{
  "selftext": "2011 Free Veterans Day Meals\n\nApplebee’s – free meal, Friday, Nov. 11: Last year, Applebee’s served 1,024,000 million free meals to military veterans and active servicemembers. Applebee’s is again offering a free meal to military veterans and active-duty service members on Veteran’s Day, Friday, Nov. 11, 2011. There will be 7 entrées to choose from. Military ID or proof of service required. Find locations at [Applebee's Website](http://www.applebees.com).\n\nChili’s – free meal, Friday, Nov. 11. Chili’s is offering all military veterans past and present their choice of one of 6 meals. This offer is available during business hours on November 11, 2011 at participating Chili’s in the U.S. only. Dine-in from limited menu only; beverages and gratuity not included. Veterans and active duty military simply show proof of military service. Visit their [website](http://www.chilis.com) to find locations. \n\nGolden Corral – Free meal, Monday Nov. 14: The 10th annual Golden Corral Military Appreciation dinner will be held on Monday, November 14, 2011 from 5 pm to 9 pm in all Golden Corral Restaurants nationwide. The free “thank you” dinner is available to any person who has ever served in the United States Military. If you are a veteran, retired, currently serving, in the National Guard or Reserves, you are invited to participate in Golden Corral’s Military Appreciation Monday dinner. For more information visit [Golden Corral Military](http://www.goldencorral.com/military/). \n\nHooters – Free Meal, Friday, Nov. 11. Hooter’s is serving up a free meal to military veterans all day on Veterans Day. Offer good for all veterans and active duty military personnel. Choose one of the new specialty items on the Hooter’s menu. Offer valid at participating Hooters only; open to all active duty and military\nveterans with valid military ID or proof of military service. Drink purchase required. For more information, visit, www.HootersVeteransDay.com.\n\nKrispy Kreme – Free doughnut. Available only at participating Krispy Kreme stores. Offer available to all active-duty, retirees & veterans on Friday November 11th. Be sure to call ahead to verify your local Krispy Kreme is participating.\n\nMcCormick & Schmick’s Seafood Restaurants – free lunch or dinner, Sunday Nov 13, 2011: McCormick & Schmick’s is celebrating their 13th annual Veteran’s Appreciation Event on Sunday, November 13th. Veterans will be able to choose a complimentary lunch or dinner entrée. Veterans must provide proof of military service. Be sure to contact your local McCormick & Schmick’s as this is valid at participating restaurants only. Also, Space is limited and reservations are highly recommended. For more information visit: [M&S Veterans Appreciation Event](http://www.mccormickandschmicks.com/featured-promotion/Veterans-Appreciation-Event.aspx).\n\nOutback Steakhouse – A week of Free Bloomin’ Onions and Cokes Monday Nov. 7 – Friday Nov. 11. Outback Steakhouse is honoring America’s military veterans by offering active duty military and veterans a free Bloomin’ Onion and a Coca-Cola product during the week leading up to Veteran’s Day. This offer is available to Military Personnel who have one of the following forms of identifications: U.S Uniform Services Identification Card, U.S Uniform Services Retired Identification Card, Current Leave and Earnings Statement (LES), DD form 214 Veterans Organization Card (i.e., American Legion and VFW), Photograph in Uniform, Wearing Uniform. For more information, visit, http://outback.com/companyinfo/veteransday.aspx.\n\nThe Outback understands commitment. For the past two years, The Outback, with the help of their patrons, has donated $2 Million to Operation Homefront, a non-profit organization providing everyday and emergency support for active troops, wounded warriors and their families.\n\nSubway – Free Six Inch Sub. Select Subway locations offer a FREE six inch sub to military veterans on Veteran’s Day. However, Subway restaurants are franchises, so this offer may not be available everywhere. Please call ahead.\n\nTexas Roadhouse – free meal, Friday, Nov. 11. Offer varies by location; our local Texas Roadhouse is offering a free meal from opening until 4pm. Other locations may vary in offer, hours, or availability. Call ahead to your local restaurant for more information.\n\nT.G.I. Friday’s – Buy one get one free Nov 11-14. At participating locations for anyone with an old or current military ID. November 11-14.\n\nUno Chicago Grill, Friday, Nov. 11. Uno’s is offering a free entree or individual pizza with a purchase of an entree or pizza of equal or greater value. Offer good for all military for veterans and active duty military. ID or proof of service required: Show up in uniform (if your service permits), provide military ID, show a picture of yourself in uniform, or have other ID showing proof of service. \n\nHome Depot and Lowes Coupon Updates\nNote: Home Depot and Lowes 10% Military Discount Available Everyday.\n\nHome Depot: The Home Depot is offering all active duty personnel, reservists, retired military, veterans and their families a 10 percent discount off their purchases in honor of Veteran’s Day. The offer is valid on purchases of up to $2,000 for a maximum of $200 and is available at The Home Depot stores, The Home Depot Design Center locations, Yardbirds and EXPO Design Center(R) locations. The 10% discount is available everyday for active duty and retirees, but not all veterans. Home Depot makes this offer available to all veterans on most military holidays. [You can also find Home Depot discounts online](http://www.homedepot.com/webapp/wcs/stores/servlet/ContentView?pn=SF_Misc_Affiliate_Landing&langId=-1&storeId=10051&catalogId=10053&PID=2893190&cm_mmc=CJ-_-2893190-_-10383217&SID=VetsDay&AID=10383217&cj=true&locStoreNum=577).\n\nLowes: Lowe’s Companies, Inc. will offer all active, reserve, honorably discharged, retired military personnel and their immediate family members a 10\npercent discount on in-store U.S. purchases made during the Veterans Day holiday. The discount is available Nov. 7 – Nov. 11. The discount is available on in-stock and special order purchases up to $5,000. To qualify, individuals must present a valid military ID or other proof of service. Excluded from the discount are sales via Lowes.com, previous sales, and purchases of services or gift cards. Like Home Depot, Lowes offers this discount daily to active duty military members, but not to veterans. However, they extend the offer to military veterans on military holidays. You can also find exclusive discounts at [Lowe's.com](http://www.Lowes.com).\n\nFree Park Admissions for Veterans Day\n\nHere's to the Heroes\nAnheuser-Busch Parks. Anheuser-Busch Parks offers Active Duty Service Members free admission for them and up to 3 dependents to any of their parks once a year. Throughout 2011, members of the military and as many as three direct dependents may enter SeaWorld, Busch Gardens or Sesame Place parks with a single-day complimentary admission. The Here’s to the Heroes program is only available to Any active duty, activated or drilling reservist, or National Guardsman. Eligible parks include: Adventure Island, Busch Gardens (Tampa Bay or Williamsburg), SeaWorld (Orlando, San Diego, or San Antonio), Sesame Place, and Water Country USA. Not valid at Discovery Cove and Aquatica. Christmas Town at Busch Gardens in Williamsburg, Va. is not included as part of this program. For more information and to register, visit: [Free admission summary](http://www.herosalute.com/states/free_admission_summary.html), and [ticket application](http://commerce.4adventure.com/store/os_application.asp). \n\nColonial Williamsburg Free Admission. \nColonial Williamsburg offers free weekend-long admission tickets to active-duty military, reservists, retirees, veterans, and their immediate dependents from Friday, Nov. 11\nthrough Sunday, Nov. 13th. The complimentary ticket incudes admission to Colonial Williamsburg exhibition sites, art museums, and most daytime programs, as well as free parking and use of the shuttle bus system. Tickets are only available at on-site ticket sales locations. Tickets are also available to families of deployed servicemembers. Tickets available on the following dates: Nov. 11-13.\n\nHistoric Jamestowne – Free Admission. The National Park Service commemorates Veterans Day with Fee Free days at Historic Jamestowne November 11-13. Free admission for everyone. [See events calendar](http://historicjamestowne.org/calendar/?month=11&year=2011). \n\nKnotts Berry Farm Military Tribute Days – Free Admission. Knott’s Berry Farm has an annual Military Tribute event in which they offer military members past and present by offering free park admission. This year the Military Tribute Days run from November 1 – 24 November (Thanksgiving Day). Veterans or current serving military personnel plus one guest get in FREE with proper ID presented at Knott’s turnstile (DD214, Veterans Administration Hospital ID or Active Military Service ID). Purchase up to six additional tickets for just $17 each. [More info](http://www.knotts.com/public/admission/prices/deals.cfm).\n \n\nFee Free Day at National Parks. \nTo honor America’s service men and women, Secretary of the Interior Ken Salazar announced that areas managed by the National Park Service would not charge entrance fees for Veteran’s Day weekend – November 11-13, 2011. [Over 100 national Parks will be participating in this event.](http://www.nps.gov/findapark/feefreeparks.htm)\n\nSan Jacinto Monument and Museum (La Porte, TX). \nNovember 7-13: Free admission to the theatre, Observation Floor, and (on November 12-13) the special exhibit to all veterans and their families. [More info](http://www.sanjacinto-museum.org/About_Us/Calendar/).\n\n",
  "gilded": 0,
  "score": 55,
  "removal_reason": null,
  "approved_by": null,
  "created_utc": 1319812396.0,
  "is_self": true,
  "stickied": false,
  "edited": true,
  "distinguished": null,
  "permalink": "https://www.reddit.com/r/Military/comments/ls7qb/list_of_veterans_day_discounts_free_meals/?ref=search_posts",
  "banned_by": null,
  "from_id": null,
  "likes": null,
  "_underscore_names": null,
  "num_reports": null,
  "link_flair_css_class": null,
  "_info_url": "https://api.reddit.com/api/info/",
  "id": "ls7qb",
  "archived": true,
  "secure_media": null,
  "from_kind": null,
  "saved": false,
  "domain": "self.Military",
  "ups": 55,
  "suggested_sort": null,
  "quarantine": false,
  "over_18": false,
  "hide_score": false,
  "url": "https://www.reddit.com/r/Military/comments/ls7qb/list_of_veterans_day_discounts_free_meals/",
  "subreddit_id": "t5_2qh8y",
  "_params": {},
  "_comments": null,
  "_replaced_more": false,
  "_comments_by_id": {},
  "user_reports": [],
  "media_embed": {},
  "created": 1319815996.0,
  "author_flair_text": null,
  "visited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>2011 Free Veterans Day Meals</p>\n\n<p>Applebee’s – free meal, Friday, Nov. 11: Last year, Applebee’s served 1,024,000 million free meals to military veterans and active servicemembers. Applebee’s is again offering a free meal to military veterans and active-duty service members on Veteran’s Day, Friday, Nov. 11, 2011. There will be 7 entrées to choose from. Military ID or proof of service required. Find locations at <a href=\"http://www.applebees.com\">Applebee&#39;s Website</a>.</p>\n\n<p>Chili’s – free meal, Friday, Nov. 11. Chili’s is offering all military veterans past and present their choice of one of 6 meals. This offer is available during business hours on November 11, 2011 at participating Chili’s in the U.S. only. Dine-in from limited menu only; beverages and gratuity not included. Veterans and active duty military simply show proof of military service. Visit their <a href=\"http://www.chilis.com\">website</a> to find locations. </p>\n\n<p>Golden Corral – Free meal, Monday Nov. 14: The 10th annual Golden Corral Military Appreciation dinner will be held on Monday, November 14, 2011 from 5 pm to 9 pm in all Golden Corral Restaurants nationwide. The free “thank you” dinner is available to any person who has ever served in the United States Military. If you are a veteran, retired, currently serving, in the National Guard or Reserves, you are invited to participate in Golden Corral’s Military Appreciation Monday dinner. For more information visit <a href=\"http://www.goldencorral.com/military/\">Golden Corral Military</a>. </p>\n\n<p>Hooters – Free Meal, Friday, Nov. 11. Hooter’s is serving up a free meal to military veterans all day on Veterans Day. Offer good for all veterans and active duty military personnel. Choose one of the new specialty items on the Hooter’s menu. Offer valid at participating Hooters only; open to all active duty and military\nveterans with valid military ID or proof of military service. Drink purchase required. For more information, visit, <a href=\"http://www.HootersVeteransDay.com\">www.HootersVeteransDay.com</a>.</p>\n\n<p>Krispy Kreme – Free doughnut. Available only at participating Krispy Kreme stores. Offer available to all active-duty, retirees &amp; veterans on Friday November 11th. Be sure to call ahead to verify your local Krispy Kreme is participating.</p>\n\n<p>McCormick &amp; Schmick’s Seafood Restaurants – free lunch or dinner, Sunday Nov 13, 2011: McCormick &amp; Schmick’s is celebrating their 13th annual Veteran’s Appreciation Event on Sunday, November 13th. Veterans will be able to choose a complimentary lunch or dinner entrée. Veterans must provide proof of military service. Be sure to contact your local McCormick &amp; Schmick’s as this is valid at participating restaurants only. Also, Space is limited and reservations are highly recommended. For more information visit: <a href=\"http://www.mccormickandschmicks.com/featured-promotion/Veterans-Appreciation-Event.aspx\">M&amp;S Veterans Appreciation Event</a>.</p>\n\n<p>Outback Steakhouse – A week of Free Bloomin’ Onions and Cokes Monday Nov. 7 – Friday Nov. 11. Outback Steakhouse is honoring America’s military veterans by offering active duty military and veterans a free Bloomin’ Onion and a Coca-Cola product during the week leading up to Veteran’s Day. This offer is available to Military Personnel who have one of the following forms of identifications: U.S Uniform Services Identification Card, U.S Uniform Services Retired Identification Card, Current Leave and Earnings Statement (LES), DD form 214 Veterans Organization Card (i.e., American Legion and VFW), Photograph in Uniform, Wearing Uniform. For more information, visit, <a href=\"http://outback.com/companyinfo/veteransday.aspx\">http://outback.com/companyinfo/veteransday.aspx</a>.</p>\n\n<p>The Outback understands commitment. For the past two years, The Outback, with the help of their patrons, has donated $2 Million to Operation Homefront, a non-profit organization providing everyday and emergency support for active troops, wounded warriors and their families.</p>\n\n<p>Subway – Free Six Inch Sub. Select Subway locations offer a FREE six inch sub to military veterans on Veteran’s Day. However, Subway restaurants are franchises, so this offer may not be available everywhere. Please call ahead.</p>\n\n<p>Texas Roadhouse – free meal, Friday, Nov. 11. Offer varies by location; our local Texas Roadhouse is offering a free meal from opening until 4pm. Other locations may vary in offer, hours, or availability. Call ahead to your local restaurant for more information.</p>\n\n<p>T.G.I. Friday’s – Buy one get one free Nov 11-14. At participating locations for anyone with an old or current military ID. November 11-14.</p>\n\n<p>Uno Chicago Grill, Friday, Nov. 11. Uno’s is offering a free entree or individual pizza with a purchase of an entree or pizza of equal or greater value. Offer good for all military for veterans and active duty military. ID or proof of service required: Show up in uniform (if your service permits), provide military ID, show a picture of yourself in uniform, or have other ID showing proof of service. </p>\n\n<p>Home Depot and Lowes Coupon Updates\nNote: Home Depot and Lowes 10% Military Discount Available Everyday.</p>\n\n<p>Home Depot: The Home Depot is offering all active duty personnel, reservists, retired military, veterans and their families a 10 percent discount off their purchases in honor of Veteran’s Day. The offer is valid on purchases of up to $2,000 for a maximum of $200 and is available at The Home Depot stores, The Home Depot Design Center locations, Yardbirds and EXPO Design Center(R) locations. The 10% discount is available everyday for active duty and retirees, but not all veterans. Home Depot makes this offer available to all veterans on most military holidays. <a href=\"http://www.homedepot.com/webapp/wcs/stores/servlet/ContentView?pn=SF_Misc_Affiliate_Landing&amp;langId=-1&amp;storeId=10051&amp;catalogId=10053&amp;PID=2893190&amp;cm_mmc=CJ-_-2893190-_-10383217&amp;SID=VetsDay&amp;AID=10383217&amp;cj=true&amp;locStoreNum=577\">You can also find Home Depot discounts online</a>.</p>\n\n<p>Lowes: Lowe’s Companies, Inc. will offer all active, reserve, honorably discharged, retired military personnel and their immediate family members a 10\npercent discount on in-store U.S. purchases made during the Veterans Day holiday. The discount is available Nov. 7 – Nov. 11. The discount is available on in-stock and special order purchases up to $5,000. To qualify, individuals must present a valid military ID or other proof of service. Excluded from the discount are sales via Lowes.com, previous sales, and purchases of services or gift cards. Like Home Depot, Lowes offers this discount daily to active duty military members, but not to veterans. However, they extend the offer to military veterans on military holidays. You can also find exclusive discounts at <a href=\"http://www.Lowes.com\">Lowe&#39;s.com</a>.</p>\n\n<p>Free Park Admissions for Veterans Day</p>\n\n<p>Here&#39;s to the Heroes\nAnheuser-Busch Parks. Anheuser-Busch Parks offers Active Duty Service Members free admission for them and up to 3 dependents to any of their parks once a year. Throughout 2011, members of the military and as many as three direct dependents may enter SeaWorld, Busch Gardens or Sesame Place parks with a single-day complimentary admission. The Here’s to the Heroes program is only available to Any active duty, activated or drilling reservist, or National Guardsman. Eligible parks include: Adventure Island, Busch Gardens (Tampa Bay or Williamsburg), SeaWorld (Orlando, San Diego, or San Antonio), Sesame Place, and Water Country USA. Not valid at Discovery Cove and Aquatica. Christmas Town at Busch Gardens in Williamsburg, Va. is not included as part of this program. For more information and to register, visit: <a href=\"http://www.herosalute.com/states/free_admission_summary.html\">Free admission summary</a>, and <a href=\"http://commerce.4adventure.com/store/os_application.asp\">ticket application</a>. </p>\n\n<p>Colonial Williamsburg Free Admission. \nColonial Williamsburg offers free weekend-long admission tickets to active-duty military, reservists, retirees, veterans, and their immediate dependents from Friday, Nov. 11\nthrough Sunday, Nov. 13th. The complimentary ticket incudes admission to Colonial Williamsburg exhibition sites, art museums, and most daytime programs, as well as free parking and use of the shuttle bus system. Tickets are only available at on-site ticket sales locations. Tickets are also available to families of deployed servicemembers. Tickets available on the following dates: Nov. 11-13.</p>\n\n<p>Historic Jamestowne – Free Admission. The National Park Service commemorates Veterans Day with Fee Free days at Historic Jamestowne November 11-13. Free admission for everyone. <a href=\"http://historicjamestowne.org/calendar/?month=11&amp;year=2011\">See events calendar</a>. </p>\n\n<p>Knotts Berry Farm Military Tribute Days – Free Admission. Knott’s Berry Farm has an annual Military Tribute event in which they offer military members past and present by offering free park admission. This year the Military Tribute Days run from November 1 – 24 November (Thanksgiving Day). Veterans or current serving military personnel plus one guest get in FREE with proper ID presented at Knott’s turnstile (DD214, Veterans Administration Hospital ID or Active Military Service ID). Purchase up to six additional tickets for just $17 each. <a href=\"http://www.knotts.com/public/admission/prices/deals.cfm\">More info</a>.</p>\n\n<p>Fee Free Day at National Parks. \nTo honor America’s service men and women, Secretary of the Interior Ken Salazar announced that areas managed by the National Park Service would not charge entrance fees for Veteran’s Day weekend – November 11-13, 2011. <a href=\"http://www.nps.gov/findapark/feefreeparks.htm\">Over 100 national Parks will be participating in this event.</a></p>\n\n<p>San Jacinto Monument and Museum (La Porte, TX). \nNovember 7-13: Free admission to the theatre, Observation Floor, and (on November 12-13) the special exhibit to all veterans and their families. <a href=\"http://www.sanjacinto-museum.org/About_Us/Calendar/\">More info</a>.</p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "_comment_sort": null,
  "report_reasons": null,
  "name": "t3_ls7qb",
  "from": null,
  "hidden": false,
  "clicked": false,
  "media": null,
  "json_dict": null,
  "_api_link": "https://api.reddit.com/r/Military/comments/ls7qb/list_of_veterans_day_discounts_free_meals/?ref=search_posts",
  "secure_media_embed": {},
  "mod_reports": [],
  "_orphaned": {},
  "_uniq": null,
  "num_comments": 27,
  "link_flair_text": null,
  "title": "List of Veterans Day Discounts / Free Meals",
  "_has_fetched": true,
  "author_flair_css_class": null,
  "thumbnail": "self"
}