{
  "selftext": "poster: **[Goldilocks_is_cool](/u/Goldilocks_is_cool)**, [original conspiracy link](/r/conspiracy/comments/2znvqg/antitrust_probe_of_google_finding_real_harm_to/)\n\n-----------------------------------\n\n\nInside the U.S. Antitrust Probe of Google\n**Key FTC staff wanted to sue** Internet giant after finding ‘real harm to consumers and to innovation’\nGoogle’s Eric Schmidt testified in 2011 about the Internet giant’s business practices and defended how it displayed search results. ENLARGE\nGoogle’s Eric Schmidt testified in 2011 about the Internet giant’s business practices and defended how it displayed search results. Photo: Getty Images\nBy\nBrody Mullins,\nRolfe Winkler and\nBrent Kendall\nUpdated March 19, 2015 7:38 p.m. ET\n51 COMMENTS\n\nWASHINGTON—Officials at the Federal Trade Commission **concluded in 2012 that Google Inc. used anticompetitive tactics and abused its monopoly power in ways that harmed Internet users and rivals**, a far harsher analysis of Google’s business than was previously known.\n\nThe staff report from the agency’s bureau of competition recommended the commission bring a lawsuit challenging three Google practices. **The move would have** triggered one of the highest-profile antitrust cases since the Justice Department sued Microsoft Corp. in the 1990s.\n\n The 160-page critique, **which was supposed to remain private** but was inadvertently disclosed in an open-records request, concluded that Google’s “conduct has resulted—and will result—in real harm to consumers and to innovation in the online search and advertising markets.”\n\nThe findings stand in contrast to the conclusion of the FTC’s commissioners, who voted unanimously in early 2013 to end the investigation after Google agreed to some voluntary changes to its practices.\n\nIt is unusual for the commissioners to not take staff recommendations. But in this case, they were wrestling with competing recommendations, including a separate report from the agency’s economic bureau that didn’t favor legal action.\n\nThen-Chairman Jon Leibowitz said in a written statement at the time that Google’s voluntary changes deliver “more relief for American consumers faster than any other option.”\n\nGoogle General Counsel Kent Walker said in a statement Thursday that the FTC ultimately “agreed that there was no need to take action on how we rank and display search results.” He added: “Speculation about potential consumer harm turned out to be entirely wrong. Since the investigation closed two years ago, the ways people access information online have only increased, giving consumers more choice than ever before.”\n\nOn one issue—whether Google used anticompetitive tactics for its search engine—the competition staff recommended against a lawsuit, although it said Google’s actions **resulted in “significant harm” to rivals. In three other areas, the report found evidence the company used its monopoly behavior to help its own business and hurt its rivals.**\nENLARGE\n\nThe report undercuts Google’s oft-stated contention that the FTC found no evidence of wrongdoing. “The conclusion is clear: Google’s services are good for users and good for competition,” said David Drummond, Google’s senior vice president and chief legal officer, when the FTC closed the matter.\n\nIt could prompt new complaints from some Google competitors, such as Yelp Inc., who allege the company still engages in anticompetitive behavior, and renewed focus by antitrust authorities in Europe, who are pursuing their own look into Google.\n\n“This document appears to show that the FTC had direct evidence from Google of intentional search bias,” said Luther Lowe, the vice president of public policy for Yelp.\nENLARGE\n\nThe Wall Street Journal viewed portions of the document after the agency **inadvertently disclosed it** as part of a Freedom of Information Act request. The FTC declined to release the undisclosed pages and asked the Journal to return the document, which it declined to do.\n\n“Unfortunately, an unredacted version of this material was inadvertently released in response to a FOIA request,” an FTC spokesman said in a statement to the Journal. “We are taking steps to ensure this does not happen again.”\n\nEmbedded in the document and in detailed footnotes are an array of previously unknown details about Google’s business, many of which come from senior officials such as Executive Chairman Eric Schmidt, former executive Marissa Mayer and co-founders Larry Page and Sergey Brin.\n\nData included in the report suggest Google was more dominant in the U.S. Internet search market than was widely believed. The company estimated its market share at between 69% and 84% during a period when research firm comScore put it at 65%. “From an antitrust perspective, I’m happy to see [comScore] underestimate our share,” the report quoted Google Chief Economist Hal Varian as saying, without specifying the context.\n\n**An antitrust suit against Google would have pitted Obama administration appointees against one of the White House’s closest corporate allies**. Google was the second-largest corporate source of campaign donations to President Barack Obama’s re-election effort. Google executives have visited the White House scores of times since Mr. Obama has been in office, according to visitor logs.\n\n“The FTC is an independent agency and we respect their independent decision-making,” said Jennifer Friedman, a White House spokeswoman.\n\nIn its investigation, FTC staff said Google’s conduct “helped it to maintain, preserve and enhance Google’s monopoly position in the markets for search and search advertising” **in violation of the law**. Google’s behavior “will have lasting negative effects on consumer welfare,” the report said.\n\nGoogle has long disputed any characterization that it is a monopoly, saying that competition is “just a click away.”\n\nIn discussing one of the issues the FTC staff wanted to sue over, the report said **the company illegally took content from rival websites** such as Yelp, TripAdvisor Inc. and Amazon.com Inc. to improve its own websites. It cited one instance when Google copied Amazon’s sales rankings to rank its own items. It also copied Amazon’s reviews and ratings, the report found. Spokesmen for TripAdvisor and Amazon declined to comment.\n\n**When competitors asked Google to stop taking their content, it threatened to remove them from its search engine.**\n[Do no evil?]\n\n“It is clear that Google’s threat was intended to produce, and did produce, the desired effect,” the report said, “which was to coerce Yelp and TripAdvisor into backing down.” The company also sent a message that it would “use its monopoly power over search to extract the fruits of its rivals’ innovations.”\n\nIn its final agreement, the commission secured a promise that Google would allow websites to opt out of having their content included in its competing search products.\n\nThe staff said **Google also broke antitrust law** by placing restrictions on websites that publish its search results from also working with rivals such as Microsoft’s Bing and Yahoo Inc.\n\nThe commission made no mention of this issue in its final report, nor did it secure any commitments from Google to change its policies.\n\nIn a third area, the FTC staff said **Google violated antitrust law** by restricting advertisers’ ability to use data garnered from Google ad campaigns in advertising run on rival platforms.\n\nThe FTC report cited a Google employee who said the company once wanted to do away with the unnecessary restriction but was overruled by Mr. Page, who is now Google’s chief executive. A Google spokeswoman declined to make Mr. Page available for comment.\n\nUltimately, Google changed this policy voluntarily in 2013 at the behest of the agency.\n\nOn the most important issue, that of Google’s prized search engine, the FTC report said **Google altered it to benefit its own services at the expense of rivals**. The report said Google “adopted a strategy of demoting, or refusing to display, links to certain vertical websites in highly commercial categories.”\n\nIn what it termed “a close call,” the staff said the FTC shouldn’t issue a complaint against the company because of legal hurdles and Google’s “strong procompetitive justifications.”\n\n    ‘[Google’s behavior] helped it to maintain, preserve and enhance Google’s monopoly position in the markets for search and search advertising’\n    —FTC staff report \n\nThe “evidence paints a complex portrait of a company working toward an overall goal of maintaining its market share by providing the best user experience, while simultaneously engaging in tactics that resulted in harm to many vertical competitors, and likely helped to entrench Google’s monopoly power over search and search advertising,” the staff said.\n\nOn Jan. 3, the five FTC commissioners voted to close the investigation. A few months later, now FTC Chairwoman Edith Ramirez told a Senate committee that a majority of commissioners didn’t support a case against Google on any of the allegations under investigation.\n\nWrite to Brody Mullins at brody.mullins@wsj.com, Rolfe Winkler at rolfe.winkler@wsj.com and Brent Kendall at brent.kendall@wsj.com\n   \n\nCopyright ©2015 Dow Jones &amp; Company, Inc. All Rights Reserved.\n\n\n-----------------------------------\n\nDiscourse level: 100%\n\nShills: 0%\n\n",
  "gilded": 0,
  "score": 1,
  "removal_reason": null,
  "approved_by": null,
  "created_utc": 1426824765.0,
  "is_self": true,
  "stickied": false,
  "edited": 1426911024.0,
  "distinguished": null,
  "permalink": "https://www.reddit.com/r/conspiro/comments/2znzup/antitrust_probe_of_google_finding_real_harm_to/?ref=search_posts",
  "banned_by": null,
  "from_id": null,
  "likes": null,
  "_underscore_names": null,
  "num_reports": null,
  "link_flair_css_class": null,
  "_info_url": "https://api.reddit.com/api/info/",
  "id": "2znzup",
  "archived": true,
  "secure_media": null,
  "from_kind": null,
  "saved": false,
  "domain": "self.conspiro",
  "ups": 1,
  "suggested_sort": null,
  "quarantine": false,
  "over_18": false,
  "hide_score": false,
  "url": "https://www.reddit.com/r/conspiro/comments/2znzup/antitrust_probe_of_google_finding_real_harm_to/",
  "subreddit_id": "t5_2x2ck",
  "_params": {},
  "_comments": null,
  "_replaced_more": false,
  "_comments_by_id": {},
  "user_reports": [],
  "media_embed": {},
  "created": 1426828365.0,
  "author_flair_text": null,
  "visited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>poster: <strong><a href=\"/u/Goldilocks_is_cool\">Goldilocks_is_cool</a></strong>, <a href=\"/r/conspiracy/comments/2znvqg/antitrust_probe_of_google_finding_real_harm_to/\">original conspiracy link</a></p>\n\n<hr/>\n\n<p>Inside the U.S. Antitrust Probe of Google\n<strong>Key FTC staff wanted to sue</strong> Internet giant after finding ‘real harm to consumers and to innovation’\nGoogle’s Eric Schmidt testified in 2011 about the Internet giant’s business practices and defended how it displayed search results. ENLARGE\nGoogle’s Eric Schmidt testified in 2011 about the Internet giant’s business practices and defended how it displayed search results. Photo: Getty Images\nBy\nBrody Mullins,\nRolfe Winkler and\nBrent Kendall\nUpdated March 19, 2015 7:38 p.m. ET\n51 COMMENTS</p>\n\n<p>WASHINGTON—Officials at the Federal Trade Commission <strong>concluded in 2012 that Google Inc. used anticompetitive tactics and abused its monopoly power in ways that harmed Internet users and rivals</strong>, a far harsher analysis of Google’s business than was previously known.</p>\n\n<p>The staff report from the agency’s bureau of competition recommended the commission bring a lawsuit challenging three Google practices. <strong>The move would have</strong> triggered one of the highest-profile antitrust cases since the Justice Department sued Microsoft Corp. in the 1990s.</p>\n\n<p>The 160-page critique, <strong>which was supposed to remain private</strong> but was inadvertently disclosed in an open-records request, concluded that Google’s “conduct has resulted—and will result—in real harm to consumers and to innovation in the online search and advertising markets.”</p>\n\n<p>The findings stand in contrast to the conclusion of the FTC’s commissioners, who voted unanimously in early 2013 to end the investigation after Google agreed to some voluntary changes to its practices.</p>\n\n<p>It is unusual for the commissioners to not take staff recommendations. But in this case, they were wrestling with competing recommendations, including a separate report from the agency’s economic bureau that didn’t favor legal action.</p>\n\n<p>Then-Chairman Jon Leibowitz said in a written statement at the time that Google’s voluntary changes deliver “more relief for American consumers faster than any other option.”</p>\n\n<p>Google General Counsel Kent Walker said in a statement Thursday that the FTC ultimately “agreed that there was no need to take action on how we rank and display search results.” He added: “Speculation about potential consumer harm turned out to be entirely wrong. Since the investigation closed two years ago, the ways people access information online have only increased, giving consumers more choice than ever before.”</p>\n\n<p>On one issue—whether Google used anticompetitive tactics for its search engine—the competition staff recommended against a lawsuit, although it said Google’s actions <strong>resulted in “significant harm” to rivals. In three other areas, the report found evidence the company used its monopoly behavior to help its own business and hurt its rivals.</strong>\nENLARGE</p>\n\n<p>The report undercuts Google’s oft-stated contention that the FTC found no evidence of wrongdoing. “The conclusion is clear: Google’s services are good for users and good for competition,” said David Drummond, Google’s senior vice president and chief legal officer, when the FTC closed the matter.</p>\n\n<p>It could prompt new complaints from some Google competitors, such as Yelp Inc., who allege the company still engages in anticompetitive behavior, and renewed focus by antitrust authorities in Europe, who are pursuing their own look into Google.</p>\n\n<p>“This document appears to show that the FTC had direct evidence from Google of intentional search bias,” said Luther Lowe, the vice president of public policy for Yelp.\nENLARGE</p>\n\n<p>The Wall Street Journal viewed portions of the document after the agency <strong>inadvertently disclosed it</strong> as part of a Freedom of Information Act request. The FTC declined to release the undisclosed pages and asked the Journal to return the document, which it declined to do.</p>\n\n<p>“Unfortunately, an unredacted version of this material was inadvertently released in response to a FOIA request,” an FTC spokesman said in a statement to the Journal. “We are taking steps to ensure this does not happen again.”</p>\n\n<p>Embedded in the document and in detailed footnotes are an array of previously unknown details about Google’s business, many of which come from senior officials such as Executive Chairman Eric Schmidt, former executive Marissa Mayer and co-founders Larry Page and Sergey Brin.</p>\n\n<p>Data included in the report suggest Google was more dominant in the U.S. Internet search market than was widely believed. The company estimated its market share at between 69% and 84% during a period when research firm comScore put it at 65%. “From an antitrust perspective, I’m happy to see [comScore] underestimate our share,” the report quoted Google Chief Economist Hal Varian as saying, without specifying the context.</p>\n\n<p><strong>An antitrust suit against Google would have pitted Obama administration appointees against one of the White House’s closest corporate allies</strong>. Google was the second-largest corporate source of campaign donations to President Barack Obama’s re-election effort. Google executives have visited the White House scores of times since Mr. Obama has been in office, according to visitor logs.</p>\n\n<p>“The FTC is an independent agency and we respect their independent decision-making,” said Jennifer Friedman, a White House spokeswoman.</p>\n\n<p>In its investigation, FTC staff said Google’s conduct “helped it to maintain, preserve and enhance Google’s monopoly position in the markets for search and search advertising” <strong>in violation of the law</strong>. Google’s behavior “will have lasting negative effects on consumer welfare,” the report said.</p>\n\n<p>Google has long disputed any characterization that it is a monopoly, saying that competition is “just a click away.”</p>\n\n<p>In discussing one of the issues the FTC staff wanted to sue over, the report said <strong>the company illegally took content from rival websites</strong> such as Yelp, TripAdvisor Inc. and Amazon.com Inc. to improve its own websites. It cited one instance when Google copied Amazon’s sales rankings to rank its own items. It also copied Amazon’s reviews and ratings, the report found. Spokesmen for TripAdvisor and Amazon declined to comment.</p>\n\n<p><strong>When competitors asked Google to stop taking their content, it threatened to remove them from its search engine.</strong>\n[Do no evil?]</p>\n\n<p>“It is clear that Google’s threat was intended to produce, and did produce, the desired effect,” the report said, “which was to coerce Yelp and TripAdvisor into backing down.” The company also sent a message that it would “use its monopoly power over search to extract the fruits of its rivals’ innovations.”</p>\n\n<p>In its final agreement, the commission secured a promise that Google would allow websites to opt out of having their content included in its competing search products.</p>\n\n<p>The staff said <strong>Google also broke antitrust law</strong> by placing restrictions on websites that publish its search results from also working with rivals such as Microsoft’s Bing and Yahoo Inc.</p>\n\n<p>The commission made no mention of this issue in its final report, nor did it secure any commitments from Google to change its policies.</p>\n\n<p>In a third area, the FTC staff said <strong>Google violated antitrust law</strong> by restricting advertisers’ ability to use data garnered from Google ad campaigns in advertising run on rival platforms.</p>\n\n<p>The FTC report cited a Google employee who said the company once wanted to do away with the unnecessary restriction but was overruled by Mr. Page, who is now Google’s chief executive. A Google spokeswoman declined to make Mr. Page available for comment.</p>\n\n<p>Ultimately, Google changed this policy voluntarily in 2013 at the behest of the agency.</p>\n\n<p>On the most important issue, that of Google’s prized search engine, the FTC report said <strong>Google altered it to benefit its own services at the expense of rivals</strong>. The report said Google “adopted a strategy of demoting, or refusing to display, links to certain vertical websites in highly commercial categories.”</p>\n\n<p>In what it termed “a close call,” the staff said the FTC shouldn’t issue a complaint against the company because of legal hurdles and Google’s “strong procompetitive justifications.”</p>\n\n<pre><code>‘[Google’s behavior] helped it to maintain, preserve and enhance Google’s monopoly position in the markets for search and search advertising’\n—FTC staff report \n</code></pre>\n\n<p>The “evidence paints a complex portrait of a company working toward an overall goal of maintaining its market share by providing the best user experience, while simultaneously engaging in tactics that resulted in harm to many vertical competitors, and likely helped to entrench Google’s monopoly power over search and search advertising,” the staff said.</p>\n\n<p>On Jan. 3, the five FTC commissioners voted to close the investigation. A few months later, now FTC Chairwoman Edith Ramirez told a Senate committee that a majority of commissioners didn’t support a case against Google on any of the allegations under investigation.</p>\n\n<p>Write to Brody Mullins at <a href=\"mailto:brody.mullins@wsj.com\">brody.mullins@wsj.com</a>, Rolfe Winkler at <a href=\"mailto:rolfe.winkler@wsj.com\">rolfe.winkler@wsj.com</a> and Brent Kendall at <a href=\"mailto:brent.kendall@wsj.com\">brent.kendall@wsj.com</a></p>\n\n<p>Copyright ©2015 Dow Jones &amp; Company, Inc. All Rights Reserved.</p>\n\n<hr/>\n\n<p>Discourse level: 100%</p>\n\n<p>Shills: 0%</p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "_comment_sort": null,
  "report_reasons": null,
  "name": "t3_2znzup",
  "from": null,
  "hidden": false,
  "clicked": false,
  "media": null,
  "json_dict": null,
  "_api_link": "https://api.reddit.com/r/conspiro/comments/2znzup/antitrust_probe_of_google_finding_real_harm_to/?ref=search_posts",
  "secure_media_embed": {},
  "mod_reports": [],
  "_orphaned": {},
  "_uniq": null,
  "num_comments": 0,
  "link_flair_text": null,
  "title": "Antitrust Probe of Google finding ‘real harm to consumers and to innovation’",
  "_has_fetched": true,
  "author_flair_css_class": null,
  "thumbnail": ""
}