{
  "downs": 0,
  "mod_reports": [],
  "secure_media_embed": {},
  "_info_url": "https://api.reddit.com/api/info/",
  "gilded": 0,
  "num_comments": 0,
  "_orphaned": {},
  "hidden": false,
  "ups": 6,
  "url": "https://www.reddit.com/r/tabled/comments/1dywuc/table_iama_i_am_joe_piscopo_who_you_might_know/",
  "_has_fetched": true,
  "quarantine": false,
  "name": "t3_1dywuc",
  "author_flair_text": "",
  "user_reports": [],
  "saved": false,
  "permalink": "https://www.reddit.com/r/tabled/comments/1dywuc/table_iama_i_am_joe_piscopo_who_you_might_know/?ref=search_posts",
  "over_18": false,
  "is_self": true,
  "_params": {},
  "thumbnail": "",
  "created_utc": 1368059863.0,
  "_replaced_more": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Verified?</strong> <em>(This bot cannot verify AMAs just yet)</em></p>\n\n<p><strong>Date:</strong> 2013-05-07</p>\n\n<p><strong><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/\">Link to submission</a></strong> (<em>Has self-text</em>)</p>\n\n<p><strong><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/tabledresser/c9v63ga\">Link to my post</a></strong></p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Questions</th>\n<th align=\"left\">Answers</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ubfiy?context=5\">What was the experience like on the set?   Were you a Star Trek fan before accepting the role?   If you could replicate any human, who would it be?</a></td>\n<td align=\"left\">The best part of the entire experience was working with Brent Spiner. That guy is amazing actor! It&#39;s more than just gold makeup. Also no matter where I go in the world people bring that up to me more than any other role I&#39;ve done.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ucl2p?context=5\">Did you ever do your Sinatra impersonation for Sinatra?  If so, did Frank approve?</a></td>\n<td align=\"left\">Yes -- at the Friar&#39;s Club.  He LOVED it (which is why I&#39;m still alive).  And, on an old show called &quot;Solid Gold&quot; where the man himself introduced me and I did him in full make-up.  He used to refer to me as the &quot;Vice Chairman of the Board.&quot;</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ubfpf?context=5\">What was it like to fight Chuck Norris in Sidekicks?  Was there a third fist hidden under his beard?</a></td>\n<td align=\"left\">Very funny!</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">It was a privilege and an honor being beaten up by the bearded one.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I had never trained so hard in my life because of my respect for Chuck.  He&#39;s a great guy and a great athlete.  And, as silly as my character was, we took the fight scenes seriously.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Even though I signed a contract saying I wouldn&#39;t tell: yes, there is a third fist in his beard.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uc1oy?context=5\">Why&#39;d ya ditch the mullet? you rocked that &#39;do out of the park.</a></td>\n<td align=\"left\">Literally laughing out loud right now.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">The truth is that Jon Stamos asked me to cut it off so that he could be the good looking one... ;)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uazj3?context=5\">Who were your least favorite people to work with on SNL?  Favorite?</a></td>\n<td align=\"left\">Favorite person is easy: I can never quite describe the thrill of working with Eddie Murphy live on the set of SNL.  He had a reckless abandon that was contagious.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uazj3?context=5\">The recent set of interactions with O&amp;A was brilliant from beginning to end.  It made my appreciation for you grow even more.</a></td>\n<td align=\"left\">And, really, thank you for the kind words about O&amp;A -- getting my ass kicked in court wasn&#39;t fun, but you guys helped me get through it!  Thank you!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9udlrq?context=5\"><em>I know that this is an AMA and I want to be honest with you all, but I&#39;m a guy that just doesn&#39;t like going negative.</em>  GGJP.</a></td>\n<td align=\"left\">Oh, if this could become a new meme... I would be so happy!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uc5kw?context=5\">Joe, you are a great performer!  Truly enjoyed your SNL stuff!</a></td>\n<td align=\"left\">That&#39;s a fair question.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uc5kw?context=5\">My question is regarding your name being synonymous with a great actor/performer expected to be huge post-TV and never attaining the same as, say, an Eddie Murphy or Julia-Louis Dreyfuss (strictly SNL alum speaking).  What are your thoughts on that?  Does it bother you?  Are you satisfied with your work post-SNL enough that you can just let it wash over you?</a></td>\n<td align=\"left\">After I had Thyroid Cancer in 1981, my outlook on what &quot;success&quot; is changed.  I lost my single-minded focus to succeed in showbiz and wound up focusing way more on my family.  So, if you&#39;re asking if I&#39;m happy with my career, I think the bigger question is am I happy with my life -- and the answer is, I&#39;m here, I&#39;m alive, and YES!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uaya8?context=5\">What&#39;s your favorite story from the set of Johnny Dangerously ?</a></td>\n<td align=\"left\">There&#39;s a scene in JD where there&#39;s a dead body -- someone was cleaning his gun and I accidentally shot somebody.  Michael Keaton and I are talking and, as an adlib, we both rest our feet on the body.  We could hardly stop ourselves from laughing.  I&#39;m not even sure it made it into the final cut (I haven&#39;t seen the movie in a while -- any redditors remember if it&#39;s in there or not)?</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Anyway, just working with a guy like Keaton -- every day was a struggle not to laugh!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ubj5m?context=5\">So my question is, what is your favorite filming <strong>location</strong> of all the films you&#39;ve been in, and why?</a></td>\n<td align=\"left\">My favorite place to shoot was the exotic... Newark and Jersey City when I was shooting Wiseguys with Danny DeVito.  It was the dead cold of winter, the scenery was oil refineries and cemeteries, and man... it just doesn&#39;t ge better than that.  For a Jersey boy, it was nice being around what I grew up with :)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ubz15?context=5\">You&#39;re on the road a lot, can you share some of those experiences and tips on how you deal with that?</a></td>\n<td align=\"left\">Here&#39;s the trick: I seem to seek out women who are really mean to me, and that makes everything else in life a lot easier to deal with.  Those same girls, though, they make the road very... accommodating.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uczvr?context=5\">How did you react after your long Time friends opie and Anthony reacted to your hbo special?</a></td>\n<td align=\"left\">There are times when I don&#39;t disagree with Opie and Athony but I have to stay politically correct because of the good people I work with.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uczvr?context=5\">Why sit there shirtless while talking??</a></td>\n<td align=\"left\">By the way -- what are you talking about me being shirtless?  I don&#39;t remember having done that...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uec87?context=5\">We can see through your webcam. You&#39;re shirtless now, Joe. </a></td>\n<td align=\"left\">Well then you&#39;re going to have pay extra...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ucv86?context=5\">What&#39;s your favorite joke?</a></td>\n<td align=\"left\">Howard Hughes type guy, old, rich but just a mess.  He decides to change his life -- gets spiffied up -- he cuts his hair, gets a shave, buys a suit, some plastic surgery, a red Ferrari, a young hot blonde at his side.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">They&#39;re driving down the highway and BOOM, he&#39;s struck by lighting.  He gets up to heaven and he says to God -- I just started learning how to live my life!  Why did you take me.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">And God says, &quot;well, to tell you the truth, I didn&#39;t recognize you.&quot;</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Okay not a great joke, but my dad loved it.  And, uh, don&#39;t tell <a href=\"/r/atheism\">/r/atheism</a> about it.  It&#39;s just a joke.  I don&#39;t need them coming after me! :)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ub1yk?context=5\">Who do you think has been the best SNL host of all time? And, follow up question, who&#39;s been an epic fail? </a></td>\n<td align=\"left\">Eddie was the best host I&#39;ve ever seen -- if you&#39;ll remember, Nick Nolte was scheduled to host and backed out at the last second and Eddie stepped in for him.  There have been a lot of SNL articles and books about this incident, but I can tell you Reddit none of them got it right: Eddie Murphy was the single best host in the show&#39;s history.  And... he saved our ass that week.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Epic Fail: we already talked about Spruce Burn.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ubbcn?context=5\">I imagine the hilarity of the script made it hard to get usable stuff on film. Who was the funniest on set, and how much of the movie was improvised?</a></td>\n<td align=\"left\">Peter Boyle was great.  And Richard Dimirti who played Roman Moronie is truly one of the funniest people I ever worked with.  He kept all of us in stitches on the set.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9udxn3?context=5\">How long did it take you to compose Kimberly, and why was it never released as a commercial single? IT ROCKED!</a></td>\n<td align=\"left\">Again, literally laughing out loud.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">All I can say Reddit is that when you&#39;re in love, sometimes you do stupid things.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Suffice it to say, if that song were released today, it would have significantly different lyrics.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uay00?context=5\">What was the best and worst part about working at SNL? Who were your favorite and least favorite guest hosts?</a></td>\n<td align=\"left\">Coming up with new material every week was as daunting a task as I ever encountered.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I can remember Eddie and me staying up all night trying to come up with new material.  We were like two college roommates cramming for a final -- we both got punchy and started riffing and some of the best stuff came out of that.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Some bad moments -- having to do a sketch that you <em>knew</em> wasn&#39;t really funny, but they needed to fill time.  And then on Sunday hearing all my boys back in Jersey calling me out on how terrible the sketch was.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Favorite Guest Host -- Jerry Lewis, Robin Williams, and Don Rickles.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Least Favorite Guest Host -- I said before, I didn&#39;t want to talk bad about anybody.  But let&#39;s just say that if I <em>had</em> to say something about somebody, his name would rhyme with &quot;Spruce Burn&quot;. :)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ubun1?context=5\">Do you ever get tired of people asking you about SNL or Johnny Dangerously?</a></td>\n<td align=\"left\">Never get tired of SNL ever.  Keep asking all you want!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ubun1?context=5\">I know you guys want to talk about the new movie, not stuff that happened in the 80s, right?</a></td>\n<td align=\"left\">There&#39;s only ONE Sinatra, but I gotta tell ya -- I was at the Sinatra restaurant in the Wynn in Vegas last night and I asked for a table and they told me it was a half hour wait.  My first thought was WWFD -- What Would Frank Do -- but since I figured <em>I</em> would get arrested for killing a maitre&#39;d, we went to a Chinese joint.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ubun1?context=5\">Also, who does the best Sinatra impression...you, or Joe Piscopo?</a></td>\n<td align=\"left\">But seriously, if you want to see me channel the old man, come out to one of my shows!  He would have wanted it that...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ubhfi?context=5\">Any plans of returning to SNL, even if it&#39;s just a quick cameo?</a></td>\n<td align=\"left\">Lorne Michaels offered me a shot on Weekend Update.  If and when I announce my candidacy for the governorship of New Jersey, I&#39;ll take him up on that offer.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ubxtb?context=5\">How much can you bench?</a></td>\n<td align=\"left\">I love this question.  Here it is, straight from the heart: I suck on the flat bench.  MAX, INCLINE: 225.  I&#39;ve always admired the beef monsters who can bang 345.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">UGH, I feel like such a wuss.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uctbb?context=5\">In the major motion picture Sidekicks how was it like to fight Chuch Norris? also, Did you ever happen to stay in touch with young Johnathan Brandis? If so did he ever show any signs of depression or an signs leading to his suicide?</a></td>\n<td align=\"left\">That&#39;s a great question.  He absolutely did not seem depressed ever.  He was one of the most positive, nicest kids you&#39;ll ever meet.  Which just goes to show you, you never know how and when the depression is going to hit.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uctbb?context=5\">I&#39;m only curious because I enjoyed the roles he was in. good actor.</a></td>\n<td align=\"left\">Jay is telling me about reddit and I love the sense of community you have here.  Things like <a href=\"/r/suicidewatch\">/r/suicidewatch</a> are a great resource for people needing help and I urge any of you who might be feeling bad to seek help.  Johnathan was a great kid and I miss him.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ubu4b?context=5\">When&#39;s <em>Dead Heat 2</em> coming out?</a></td>\n<td align=\"left\">Seriously, I get more requests for what you just asked than anything else!  As soon as I&#39;m done with this AMA I&#39;m calling my agent and suing the makers of RIPD! :)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ucamt?context=5\">I Thought You Were Dead!? Well Anyways Your Pretty Funny. </a></td>\n<td align=\"left\">I&#39;m new to Reddit, but shouldn&#39;t that be &quot;You&#39;re&quot;.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ucss9?context=5\">Who is your favorite stand-up comedian?</a></td>\n<td align=\"left\">Well, I have to say Jay Black because he&#39;s here.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Lewis Black Gilbert Gottfried Colbert Sinbad George Lopez Louis CK&#39;s last special was awesome and very smart.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9udrfv?context=5\">What are your thoughts on Chris Christie?  Would you ever run for office?</a></td>\n<td align=\"left\">I would run for office, but not against him!  We&#39;re not of the same political persuasion, but he&#39;s the smartest politician on the scene.  You can&#39;t help but love his flippant Jersey style.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I mean, how many politicians can get into a verbal altercation on the boardwalk with an ice cream cone in his hand?  Maybe Lincoln...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ublc5?context=5\">What can you tell us about the new flick? What was your favorite part about filming?</a></td>\n<td align=\"left\">My favorite part of the new movie was working with Paul Sorvino -- that was thrilling.  And, intimidating -- he&#39;s a friend, but he&#39;s so serious in his role as a tough guy that there were points I actually got scared of him.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Also, dancing and singing with the star, Erich Bergen was amazing.  It was nice to show off my chops.  But don&#39;t worry, I&#39;m still Jersey baby.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ud4mv?context=5\">Nice.</a></td>\n<td align=\"left\">He&#39;s a fine young man who I know is married, so that means he&#39;s sexually frustrated.  That means his testosterone level is probably through the roof.  Let&#39;s not anger him!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uf334?context=5\">Approximately how many schools can the .88 magnum efficiently penetrate?</a></td>\n<td align=\"left\">I love Johnny Dangerously -- great movie.  Shout out to Amy Hecklerling for directing it.  And Norman Steinberg for writing it.  But clearly, we would have left that joke out if the movie were made today...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9udow4?context=5\">Do you think there are as many talented comedians performing nowadays as there were back in the 80s and 90s? If not, why not? ( I would say no and I do not know why. Maybe performers are a lot more phony and formulaic than they used to be. )</a></td>\n<td align=\"left\">Wow, what an astute question!</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I actually think that the best time for stand-up was before my time.  Guys like Robert Klein, George Carlin, Rodney Dangerfield, Richard Pryor, Woody Allen, Dick Cavett, and Bill Cosby.  Those guys were the true pioneers.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Since I hit the scene, it&#39;s all be downhill since then! :)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ubusr?context=5\">What is the most memorable thing that you saw or were part of on your appearance on Startrek TNG ? </a></td>\n<td align=\"left\">LeVar Burton never took that thing off his head.  That&#39;s all I have to say.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uc8i5?context=5\">Joe, can you talk about some behind the scenes memories of that awful strange transition when everyone got fired but you and Eddie Murphy? </a></td>\n<td align=\"left\">I felt so bad that we were ruining America&#39;s favorite television show.  And when they decided to keep Eddie and I, we were just two cocky comics from the clubs and, at the time, we couldn&#39;t care less.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I think that it was that cockiness that kept us funny and appealing to the producers.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ud08l?context=5\">Thanks for doing this AMA Joe.  A fan of your work, and thanks for all the laughs over the years.  What comics crack you up the most today, and who were you favorites in the past?  Lastly, what is the airspeed velocity of an unladen swallow?  :-)  </a></td>\n<td align=\"left\"><a href=\"http://youtu.be/y2R3FvS4xr4\">Link to youtu.be</a></td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uf9ml?context=5\">What is going on the Howard stern show like? </a></td>\n<td align=\"left\">Part psychotherapy.  Part interrogation.  Part waterboarding.  All in all, a good experience...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uedbv?context=5\">In that famous clip of you playing the drums, and dying from cocaine,  A) Were you really playing the drums?  B) Was it real cocaine?</a></td>\n<td align=\"left\">Really playing the drums, but not real cocaine.  But according to some of the people in this AMA, I really did die :)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9udx1g?context=5\">I&#39;m honestly not trying to insult you, but did/do you use PEDs?</a></td>\n<td align=\"left\">Fair question. Does Lipitor count as a PED?</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I never, not once EVER used a PED.  I used to work out with the big boys at the gym and they would say, &quot;Why would you work out so hard, just take a shot in the ass!&quot;</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">In principle, I was against it, but not to mention I had the cancer and any PED would accelerate the growth of any latent cancer cells.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uf1va?context=5\">That was back in the early 80&#39;s right? Everything still OK, Mr. Piscopo?</a></td>\n<td align=\"left\">They tell me I was &quot;cured&quot; in 1991 (10 years cancer free) -- but you&#39;re always looking over your shoulder and to this day, I&#39;m an absolutely hypochondriac and I get tested regularly.  For cancer.  And STDs.  :)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uayah?context=5\">Who was the biggest douchebag on SNL to work with? </a></td>\n<td align=\"left\">I am Italian.  I have taken the SNL code of Omerta.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ublhf?context=5\">I only have one question: &quot;Hey yo, beanpole! Yooouuu wanna show me what you got?&quot;</a></td>\n<td align=\"left\">Another literal laugh out loud.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">The basketball players were standing on apple boxes so that they could make me look shorter than I was -- but I have the fondest memories of shooting those Miller Beer spots.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">By the way: I must be the worst white basketball player on the planet.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ub5ij?context=5\">Who would you say is the best living New Jerseyan? (I&#39;m assuming Sinatra would be tops of the all-time list.)</a></td>\n<td align=\"left\">Re: Sinatra -- true dat.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Right now, Springsteen is the living legend.  Hands down, no contest.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ucjix?context=5\">You opened up a Piano Bar at the Resorts casino in Atlantic City and I so badly wanted to go but found out about it on the day we were leaving. Is it still there?</a></td>\n<td align=\"left\">We took &quot;Club Piscopo&quot; on the road.  We will be at McCloone&#39;s in Asbury Park June 6th, July 10th (with Jeff Norris), and if I can afford him... Jay Black one day.  C&#39;mon out and see the show!  Would love to meet you!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uc80k?context=5\">What was your single favorite skit that you performed in on SNL?</a></td>\n<td align=\"left\">Solomon and Pudge -- where Eddie and I played those two old guys in the neighborhood bar.  It was always placed in the 12:55 slot -- it was so organic, I always felt that it embodied the relationship of Eddie and I more than anything else.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">But swinging with the SNL band doing Frank Sinatra was Ring-A-Ding as well...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ubnw3?context=5\">In your opinion what was the &quot;Golden Era&quot; of SNL? The ONE period where the perfect storm of actors, writers, hosts all came together to make the best shows.</a></td>\n<td align=\"left\">Great question: the original cast.  That&#39;s inarguable.  One of the greatest collection of actors on the planet.  Great writers.  Lorne Michaels!  I am awed by what they accomplished.  The fact that I got to even place a few steps on the trail they blazed was an honor.  (Was that too dramatic an answer?)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uc71z?context=5\">Why are old rich people afraid of typing?</a></td>\n<td align=\"left\">I&#39;m not that old, I&#39;m not that rich.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Side note: Jay is typing this because he has a full keyboard and because if I tried to type this out on my iPhone 5 it&#39;ll be 2016 before this AMA is done.  If Apple ever makes a phone for people with normal sized hands, I think that little upstart company might have something...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9udbtc?context=5\">Hey Joe! Thanks for doing this! What has been the biggest letdown of your career as a comedian/actor? </a></td>\n<td align=\"left\">I did a show for the New Jersey Chamber of Commerce YEARS ago and it was a train wreck in every way conceivable.  But, in true Jersey fashion, all is forgiven... but not forgotten.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ud16n?context=5\">What do you think of that show jersey shore? you know the show with snooki aka the evil midget.</a></td>\n<td align=\"left\">If you&#39;re from Jersey or if you&#39;re Italian, you can make all the jokes you want.  If you&#39;re not, fuggedaboutit...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9udg9o?context=5\">Do you have a podcast or have any favorite interviews that you have done this year?</a></td>\n<td align=\"left\"><a href=\"https://mobile.twitter.com/GaryCantrell\">Link to mobile.twitter.com</a></td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">And, Paul Rohrer in Denver is great as well!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ud7se?context=5\">Is Howard stern as large of an ass hole that he seems?</a></td>\n<td align=\"left\">Howard is one of the nicest guys on the planet -- off the air. His on-air persona is appealing to millions, but what&#39;s most appealing to me is how down-to-earth and insecure the guy really is.  He&#39;s a human being doing a show.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ufcfl?context=5\">Is the fact that this AMA only has 96 upvotes in 3 hours disheartening? </a></td>\n<td align=\"left\">Seeing as I didn&#39;t know what an upvote was 4 hours ago -- no.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9udisi?context=5\">&quot;You are black and I am white, you are blind as a bat and I have sight.&quot; /fucking hilarious.</a></td>\n<td align=\"left\">The one and only time I ever (respectfully) upstaged Eddie Murphy.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ubvy3?context=5\">I love your recent appearances on Opie and Anthony. You were hilarious and had some great stories as well as a fantastic sense of humor about everything, including yourself.  Great sport mate, hope to see more of you. </a></td>\n<td align=\"left\">God Bless you Brother.  Thanks, I&#39;m trying.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uf3j1?context=5\">Joe really did a great job on O&amp;A. Not many can keep a cool head when dealing with them and their hilarious antics. </a></td>\n<td align=\"left\">I truly appreciate that.  Thanks.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9udaje?context=5\">Now I am looking up Johnny D on Netflix. Haven&#39;t seen that movie in years but one my all time favorites. Great job in that movie!</a></td>\n<td align=\"left\">You can&#39;t just see that movie once... ONCE!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uc4zd?context=5\">Joe, youre the man. Ive enjoyed everything Ive seen you in. I wish I had a question, but in lieu of that, Ill just say good luck with your new flick and all your future endeavors.</a></td>\n<td align=\"left\">Thank you brother.  I&#39;ll take this opportunity to plug where the movie is at.  Please, if you&#39;re near one of these theaters, go see it.  Or, maybe just go buy a ticket and then go watch Iron Man 3.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">We&#39;re playing at the AMC in...</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Jersey Gardens in Elizabeth, NJ AMC Loews Village 7 on 3rd AVE in New York. AMC Norwalk 20 in Norwalk, CA.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uf0p5?context=5\">You shouldn&#39;t have done this IAmA, Joe. Stephen Colbert did an IAmA. ONCE!</a></td>\n<td align=\"left\">Need to say something here: Stephen Colbert is one of the smartest, most talented human beings on TV today.  I am a HUGE Colbert fan!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uc5d5?context=5\">Sidekicks was such a fun movie to watch when I was younger. I&#39;ll have to see if I can find that on netflix or something.</a></td>\n<td align=\"left\">Technically that&#39;s not a question, but every time you watch it on Netflix, I get a check for 4 cents.  So if you could please watch it like 84,000,000 times today, I&#39;d appreciate it...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ub3hy?context=5\">My favorite SNL was when you were throwing stuff at Eddie Murphy during a velvet Jones skit.  Did you guys happen to be intoxicated or something, or was it just that crazy on the set.</a></td>\n<td align=\"left\">Oh my God, I remember that!  That was wild!  The sketch was BOMBING and Eddie and I were trying to pull it out and make it work.  So, we weren&#39;t intoxicated, just desperate.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">But that was such a great time, thanks for reminding me of it!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ucwy7?context=5\">No questions really, but my buddies mom used to fuck you wayyy back in the day.  She&#39;s pretty MILF&#39;y and seems like she&#39;d be a freak in the sack, so good job, Joey.</a></td>\n<td align=\"left\">Stay classy Reddit.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ue29l?context=5\">Please give us the behind the scenes gossip from the movie Super. edit: just realized it&#39;s The Super, and it starred joe pesci...not joe piscopo. still though, i stand by my question.</a></td>\n<td align=\"left\">I wasn&#39;t in the movie &quot;The Super!?&quot;</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uf89a?context=5\">Howard is one of the nicest guys on the planet -- off the air. His on-air persona is appealing to millions, but what&#39;s most appealing to me is how down-to-earth and insecure the guy really is.  He&#39;s a human being doing a show.</a></td>\n<td align=\"left\">(by the way, he&#39;s the guy who told me I should marry Kimberly!)</td>\n</tr>\n</tbody></table>\n\n<p><em>Last updated: 2013-05-13 00:05 UTC</em></p>\n\n<p><em>This post was generated by a robot! Send all complaints to <a href=\"/message/compose/?to=epsy\">epsy</a>.</em></p>\n</div><!-- SC_ON -->",
  "author_flair_css_class": "tabler",
  "subreddit_id": "t5_2tkmw",
  "archived": true,
  "domain": "self.tabled",
  "clicked": false,
  "score": 6,
  "id": "1dywuc",
  "stickied": false,
  "media_embed": {},
  "visited": false,
  "selftext": "**Verified?** *(This bot cannot verify AMAs just yet)*\n\n**Date:** 2013-05-07\n\n**[Link to submission](http://www.reddit.com/r/IAmA/comments/1dvsrk/)** (*Has self-text*)\n\n**[Link to my post](http://www.reddit.com/r/IAmA/comments/1dvsrk/tabledresser/c9v63ga)**\n\n\n\nQuestions|Answers\n:--|:--\n[What was the experience like on the set?   Were you a Star Trek fan before accepting the role?   If you could replicate any human, who would it be?](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ubfiy?context=5)|The best part of the entire experience was working with Brent Spiner. That guy is amazing actor! It's more than just gold makeup. Also no matter where I go in the world people bring that up to me more than any other role I've done.\n[Did you ever do your Sinatra impersonation for Sinatra?  If so, did Frank approve?](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ucl2p?context=5)|Yes -- at the Friar's Club.  He LOVED it (which is why I'm still alive).  And, on an old show called \"Solid Gold\" where the man himself introduced me and I did him in full make-up.  He used to refer to me as the \"Vice Chairman of the Board.\"\n[What was it like to fight Chuck Norris in Sidekicks?  Was there a third fist hidden under his beard?](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ubfpf?context=5)|Very funny!\n |It was a privilege and an honor being beaten up by the bearded one.\n |I had never trained so hard in my life because of my respect for Chuck.  He's a great guy and a great athlete.  And, as silly as my character was, we took the fight scenes seriously.\n |Even though I signed a contract saying I wouldn't tell: yes, there is a third fist in his beard.\n[Why'd ya ditch the mullet? you rocked that 'do out of the park.](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uc1oy?context=5)|Literally laughing out loud right now.\n |The truth is that Jon Stamos asked me to cut it off so that he could be the good looking one... ;)\n[Who were your least favorite people to work with on SNL?  Favorite?](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uazj3?context=5)|Favorite person is easy: I can never quite describe the thrill of working with Eddie Murphy live on the set of SNL.  He had a reckless abandon that was contagious.\n[The recent set of interactions with O&A was brilliant from beginning to end.  It made my appreciation for you grow even more.](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uazj3?context=5)|And, really, thank you for the kind words about O&A -- getting my ass kicked in court wasn't fun, but you guys helped me get through it!  Thank you!\n[*I know that this is an AMA and I want to be honest with you all, but I'm a guy that just doesn't like going negative.*  GGJP.](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9udlrq?context=5)|Oh, if this could become a new meme... I would be so happy!\n[Joe, you are a great performer!  Truly enjoyed your SNL stuff!](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uc5kw?context=5)|That's a fair question.\n[My question is regarding your name being synonymous with a great actor/performer expected to be huge post-TV and never attaining the same as, say, an Eddie Murphy or Julia-Louis Dreyfuss (strictly SNL alum speaking\\).  What are your thoughts on that?  Does it bother you?  Are you satisfied with your work post-SNL enough that you can just let it wash over you?](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uc5kw?context=5)|After I had Thyroid Cancer in 1981, my outlook on what \"success\" is changed.  I lost my single-minded focus to succeed in showbiz and wound up focusing way more on my family.  So, if you're asking if I'm happy with my career, I think the bigger question is am I happy with my life -- and the answer is, I'm here, I'm alive, and YES!\n[What's your favorite story from the set of Johnny Dangerously ?](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uaya8?context=5)|There's a scene in JD where there's a dead body -- someone was cleaning his gun and I accidentally shot somebody.  Michael Keaton and I are talking and, as an adlib, we both rest our feet on the body.  We could hardly stop ourselves from laughing.  I'm not even sure it made it into the final cut (I haven't seen the movie in a while -- any redditors remember if it's in there or not)?\n |Anyway, just working with a guy like Keaton -- every day was a struggle not to laugh!\n[So my question is, what is your favorite filming **location** of all the films you've been in, and why?](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ubj5m?context=5)|My favorite place to shoot was the exotic... Newark and Jersey City when I was shooting Wiseguys with Danny DeVito.  It was the dead cold of winter, the scenery was oil refineries and cemeteries, and man... it just doesn't ge better than that.  For a Jersey boy, it was nice being around what I grew up with :)\n[You're on the road a lot, can you share some of those experiences and tips on how you deal with that?](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ubz15?context=5)|Here's the trick: I seem to seek out women who are really mean to me, and that makes everything else in life a lot easier to deal with.  Those same girls, though, they make the road very... accommodating.\n[How did you react after your long Time friends opie and Anthony reacted to your hbo special?](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uczvr?context=5)|There are times when I don't disagree with Opie and Athony but I have to stay politically correct because of the good people I work with.\n[Why sit there shirtless while talking??](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uczvr?context=5)|By the way -- what are you talking about me being shirtless?  I don't remember having done that...\n[We can see through your webcam. You're shirtless now, Joe. ](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uec87?context=5)|Well then you're going to have pay extra...\n[What's your favorite joke?](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ucv86?context=5)|Howard Hughes type guy, old, rich but just a mess.  He decides to change his life -- gets spiffied up -- he cuts his hair, gets a shave, buys a suit, some plastic surgery, a red Ferrari, a young hot blonde at his side.\n |They're driving down the highway and BOOM, he's struck by lighting.  He gets up to heaven and he says to God -- I just started learning how to live my life!  Why did you take me.\n |And God says, \"well, to tell you the truth, I didn't recognize you.\"\n |Okay not a great joke, but my dad loved it.  And, uh, don't tell /r/atheism about it.  It's just a joke.  I don't need them coming after me! :)\n[Who do you think has been the best SNL host of all time? And, follow up question, who's been an epic fail? ](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ub1yk?context=5)|Eddie was the best host I've ever seen -- if you'll remember, Nick Nolte was scheduled to host and backed out at the last second and Eddie stepped in for him.  There have been a lot of SNL articles and books about this incident, but I can tell you Reddit none of them got it right: Eddie Murphy was the single best host in the show's history.  And... he saved our ass that week.\n |Epic Fail: we already talked about Spruce Burn.\n[I imagine the hilarity of the script made it hard to get usable stuff on film. Who was the funniest on set, and how much of the movie was improvised?](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ubbcn?context=5)|Peter Boyle was great.  And Richard Dimirti who played Roman Moronie is truly one of the funniest people I ever worked with.  He kept all of us in stitches on the set.\n[How long did it take you to compose Kimberly, and why was it never released as a commercial single? IT ROCKED!](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9udxn3?context=5)|Again, literally laughing out loud.\n |All I can say Reddit is that when you're in love, sometimes you do stupid things.\n |Suffice it to say, if that song were released today, it would have significantly different lyrics. \n[What was the best and worst part about working at SNL? Who were your favorite and least favorite guest hosts?](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uay00?context=5)|Coming up with new material every week was as daunting a task as I ever encountered.\n |I can remember Eddie and me staying up all night trying to come up with new material.  We were like two college roommates cramming for a final -- we both got punchy and started riffing and some of the best stuff came out of that.\n |Some bad moments -- having to do a sketch that you *knew* wasn't really funny, but they needed to fill time.  And then on Sunday hearing all my boys back in Jersey calling me out on how terrible the sketch was.\n |Favorite Guest Host -- Jerry Lewis, Robin Williams, and Don Rickles.\n |Least Favorite Guest Host -- I said before, I didn't want to talk bad about anybody.  But let's just say that if I *had* to say something about somebody, his name would rhyme with \"Spruce Burn\". :)\n[Do you ever get tired of people asking you about SNL or Johnny Dangerously?](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ubun1?context=5)|Never get tired of SNL ever.  Keep asking all you want!\n[I know you guys want to talk about the new movie, not stuff that happened in the 80s, right?](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ubun1?context=5)|There's only ONE Sinatra, but I gotta tell ya -- I was at the Sinatra restaurant in the Wynn in Vegas last night and I asked for a table and they told me it was a half hour wait.  My first thought was WWFD -- What Would Frank Do -- but since I figured *I* would get arrested for killing a maitre'd, we went to a Chinese joint.\n[Also, who does the best Sinatra impression...you, or Joe Piscopo?](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ubun1?context=5)|But seriously, if you want to see me channel the old man, come out to one of my shows!  He would have wanted it that...\n[Any plans of returning to SNL, even if it's just a quick cameo?](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ubhfi?context=5)|Lorne Michaels offered me a shot on Weekend Update.  If and when I announce my candidacy for the governorship of New Jersey, I'll take him up on that offer.\n[How much can you bench?](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ubxtb?context=5)|I love this question.  Here it is, straight from the heart: I suck on the flat bench.  MAX, INCLINE: 225.  I've always admired the beef monsters who can bang 345.\n |UGH, I feel like such a wuss.\n[In the major motion picture Sidekicks how was it like to fight Chuch Norris? also, Did you ever happen to stay in touch with young Johnathan Brandis? If so did he ever show any signs of depression or an signs leading to his suicide?](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uctbb?context=5)|That's a great question.  He absolutely did not seem depressed ever.  He was one of the most positive, nicest kids you'll ever meet.  Which just goes to show you, you never know how and when the depression is going to hit.\n[I'm only curious because I enjoyed the roles he was in. good actor.](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uctbb?context=5)|Jay is telling me about reddit and I love the sense of community you have here.  Things like /r/suicidewatch are a great resource for people needing help and I urge any of you who might be feeling bad to seek help.  Johnathan was a great kid and I miss him.\n[When's *Dead Heat 2* coming out?](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ubu4b?context=5)|Seriously, I get more requests for what you just asked than anything else!  As soon as I'm done with this AMA I'm calling my agent and suing the makers of RIPD! :)\n[I Thought You Were Dead!? Well Anyways Your Pretty Funny. ](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ucamt?context=5)|I'm new to Reddit, but shouldn't that be \"You're\".\n[Who is your favorite stand-up comedian?](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ucss9?context=5)|Well, I have to say Jay Black because he's here.\n |Lewis Black Gilbert Gottfried Colbert Sinbad George Lopez Louis CK's last special was awesome and very smart. \n[What are your thoughts on Chris Christie?  Would you ever run for office?](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9udrfv?context=5)|I would run for office, but not against him!  We're not of the same political persuasion, but he's the smartest politician on the scene.  You can't help but love his flippant Jersey style.\n |I mean, how many politicians can get into a verbal altercation on the boardwalk with an ice cream cone in his hand?  Maybe Lincoln...\n[What can you tell us about the new flick? What was your favorite part about filming?](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ublc5?context=5)|My favorite part of the new movie was working with Paul Sorvino -- that was thrilling.  And, intimidating -- he's a friend, but he's so serious in his role as a tough guy that there were points I actually got scared of him.\n |Also, dancing and singing with the star, Erich Bergen was amazing.  It was nice to show off my chops.  But don't worry, I'm still Jersey baby.\n[Nice.](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ud4mv?context=5)|He's a fine young man who I know is married, so that means he's sexually frustrated.  That means his testosterone level is probably through the roof.  Let's not anger him!\n[Approximately how many schools can the .88 magnum efficiently penetrate?](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uf334?context=5)|I love Johnny Dangerously -- great movie.  Shout out to Amy Hecklerling for directing it.  And Norman Steinberg for writing it.  But clearly, we would have left that joke out if the movie were made today...\n[Do you think there are as many talented comedians performing nowadays as there were back in the 80s and 90s? If not, why not? ( I would say no and I do not know why. Maybe performers are a lot more phony and formulaic than they used to be. \\)](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9udow4?context=5)|Wow, what an astute question!\n |I actually think that the best time for stand-up was before my time.  Guys like Robert Klein, George Carlin, Rodney Dangerfield, Richard Pryor, Woody Allen, Dick Cavett, and Bill Cosby.  Those guys were the true pioneers.\n |Since I hit the scene, it's all be downhill since then! :)\n[What is the most memorable thing that you saw or were part of on your appearance on Startrek TNG ? ](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ubusr?context=5)|LeVar Burton never took that thing off his head.  That's all I have to say.\n[Joe, can you talk about some behind the scenes memories of that awful strange transition when everyone got fired but you and Eddie Murphy? ](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uc8i5?context=5)|I felt so bad that we were ruining America's favorite television show.  And when they decided to keep Eddie and I, we were just two cocky comics from the clubs and, at the time, we couldn't care less.\n |I think that it was that cockiness that kept us funny and appealing to the producers.\n[Thanks for doing this AMA Joe.  A fan of your work, and thanks for all the laughs over the years.  What comics crack you up the most today, and who were you favorites in the past?  Lastly, what is the airspeed velocity of an unladen swallow?  :-\\)  ](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ud08l?context=5)|[Link to youtu.be](http://youtu.be/y2R3FvS4xr4)\n[What is going on the Howard stern show like? ](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uf9ml?context=5)|Part psychotherapy.  Part interrogation.  Part waterboarding.  All in all, a good experience...\n[In that famous clip of you playing the drums, and dying from cocaine,  A\\) Were you really playing the drums?  B\\) Was it real cocaine?](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uedbv?context=5)|Really playing the drums, but not real cocaine.  But according to some of the people in this AMA, I really did die :)\n[I'm honestly not trying to insult you, but did/do you use PEDs?](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9udx1g?context=5)|Fair question. Does Lipitor count as a PED?\n |I never, not once EVER used a PED.  I used to work out with the big boys at the gym and they would say, \"Why would you work out so hard, just take a shot in the ass!\"\n |In principle, I was against it, but not to mention I had the cancer and any PED would accelerate the growth of any latent cancer cells. \n[That was back in the early 80's right? Everything still OK, Mr. Piscopo?](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uf1va?context=5)|They tell me I was \"cured\" in 1991 (10 years cancer free) -- but you're always looking over your shoulder and to this day, I'm an absolutely hypochondriac and I get tested regularly.  For cancer.  And STDs.  :)\n[Who was the biggest douchebag on SNL to work with? ](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uayah?context=5)|I am Italian.  I have taken the SNL code of Omerta.\n[I only have one question: \"Hey yo, beanpole! Yooouuu wanna show me what you got?\"](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ublhf?context=5)|Another literal laugh out loud.\n |The basketball players were standing on apple boxes so that they could make me look shorter than I was -- but I have the fondest memories of shooting those Miller Beer spots.\n |By the way: I must be the worst white basketball player on the planet.\n[Who would you say is the best living New Jerseyan? (I'm assuming Sinatra would be tops of the all-time list.\\)](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ub5ij?context=5)|Re: Sinatra -- true dat.\n |Right now, Springsteen is the living legend.  Hands down, no contest.\n[You opened up a Piano Bar at the Resorts casino in Atlantic City and I so badly wanted to go but found out about it on the day we were leaving. Is it still there?](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ucjix?context=5)|We took \"Club Piscopo\" on the road.  We will be at McCloone's in Asbury Park June 6th, July 10th (with Jeff Norris), and if I can afford him... Jay Black one day.  C'mon out and see the show!  Would love to meet you!\n[What was your single favorite skit that you performed in on SNL?](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uc80k?context=5)|Solomon and Pudge -- where Eddie and I played those two old guys in the neighborhood bar.  It was always placed in the 12:55 slot -- it was so organic, I always felt that it embodied the relationship of Eddie and I more than anything else.\n |But swinging with the SNL band doing Frank Sinatra was Ring-A-Ding as well...\n[In your opinion what was the \"Golden Era\" of SNL? The ONE period where the perfect storm of actors, writers, hosts all came together to make the best shows.](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ubnw3?context=5)|Great question: the original cast.  That's inarguable.  One of the greatest collection of actors on the planet.  Great writers.  Lorne Michaels!  I am awed by what they accomplished.  The fact that I got to even place a few steps on the trail they blazed was an honor.  (Was that too dramatic an answer?)\n[Why are old rich people afraid of typing?](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uc71z?context=5)|I'm not that old, I'm not that rich.\n |Side note: Jay is typing this because he has a full keyboard and because if I tried to type this out on my iPhone 5 it'll be 2016 before this AMA is done.  If Apple ever makes a phone for people with normal sized hands, I think that little upstart company might have something...\n[Hey Joe! Thanks for doing this! What has been the biggest letdown of your career as a comedian/actor? ](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9udbtc?context=5)|I did a show for the New Jersey Chamber of Commerce YEARS ago and it was a train wreck in every way conceivable.  But, in true Jersey fashion, all is forgiven... but not forgotten.\n[What do you think of that show jersey shore? you know the show with snooki aka the evil midget.](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ud16n?context=5)|If you're from Jersey or if you're Italian, you can make all the jokes you want.  If you're not, fuggedaboutit...\n[Do you have a podcast or have any favorite interviews that you have done this year?](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9udg9o?context=5)|[Link to mobile.twitter.com](https://mobile.twitter.com/GaryCantrell)\n |And, Paul Rohrer in Denver is great as well!\n[Is Howard stern as large of an ass hole that he seems?](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ud7se?context=5)|Howard is one of the nicest guys on the planet -- off the air. His on-air persona is appealing to millions, but what's most appealing to me is how down-to-earth and insecure the guy really is.  He's a human being doing a show.\n[Is the fact that this AMA only has 96 upvotes in 3 hours disheartening? ](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ufcfl?context=5)|Seeing as I didn't know what an upvote was 4 hours ago -- no.\n[\"You are black and I am white, you are blind as a bat and I have sight.\" /fucking hilarious.](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9udisi?context=5)|The one and only time I ever (respectfully) upstaged Eddie Murphy.\n[I love your recent appearances on Opie and Anthony. You were hilarious and had some great stories as well as a fantastic sense of humor about everything, including yourself.  Great sport mate, hope to see more of you. ](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ubvy3?context=5)|God Bless you Brother.  Thanks, I'm trying.\n[Joe really did a great job on O&A. Not many can keep a cool head when dealing with them and their hilarious antics. ](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uf3j1?context=5)|I truly appreciate that.  Thanks.\n[Now I am looking up Johnny D on Netflix. Haven't seen that movie in years but one my all time favorites. Great job in that movie!](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9udaje?context=5)|You can't just see that movie once... ONCE!\n[Joe, youre the man. Ive enjoyed everything Ive seen you in. I wish I had a question, but in lieu of that, Ill just say good luck with your new flick and all your future endeavors.](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uc4zd?context=5)|Thank you brother.  I'll take this opportunity to plug where the movie is at.  Please, if you're near one of these theaters, go see it.  Or, maybe just go buy a ticket and then go watch Iron Man 3.\n |We're playing at the AMC in...\n |Jersey Gardens in Elizabeth, NJ AMC Loews Village 7 on 3rd AVE in New York. AMC Norwalk 20 in Norwalk, CA.\n[You shouldn't have done this IAmA, Joe. Stephen Colbert did an IAmA. ONCE!](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uf0p5?context=5)|Need to say something here: Stephen Colbert is one of the smartest, most talented human beings on TV today.  I am a HUGE Colbert fan!\n[Sidekicks was such a fun movie to watch when I was younger. I'll have to see if I can find that on netflix or something.](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uc5d5?context=5)|Technically that's not a question, but every time you watch it on Netflix, I get a check for 4 cents.  So if you could please watch it like 84,000,000 times today, I'd appreciate it...\n[My favorite SNL was when you were throwing stuff at Eddie Murphy during a velvet Jones skit.  Did you guys happen to be intoxicated or something, or was it just that crazy on the set.](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ub3hy?context=5)|Oh my God, I remember that!  That was wild!  The sketch was BOMBING and Eddie and I were trying to pull it out and make it work.  So, we weren't intoxicated, just desperate.\n |But that was such a great time, thanks for reminding me of it!\n[No questions really, but my buddies mom used to fuck you wayyy back in the day.  She's pretty MILF'y and seems like she'd be a freak in the sack, so good job, Joey.](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ucwy7?context=5)|Stay classy Reddit.\n[Please give us the behind the scenes gossip from the movie Super. edit: just realized it's The Super, and it starred joe pesci...not joe piscopo. still though, i stand by my question.](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9ue29l?context=5)|I wasn't in the movie \"The Super!?\"\n[Howard is one of the nicest guys on the planet -- off the air. His on-air persona is appealing to millions, but what's most appealing to me is how down-to-earth and insecure the guy really is.  He's a human being doing a show.](http://www.reddit.com/r/IAmA/comments/1dvsrk/i_am_joe_piscopo_who_you_might_know_from_saturday/c9uf89a?context=5)|(by the way, he's the guy who told me I should marry Kimberly!)\n\n\n*Last updated: 2013-05-13 00:05 UTC*\n\n*This post was generated by a robot! Send all complaints to [epsy](/message/compose/?to=epsy).*\n\n",
  "hide_score": false,
  "_api_link": "https://api.reddit.com/r/tabled/comments/1dywuc/table_iama_i_am_joe_piscopo_who_you_might_know/?ref=search_posts",
  "locked": false,
  "edited": 1368403592.0,
  "title": "[Table] IAmA: I am Joe Piscopo, who you might know from Saturday Night Live, Johnny Dangerously, or my appearances on Howard Stern. Go ahead and ask my anything!",
  "created": 1368063463.0,
  "_comments_by_id": {}
}