{
  "clicked": false,
  "_replaced_more": false,
  "archived": true,
  "num_comments": 2,
  "created": 1383899192.0,
  "saved": false,
  "selftext": "I am very angry. I am at my wits end. This debaucherous fucking addiction I would not wish on my worst enemy. The smothering hold is like molten lava covering a volcano in the inevitable eruption or relapse. I am so angry and amply aware that feeling shame or guilt or getting down on myself after a relapse is the worst for me. But you know what I don't give a fuck. Fuck this shit trying to quit this is like holding my arm upright for 7 years. I am aware that the brain has limited self control power and once it is exhausted then that is the limit to its restrictive control over the impulse to watch porn. I think the behaviour I am also more addicted to is the exhibitionist aspect on webcams this is the strongest. But so is the porn pull they are both equally as strong. Fucking so many years of porn use, since I was what 11? Seriously why the fuck did I have to get internet access unmonitored to fuel my selfless, loathsome, ghastly and powerless pull to self medication. Seeing porn magazines when I was still in primary school as well could not have been anything but destructive for my psyche.  \n\nI really feel no discrepancy between me and a fucking junkie on the street begging for money. Both powerless both fucking pathetic and soulless and empty shells of people. 'Ghosts' as addicts are referred to in the book i'm reading currently. How many more books do I fucking have to read. Seriously, and the countless articles, blog posts, scientific research, videos. I honestly think I am an expert on the topic and am still powerless to stop the compulsive behaviour inhibiting me. Seriously it's so discouraging. Plus I am doing this completely on my own. All my friends are fucking whacked out cunts all addicted to smoking weed, abuse alcohol or also watch porn every fucking day. Its like I have literally no normal friends. this is a long time coming. It's so fucked I need to cleanse my friendship circle and then what, I am left with my lonesome self worst enemy. My family are ALL fucking lost causes abandoning me when I was a child and causing further neglect to a child who just wanted to be loved. Got nothing but rejection from my own parents. Who the fuck deserves that. Fucking losers. My dad is addicted to gambling it fucking serves him right I hope he fucking realises now how pathetic he is. My sister the hoarder causing all the problems with the estate. My grandma who is a fucking lost cause it's not her fault she is helping me but she cannot provide solace while I stay with her. She cannot provide it as she does not know how but I am thankful to be here not back where I was. Maybe I move out. Nearly finished my degree just push through. Thinking about the Juris Doctor Post graduate how pathetic can't even get through the exam period without binging on porn to get through and take of the fucking sting of anxiety. How fucking pathetic. \n\nRunning around the block I mean that is good but with the wrong mindset all replacement behaviours are fucking lost. I need my marks back as this is the first semester after mums death where I gave it everything. So far marks above  HD is  great but this fucking assignment is causing me anxiety. Just have to wait until tomorrow. I can stop this shit I really can. I believe I can but only been persisting for 4 months. This is not that long. Considering I frequent 7 day streaks and above I can keep improving. Each streak does get easier. The crash is bad yes but it is only bad if I stay down. I must push on. Finish this book. I really think it will be the last addiction book I read perhaps it's too fucking depressing reading about it and obsessing over addiction I only keep thinking about my sex compulsion. The brothel has to stop. That was bad the other week. I've got nobody but me to rely on. So just face that fact and deal with it. If I never speak to anybody who causes me pain in my life again i really DO NOT CARE, this is sincere this is a self protective mindset. The mind will survive but eliminating pain by whatever means necessary. That is what i've done. \n\nI push through even though it seems lost. The urge will hit in a few hours again but I should not give in. I should delete it. The last streak was reparative and I feel the healing more and more each streak. It is slow but new circuits are being rewired neuroplasticity is taking place. I think the brain can heal. Which is what the book i'm reading the author indicates otherwise. I think once i finish the real of hungry ghosts I should finish the brain that changes itself. This will wrap it all up. Moral point of view from gabor mate as to the emergence of the trauma and emotional abuse and **neglect** from my young age. Really understand that this is the compulsive behaviour that has grown to comfort my neglect from childhood in the only way I knew. Sex, masturbation, erotica and pornography. It is a direct lineage from childhood not by chance. This is the embodiment of years of built up neglect that I never addressed until now. How could I be so convoluted that I could not discover this until now. All the drugs, the hookers, the drinks, the fights, the anger it all spurs from this. My introspective nightmare stops here and today I face my fears I face my inner demon I face the inner turmoil and chaos. I must stand and fight I must be the man my family could never produce or emulate his characteristics hence i've always been looking for father figures in movies, criminals, playboys, charismatic drug abusers self medicating in similar fashion to myself, teachers, bouncers, lecturers, WHOEVER. Well this stops now as I have the tools and intrinsic worth to the total that I need to be a man. A strong man, a strong mind, a happy mind, a peaceful mind. Make amends with my past. Finding inner tranquility will take time and will be lifelong. However, I have come very far in just under 2 years. This time 2 years ago I was taking as much drugs as I could get my hands on. Watching porn alot. Going to strip clubs incessantly, porn use was really constant and multiple times per day. I smoked cigarettes, since then quitting completely. I was drinking nearly every weekend abundant amounts of shots, tequila, 1800, beer, vodka, burbon, scotch, red bull, cocaine, MDMA, weed, caps, pills. I don't consume these substances anymore and if I drink it is really sensible in comparison. I read constantly which I never did in the last 7 years, since 2006 when all this inner grief began. I nearly killed myself then and there jumping off the balcony of the hotel in a drug fused insanity. I wouldn't recognise my junior self. I am just happy to be finishing my degree now have my steady job. However the Juris Doctor maybe out of reach. 75% is quite a substantial SNG. Must reassess my options before enrolling for my final year. Considering completing a double degree. But I don't  think I will be ready next year, I want to work for a few years first. Just going to focus and get as high mark as possible. UNSW or USYD seem fine. Maybe UNSW is easier to get admitted both have fee help. Anxiety from waiting for the essay will pass. This is the most anxious I will feel as I cannot differentiate complete obliteration of my future career prospects from nerves. This is really crunch time in the highest because I gave 100% and cannot offer much more. If i can't excel academically then that's it. I finish my degree and just get a mediocre job. NO FUCK THAT I will never give up give in. If i don't get the marks now I keep working harder. I will find a way into law. I can do the four year degree at MQ if JD is not a possibility. Who knows I may not even complete a masters in law. I might pursue finance. However I doubt it. Look, I find a respectable role in the financial services sector work there for a bit and then reassess. I can nearly guarantee that I will want to study law. Psychology is too strenuous, music, I suck at the guitar (somewhat), well I can play but only for light entertainment purposes there is no way I would have the desire to go pro, sport is out of the question, physics and cosmology will always be an interest but the engagement in the real world and society is too low even though I am very interested, politics is interesting however follow in the footsteps of the current PM and other MPs who complete law to get preselection or advisory positions. Complete law post graduate it may be a long time from now and I will finish at around age 32. But who cares it's a potential 30 year practice lifetime and then other pro bono or community involved activities. Fuck money, pursue prestige, truth, integrity, moral wholesomeness and uprightness. This is noble this is right, this is me, this suits my inner moral compass. Achieve this goal and a great satisfaction will be attained. I am satisfied now that I am on the journey there. I am enjoying the journey. This abominable compulsion will stop and my strength will push this aside to ultimate attain my goals. They are incompatible, they are not to live in coexistence. I want to help others and really deluge into the world and humanities most ancient aspect. Moral correctness and altruism. Fuck consumerism and pursuit of material possessions. Sure they are nice to have but as was once said \"the things that you own inevitably own you\". Tribal law as the aborigines had governed their societies peacefully, correctly and efficiently. Much the same as our biological ancestors from millions of years prior to homo Erectus and his uprising in the billions of year history of our evolution. \n\nRead the neuroscience book by doidge and this will complete this chapter in my life. I will have faced this final stringent and clinging addiction which I have endure for nearly 15 years without exaggeration. That is nearly a quarter of a century under this spell, no wonder it is so difficult to stop. But I will stop as I have been consistently, endure the pain because it eventually goes away. Find healthy ways to spend my time exercise for relief and read for solace. Move onto topics other than addiction that I have neglected because I am so engrossed reading about my ailment. Move to other aspects of life that are also worth discovering, philosophy, social injustice, history, great storytellers such as shakespeare, law, oppression, science, food, travel. Live life, live it fruitfully, build a family, build the life you never had. Help only those that want to change and are ready. All others are a waste of energy. Find a new way find a new rebirth. Find peace and love in this life. Not spiritually but humanistically, find it by breaking from the shackles of this addiction and all other destructive ones. Music, literature, travel, exercise and constructive time with family and friends which does not feed addictive tendencies is admirable and harmless. Spend your passion, zeal and zest on these pursuits. Do it for yourself, nobody else can guide you, nobody else can heed you in the write direction with the wrong attitude, it is all on yourself to make the change. No responsibility can be lopped onto others. However others can misguide you so be vigilant and cut all those who are not good for your psyche indefinitely and choose friends wisely that will guide and protect your best interests not reverse their progress. Change constantly and improve constantly and learn to live again with vigour, virility and vitality. Be remembered for the good left behind and the change that was made and enlightenment left behind. Live the life that you determine for yourself not what is alluded to by others or dictated by past failures of others in your family or previous social circles. You are not them and are your own man, your own person. Have strength, beat this and live life anew, and experience it in a way that I have denied myself for very long and it is scary to dream of this new reality but there is no choice. Evolve and learn to love thyself again and the rest of the world. Forgive the misfortunes and hand of fate bestowed upon yourself and forgive yourself for it was not your fault.",
  "mod_reports": [],
  "secure_media_embed": {},
  "edited": 1383900643.0,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am very angry. I am at my wits end. This debaucherous fucking addiction I would not wish on my worst enemy. The smothering hold is like molten lava covering a volcano in the inevitable eruption or relapse. I am so angry and amply aware that feeling shame or guilt or getting down on myself after a relapse is the worst for me. But you know what I don&#39;t give a fuck. Fuck this shit trying to quit this is like holding my arm upright for 7 years. I am aware that the brain has limited self control power and once it is exhausted then that is the limit to its restrictive control over the impulse to watch porn. I think the behaviour I am also more addicted to is the exhibitionist aspect on webcams this is the strongest. But so is the porn pull they are both equally as strong. Fucking so many years of porn use, since I was what 11? Seriously why the fuck did I have to get internet access unmonitored to fuel my selfless, loathsome, ghastly and powerless pull to self medication. Seeing porn magazines when I was still in primary school as well could not have been anything but destructive for my psyche.  </p>\n\n<p>I really feel no discrepancy between me and a fucking junkie on the street begging for money. Both powerless both fucking pathetic and soulless and empty shells of people. &#39;Ghosts&#39; as addicts are referred to in the book i&#39;m reading currently. How many more books do I fucking have to read. Seriously, and the countless articles, blog posts, scientific research, videos. I honestly think I am an expert on the topic and am still powerless to stop the compulsive behaviour inhibiting me. Seriously it&#39;s so discouraging. Plus I am doing this completely on my own. All my friends are fucking whacked out cunts all addicted to smoking weed, abuse alcohol or also watch porn every fucking day. Its like I have literally no normal friends. this is a long time coming. It&#39;s so fucked I need to cleanse my friendship circle and then what, I am left with my lonesome self worst enemy. My family are ALL fucking lost causes abandoning me when I was a child and causing further neglect to a child who just wanted to be loved. Got nothing but rejection from my own parents. Who the fuck deserves that. Fucking losers. My dad is addicted to gambling it fucking serves him right I hope he fucking realises now how pathetic he is. My sister the hoarder causing all the problems with the estate. My grandma who is a fucking lost cause it&#39;s not her fault she is helping me but she cannot provide solace while I stay with her. She cannot provide it as she does not know how but I am thankful to be here not back where I was. Maybe I move out. Nearly finished my degree just push through. Thinking about the Juris Doctor Post graduate how pathetic can&#39;t even get through the exam period without binging on porn to get through and take of the fucking sting of anxiety. How fucking pathetic. </p>\n\n<p>Running around the block I mean that is good but with the wrong mindset all replacement behaviours are fucking lost. I need my marks back as this is the first semester after mums death where I gave it everything. So far marks above  HD is  great but this fucking assignment is causing me anxiety. Just have to wait until tomorrow. I can stop this shit I really can. I believe I can but only been persisting for 4 months. This is not that long. Considering I frequent 7 day streaks and above I can keep improving. Each streak does get easier. The crash is bad yes but it is only bad if I stay down. I must push on. Finish this book. I really think it will be the last addiction book I read perhaps it&#39;s too fucking depressing reading about it and obsessing over addiction I only keep thinking about my sex compulsion. The brothel has to stop. That was bad the other week. I&#39;ve got nobody but me to rely on. So just face that fact and deal with it. If I never speak to anybody who causes me pain in my life again i really DO NOT CARE, this is sincere this is a self protective mindset. The mind will survive but eliminating pain by whatever means necessary. That is what i&#39;ve done. </p>\n\n<p>I push through even though it seems lost. The urge will hit in a few hours again but I should not give in. I should delete it. The last streak was reparative and I feel the healing more and more each streak. It is slow but new circuits are being rewired neuroplasticity is taking place. I think the brain can heal. Which is what the book i&#39;m reading the author indicates otherwise. I think once i finish the real of hungry ghosts I should finish the brain that changes itself. This will wrap it all up. Moral point of view from gabor mate as to the emergence of the trauma and emotional abuse and <strong>neglect</strong> from my young age. Really understand that this is the compulsive behaviour that has grown to comfort my neglect from childhood in the only way I knew. Sex, masturbation, erotica and pornography. It is a direct lineage from childhood not by chance. This is the embodiment of years of built up neglect that I never addressed until now. How could I be so convoluted that I could not discover this until now. All the drugs, the hookers, the drinks, the fights, the anger it all spurs from this. My introspective nightmare stops here and today I face my fears I face my inner demon I face the inner turmoil and chaos. I must stand and fight I must be the man my family could never produce or emulate his characteristics hence i&#39;ve always been looking for father figures in movies, criminals, playboys, charismatic drug abusers self medicating in similar fashion to myself, teachers, bouncers, lecturers, WHOEVER. Well this stops now as I have the tools and intrinsic worth to the total that I need to be a man. A strong man, a strong mind, a happy mind, a peaceful mind. Make amends with my past. Finding inner tranquility will take time and will be lifelong. However, I have come very far in just under 2 years. This time 2 years ago I was taking as much drugs as I could get my hands on. Watching porn alot. Going to strip clubs incessantly, porn use was really constant and multiple times per day. I smoked cigarettes, since then quitting completely. I was drinking nearly every weekend abundant amounts of shots, tequila, 1800, beer, vodka, burbon, scotch, red bull, cocaine, MDMA, weed, caps, pills. I don&#39;t consume these substances anymore and if I drink it is really sensible in comparison. I read constantly which I never did in the last 7 years, since 2006 when all this inner grief began. I nearly killed myself then and there jumping off the balcony of the hotel in a drug fused insanity. I wouldn&#39;t recognise my junior self. I am just happy to be finishing my degree now have my steady job. However the Juris Doctor maybe out of reach. 75% is quite a substantial SNG. Must reassess my options before enrolling for my final year. Considering completing a double degree. But I don&#39;t  think I will be ready next year, I want to work for a few years first. Just going to focus and get as high mark as possible. UNSW or USYD seem fine. Maybe UNSW is easier to get admitted both have fee help. Anxiety from waiting for the essay will pass. This is the most anxious I will feel as I cannot differentiate complete obliteration of my future career prospects from nerves. This is really crunch time in the highest because I gave 100% and cannot offer much more. If i can&#39;t excel academically then that&#39;s it. I finish my degree and just get a mediocre job. NO FUCK THAT I will never give up give in. If i don&#39;t get the marks now I keep working harder. I will find a way into law. I can do the four year degree at MQ if JD is not a possibility. Who knows I may not even complete a masters in law. I might pursue finance. However I doubt it. Look, I find a respectable role in the financial services sector work there for a bit and then reassess. I can nearly guarantee that I will want to study law. Psychology is too strenuous, music, I suck at the guitar (somewhat), well I can play but only for light entertainment purposes there is no way I would have the desire to go pro, sport is out of the question, physics and cosmology will always be an interest but the engagement in the real world and society is too low even though I am very interested, politics is interesting however follow in the footsteps of the current PM and other MPs who complete law to get preselection or advisory positions. Complete law post graduate it may be a long time from now and I will finish at around age 32. But who cares it&#39;s a potential 30 year practice lifetime and then other pro bono or community involved activities. Fuck money, pursue prestige, truth, integrity, moral wholesomeness and uprightness. This is noble this is right, this is me, this suits my inner moral compass. Achieve this goal and a great satisfaction will be attained. I am satisfied now that I am on the journey there. I am enjoying the journey. This abominable compulsion will stop and my strength will push this aside to ultimate attain my goals. They are incompatible, they are not to live in coexistence. I want to help others and really deluge into the world and humanities most ancient aspect. Moral correctness and altruism. Fuck consumerism and pursuit of material possessions. Sure they are nice to have but as was once said &quot;the things that you own inevitably own you&quot;. Tribal law as the aborigines had governed their societies peacefully, correctly and efficiently. Much the same as our biological ancestors from millions of years prior to homo Erectus and his uprising in the billions of year history of our evolution. </p>\n\n<p>Read the neuroscience book by doidge and this will complete this chapter in my life. I will have faced this final stringent and clinging addiction which I have endure for nearly 15 years without exaggeration. That is nearly a quarter of a century under this spell, no wonder it is so difficult to stop. But I will stop as I have been consistently, endure the pain because it eventually goes away. Find healthy ways to spend my time exercise for relief and read for solace. Move onto topics other than addiction that I have neglected because I am so engrossed reading about my ailment. Move to other aspects of life that are also worth discovering, philosophy, social injustice, history, great storytellers such as shakespeare, law, oppression, science, food, travel. Live life, live it fruitfully, build a family, build the life you never had. Help only those that want to change and are ready. All others are a waste of energy. Find a new way find a new rebirth. Find peace and love in this life. Not spiritually but humanistically, find it by breaking from the shackles of this addiction and all other destructive ones. Music, literature, travel, exercise and constructive time with family and friends which does not feed addictive tendencies is admirable and harmless. Spend your passion, zeal and zest on these pursuits. Do it for yourself, nobody else can guide you, nobody else can heed you in the write direction with the wrong attitude, it is all on yourself to make the change. No responsibility can be lopped onto others. However others can misguide you so be vigilant and cut all those who are not good for your psyche indefinitely and choose friends wisely that will guide and protect your best interests not reverse their progress. Change constantly and improve constantly and learn to live again with vigour, virility and vitality. Be remembered for the good left behind and the change that was made and enlightenment left behind. Live the life that you determine for yourself not what is alluded to by others or dictated by past failures of others in your family or previous social circles. You are not them and are your own man, your own person. Have strength, beat this and live life anew, and experience it in a way that I have denied myself for very long and it is scary to dream of this new reality but there is no choice. Evolve and learn to love thyself again and the rest of the world. Forgive the misfortunes and hand of fate bestowed upon yourself and forgive yourself for it was not your fault.</p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "user_reports": [],
  "over_18": false,
  "score": 4,
  "stickied": false,
  "domain": "self.NoFap",
  "is_self": true,
  "hidden": false,
  "_orphaned": {},
  "_api_link": "https://api.reddit.com/r/NoFap/comments/1q5zqc/anger_and_renewed_outlook/?ref=search_posts",
  "_comments_by_id": {},
  "visited": false,
  "thumbnail": "",
  "_has_fetched": true,
  "gilded": 0,
  "hide_score": false,
  "_info_url": "https://api.reddit.com/api/info/",
  "created_utc": 1383899192.0,
  "subreddit_id": "t5_2skrn",
  "id": "1q5zqc",
  "_params": {},
  "media_embed": {},
  "name": "t3_1q5zqc",
  "quarantine": false,
  "permalink": "https://www.reddit.com/r/NoFap/comments/1q5zqc/anger_and_renewed_outlook/?ref=search_posts",
  "ups": 4,
  "url": "https://www.reddit.com/r/NoFap/comments/1q5zqc/anger_and_renewed_outlook/",
  "title": "Anger and renewed outlook"
}