{
  "downs": 0,
  "mod_reports": [],
  "secure_media_embed": {},
  "_info_url": "https://api.reddit.com/api/info/",
  "gilded": 0,
  "num_comments": 176,
  "_orphaned": {},
  "hidden": false,
  "ups": 34,
  "url": "https://www.reddit.com/r/baseball/comments/28wv8j/week_11_rbaseball_power_rankings_a_unanimous_1/",
  "_has_fetched": true,
  "quarantine": false,
  "name": "t3_28wv8j",
  "author_flair_text": "San Francisco Giants Bandwagon",
  "user_reports": [],
  "saved": false,
  "permalink": "https://www.reddit.com/r/baseball/comments/28wv8j/week_11_rbaseball_power_rankings_a_unanimous_1/?ref=search_posts",
  "over_18": false,
  "is_self": true,
  "_params": {},
  "thumbnail": "self",
  "created_utc": 1403561978.0,
  "_replaced_more": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"http://www.reddit.com/r/baseball/comments/28vc31/around_the_horn_62314/\">BEEP BEEP -- Around the Horn</a></p>\n\n<hr/>\n\n<p>More information is in the <a href=\"http://www.reddit.com/r/baseball/comments/28wv8j/week_11_rbaseball_power_rankings_a_unanimous_1/cif9g4d\">AUXILIARY POST</a>.</p>\n\n<p>Welcome <a href=\"/u/ThisMachineKILLS\">/u/ThisMachineKILLS</a> as the new D&#39;Backs voter.</p>\n\n<p>Are you a fan of the <strong>Pirates</strong>?  We are currently recruiting a new voter for the Pirates.  Check in thread for more info.</p>\n\n<p>A tie between #5 and #6 was determined via their median vote.</p>\n\n<p>Thank you <a href=\"/r/baseball\">/r/baseball</a> Mods for the fastest sticky in the west!</p>\n\n<p><strong>Total Votes</strong>: 28 (ties record) </p>\n\n<hr/>\n\n<table><thead>\n<tr>\n<th align=\"right\">#</th>\n<th align=\"left\"></th>\n<th align=\"left\">Team</th>\n<th align=\"center\">Δ</th>\n<th align=\"center\">Comment</th>\n<th align=\"left\">Record</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"right\">1.</td>\n<td align=\"left\"><a href=\"/OAK\"></a></td>\n<td align=\"left\">A&#39;s</td>\n<td align=\"center\"></td>\n<td align=\"center\">Let’s start out with <a href=\"http://cdn3.vox-cdn.com/imported_assets/2253833/838bdef75767b6ed50c850338fc3ad28.jpg\">Coco Crisp Garden Gnome Giveaway</a>. Sweet, right? Well the biggest news for the A’s this week has been Blanks to the DL, two crazy games against the Red Sox and taking two of three from the Rangers. Jim Johnson had a good outing, and JD is starting to see the light at the end of the tunnel for his slump.</td>\n<td align=\"left\">47-29 (<strong>+0</strong>)</td>\n</tr>\n<tr>\n<td align=\"right\">2.</td>\n<td align=\"left\"><a href=\"/SFG\"></a></td>\n<td align=\"left\">Giants</td>\n<td align=\"center\"></td>\n<td align=\"center\">A team playing like absolute bollocks calls up a hot young prospect from AAA and immediately starts winning games... déjà vu? The arrival of 2B Joe Panik brings with it the Giants first series win in two weeks, as they snap a 6 game losing streak and take 2 of 3 in Arizona. The injury bug is getting rather annoying now, with Angel Pagan not playing since last Saturday with a bad back and Michael Morse tweaking his back in Arizona. The shallow outfield could be a problem this week if both men are off the field for too long.</td>\n<td align=\"left\">45-30 (<strong>+0</strong>)</td>\n</tr>\n<tr>\n<td align=\"right\">3.</td>\n<td align=\"left\"><a href=\"/MIL\"></a></td>\n<td align=\"left\">Brewers</td>\n<td align=\"center\"></td>\n<td align=\"center\">By finishing the three-game sweep of the Rockies, the Brewers finished a seven-game road trip to Arizona and Colorado -- two places they have historically struggled in -- at 6-1. Milwaukee also wrapped up a stretch of 15 of 18 games on the road with a 12-6 record, going 11-4 in the 15 road games. We can only hope that Braun&#39;s ankle injury isn&#39;t severe and as Al Davis would say, &quot;Just Win&quot;</td>\n<td align=\"left\">47-30 (<strong>+1</strong>)</td>\n</tr>\n<tr>\n<td align=\"right\">4.</td>\n<td align=\"left\"><a href=\"/LAA\"></a></td>\n<td align=\"left\">Angels</td>\n<td align=\"center\"></td>\n<td align=\"center\">An otherwise solid week for the Angels was softened mildly by more bullpen incompetence. Unfortunately for the Angels, some of the bullpen woes might have been avoided if it wasn&#39;t against Mike Scioscia&#39;s religion to pitch a reliever <a href=\"http://espn.go.com/mlb/boxscore?gameId=340619105\">for more than one inning</a> - which reminds me, here is your <a href=\"http://m.mlb.com/cle/video/topic/28898650/v33856201/?c_id=cle\">Ernestblow Frieri Signature Moment of the Week</a>.... On a melancholic note, we must now remember those Angels who now have their Halo in the big ballpark in the sky. A farewell to Raul Ibanez who no doubt is one of the best <a href=\"https://twitter.com/JeffFletcherOCR/status/480579792597970944\">human beings</a> to wear an Angels jersey. Thankfully, the front office did make the right move in releasing him as CJ Cron undoubtedly deserves the DH slot for the team. Cron has only gone 4/10 with 3 HRs since taking over for the DH at last, which makes you wonder why this move took so long....</td>\n<td align=\"left\">41-33 (<strong>+1</strong>)</td>\n</tr>\n<tr>\n<td align=\"right\">5.</td>\n<td align=\"left\"><a href=\"/DET\"></a></td>\n<td align=\"left\">Tigers</td>\n<td align=\"center\"></td>\n<td align=\"center\">Super Martinez Smash Bros! Not only has Victor Martinez put together a career year at age 35 (19 HR/22K, .326/.384/.597, 163 wRC+), JD Martinez has decided to make 2014 his coming out party, smacking four home runs and going 12 for 27 over the past week. For the season, JD is slashing a cool .310/.344/.593 with a 156 wRC+. The Tigers will have a tough decision to make when Andy Dirks is ready to come off the DL in a few weeks. Now for some expected news: the bullpen is still producing heart attacks on a daily basis.</td>\n<td align=\"left\">40-32 (<strong>+1</strong>)</td>\n</tr>\n<tr>\n<td align=\"right\">6.</td>\n<td align=\"left\"><a href=\"/TOR2\"></a></td>\n<td align=\"left\">Blue Jays</td>\n<td align=\"center\"></td>\n<td align=\"center\">Besides what was a fantastic comeback victory in the opening game of a weekend series against the Reds, this was <em>not</em> a good week for the Blue Jays.  Toronto&#39;s only victory of the week was that comeback victory, meaning their record this week was 1-6.  The Blue Jays lost Jose Bautista (day-to-day with left leg tightness) and Brett Lawrie (on the Disabled List with a fractured right index finger) to injury.</td>\n<td align=\"left\">42-35 (<strong>-3</strong>)</td>\n</tr>\n<tr>\n<td align=\"right\">7.</td>\n<td align=\"left\"><a href=\"/LAD\"></a></td>\n<td align=\"left\">Dodgers</td>\n<td align=\"center\"></td>\n<td align=\"center\">The Dodgers have been as good as the Giants have been bad this week, cutting the division lead in half and then some. Everything has started to click, except the bullpen, which I fear never will, but as long as the offense and rotation keep it up, where we&#39;re going we don&#39;t need a bullpen.</td>\n<td align=\"left\">42-35 (<strong>+2</strong>)</td>\n</tr>\n<tr>\n<td align=\"right\">8.</td>\n<td align=\"left\"><a href=\"/STL\"></a></td>\n<td align=\"left\">Cardinals</td>\n<td align=\"center\"></td>\n<td align=\"center\">The Cards took the Mets to the sweeping game and won the latter 2 of 4 against the Phillies. Wacha and Garcia to the DL, CarMart and...someone else...pitching.</td>\n<td align=\"left\">41-35 (<strong>-1</strong>)</td>\n</tr>\n<tr>\n<td align=\"right\">9.</td>\n<td align=\"left\"><a href=\"/WSH\"></a></td>\n<td align=\"left\">Nationals</td>\n<td align=\"center\"></td>\n<td align=\"center\">A sweep of the Astros and a split with the Braves behind some very solid pitching has most Nats fans feeling pretty good. The last piece of the puzzle seems to be run support, which should hopefully come together a bit once Ramos and Harper get off the DL in the coming few weeks. The time for cautious optimism is here! (Check back next week for hopeless wailing!)</td>\n<td align=\"left\">39-35 (<strong>+1</strong>)</td>\n</tr>\n<tr>\n<td align=\"right\">10.</td>\n<td align=\"left\"><a href=\"/BAL\"></a></td>\n<td align=\"left\">Orioles</td>\n<td align=\"center\"></td>\n<td align=\"center\">A 4-2 week is awfully nice, but the frustrating thing is it could have easily been 5-1 or 6-0. The most heartbreaking of which came on Friday against the Yankees when we took a 3-1 lead into the bottom of the 9th and, with two outs, Britton gave up an RBI single followed by a 3 run homer. That stung. But outscoring the Yankees 14-1 over the next two games certainly helped ease the pain. And, in a surprising occurrence, the O&#39;s beat Tanaka in a Sunday day game (our kryptonite) as the struggling Jonathan Schoop became the first person to hit two homers off Tanaka in his career.</td>\n<td align=\"left\">39-35 (<strong>+2</strong>)</td>\n</tr>\n<tr>\n<td align=\"right\">11.</td>\n<td align=\"left\"><a href=\"/SEA\"></a></td>\n<td align=\"left\">Mariners</td>\n<td align=\"center\"></td>\n<td align=\"center\">Fresh off of a pretty shitty series with our mortal enemies (the San Diego Padres - for those who haven&#39;t been formally introduced to the Vedder Cup before, you&#39;re now in on the joke) the Mariners somehow found a way to sweep the hottest team in baseball. We may not be able to hit the ball, but goddamn it we can pitch. I&#39;m looking forward to... or maybe just absent-mindedly wishing for a time this season when our hitters hit and our pitchers pitch. Oh. And Jesus Montero has a 118 wRC+ over 14 PA&#39;s.</td>\n<td align=\"left\">40-36 (<strong>+3</strong>)</td>\n</tr>\n<tr>\n<td align=\"right\">12.</td>\n<td align=\"left\"><a href=\"/ATL\"></a></td>\n<td align=\"left\">Braves</td>\n<td align=\"center\"></td>\n<td align=\"center\">Man, the Braves have so many starting pitchers! Maybe they can make a splash at the trade deadline! Maybe for some much-needed bullpen arms or ... Gavin&#39;s elbow did what?!</td>\n<td align=\"left\">38-37 (<strong>-4</strong>)</td>\n</tr>\n<tr>\n<td align=\"right\">13.</td>\n<td align=\"left\"><a href=\"/KCR\"></a></td>\n<td align=\"left\">Royals</td>\n<td align=\"center\"></td>\n<td align=\"center\">A ten game winning streak put the Royals in first. A four game losing streak took care of that. While the pitching and defense are definitely playoff caliber, the offense needs a major upgrade, and soon. The Royals can only win so many games if they score an average of two runs per contest (such as they have over the last five games).</td>\n<td align=\"left\">39-36 (<strong>-2</strong>)</td>\n</tr>\n<tr>\n<td align=\"right\">14.</td>\n<td align=\"left\"><a href=\"/NYY\"></a></td>\n<td align=\"left\">Yankees</td>\n<td align=\"center\"></td>\n<td align=\"center\">Old Timers&#39; Day always leaves me with a good taste in my mouth, regardless of the shellacking the Orioles gave to the Yanks. Sweeping Toronto was quite nice, and things felt better going into the series with the Orioles than they have in a while, but you really get the feeling that we just can&#39;t string together a five game winning streak with Nuno in the rotation. Sabathia is on his way back, and honestly, he&#39;ll be a welcome addition, and then we&#39;ll see where we are. The Yankees are unsurprisingly in the market for a SP, so we&#39;ll see what happens.</td>\n<td align=\"left\">39-35 (<strong>+1</strong>)</td>\n</tr>\n<tr>\n<td align=\"right\">15.</td>\n<td align=\"left\"><a href=\"/CIN\"></a></td>\n<td align=\"left\">Reds</td>\n<td align=\"center\"></td>\n<td align=\"center\">The Reds continued their sucess since Votto&#39;s return with a 4-2 week. Unfortunately their success didn&#39;t mean much as the Cardinals and Brewers faced difficult duos of the Mets and Phillies, and Diamondbacks and Rockies, respectively. Even if it didn&#39;t show in the standings, the Reds are playing really good baseball, and they have plenty of momentum going into a series where they should crush the Cubs.</td>\n<td align=\"left\">37-37 (<strong>+5</strong>)</td>\n</tr>\n<tr>\n<td align=\"right\">16.</td>\n<td align=\"left\"><a href=\"/MIA\"></a></td>\n<td align=\"left\">Marlins</td>\n<td align=\"center\"></td>\n<td align=\"center\">The Marlins are 1 game below .500 for the first time since April 30, a direct result of their recent 2-5 showing against the Cubs (1-2) and Mets (1-3, including 2 shutout losses). The bullpen has been cruising lately (minus a converting Jacob Turner, who flummoxes me), but the rotation+offense had trouble handing a lead last week. On the bright side, Andrew Heaney looked great in his MLB debut (6 IP, only 1 run allowed) and Henderson Alvarez has been rock-solid (no more than 2 ER allowed in all of his last 6 starts). Those two will pitch 3 times this week vs. the Phillies/Athletics.</td>\n<td align=\"left\">37-38 (<strong>-3</strong>)</td>\n</tr>\n<tr>\n<td align=\"right\">17.</td>\n<td align=\"left\"><a href=\"/CLE\"></a></td>\n<td align=\"left\">Indians</td>\n<td align=\"center\"></td>\n<td align=\"center\">We played so bad this week I&#39;m actuually surprised we won the series against Los Angeles. Pitching was god awful this week, starters and bullpen. Josh Tomlins two starts were both blowouts and I&#39;d say hes one bad outing away from a plane ticket to Columbus. We&#39;re also back to getting multiple errors a game and we hit under .150 with RISP over the week. Nick Swisher in particular now has more strikeouts than games played. The Tribe get a day off to figure out what they need to do to win games before they take on Arizona for a two game set before heading to Seattle.</td>\n<td align=\"left\">37-39 (<strong>-1</strong>)</td>\n</tr>\n<tr>\n<td align=\"right\">18.</td>\n<td align=\"left\"><a href=\"/PIT\"></a></td>\n<td align=\"left\">Pirates</td>\n<td align=\"center\"></td>\n<td align=\"center\"></td>\n<td align=\"left\">37-38 (<strong>+4</strong>)</td>\n</tr>\n<tr>\n<td align=\"right\">19.</td>\n<td align=\"left\"><a href=\"/MIN\"></a></td>\n<td align=\"left\">Twins</td>\n<td align=\"center\"></td>\n<td align=\"center\">The bad news - we got swept by the Bo-Sox. The good news - we swept the Chi-Sox in four games (and my boss is a Chi-Sox fan, and they&#39;re our rivals, so that sweept means more than any losses to Boston ever could.) If we can continue to keep ourselves within reach of .500, this season will be a success.</td>\n<td align=\"left\">36-38 (<strong>+2</strong>)</td>\n</tr>\n<tr>\n<td align=\"right\">20.</td>\n<td align=\"left\"><a href=\"/BOS\"></a></td>\n<td align=\"left\">Red Sox</td>\n<td align=\"center\"></td>\n<td align=\"center\">I do not like where we are going. The bats are struggling, and as a whole we are struggling. The last couple days we have been fine, but when your only real bright spot is Brock Holt \\O/ it is not a good thing. I wish us a better week, because we sure as hell need a better week.</td>\n<td align=\"left\">35-41 (<strong>+2</strong>)</td>\n</tr>\n<tr>\n<td align=\"right\">21.</td>\n<td align=\"left\"><a href=\"/COL\"></a></td>\n<td align=\"left\">Rockies</td>\n<td align=\"center\"></td>\n<td align=\"center\">Just kidding about that whole winning thing. Things are real bad in Denver.</td>\n<td align=\"left\">34-41 (<strong>-4</strong>)</td>\n</tr>\n<tr>\n<td align=\"right\">22.</td>\n<td align=\"left\"><a href=\"/TEX\"></a></td>\n<td align=\"left\">Rangers</td>\n<td align=\"center\"></td>\n<td align=\"center\">The week started off well enough for the Rangers. They went to Oakland and destroyed them 14-8. But that was the last game they won, and I am mad so I don&#39;t want to write a whole lot about it. Darvish hasn&#39;t been himself lately, Shin Soo Choo is hurt and can&#39;t hit, Beltre has finally slowed down. Rios is in a slump. Only have two MLB starting pitchers right now and one of them is coming off a two year injury, not performing well. What can I say about it, really?</td>\n<td align=\"left\">35-40 (<strong>-3</strong>)</td>\n</tr>\n<tr>\n<td align=\"right\">23.</td>\n<td align=\"left\"><a href=\"/NYM\"></a></td>\n<td align=\"left\">Metropolitans</td>\n<td align=\"center\"></td>\n<td align=\"center\">With the Mets most recent series win against Miami, their run differential on the season is now -2, giving them a pythagorean W/L of 38-38, much better than their actual record of 35-41. Their team is looking like it will only get better this year, with the upcoming return of Travis d&#39;Arnaud from AAA where in 58 PAs he only batted .444/.483/.926(yes, that&#39;s his SLG)/1.409 with 6 home runs and 8 doubles, Juan Lagares being set to come back from the DL later this week, and the hopeful release of Chris Young. This team is still very much in the thick of the mediocre NL East.</td>\n<td align=\"left\">35-41 (<strong>+2</strong>)</td>\n</tr>\n<tr>\n<td align=\"right\">24.</td>\n<td align=\"left\"><a href=\"/CHW\"></a></td>\n<td align=\"left\">White Sox</td>\n<td align=\"center\"></td>\n<td align=\"center\"></td>\n<td align=\"left\">35-41 (<strong>-1</strong>)</td>\n</tr>\n<tr>\n<td align=\"right\">25.</td>\n<td align=\"left\"><a href=\"/HOU\"></a></td>\n<td align=\"left\">Astros</td>\n<td align=\"center\"></td>\n<td align=\"center\">The Astros were 3-7 over their last 10 games, not doing much hitting and the bullpen being used many times over the lack of our starters going deep into games. Jose Altuve Leads the AL in hitting and SB and probably secures a place in this years all start team.</td>\n<td align=\"left\">33-44 (<strong>-1</strong>)</td>\n</tr>\n<tr>\n<td align=\"right\">26.</td>\n<td align=\"left\"><a href=\"/PHI\"></a></td>\n<td align=\"left\">Phillies</td>\n<td align=\"center\"></td>\n<td align=\"center\">The Phillies&#39; pitching continues to be very streaky, and the results match their performances very closely. They were hot this week, and how few games the Phillies remained back of the mediocre NL East leaders came up often during this win streak, but 2 losses here have calmed that fire a bit. No more win-runs like that through July would be nice, or RAJ&#39;ll have us buying and not selling....again. Hat-tip to Cole Hamels who, despite a rough, injury-hampered start to the season, sports a 2.76 ERA and 9.3 K/9.</td>\n<td align=\"left\">34-40 (<strong>+0</strong>)</td>\n</tr>\n<tr>\n<td align=\"right\">27.</td>\n<td align=\"left\"><a href=\"/CHI\"></a></td>\n<td align=\"left\">Cubs</td>\n<td align=\"center\"></td>\n<td align=\"center\">We currently have two of the best young players in the league in Starlin Castro and Anthony Rizzo. Both are putting up impressive numbers and rank near the top in their positions. Kris Bryant got moved up to AAA. This team could be extremely good in a year or two.</td>\n<td align=\"left\">31-42 (<strong>+0</strong>)</td>\n</tr>\n<tr>\n<td align=\"right\">28.</td>\n<td align=\"left\"><a href=\"/SD\"></a></td>\n<td align=\"left\">Padres</td>\n<td align=\"center\"></td>\n<td align=\"center\">The upcoming weeks will be huge in the future of the Padres organization. GM Josh Byrnes was fired last week after a couple underwhelming seasons, including following a payroll bump this past offseason. The Padres have announced they will be trying to fill the position as soon as possible without rushing the process. Seeing as this season is all but lost, the new GM will have two options. Keep the current core of players and tinker around the edges with a couple big moves, as most if not all current players are better than they have been playing. The second option is hit the reset button, blow things up, and start from scratch this upcoming offseason.</td>\n<td align=\"left\">32-44 (<strong>+0</strong>)</td>\n</tr>\n<tr>\n<td align=\"right\">29.</td>\n<td align=\"left\"><a href=\"/TB\"></a></td>\n<td align=\"left\">Rays</td>\n<td align=\"center\"></td>\n<td align=\"center\">Good News: The Rays won their first series in a very, very long time. Bad News? The Rays no longer face the Astros in the 2014 season. The offense has been a lot better as well as the pitching; Odorizzi has started to look like a great force in the rotation after finally working out his command problems (something that ideally could have been done in AAA, though was forced into the rotation due to injuries). The Rays might be too far behind to catch up in the wild card race but <em>could</em> get there if they go on a Dodger-esque streak from here on out. If not, prepare yourself for a ton of David Price trade rumors.</td>\n<td align=\"left\">31-46 (<strong>+1</strong>)</td>\n</tr>\n<tr>\n<td align=\"right\">30.</td>\n<td align=\"left\"><a href=\"/ARI2\"></a></td>\n<td align=\"left\">D&#39;Backs</td>\n<td align=\"center\"></td>\n<td align=\"center\">The Diamondbacks take another step forward, only to immediately do something of a cartwheel backward. This just isn’t a team that has the (healthy) pieces to go on any sort of run, and so this week’s performance is about what I expect from the team going forward—only pounding out wins in a convincing fashion when sandwiched between convincing losses. When Trumbo and Pollock come back, it could be somewhat of a different story, but until then, the Diamondbacks will remain one of the worst teams in baseball.</td>\n<td align=\"left\">32-47 (<strong>-1</strong>)</td>\n</tr>\n</tbody></table>\n</div><!-- SC_ON -->",
  "author_flair_css_class": "SFG-wagon",
  "subreddit_id": "t5_2qm7u",
  "archived": true,
  "domain": "self.baseball",
  "clicked": false,
  "score": 34,
  "link_flair_text": "Feature",
  "id": "28wv8j",
  "stickied": false,
  "media_embed": {},
  "link_flair_css_class": "wek",
  "visited": false,
  "selftext": "[BEEP BEEP -- Around the Horn](http://www.reddit.com/r/baseball/comments/28vc31/around_the_horn_62314/)\n\n_________________________________________________________________\n\nMore information is in the [AUXILIARY POST](http://www.reddit.com/r/baseball/comments/28wv8j/week_11_rbaseball_power_rankings_a_unanimous_1/cif9g4d).\n\nWelcome /u/ThisMachineKILLS as the new D'Backs voter.\n\nAre you a fan of the **Pirates**?  We are currently recruiting a new voter for the Pirates.  Check in thread for more info.\n\nA tie between #5 and #6 was determined via their median vote.\n\nThank you /r/baseball Mods for the fastest sticky in the west!\n\n\n**Total Votes**: 28 (ties record) \n_________________________________________________________\n\n\\#||Team|Δ|Comment|Record\t\t\t\t\n--: |:--| :-- | :--: | :--: | :--\t\t\t\t\n1.\t| [](/OAK) | A's | | \tLet’s start out with [Coco Crisp Garden Gnome Giveaway](http://cdn3.vox-cdn.com/imported_assets/2253833/838bdef75767b6ed50c850338fc3ad28.jpg). Sweet, right? Well the biggest news for the A’s this week has been Blanks to the DL, two crazy games against the Red Sox and taking two of three from the Rangers. Jim Johnson had a good outing, and JD is starting to see the light at the end of the tunnel for his slump.      \t|\t47-29 (**+0**)\n2.\t| [](/SFG) | Giants | | \t   A team playing like absolute bollocks calls up a hot young prospect from AAA and immediately starts winning games... déjà vu? The arrival of 2B Joe Panik brings with it the Giants first series win in two weeks, as they snap a 6 game losing streak and take 2 of 3 in Arizona. The injury bug is getting rather annoying now, with Angel Pagan not playing since last Saturday with a bad back and Michael Morse tweaking his back in Arizona. The shallow outfield could be a problem this week if both men are off the field for too long.\t|\t45-30 (**+0**)\n3.\t| [](/MIL) | Brewers | |  By finishing the three-game sweep of the Rockies, the Brewers finished a seven-game road trip to Arizona and Colorado -- two places they have historically struggled in -- at 6-1. Milwaukee also wrapped up a stretch of 15 of 18 games on the road with a 12-6 record, going 11-4 in the 15 road games. We can only hope that Braun's ankle injury isn't severe and as Al Davis would say, \"Just Win\"  \t |\t47-30 (**+1**)\n4.\t| [](/LAA) | Angels | | An otherwise solid week for the Angels was softened mildly by more bullpen incompetence. Unfortunately for the Angels, some of the bullpen woes might have been avoided if it wasn't against Mike Scioscia's religion to pitch a reliever [for more than one inning](http://espn.go.com/mlb/boxscore?gameId=340619105) - which reminds me, here is your [Ernestblow Frieri Signature Moment of the Week](http://m.mlb.com/cle/video/topic/28898650/v33856201/?c_id=cle).... On a melancholic note, we must now remember those Angels who now have their Halo in the big ballpark in the sky. A farewell to Raul Ibanez who no doubt is one of the best [human beings](https://twitter.com/JeffFletcherOCR/status/480579792597970944) to wear an Angels jersey. Thankfully, the front office did make the right move in releasing him as CJ Cron undoubtedly deserves the DH slot for the team. Cron has only gone 4/10 with 3 HRs since taking over for the DH at last, which makes you wonder why this move took so long....   |\t41-33 (**+1**)\n5.\t| [](/DET) | Tigers | | Super Martinez Smash Bros! Not only has Victor Martinez put together a career year at age 35 (19 HR/22K, .326/.384/.597, 163 wRC+), JD Martinez has decided to make 2014 his coming out party, smacking four home runs and going 12 for 27 over the past week. For the season, JD is slashing a cool .310/.344/.593 with a 156 wRC+. The Tigers will have a tough decision to make when Andy Dirks is ready to come off the DL in a few weeks. Now for some expected news: the bullpen is still producing heart attacks on a daily basis.     |\t40-32 (**+1**)\n6.\t| [](/TOR2) | Blue Jays | |Besides what was a fantastic comeback victory in the opening game of a weekend series against the Reds, this was *not* a good week for the Blue Jays.  Toronto's only victory of the week was that comeback victory, meaning their record this week was 1-6.  The Blue Jays lost Jose Bautista (day-to-day with left leg tightness) and Brett Lawrie (on the Disabled List with a fractured right index finger) to injury. |\t42-35 (**-3**)\n7.\t| [](/LAD) | Dodgers | |The Dodgers have been as good as the Giants have been bad this week, cutting the division lead in half and then some. Everything has started to click, except the bullpen, which I fear never will, but as long as the offense and rotation keep it up, where we're going we don't need a bullpen. |\t42-35 (**+2**)\n8.\t| [](/STL) | Cardinals| |The Cards took the Mets to the sweeping game and won the latter 2 of 4 against the Phillies. Wacha and Garcia to the DL, CarMart and...someone else...pitching. |\t41-35 (**-1**)\n9.\t| [](/WSH) |  Nationals | |A sweep of the Astros and a split with the Braves behind some very solid pitching has most Nats fans feeling pretty good. The last piece of the puzzle seems to be run support, which should hopefully come together a bit once Ramos and Harper get off the DL in the coming few weeks. The time for cautious optimism is here! (Check back next week for hopeless wailing!)|\t39-35 (**+1**)\n10.\t| [](/BAL) | Orioles | |A 4-2 week is awfully nice, but the frustrating thing is it could have easily been 5-1 or 6-0. The most heartbreaking of which came on Friday against the Yankees when we took a 3-1 lead into the bottom of the 9th and, with two outs, Britton gave up an RBI single followed by a 3 run homer. That stung. But outscoring the Yankees 14-1 over the next two games certainly helped ease the pain. And, in a surprising occurrence, the O's beat Tanaka in a Sunday day game (our kryptonite) as the struggling Jonathan Schoop became the first person to hit two homers off Tanaka in his career.|\t39-35 (**+2**)\n11.\t| [](/SEA) | Mariners| |Fresh off of a pretty shitty series with our mortal enemies (the San Diego Padres - for those who haven't been formally introduced to the Vedder Cup before, you're now in on the joke) the Mariners somehow found a way to sweep the hottest team in baseball. We may not be able to hit the ball, but goddamn it we can pitch. I'm looking forward to... or maybe just absent-mindedly wishing for a time this season when our hitters hit and our pitchers pitch. Oh. And Jesus Montero has a 118 wRC+ over 14 PA's. |\t40-36 (**+3**)\n12.\t| [](/ATL) | Braves | |Man, the Braves have so many starting pitchers! Maybe they can make a splash at the trade deadline! Maybe for some much-needed bullpen arms or ... Gavin's elbow did what?!|\t38-37 (**-4**)\n13.\t| [](/KCR) | Royals | |A ten game winning streak put the Royals in first. A four game losing streak took care of that. While the pitching and defense are definitely playoff caliber, the offense needs a major upgrade, and soon. The Royals can only win so many games if they score an average of two runs per contest (such as they have over the last five games).|\t39-36 (**-2**)\n14.\t| [](/NYY) | Yankees  | |Old Timers' Day always leaves me with a good taste in my mouth, regardless of the shellacking the Orioles gave to the Yanks. Sweeping Toronto was quite nice, and things felt better going into the series with the Orioles than they have in a while, but you really get the feeling that we just can't string together a five game winning streak with Nuno in the rotation. Sabathia is on his way back, and honestly, he'll be a welcome addition, and then we'll see where we are. The Yankees are unsurprisingly in the market for a SP, so we'll see what happens. |\t39-35 (**+1**)\n15.\t| [](/CIN) | Reds | |The Reds continued their sucess since Votto's return with a 4-2 week. Unfortunately their success didn't mean much as the Cardinals and Brewers faced difficult duos of the Mets and Phillies, and Diamondbacks and Rockies, respectively. Even if it didn't show in the standings, the Reds are playing really good baseball, and they have plenty of momentum going into a series where they should crush the Cubs.|\t37-37 (**+5**)\n16.\t| [](/MIA) | Marlins | |The Marlins are 1 game below .500 for the first time since April 30, a direct result of their recent 2-5 showing against the Cubs (1-2) and Mets (1-3, including 2 shutout losses). The bullpen has been cruising lately (minus a converting Jacob Turner, who flummoxes me), but the rotation+offense had trouble handing a lead last week. On the bright side, Andrew Heaney looked great in his MLB debut (6 IP, only 1 run allowed) and Henderson Alvarez has been rock-solid (no more than 2 ER allowed in all of his last 6 starts). Those two will pitch 3 times this week vs. the Phillies/Athletics.|\t37-38 (**-3**)\n17.\t| [](/CLE) | Indians | |We played so bad this week I'm actuually surprised we won the series against Los Angeles. Pitching was god awful this week, starters and bullpen. Josh Tomlins two starts were both blowouts and I'd say hes one bad outing away from a plane ticket to Columbus. We're also back to getting multiple errors a game and we hit under .150 with RISP over the week. Nick Swisher in particular now has more strikeouts than games played. The Tribe get a day off to figure out what they need to do to win games before they take on Arizona for a two game set before heading to Seattle.|\t37-39 (**-1**)\n18.\t| [](/PIT) | Pirates | ||\t37-38 (**+4**)\n19.\t| [](/MIN) | Twins | |The bad news - we got swept by the Bo-Sox. The good news - we swept the Chi-Sox in four games (and my boss is a Chi-Sox fan, and they're our rivals, so that sweept means more than any losses to Boston ever could.) If we can continue to keep ourselves within reach of .500, this season will be a success.|\t36-38 (**+2**)\n20.\t| [](/BOS) | Red Sox | |I do not like where we are going. The bats are struggling, and as a whole we are struggling. The last couple days we have been fine, but when your only real bright spot is Brock Holt \\O/ it is not a good thing. I wish us a better week, because we sure as hell need a better week.\t|\t35-41 (**+2**)\n21.\t| [](/COL) | Rockies | |Just kidding about that whole winning thing. Things are real bad in Denver.|\t34-41 (**-4**)\n22.\t| [](/TEX) | Rangers| |The week started off well enough for the Rangers. They went to Oakland and destroyed them 14-8. But that was the last game they won, and I am mad so I don't want to write a whole lot about it. Darvish hasn't been himself lately, Shin Soo Choo is hurt and can't hit, Beltre has finally slowed down. Rios is in a slump. Only have two MLB starting pitchers right now and one of them is coming off a two year injury, not performing well. What can I say about it, really? |\t35-40 (**-3**)\n23.\t| [](/NYM) | Metropolitans  | |With the Mets most recent series win against Miami, their run differential on the season is now -2, giving them a pythagorean W/L of 38-38, much better than their actual record of 35-41. Their team is looking like it will only get better this year, with the upcoming return of Travis d'Arnaud from AAA where in 58 PAs he only batted .444/.483/.926(yes, that's his SLG)/1.409 with 6 home runs and 8 doubles, Juan Lagares being set to come back from the DL later this week, and the hopeful release of Chris Young. This team is still very much in the thick of the mediocre NL East.|\t35-41 (**+2**)\n24.\t| [](/CHW) | White Sox | ||\t35-41 (**-1**)\n25.\t| [](/HOU) | Astros | |The Astros were 3-7 over their last 10 games, not doing much hitting and the bullpen being used many times over the lack of our starters going deep into games. Jose Altuve Leads the AL in hitting and SB and probably secures a place in this years all start team.|\t33-44 (**-1**)\n26.\t| [](/PHI) | Phillies | |The Phillies' pitching continues to be very streaky, and the results match their performances very closely. They were hot this week, and how few games the Phillies remained back of the mediocre NL East leaders came up often during this win streak, but 2 losses here have calmed that fire a bit. No more win-runs like that through July would be nice, or RAJ'll have us buying and not selling....again. Hat-tip to Cole Hamels who, despite a rough, injury-hampered start to the season, sports a 2.76 ERA and 9.3 K/9.|\t34-40 (**+0**)\n27.\t| [](/CHI) | Cubs | |We currently have two of the best young players in the league in Starlin Castro and Anthony Rizzo. Both are putting up impressive numbers and rank near the top in their positions. Kris Bryant got moved up to AAA. This team could be extremely good in a year or two.|\t31-42 (**+0**)\n28.\t| [](/SD) | Padres | |The upcoming weeks will be huge in the future of the Padres organization. GM Josh Byrnes was fired last week after a couple underwhelming seasons, including following a payroll bump this past offseason. The Padres have announced they will be trying to fill the position as soon as possible without rushing the process. Seeing as this season is all but lost, the new GM will have two options. Keep the current core of players and tinker around the edges with a couple big moves, as most if not all current players are better than they have been playing. The second option is hit the reset button, blow things up, and start from scratch this upcoming offseason. | 32-44 (**+0**)\n29.\t| [](/TB) | Rays | |Good News: The Rays won their first series in a very, very long time. Bad News? The Rays no longer face the Astros in the 2014 season. The offense has been a lot better as well as the pitching; Odorizzi has started to look like a great force in the rotation after finally working out his command problems (something that ideally could have been done in AAA, though was forced into the rotation due to injuries). The Rays might be too far behind to catch up in the wild card race but *could* get there if they go on a Dodger-esque streak from here on out. If not, prepare yourself for a ton of David Price trade rumors. |\t31-46 (**+1**)\n30.\t| [](/ARI2) | D'Backs | |The Diamondbacks take another step forward, only to immediately do something of a cartwheel backward. This just isn’t a team that has the (healthy) pieces to go on any sort of run, and so this week’s performance is about what I expect from the team going forward—only pounding out wins in a convincing fashion when sandwiched between convincing losses. When Trumbo and Pollock come back, it could be somewhat of a different story, but until then, the Diamondbacks will remain one of the worst teams in baseball. |\t32-47 (**-1**)",
  "hide_score": false,
  "_api_link": "https://api.reddit.com/r/baseball/comments/28wv8j/week_11_rbaseball_power_rankings_a_unanimous_1/?ref=search_posts",
  "locked": false,
  "edited": 1403564143.0,
  "title": "Week 11 r/baseball Power Rankings -- A unanimous #1, new #30, and lots of movement after Top 5",
  "created": 1403565578.0,
  "_comments_by_id": {}
}