{
  "clicked": false,
  "_replaced_more": false,
  "archived": true,
  "num_comments": 0,
  "created": 1347767718.0,
  "saved": false,
  "selftext": "**Verified?** *(This bot cannot verify AMAs just yet)*\n\n**Date:** 2012-09-15\n\n**[Link to submission](http://www.reddit.com/r/IAmA/comments/zxdsl/)** (*Has self-text*)\n\n**[Link to my post](http://www.reddit.com/r/IAmA/comments/zxdsl/tabledresser/c68ryh4)**\n\n\n\nQuestions|Answers\n:--|:--\n[Have you ever seen any indication that this \"Maria\" is financially exploiting your dad?](http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68k3sb?context=5)|Not really. I mean my dad certainly has treated her well and buys her things but nothing too extravagant and she seems like the type of person who doesnt really care about material things. Who knows though, there could be a side of this story im not aware of. She's been nothing but nice to me. I dont have many negative things to say about her other than shes the one who introduced my dad to it. I dont solely blame her for it because my dad made his own decision to believe in these things. \n[I mean, I liked that show \"V\" and all, but there are limits. Is your dad into all that orgone and chemtrail stuff? Can you tell us a little bit more about what your dad actually believes?](http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68j9de?context=5)|Yes big believer in that chemtrail stuff. Heres a bit more into what he believes.\n |He believes that the world is run by reptilian humanoids from another dimension that control every aspect of human life.\n |He believes that many high ranking people such as george bush, the queen, etc. are these reptilians.\n |He believes that the world governments are going to come together and create the New World Order.\n |He believes that the NWO will try and get the worlds population down to 500 million for better control over the people.\n |He believes that America will be a police state any time now. ( which I actually somewhat believe to a certain extent)\n[He probably knows all about the Georgia Guidestones, right?](http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68kf7b?context=5)|If those are those messages on the rocks or whatever then yes he showed me those before. Sorry to oversimplify it but im a bit hazy on the details of them. \n[Has your Dad ever tried to y'know, convert you? I can imagine that being a highly awkward conversation. If so, how did you respond? Did you ever give his ideas any credence? ](http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68j974?context=5)|Yes, he tried to convert me many times. It was honestly the weirdest thing Ive ever experienced the first time he tried. I think most people get the view of their parents as the super responsible and unflappable people and when one of your parents basically starts talking crazy its a very very scary situation. I cant say i ever did give his idea any credence.\n[Well you stay strong man, you're right about a person of responsibility completely whacking out on you like that. Naht good.  Still as long as he respects your (sane\\) views, then I'm sure you can still enjoy a decent relationship right? ](http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68jd1x?context=5)|Yea i mean he understands that he'll never get me to believe in it and he respects those beliefs. We talk very rarely but when we do its respectful and i still love him very much and want nothing more than to just have a normal father son relationship. \n[I am not trying to be a dick because I am a huge conspiracy theorist but did your dad have any sudden behavior changes or any signs of neurological problems?](http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68j1fl?context=5)|Valid question, no dickishness sensed. I cant say i noticed any neurological problems, but honestly he did seem happier. He suddenly went from a guy who was completely emotionally shut down to being very open.\n[The dicksense is strong with this one.](http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68kuu7?context=5)|Yea this one was hiding from me for a while. Well played sir, well played.\n[So does your dad see the John Carpenter film \"They Live\" as a documentary instead of science fiction?  (Highly recommended movie BTW\\).](http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68jlgg?context=5)|Never seen it but after doing some investigative research (wikipedia) it seems right up his alley. I'll definitely have to check it out though, it looks pretty cool. \n[How old is your dad?  We're his parents old fashion?  Does his family have any history with paranoia?  Along with getting spiritual guidance has he or is he on any medication or other \"drugs\"?  Does he think Obama is a reptile?  Has he ever came face to face with one?  Also, I do not mean to offend you in any way. I am just trying to understand the whole situation. I have an open mind about most conspiracies.  Do you believe him?  How has the situation changed your life?  Are you upset about the whole thing?  ](http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68j6af?context=5)|My dad is in his 50's. His parents were very old fashioned, my grandpa was the typical hard working american of the 50s and 60s who worked on telephone lines his whole life and my grandma was the typical stay at home mom. No history with paranoia as far as i know. As far as drugs go I always thought he at least smoked weed but as it turns out he is very much against drugs of any kind really. Hes never come out and blatantly said Obama is a reptile but i think he thinks so, he says that basically most presidents and politicians are. Do i believe him? if you mean do i believe he genuinely believes in this stuff, I do. The situation greatly changed my life. The whole thing started when we were really actually beginning to get close and hang out more. He was never around much when i was little because he always traveled for work. What upset me the most was when he decided to up and leave and move permanently to his other house with no explanation when i was 14 years old. \n[OP what would your dad think if you got a government job?](http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68jwwk?context=5)|He would either A. Shun me forever or B. Ask me to uncover some secret information. I wish i was joking about that answer hahah. \n[I would use it as an opportunity to troll him. I would start acting secretive and talk in a monotone voice around him. Especially if it was like a really low level govt. job.](http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68jz1m?context=5)|Brilliant plan. Yea like even if i worked in some non exciting gov. job like Sanitation, i would wear one those ear buds and pretend to talk into it very quietly. Plus sanitation gets all the hot interns. \n[Where is the proof about the lizard beings?  What is your dad's ultimate goal? To expose the lizards? Does he have a plan of action?](http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68k906?context=5)|As far as I know , and anyone can correct me if im wrong, they really dont have proof aside from stupid youtube videos. Its basically a religion where its a belief and there defense is that you cant disprove it. As far as my dads ultimate goal, its basically to make as many people aware of it as possible and to expose the lizard people and i guess somehow that will give them less power. \n[How do you detect a lizard person? ](http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68jdkp?context=5)|Well, from my understanding you can tell by the eyes hahah. Apparently there are videos on youtube that prove that people like George H W Bush are reptilians but they way there eyes look. \n[What was it like inside the house?  What did your dad do while staying there?  Does he still do this currently?  Do you still talk?](http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68j3xc?context=5)|It was actually a really cool house, but i mean pretty normal. It was kind of weird being there because my dad would be like normal and we would just hang out and watch movies or play golf but then he would go into weirdo mode and start forcing these beliefs on me by showing me these insanely long and boring videos about all this. He is still a firm believer. We rarely talk anymore and if we do only by email, it really hurts because i love him to death but i just cant get on board with this. \n[My friend has recently leapt into this theory as well. Letting it consume, most of his entire day-to-day happenin's.  It also coincides with some pretty significant life changes, his sister had an injury ending her dancing career, his parents lost their home, and he's always had a good deal of paranoia.  Do you have any advice as to how I can approach this change? Or, if it's simply a lost cause.](http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68jo8z?context=5)|Im very sorry to hear that, its always tough seeing someone close to you do something bizarre. My advice to you is to be there for him / her and try and get them to talk about those life changes. My feeling, atleast in this case is that your friend is closing himself off to the problems and it is manifesting in this belief. Your friend is basically burying their head in the sand to perhaps avoid these problems. So as hard as it may be to see your friend like this, stick with them and try and get them to talk it out. Hope that this helps in any way.\n[That is certainly helpful.  That's for the most part what I've been doing. It just, becomes, a major point of contention when it seems to be all he wants to talk about.  ](http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68js4x?context=5)|Yea it really does consume their lives. But stick with it and i wish you the best. \n[Does your father have any plans for these reptilian humanoids? Is his group planning some kind of resistance against the creatures? Does he believe that average people can also be a reptile?](http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68jwlz?context=5)|As far as i know there arent really any plans of a resistance or any such thing. He believes that being a reptile means you are going to be either famous or powerful, so no, its apparently very exclusive. \n[Is \"Reptile\" a euphamism for something else? Like the British monarchy? Or Jews? or is it actually that he believes in freaking REPTILES?](http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68kphc?context=5)|No the actual belief is the people are reptilian humanoids from another dimension. No bullshit, that is what they actually believe. \n[I'm presuming you mean the Annunaki when you say reptilians?  Does he also believe in Nibiru?](http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68k0ce?context=5)|Yes, Annunaki is what i speak of. As far as Nibiru yes he does believe that although he never got to much into detail about it so im not 100% sure exactly what thats all about. \n[Does it have a negative impact on his personal life?  Does he stay closed up in his house? does he work? does he socialize with friends?](http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68jojb?context=5)|The thing about his situation is he doesn't fit the typical conspiracy theorist, hes not always holed up in house plastering thousands of pictures on a wall and connecting them with strings. He lives a fairly normal life i would say. Hes a business consultant and he travels alot still. That being said he does have a lot of down time when not traveling and does usually spend it at home with his SO (yea just realized i didnt explain this fully but he still lives with Maria the spiritual healer). \n[Reptiles... what a fruitcake! They are crab people.  Craaab people, craaab people, craaab people, craaab people, craaab people, craaab people.](http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68jf5g?context=5)|There have an upvote, i literally laughed out loud at this. \n[Does he ever get angry with you if you disagree, or refuse to believe him ](http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68j8h8?context=5)|He would get testy sometimes when I would say basically that hes in a cult and I couldnt be a part of it. I remember one time when he was trying to get me to watch some whacko video he had, i refused and he started yelling basically saying that if i choose not to watch then i would be making my life harder by becoming a slave to them. The few times he did get mad though it genuinely seemed like he wanted to help me and in his mind the way to help me was to get me to believe like he does. \n[Valid question, no dickishness sensed. I cant say i noticed any neurological problems, but honestly he did seem happier. He suddenly went from a guy who was completely emotionally shut down to being very open.](http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68j43j?context=5)|Also I consider myself a bit of a conspiracy theorist as well but I simply could not even begin to wrap my mind around this theory. \n[I gather it's more believable because Icke can talk for three days solid on the topic. No facts mind you, but for three days.](http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68llip?context=5)|Seriously, he travels to a lot of schools and such to put on presentations and they last upwards of ten hours in some cases. \n[Hey man, I have a brother who believes in that stuff too, last 8 years now actually, it's tearing my family apart too, just thanks for reminding me there's people out there who are going through this shit too. I hope you and your family work things out man. Love from Dublin.](http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68kndw?context=5)|Thanks man, appreciate the kind words and I wish you and your family the best.\n[Mid life crisis my friend.](http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68j575?context=5)|Hahaha, funny you say that because this all started when my dad was having his mid life crisis. It started as the normal crisis where he bought a sports car and all that crap and then went to this. But i think hes beyond the crisis point and is still a firm believer in this conspiracy. \n\n\n*Last updated: 2012-09-19 21:10 UTC*\n\n*This post was generated by a robot! Send all complaints to [epsy](/message/compose/?to=epsy).*\n\n",
  "mod_reports": [],
  "secure_media_embed": {},
  "author_flair_css_class": "tabler",
  "edited": 1348089059.0,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Verified?</strong> <em>(This bot cannot verify AMAs just yet)</em></p>\n\n<p><strong>Date:</strong> 2012-09-15</p>\n\n<p><strong><a href=\"http://www.reddit.com/r/IAmA/comments/zxdsl/\">Link to submission</a></strong> (<em>Has self-text</em>)</p>\n\n<p><strong><a href=\"http://www.reddit.com/r/IAmA/comments/zxdsl/tabledresser/c68ryh4\">Link to my post</a></strong></p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Questions</th>\n<th align=\"left\">Answers</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68k3sb?context=5\">Have you ever seen any indication that this &quot;Maria&quot; is financially exploiting your dad?</a></td>\n<td align=\"left\">Not really. I mean my dad certainly has treated her well and buys her things but nothing too extravagant and she seems like the type of person who doesnt really care about material things. Who knows though, there could be a side of this story im not aware of. She&#39;s been nothing but nice to me. I dont have many negative things to say about her other than shes the one who introduced my dad to it. I dont solely blame her for it because my dad made his own decision to believe in these things.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68j9de?context=5\">I mean, I liked that show &quot;V&quot; and all, but there are limits. Is your dad into all that orgone and chemtrail stuff? Can you tell us a little bit more about what your dad actually believes?</a></td>\n<td align=\"left\">Yes big believer in that chemtrail stuff. Heres a bit more into what he believes.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">He believes that the world is run by reptilian humanoids from another dimension that control every aspect of human life.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">He believes that many high ranking people such as george bush, the queen, etc. are these reptilians.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">He believes that the world governments are going to come together and create the New World Order.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">He believes that the NWO will try and get the worlds population down to 500 million for better control over the people.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">He believes that America will be a police state any time now. ( which I actually somewhat believe to a certain extent)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68kf7b?context=5\">He probably knows all about the Georgia Guidestones, right?</a></td>\n<td align=\"left\">If those are those messages on the rocks or whatever then yes he showed me those before. Sorry to oversimplify it but im a bit hazy on the details of them.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68j974?context=5\">Has your Dad ever tried to y&#39;know, convert you? I can imagine that being a highly awkward conversation. If so, how did you respond? Did you ever give his ideas any credence? </a></td>\n<td align=\"left\">Yes, he tried to convert me many times. It was honestly the weirdest thing Ive ever experienced the first time he tried. I think most people get the view of their parents as the super responsible and unflappable people and when one of your parents basically starts talking crazy its a very very scary situation. I cant say i ever did give his idea any credence.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68jd1x?context=5\">Well you stay strong man, you&#39;re right about a person of responsibility completely whacking out on you like that. Naht good.  Still as long as he respects your (sane) views, then I&#39;m sure you can still enjoy a decent relationship right? </a></td>\n<td align=\"left\">Yea i mean he understands that he&#39;ll never get me to believe in it and he respects those beliefs. We talk very rarely but when we do its respectful and i still love him very much and want nothing more than to just have a normal father son relationship.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68j1fl?context=5\">I am not trying to be a dick because I am a huge conspiracy theorist but did your dad have any sudden behavior changes or any signs of neurological problems?</a></td>\n<td align=\"left\">Valid question, no dickishness sensed. I cant say i noticed any neurological problems, but honestly he did seem happier. He suddenly went from a guy who was completely emotionally shut down to being very open.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68kuu7?context=5\">The dicksense is strong with this one.</a></td>\n<td align=\"left\">Yea this one was hiding from me for a while. Well played sir, well played.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68jlgg?context=5\">So does your dad see the John Carpenter film &quot;They Live&quot; as a documentary instead of science fiction?  (Highly recommended movie BTW).</a></td>\n<td align=\"left\">Never seen it but after doing some investigative research (wikipedia) it seems right up his alley. I&#39;ll definitely have to check it out though, it looks pretty cool.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68j6af?context=5\">How old is your dad?  We&#39;re his parents old fashion?  Does his family have any history with paranoia?  Along with getting spiritual guidance has he or is he on any medication or other &quot;drugs&quot;?  Does he think Obama is a reptile?  Has he ever came face to face with one?  Also, I do not mean to offend you in any way. I am just trying to understand the whole situation. I have an open mind about most conspiracies.  Do you believe him?  How has the situation changed your life?  Are you upset about the whole thing?  </a></td>\n<td align=\"left\">My dad is in his 50&#39;s. His parents were very old fashioned, my grandpa was the typical hard working american of the 50s and 60s who worked on telephone lines his whole life and my grandma was the typical stay at home mom. No history with paranoia as far as i know. As far as drugs go I always thought he at least smoked weed but as it turns out he is very much against drugs of any kind really. Hes never come out and blatantly said Obama is a reptile but i think he thinks so, he says that basically most presidents and politicians are. Do i believe him? if you mean do i believe he genuinely believes in this stuff, I do. The situation greatly changed my life. The whole thing started when we were really actually beginning to get close and hang out more. He was never around much when i was little because he always traveled for work. What upset me the most was when he decided to up and leave and move permanently to his other house with no explanation when i was 14 years old.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68jwwk?context=5\">OP what would your dad think if you got a government job?</a></td>\n<td align=\"left\">He would either A. Shun me forever or B. Ask me to uncover some secret information. I wish i was joking about that answer hahah.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68jz1m?context=5\">I would use it as an opportunity to troll him. I would start acting secretive and talk in a monotone voice around him. Especially if it was like a really low level govt. job.</a></td>\n<td align=\"left\">Brilliant plan. Yea like even if i worked in some non exciting gov. job like Sanitation, i would wear one those ear buds and pretend to talk into it very quietly. Plus sanitation gets all the hot interns.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68k906?context=5\">Where is the proof about the lizard beings?  What is your dad&#39;s ultimate goal? To expose the lizards? Does he have a plan of action?</a></td>\n<td align=\"left\">As far as I know , and anyone can correct me if im wrong, they really dont have proof aside from stupid youtube videos. Its basically a religion where its a belief and there defense is that you cant disprove it. As far as my dads ultimate goal, its basically to make as many people aware of it as possible and to expose the lizard people and i guess somehow that will give them less power.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68jdkp?context=5\">How do you detect a lizard person? </a></td>\n<td align=\"left\">Well, from my understanding you can tell by the eyes hahah. Apparently there are videos on youtube that prove that people like George H W Bush are reptilians but they way there eyes look.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68j3xc?context=5\">What was it like inside the house?  What did your dad do while staying there?  Does he still do this currently?  Do you still talk?</a></td>\n<td align=\"left\">It was actually a really cool house, but i mean pretty normal. It was kind of weird being there because my dad would be like normal and we would just hang out and watch movies or play golf but then he would go into weirdo mode and start forcing these beliefs on me by showing me these insanely long and boring videos about all this. He is still a firm believer. We rarely talk anymore and if we do only by email, it really hurts because i love him to death but i just cant get on board with this.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68jo8z?context=5\">My friend has recently leapt into this theory as well. Letting it consume, most of his entire day-to-day happenin&#39;s.  It also coincides with some pretty significant life changes, his sister had an injury ending her dancing career, his parents lost their home, and he&#39;s always had a good deal of paranoia.  Do you have any advice as to how I can approach this change? Or, if it&#39;s simply a lost cause.</a></td>\n<td align=\"left\">Im very sorry to hear that, its always tough seeing someone close to you do something bizarre. My advice to you is to be there for him / her and try and get them to talk about those life changes. My feeling, atleast in this case is that your friend is closing himself off to the problems and it is manifesting in this belief. Your friend is basically burying their head in the sand to perhaps avoid these problems. So as hard as it may be to see your friend like this, stick with them and try and get them to talk it out. Hope that this helps in any way.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68js4x?context=5\">That is certainly helpful.  That&#39;s for the most part what I&#39;ve been doing. It just, becomes, a major point of contention when it seems to be all he wants to talk about.  </a></td>\n<td align=\"left\">Yea it really does consume their lives. But stick with it and i wish you the best.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68jwlz?context=5\">Does your father have any plans for these reptilian humanoids? Is his group planning some kind of resistance against the creatures? Does he believe that average people can also be a reptile?</a></td>\n<td align=\"left\">As far as i know there arent really any plans of a resistance or any such thing. He believes that being a reptile means you are going to be either famous or powerful, so no, its apparently very exclusive.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68kphc?context=5\">Is &quot;Reptile&quot; a euphamism for something else? Like the British monarchy? Or Jews? or is it actually that he believes in freaking REPTILES?</a></td>\n<td align=\"left\">No the actual belief is the people are reptilian humanoids from another dimension. No bullshit, that is what they actually believe.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68k0ce?context=5\">I&#39;m presuming you mean the Annunaki when you say reptilians?  Does he also believe in Nibiru?</a></td>\n<td align=\"left\">Yes, Annunaki is what i speak of. As far as Nibiru yes he does believe that although he never got to much into detail about it so im not 100% sure exactly what thats all about.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68jojb?context=5\">Does it have a negative impact on his personal life?  Does he stay closed up in his house? does he work? does he socialize with friends?</a></td>\n<td align=\"left\">The thing about his situation is he doesn&#39;t fit the typical conspiracy theorist, hes not always holed up in house plastering thousands of pictures on a wall and connecting them with strings. He lives a fairly normal life i would say. Hes a business consultant and he travels alot still. That being said he does have a lot of down time when not traveling and does usually spend it at home with his SO (yea just realized i didnt explain this fully but he still lives with Maria the spiritual healer).</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68jf5g?context=5\">Reptiles... what a fruitcake! They are crab people.  Craaab people, craaab people, craaab people, craaab people, craaab people, craaab people.</a></td>\n<td align=\"left\">There have an upvote, i literally laughed out loud at this.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68j8h8?context=5\">Does he ever get angry with you if you disagree, or refuse to believe him </a></td>\n<td align=\"left\">He would get testy sometimes when I would say basically that hes in a cult and I couldnt be a part of it. I remember one time when he was trying to get me to watch some whacko video he had, i refused and he started yelling basically saying that if i choose not to watch then i would be making my life harder by becoming a slave to them. The few times he did get mad though it genuinely seemed like he wanted to help me and in his mind the way to help me was to get me to believe like he does.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68j43j?context=5\">Valid question, no dickishness sensed. I cant say i noticed any neurological problems, but honestly he did seem happier. He suddenly went from a guy who was completely emotionally shut down to being very open.</a></td>\n<td align=\"left\">Also I consider myself a bit of a conspiracy theorist as well but I simply could not even begin to wrap my mind around this theory.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68llip?context=5\">I gather it&#39;s more believable because Icke can talk for three days solid on the topic. No facts mind you, but for three days.</a></td>\n<td align=\"left\">Seriously, he travels to a lot of schools and such to put on presentations and they last upwards of ten hours in some cases.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68kndw?context=5\">Hey man, I have a brother who believes in that stuff too, last 8 years now actually, it&#39;s tearing my family apart too, just thanks for reminding me there&#39;s people out there who are going through this shit too. I hope you and your family work things out man. Love from Dublin.</a></td>\n<td align=\"left\">Thanks man, appreciate the kind words and I wish you and your family the best.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/zxdsl/iama_person_whos_dad_believes_in_the_conspiracy/c68j575?context=5\">Mid life crisis my friend.</a></td>\n<td align=\"left\">Hahaha, funny you say that because this all started when my dad was having his mid life crisis. It started as the normal crisis where he bought a sports car and all that crap and then went to this. But i think hes beyond the crisis point and is still a firm believer in this conspiracy.</td>\n</tr>\n</tbody></table>\n\n<p><em>Last updated: 2012-09-19 21:10 UTC</em></p>\n\n<p><em>This post was generated by a robot! Send all complaints to <a href=\"/message/compose/?to=epsy\">epsy</a>.</em></p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "user_reports": [],
  "author_flair_text": "",
  "over_18": false,
  "score": 12,
  "stickied": false,
  "domain": "self.tabled",
  "is_self": true,
  "hidden": false,
  "_orphaned": {},
  "_api_link": "https://api.reddit.com/r/tabled/comments/zyek0/table_iama_person_whos_dad_believes_in_the/?ref=search_posts",
  "_comments_by_id": {},
  "visited": false,
  "thumbnail": "",
  "_has_fetched": true,
  "gilded": 0,
  "hide_score": false,
  "_info_url": "https://api.reddit.com/api/info/",
  "created_utc": 1347767718.0,
  "subreddit_id": "t5_2tkmw",
  "id": "zyek0",
  "_params": {},
  "media_embed": {},
  "name": "t3_zyek0",
  "quarantine": false,
  "permalink": "https://www.reddit.com/r/tabled/comments/zyek0/table_iama_person_whos_dad_believes_in_the/?ref=search_posts",
  "ups": 12,
  "url": "https://www.reddit.com/r/tabled/comments/zyek0/table_iama_person_whos_dad_believes_in_the/",
  "title": "[Table] IAmA person who's Dad believes in the conspiracy of Reptilian Humanoids made popular by David Icke and it made my family fall apart. AMA"
}