{
  "selftext": "After that atrociously ill-informed post (purportedly by Mahesh Murthy), here's a primer on why the hike in natural gas prices deserves to be stopped.\n\nExhibit A: [Panel seeks review of Rangarajan formula on gas pricing: The Hindu](http://www.thehindu.com/todays-paper/tp-business/panel-seeks-review-of-rangarajan-formula-on-gas-pricing/article5476225.ece)\n\n\n>“It is to be observed that the benefit of lower gas price at Henry Hub has been largely diluted by the inclusion of Japan's liquefied natural gas prices, **which includes 60 per cent royalty component linkage to Japanese Crude Cocktail and host of other factors,**” it said.\n\n>The panel, headed by Andhra Pradesh MP Aruna Kumar Vundavalli, was of the view that **Russia, which exports 40 to 50 per cent of its gas to Europe at a price of about $8.77 per mBtu, could be a better indicator of gas price. Russia is the world's second largest gas producer** and consuming country in the world and its prices could be incorporated as one of the reference price in the pricing formula, it said.\n\n>The committee also pointed at **omission of domestic cost of production of natural gas, which ranges from $2.48 to $3.63 for private and public sector firms**, in the formula.\n\nSee also: [Parliamentary panel calls for review of Rangarajan gas price formula: Business Standard](http://articles.economictimes.indiatimes.com/2013-12-18/news/45338189_1_national-balancing-point-12-month-trailing-average-price-natural-gas)\n\nExhibit B: [Rangarajan panel's gas pricing formula might prove too complex](http://articles.economictimes.indiatimes.com/2013-01-07/news/36192694_1_domestic-gas-price-henry-hub-netback)\n\n>Unlike other traded commodity markets, **internationally gas prices are of course characterised by disparate regional benchmarks**. The panel wants the price formula reviewed in five years assuming that the gas market, and attendant infrastructure like import terminals and pipelines, would be more developed then. But in the ensuing period, **we surely need policy to induce transparent price discovery in gas** and also develop promising clean-coal technologies like coal gasification and combined-cycle power plants, to effectively manage the explosive demand for gas, and in tandem address its relative short supply in our endowment of natural resources. **The point is that proactive market design and regular scope for price bids for gas should lead to a better demand and supply scenario looking ahead.**\n\n>To determine the domestic gas price, **the panel wants the netback price (that reflects price received by the buyer for his final product) of Indian imports of liquefied natural gas (LNG) at the wellhead of exporting countries**. It would form one set of prices. **The other set of prices proposed is an average of the Henry Hub in the US and the National Balancing Point in the UK, plus netback prices of the sources of LNG supply for Japan.** And the **average of the two sets of prices is what's proposed as the local price of gas**. But while prices in the hubs of the mature markets — with very different supply and demand patterns than here — could be tracked, **determining netback prices for LNG imported into India or Japan would be quite a task. Besides, gas via LNG imports remains quite small here and Japan is hugely energy-efficient.**\n\nExhibit C: [Oil Ministry moves Cabinet to deny RIL higher gas price: The Hindu](http://www.thehindu.com/business/Industry/oil-ministry-moves-cabinet-to-deny-ril-higher-gas-price/article5120470.ece)\n\n>DGH believes **output from D1&D3 fell to 10.12 million standard cubic metres per day from 53-54 mmscmd achieved in March 2010 because RIL did not drill its committed number of wells**. More wells, it believes, would increase output.\n\n>RIL on the other hand blames **unforeseen geological complexities for the fall in output and believes the reserves in D1&D3 are actually less than one-third of 10.3 Trillion cubic feet predicted** two years before the field began output in April 2009.\n\n>RIL and its partners BP plc of UK and Canada’s Niko Resources has submitted a revised field development plan for D1&D3 to the MC **detailing the lower reserves and the corresponding cut in expenditure from USD 8.8 billion proposed previously.**\n\nExhibit D: [Moily has junked arbitration to help Reliance, Dasgupta tells court: The Hindu](http://www.thehindu.com/news/national/moily-has-junked-arbitration-to-help-reliance-dasgupta-tells-court/article4966030.ece) \n\n>Senior counsel Colin Gonsalves, appearing for the petitioners, said the decision to raise gas price should be reviewed as **the Minister had overruled the opinion of senior officers of his ministry and his predecessor**. When Justice Sathasivam wanted to know “why the parties can’t go for arbitration,” counsel pointed out that **the Minister had given a statement that he wanted to junk arbitration and that the government would not proceed with the process.**\n\n>The contractors allegedly incurred **investment costs for the full capacity of 80 MMSCMD and recovered all these costs and perhaps more from the government through the sale of gas priced at $4.2 per mmbtu**. Simultaneously, **the contractors deliberately reduced production**, thus holding the country to ransom at a time when gas demand far outstripped supply. **By June 2013, only 9 out of 18 wells were in production and gas sales were only 18% of the target of 80 MMSCMD. The reduction was done in anticipation of a price rise** and this was confirmed by government’s announcement that from April 2014 the price would be increased to $8.4 mmbtu. \n\nExhibit E: [Analysis:Faulty formula will lead to faulty gas price: Business Standard](http://www.business-standard.com/article/economy-policy/analysis-faulty-formula-will-lead-to-faulty-gas-price-113070500564_1.html)\n\n>Nowhere in the world is ‘wellhead’ (price of gas at the discovery well) prices determined in the way it has been done by C Rangarajan. Surya Sethi, former Principal Advisor, Power and Energy, Government of India points out **India is today the only country in the world that sees no difference between the wellhead price of natural gas and Liquefied natural gas (LNG). It is equating price of milk and cottage cheese.**\n\n>Nowhere in the world is wellhead gas price as high as that is India. **If the same average of pithead price and landed prices are applied to other mined products like oil, coal, lignite, iron ore among others, their prices would shoot up.** The other drawback of the formula is there is no cap or floor price of gas and the price is in dollar terms. In the earlier formula, price was capped at $60 per barrel of crude and a portion of the price was pegged to the dollar at a fixed exchange price of Rs 45 against the dollar. **Given the current scenario if oil prices move higher, rupee generally weakens, which would further increase gas price to the consumer.**\n\nExhibit F: [Of Reliance, by Reliance, for Reliance: The Hindu](http://www.thehindu.com/opinion/lead/of-reliance-by-reliance-for-reliance/article4866611.ece)\n\n>First, the government itself admits that **despite raising the domestic wellhead price of natural gas by almost 300 per cent from as low as $1.79/MMBtu to as high as $5.25/MMBtu, investments in the sector and the country’s gas output have actually dropped. The bulk of this drop is because of Reliance Industries Ltd (RIL)**, the company whose demands triggered the recent price increase. The Comptroller and Auditor General report explicitly outlines how **RIL reneged on its production commitments while gold-plating its investments**. Can the government guarantee that a price of $8.4/MMBtu will raise gas availability? \n\n>Significantly, the single largest instance of foreign direct investment that the above cited 300 per cent price increase attracted was BP’s acquisition of a 30 per cent stake in RIL’s declining KG basin play and not in any new greenfield frontier. BP is not known to invest $7 billion-plus for improving a country’s fiscal or energy balance. The company must have seen returns from a known discovery even at the then approved price of $4.2/MMBtu. \n\nFuck it, just read the entire article; it is golden!",
  "gilded": 0,
  "score": 32,
  "removal_reason": null,
  "approved_by": null,
  "created_utc": 1396595805.0,
  "is_self": true,
  "stickied": false,
  "edited": false,
  "distinguished": null,
  "permalink": "https://www.reddit.com/r/india/comments/22677b/people_far_better_informed_than_mahesh_murthy/?ref=search_posts",
  "banned_by": null,
  "from_id": null,
  "likes": null,
  "_underscore_names": null,
  "num_reports": null,
  "link_flair_css_class": "three",
  "_info_url": "https://api.reddit.com/api/info/",
  "id": "22677b",
  "archived": true,
  "secure_media": null,
  "from_kind": null,
  "saved": false,
  "domain": "self.india",
  "ups": 32,
  "suggested_sort": null,
  "quarantine": false,
  "over_18": false,
  "hide_score": false,
  "url": "https://www.reddit.com/r/india/comments/22677b/people_far_better_informed_than_mahesh_murthy/",
  "subreddit_id": "t5_2qh1q",
  "_params": {},
  "_comments": null,
  "_replaced_more": false,
  "_comments_by_id": {},
  "user_reports": [],
  "media_embed": {},
  "created": 1396595805.0,
  "author_flair_text": "Socially left leaning, economically centrist.",
  "visited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>After that atrociously ill-informed post (purportedly by Mahesh Murthy), here&#39;s a primer on why the hike in natural gas prices deserves to be stopped.</p>\n\n<p>Exhibit A: <a href=\"http://www.thehindu.com/todays-paper/tp-business/panel-seeks-review-of-rangarajan-formula-on-gas-pricing/article5476225.ece\">Panel seeks review of Rangarajan formula on gas pricing: The Hindu</a></p>\n\n<blockquote>\n<p>“It is to be observed that the benefit of lower gas price at Henry Hub has been largely diluted by the inclusion of Japan&#39;s liquefied natural gas prices, <strong>which includes 60 per cent royalty component linkage to Japanese Crude Cocktail and host of other factors,</strong>” it said.</p>\n\n<p>The panel, headed by Andhra Pradesh MP Aruna Kumar Vundavalli, was of the view that <strong>Russia, which exports 40 to 50 per cent of its gas to Europe at a price of about $8.77 per mBtu, could be a better indicator of gas price. Russia is the world&#39;s second largest gas producer</strong> and consuming country in the world and its prices could be incorporated as one of the reference price in the pricing formula, it said.</p>\n\n<p>The committee also pointed at <strong>omission of domestic cost of production of natural gas, which ranges from $2.48 to $3.63 for private and public sector firms</strong>, in the formula.</p>\n</blockquote>\n\n<p>See also: <a href=\"http://articles.economictimes.indiatimes.com/2013-12-18/news/45338189_1_national-balancing-point-12-month-trailing-average-price-natural-gas\">Parliamentary panel calls for review of Rangarajan gas price formula: Business Standard</a></p>\n\n<p>Exhibit B: <a href=\"http://articles.economictimes.indiatimes.com/2013-01-07/news/36192694_1_domestic-gas-price-henry-hub-netback\">Rangarajan panel&#39;s gas pricing formula might prove too complex</a></p>\n\n<blockquote>\n<p>Unlike other traded commodity markets, <strong>internationally gas prices are of course characterised by disparate regional benchmarks</strong>. The panel wants the price formula reviewed in five years assuming that the gas market, and attendant infrastructure like import terminals and pipelines, would be more developed then. But in the ensuing period, <strong>we surely need policy to induce transparent price discovery in gas</strong> and also develop promising clean-coal technologies like coal gasification and combined-cycle power plants, to effectively manage the explosive demand for gas, and in tandem address its relative short supply in our endowment of natural resources. <strong>The point is that proactive market design and regular scope for price bids for gas should lead to a better demand and supply scenario looking ahead.</strong></p>\n\n<p>To determine the domestic gas price, <strong>the panel wants the netback price (that reflects price received by the buyer for his final product) of Indian imports of liquefied natural gas (LNG) at the wellhead of exporting countries</strong>. It would form one set of prices. <strong>The other set of prices proposed is an average of the Henry Hub in the US and the National Balancing Point in the UK, plus netback prices of the sources of LNG supply for Japan.</strong> And the <strong>average of the two sets of prices is what&#39;s proposed as the local price of gas</strong>. But while prices in the hubs of the mature markets — with very different supply and demand patterns than here — could be tracked, <strong>determining netback prices for LNG imported into India or Japan would be quite a task. Besides, gas via LNG imports remains quite small here and Japan is hugely energy-efficient.</strong></p>\n</blockquote>\n\n<p>Exhibit C: <a href=\"http://www.thehindu.com/business/Industry/oil-ministry-moves-cabinet-to-deny-ril-higher-gas-price/article5120470.ece\">Oil Ministry moves Cabinet to deny RIL higher gas price: The Hindu</a></p>\n\n<blockquote>\n<p>DGH believes <strong>output from D1&amp;D3 fell to 10.12 million standard cubic metres per day from 53-54 mmscmd achieved in March 2010 because RIL did not drill its committed number of wells</strong>. More wells, it believes, would increase output.</p>\n\n<p>RIL on the other hand blames <strong>unforeseen geological complexities for the fall in output and believes the reserves in D1&amp;D3 are actually less than one-third of 10.3 Trillion cubic feet predicted</strong> two years before the field began output in April 2009.</p>\n\n<p>RIL and its partners BP plc of UK and Canada’s Niko Resources has submitted a revised field development plan for D1&amp;D3 to the MC <strong>detailing the lower reserves and the corresponding cut in expenditure from USD 8.8 billion proposed previously.</strong></p>\n</blockquote>\n\n<p>Exhibit D: <a href=\"http://www.thehindu.com/news/national/moily-has-junked-arbitration-to-help-reliance-dasgupta-tells-court/article4966030.ece\">Moily has junked arbitration to help Reliance, Dasgupta tells court: The Hindu</a> </p>\n\n<blockquote>\n<p>Senior counsel Colin Gonsalves, appearing for the petitioners, said the decision to raise gas price should be reviewed as <strong>the Minister had overruled the opinion of senior officers of his ministry and his predecessor</strong>. When Justice Sathasivam wanted to know “why the parties can’t go for arbitration,” counsel pointed out that <strong>the Minister had given a statement that he wanted to junk arbitration and that the government would not proceed with the process.</strong></p>\n\n<p>The contractors allegedly incurred <strong>investment costs for the full capacity of 80 MMSCMD and recovered all these costs and perhaps more from the government through the sale of gas priced at $4.2 per mmbtu</strong>. Simultaneously, <strong>the contractors deliberately reduced production</strong>, thus holding the country to ransom at a time when gas demand far outstripped supply. <strong>By June 2013, only 9 out of 18 wells were in production and gas sales were only 18% of the target of 80 MMSCMD. The reduction was done in anticipation of a price rise</strong> and this was confirmed by government’s announcement that from April 2014 the price would be increased to $8.4 mmbtu. </p>\n</blockquote>\n\n<p>Exhibit E: <a href=\"http://www.business-standard.com/article/economy-policy/analysis-faulty-formula-will-lead-to-faulty-gas-price-113070500564_1.html\">Analysis:Faulty formula will lead to faulty gas price: Business Standard</a></p>\n\n<blockquote>\n<p>Nowhere in the world is ‘wellhead’ (price of gas at the discovery well) prices determined in the way it has been done by C Rangarajan. Surya Sethi, former Principal Advisor, Power and Energy, Government of India points out <strong>India is today the only country in the world that sees no difference between the wellhead price of natural gas and Liquefied natural gas (LNG). It is equating price of milk and cottage cheese.</strong></p>\n\n<p>Nowhere in the world is wellhead gas price as high as that is India. <strong>If the same average of pithead price and landed prices are applied to other mined products like oil, coal, lignite, iron ore among others, their prices would shoot up.</strong> The other drawback of the formula is there is no cap or floor price of gas and the price is in dollar terms. In the earlier formula, price was capped at $60 per barrel of crude and a portion of the price was pegged to the dollar at a fixed exchange price of Rs 45 against the dollar. <strong>Given the current scenario if oil prices move higher, rupee generally weakens, which would further increase gas price to the consumer.</strong></p>\n</blockquote>\n\n<p>Exhibit F: <a href=\"http://www.thehindu.com/opinion/lead/of-reliance-by-reliance-for-reliance/article4866611.ece\">Of Reliance, by Reliance, for Reliance: The Hindu</a></p>\n\n<blockquote>\n<p>First, the government itself admits that <strong>despite raising the domestic wellhead price of natural gas by almost 300 per cent from as low as $1.79/MMBtu to as high as $5.25/MMBtu, investments in the sector and the country’s gas output have actually dropped. The bulk of this drop is because of Reliance Industries Ltd (RIL)</strong>, the company whose demands triggered the recent price increase. The Comptroller and Auditor General report explicitly outlines how <strong>RIL reneged on its production commitments while gold-plating its investments</strong>. Can the government guarantee that a price of $8.4/MMBtu will raise gas availability? </p>\n\n<p>Significantly, the single largest instance of foreign direct investment that the above cited 300 per cent price increase attracted was BP’s acquisition of a 30 per cent stake in RIL’s declining KG basin play and not in any new greenfield frontier. BP is not known to invest $7 billion-plus for improving a country’s fiscal or energy balance. The company must have seen returns from a known discovery even at the then approved price of $4.2/MMBtu. </p>\n</blockquote>\n\n<p>Fuck it, just read the entire article; it is golden!</p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "_comment_sort": null,
  "report_reasons": null,
  "name": "t3_22677b",
  "from": null,
  "hidden": false,
  "clicked": false,
  "media": null,
  "json_dict": null,
  "_api_link": "https://api.reddit.com/r/india/comments/22677b/people_far_better_informed_than_mahesh_murthy/?ref=search_posts",
  "secure_media_embed": {},
  "mod_reports": [],
  "_orphaned": {},
  "_uniq": null,
  "num_comments": 47,
  "link_flair_text": "[R]eddiquette",
  "title": "People far better informed than Mahesh Mu[r]thy explain the gas pricing fiasco with facts",
  "_has_fetched": true,
  "author_flair_css_class": "",
  "thumbnail": "self"
}