{
  "downs": 0,
  "mod_reports": [],
  "secure_media_embed": {},
  "_info_url": "https://api.reddit.com/api/info/",
  "gilded": 0,
  "num_comments": 437,
  "_orphaned": {},
  "hidden": false,
  "ups": 3418,
  "url": "https://www.reddit.com/r/Games/comments/3m72qr/bioshock_pulled_from_ios_app_store_it_has_been/",
  "_has_fetched": true,
  "quarantine": false,
  "name": "t3_3m72qr",
  "user_reports": [],
  "saved": false,
  "permalink": "https://www.reddit.com/r/Games/comments/3m72qr/bioshock_pulled_from_ios_app_store_it_has_been/?ref=search_posts",
  "over_18": false,
  "is_self": true,
  "_params": {},
  "thumbnail": "",
  "created_utc": 1443104696.0,
  "_replaced_more": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Update</strong> 09/24 @2:30PM ET:<br/>\n<a href=\"http://toucharcade.com/2015/09/24/2k-says-bioshock-will-be-fixed-for-ios-9/\">TouchArcade:  2K Says &#39;BioShock&#39; Will be Fixed for iOS 9</a>  </p>\n\n<blockquote>\n<p>The BioShock saga, where the game, incompatible with iOS 8.4 and later, was not only pulled from the App Store but from purchase histories entirely, has taken another twist. It looks like 2K will be fixing the game and putting it back on the App Store. According to a 2K representative who reached out to us earlier today:  </p>\n\n<blockquote>\n<p>2K recently provided inaccurate information to customers surrounding removal of BioShock for iOS from the App Store. BioShock is currently incompatible with iOS versions 8.4 and higher, and as such, <strong>is temporarily removed for purchase from the App Store. 2K is fixing the compatibility issue, and when resolved, will place BioShock back on the App Store for purchase. Customers who already own BioShock may continue playing the game with iOS version 8.3 or earlier</strong>. 2K regrets the initial customer service error and looks forward to delivering an updated version of BioShock for iOS in the near future.  </p>\n</blockquote>\n\n<p>So it looks like this is getting resolved, in a very similar way to how The World Ends With You [$17.99 / $19.99 (HD)] went down – game stops working, publisher is slow to react to fixing it, mixed messages from customer service lead to confusion over whether the game is getting fixed, before a public outcry seemingly leads to the game getting fixed. We&#39;ll keep an eye out for if and when BioShock comes back to the App Store, and let you all know, of course. <strong>An iOS 8.4 update was promised, but never quite made it out, so we&#39;ll see if this one actually comes out.</strong>  </p>\n\n<p>But for big companies releasing premium games? All this negative publicity should serve as a lesson: maybe updating games comes at a high cost. But instead of dealing with negative outcry from consumers and the media, along with poisoning the well for high-priced premium games on mobile, maybe it&#39;s best to just make sure these things are fixed for later iOS versions when they inevitably do break? These things happen, and people have been patient waiting for fixes, but it&#39;s just the right thing to do to support these games, especially expensive-for-mobile ones, for a reasonable amount of time.  </p>\n</blockquote>\n\n<p>&nbsp;  </p>\n\n<hr/>\n\n<p><strong>Original post</strong>  </p>\n\n<p><a href=\"http://toucharcade.com/2015/09/23/bioshock-delisted-from-the-app-store/\">TouchArcade:  2K&#39;s &#39;Bioshock&#39; Has Been Completely Delisted From The App Store For Unknown Reasons</a>:  </p>\n\n<blockquote>\n<p>...Though opinions of the results may vary, most can at least agree that it was quite impressive from a tech point of view. <strong>Unfortunately, not even a year later, the arrival of iOS 8.4 completely broke the game.</strong> The publisher of the game, 2K, quickly amended its App Store description to assure players that they were working on fixing the problem. Not long after that, the game was pulled from active sale on the App Store, <strong>but was still accessible through the purchase history of anyone who bought it. Was.</strong>  </p>\n\n<p>An eagle-eyed member of the TouchArcade forums recently noticed that Bioshock is <strong>now not only unavailable to buy, but not even existing owners can re-download the title via their purchase histories, as with most pulled apps</strong>...  </p>\n</blockquote>\n\n<p>&nbsp;  </p>\n\n<p><a href=\"http://toucharcade.com/2015/09/23/bioshock-removal-2k-support-response/\">TouchArcade:  2K Support Says The Removal Of &#39;Bioshock&#39; Was A Developer Decision</a>  </p>\n\n<blockquote>\n<p>2K&#39;s iOS port of their hit Bioshock was pulled from the App Store after it ran into compatibility problems with iOS 8.4 in July of this year. <strong>The App Store description prior to the game being pulled stated they were working on fixing the problem</strong>, so it didn&#39;t set off any serious alarm bells. After all, it&#39;s often the case on iOS that a publisher will pull a game while they get it fixed up so no one buys a broken product in the meantime. And while Bioshock&#39;s fix was stretching into months, we&#39;ve certainly seen longer waits for updates. This week, however, a new twist entered the story, with Bioshock being fully delisted from the App Store. What that means is that even people who already bought it are unable to download it again.  </p>\n\n<p>...  </p>\n\n<p>Earlier today, TouchArcade forum member dalglir contacted 2K&#39;s support. He received a reply not long after. You can read the full response in the game&#39;s forum thread, if you&#39;d like. It&#39;s mostly a stock-type letter, but there are a couple of interesting points. First, the customer service representative confirms that 2K doesn&#39;t &quot;currently have this game for mobile gaming anymore&quot;. <strong>She goes on to say that the delisting was &quot;a developer decision&quot;, which confirms that it was done at 2K&#39;s request as opposed to, say, Apple&#39;s</strong>. The representative then goes on to tell dalglir to request a refund from Apple should dalglir want one, as 2K can&#39;t process refunds on their end...  </p>\n</blockquote>\n\n<p>&nbsp;  </p>\n\n<p>Quotes taken from the full articles, but I found these excerpts most relevant to the overall story.  </p>\n\n<p>&nbsp;  </p>\n\n<hr/>\n\n<p>Thoughts?  This sentence in the closing paragraph of the second article sums up mine quite well:  </p>\n\n<blockquote>\n<p>Personally, I&#39;m still kind of baffled as to how such a high-profile project wasn&#39;t able to survive a full calendar year without being broken beyond repair.  </p>\n</blockquote>\n\n<p>&nbsp;  </p>\n\n<p>Events like this that make me believe there will always be a market for dedicated gaming platforms in consoles and PC&#39;s, even if the share is (further) reduced by mobile devices.  I&#39;ve yet to have a console OS update make a game permanently unplayable, and PC games are usually modded if an official fix never comes.  I trust my gaming machine to be able to do its job and always play the games I buy for them, but neither phones nor tablets have been shown as dependable for it.  Sadly I don&#39;t expect app-capable TV devices like the upcoming Apple TV to be any different.  </p>\n\n<p>&nbsp;  </p>\n\n<p><sup><sup>edit</sup></sup> <sup><sup>for</sup></sup> <sup><sup>updates,</sup></sup> <sup><sup>formatting</sup></sup> <sup><sup>and</sup></sup> <sup><sup>clarity</sup></sup></p>\n</div><!-- SC_ON -->",
  "subreddit_id": "t5_2qhwp",
  "archived": false,
  "domain": "self.Games",
  "clicked": false,
  "score": 3418,
  "id": "3m72qr",
  "stickied": false,
  "media_embed": {},
  "visited": false,
  "selftext": "**Update** 09/24 @2:30PM ET:  \n[TouchArcade:  2K Says 'BioShock' Will be Fixed for iOS 9](http://toucharcade.com/2015/09/24/2k-says-bioshock-will-be-fixed-for-ios-9/)  \n  \n>The BioShock saga, where the game, incompatible with iOS 8.4 and later, was not only pulled from the App Store but from purchase histories entirely, has taken another twist. It looks like 2K will be fixing the game and putting it back on the App Store. According to a 2K representative who reached out to us earlier today:  \n  \n>>2K recently provided inaccurate information to customers surrounding removal of BioShock for iOS from the App Store. BioShock is currently incompatible with iOS versions 8.4 and higher, and as such, **is temporarily removed for purchase from the App Store. 2K is fixing the compatibility issue, and when resolved, will place BioShock back on the App Store for purchase. Customers who already own BioShock may continue playing the game with iOS version 8.3 or earlier**. 2K regrets the initial customer service error and looks forward to delivering an updated version of BioShock for iOS in the near future.  \n  \n>So it looks like this is getting resolved, in a very similar way to how The World Ends With You [$17.99 / $19.99 (HD)] went down – game stops working, publisher is slow to react to fixing it, mixed messages from customer service lead to confusion over whether the game is getting fixed, before a public outcry seemingly leads to the game getting fixed. We'll keep an eye out for if and when BioShock comes back to the App Store, and let you all know, of course. **An iOS 8.4 update was promised, but never quite made it out, so we'll see if this one actually comes out.**  \n  \n>But for big companies releasing premium games? All this negative publicity should serve as a lesson: maybe updating games comes at a high cost. But instead of dealing with negative outcry from consumers and the media, along with poisoning the well for high-priced premium games on mobile, maybe it's best to just make sure these things are fixed for later iOS versions when they inevitably do break? These things happen, and people have been patient waiting for fixes, but it's just the right thing to do to support these games, especially expensive-for-mobile ones, for a reasonable amount of time.  \n  \n&nbsp;  \n  \n---  \n**Original post**  \n\n[TouchArcade:  2K's 'Bioshock' Has Been Completely Delisted From The App Store For Unknown Reasons](http://toucharcade.com/2015/09/23/bioshock-delisted-from-the-app-store/):  \n  \n>...Though opinions of the results may vary, most can at least agree that it was quite impressive from a tech point of view. **Unfortunately, not even a year later, the arrival of iOS 8.4 completely broke the game.** The publisher of the game, 2K, quickly amended its App Store description to assure players that they were working on fixing the problem. Not long after that, the game was pulled from active sale on the App Store, **but was still accessible through the purchase history of anyone who bought it. Was.**  \n  \n>An eagle-eyed member of the TouchArcade forums recently noticed that Bioshock is **now not only unavailable to buy, but not even existing owners can re-download the title via their purchase histories, as with most pulled apps**...  \n  \n&nbsp;  \n  \n[TouchArcade:  2K Support Says The Removal Of 'Bioshock' Was A Developer Decision](http://toucharcade.com/2015/09/23/bioshock-removal-2k-support-response/)  \n  \n>2K's iOS port of their hit Bioshock was pulled from the App Store after it ran into compatibility problems with iOS 8.4 in July of this year. **The App Store description prior to the game being pulled stated they were working on fixing the problem**, so it didn't set off any serious alarm bells. After all, it's often the case on iOS that a publisher will pull a game while they get it fixed up so no one buys a broken product in the meantime. And while Bioshock's fix was stretching into months, we've certainly seen longer waits for updates. This week, however, a new twist entered the story, with Bioshock being fully delisted from the App Store. What that means is that even people who already bought it are unable to download it again.  \n  \n>...  \n  \n>Earlier today, TouchArcade forum member dalglir contacted 2K's support. He received a reply not long after. You can read the full response in the game's forum thread, if you'd like. It's mostly a stock-type letter, but there are a couple of interesting points. First, the customer service representative confirms that 2K doesn't \"currently have this game for mobile gaming anymore\". **She goes on to say that the delisting was \"a developer decision\", which confirms that it was done at 2K's request as opposed to, say, Apple's**. The representative then goes on to tell dalglir to request a refund from Apple should dalglir want one, as 2K can't process refunds on their end...  \n  \n&nbsp;  \n\nQuotes taken from the full articles, but I found these excerpts most relevant to the overall story.  \n\n&nbsp;  \n\n---  \nThoughts?  This sentence in the closing paragraph of the second article sums up mine quite well:  \n>Personally, I'm still kind of baffled as to how such a high-profile project wasn't able to survive a full calendar year without being broken beyond repair.  \n  \n&nbsp;  \n\nEvents like this that make me believe there will always be a market for dedicated gaming platforms in consoles and PC's, even if the share is (further) reduced by mobile devices.  I've yet to have a console OS update make a game permanently unplayable, and PC games are usually modded if an official fix never comes.  I trust my gaming machine to be able to do its job and always play the games I buy for them, but neither phones nor tablets have been shown as dependable for it.  Sadly I don't expect app-capable TV devices like the upcoming Apple TV to be any different.  \n  \n&nbsp;  \n\n^^edit ^^for ^^updates, ^^formatting ^^and ^^clarity",
  "hide_score": false,
  "_api_link": "https://api.reddit.com/r/Games/comments/3m72qr/bioshock_pulled_from_ios_app_store_it_has_been/?ref=search_posts",
  "locked": false,
  "edited": 1443123109.0,
  "title": "Bioshock pulled from iOS App Store. It has been unusable since the iOS 8.4 update, but now customers that bought it can't even re-download it",
  "created": 1443104696.0,
  "_comments_by_id": {}
}