{
  "selftext": "**Verified?** *(This bot cannot verify AMAs just yet)*\n\n**Date:** 2014-01-14\n\n**[Link to submission](http://www.reddit.com/r/Fantasy/comments/1v7nb6/)** (*Has self-text*)\n\n**[Link to my post](http://www.reddit.com/r/Fantasy/comments/1v7nb6/tabledresser/ceqega9)**\n\n\n\nQuestions|Answers\n:--|:--\n[Two novellas about Auri and Bast? I think I love you. Auri is by far my favourite character!](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cept5uc?context=5)|You're not alone... \n[As a veteran of the first two WoW forums, I'll have you know my eye started twitching again.  The left one (which we all know is the more serious one\\).](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/ceptjxm?context=5)|That's what I get for trying to answer 200 questions inside of two hours... \n[**Alert: very fanboyish question ahead**: Is one day in the four-corners world longer than in our world?  The reason I ask is that, apart from the prelude/interlude chapters in your books, you make it very clear that what we're reading in the novels is exactly Kote's word-by-word dictation to Chronicler. And each book is Kote's narration happening on one day. So how can the books be so long (the audiobooks, especially Wise Man's Fear, are much longer than 24 hours\\)? Could it be that a day in the Four Corners world is much longer than 24 hours?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cephxt6?context=5)|It is not unreasonable to think that a day in the four corners is a different length than ours.   I know this last one to be true because I know the prologue of the book very well, so when I read it out loud, I tend to go about 50% faster than the narrator of the audio book.\n |Kvothe would probably tell his story much more quickly than a narrator would read it.  Anyone who has ever listened to an audiobook on 1.5 speed knows what I'm talking about. The story doesn't sound very different at all. The compression they use just trims out the empty pauses between words and sentences...\n[What kind of pants does Kvothe wear?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cephw13?context=5)|You're assuming... \n[Right. Noted. So when I cosplay him next week, for the Worldbuilders charity, it's pants free?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepof4y?context=5)|Um... \n[Hey, Pat! I'm a big fan of your books and on your work domesticating owlbears (also making the world a better place for years to come, yadda yadda\\). I recently got my girlfriend to start reading NotW and she really likes it but had a comment I'd like to send your way. Every one of Kvothe's friends (especially the ladies\\) are described as good looking, not an ugly one in the bunch. Was it a conscious decision to give him such a beautiful group of friends?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cephw69?context=5)|In his book, \"Born Standing Up\" Steve Martin talks about the fact that he lived through a time in US history when having sex with someone was pretty much as common and casual as saying hello. (I'm paraphrasing here, as I don't have the book at hand.)\n |He's said that people asked him if the women he knew at that point in his life were beautiful, and he said. \"We were in our twenties. We were all beautiful.\"\n |There's a lot of truth to that... \n[Motherfuck, that was a good answer.](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepxjfm?context=5)|Woo! I'm awesome!\n[Who would win in a battle of wits, Kvothe or Locke Lamora?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepjtr1?context=5)|Truth is, I've spent more than a little time thinking about this.\n |If Kvothe and Locke got together in the right circumstances, I think they would get along. I actually think they'd like each other, in a reserved, professional sort of way.\n |Here's the key piece of dialogue from their conversation...\n |Locke: You know, for a thief, you're one hell of a performer.\n |Kvothe: Thanks. As a performer, you're one hell of a thief.  \n[Hey Patrick.  Both Brandon and you would create a group of characters separately for one book. Each chapter would trade off between the two of you with the characters doing their own story and fighting between the two groups. When y'all got down to the last 10% of the book, it would be given over to George R.R. Martin to decide who lives, who dies, and who wins.  My question is: When will we get this incredibly awesome collaboration?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepk1mg?context=5)|Heh. This is honestly the first time I've heard this story. If you just made it up, my hat is off to you. \n[I asked him about it at a later signing (I was the original asker mentioned in the comment\\) and he assured me you knew about it! One of you is trying very hard to mess with my head...](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepx7qy?context=5)|It would probably be better to say that I don't *remember* this story.\n |I have a notoriously bad memory. \n[Congrats on being a new dad! (Again, I know, but each time is worth celebrating!\\) Do you think being a father has changed anything about how you write? \\[I'm putting aside my usual snarky Reddit persona because, dude, you're likely sleep deprived, and ya don't kick a guy when he's bleary.\\]](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cephram?context=5)|Heya Brent,\n |I'd probably say that it has changed the way I write, but probably not in the way most people would assume...\n |We all draw from our own personal experiences when we write. And being a father has given me a whole bucketful of new experiences to draw from. So in some ways it's given me more grist for the mill.\n |What's more, being a father is a pretty universal experience, so it's really useful grist.\n |That said, becoming a father hasn't really turned my life on its head the way it does to some people. I think that's probably because I didn't have a kid until I was 35...  \n[Can a person learn their own true name?  If so could they command it?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepstrz?context=5)|This is a *very* good question. \n[Hey pat. This cute girl in my archaeology class has her dimples pierced. We flirted all day today. I'm not sure if I'm a fan of the dimple piercings though. It's tough. What should I do? Do you like dimple piercings? (on her face obviously\\) ](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepiccq?context=5)|I honestly do not think I've ever seen a dimple piercing, though now I'm extremely curious.\n |I'm from small-town Wisconsin, you realize. We're rustic folk around here...\n |As for what you should do? If you like her, keep talking to her.\n |Other than that, I'm not the sort of person you want to ask for advice for flirting. Seriously. \n[Has anyone in the Four Corners ever looked at the Moon with a telescope?  If so, what did they see? ](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepjeec?context=5)|That's a really good question. \n[What's your favorite fantasy weapon?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepiah9?context=5)|I'll forgive the double question here because it's an easy answer for me: \n[ what book are you most looking forward to reading in 2014 (released or expected to be released\\)?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepiah9?context=5)|Skin Game. (I'm crazy for the Dresden files.) \n[Do the Tinkers have a magical ability to give good recommendations? And if so is it inherent (like a knack\\) or is it gained upon becoming a Tinker?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepqoor?context=5)|This is a good question. It makes me happy that you're asking it. \n[How do we know this is not Mary Robinette Kowal?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepsnkx?context=5)|Congratulations. You just won reddit. \n[Never believe anyone on the internet who says he's Patrick Rothfuss. The statistics are against you. 0_0.](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepz48c?context=5)|In retrospect, I totally should have had Mary come in and do this AMA with me... \n[What was it like reading The Wind Comes (Kvothe erotica fanfiction, created as a milestone reward for this year's Worldbuilders drive\\) by /u/MaryRobinette Kowal? How do you think she did in terms of nailing your voice?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepi9ri?context=5)|Honestly? I haven't had a chance to read it yet. Things have been pure madness around here. I'm trying to get some writing done, we're in the middle of the fundraiser, and I just had another kid, so I'm working hard on not being a shitty father.\n |Also, I'm kinda saving it for when I need something to cheer me up.\n |I can say though, Mary has a knack for mimicry. I'm pretty sure it's her mutant power... \n[Why do I have the feeling you're going to be reading it for the first time on camera?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepvs4w?context=5)|I've considered that too. I think it would be fun to walk into it competely cold and see if I could do it. \n[Is Felurian by any chance blue? WHY DO I IMAGINE HER BLUE, does it make any sense?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/ceptaho?context=5)|It might be because it's always twilight/nighttime when we see her. And moonlight tends to make pale skin bluish.\n |But no, she's not blue.\n |Here eyes are twilight blue. So that might be why so many other folks made the connection too.\n |Also, she has the purple butterfly patterning on her eyelids. That might have contributed to it as well... \n[Confirmed here: Most of Pat's readers are criminals! ](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/ceptg35?context=5)|I would like to point out that correlation is not the same as causation... \n[What is Fela's cup size?  For uh, science. ](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepssqa?context=5)|Probably a generous C. Perhaps a D. \n[U/PRothfuss answering the only questions that matter.](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepyje4?context=5)|Well... they did say it was for science. I'm a big fan of... science. \n[I remember you saying at one point that, if you'd simply released an earlier draft of your book, the character Auri wouldn't even exist.](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepic1w?context=5)|Your follow-up question here is really good, \"How much has the story changed?\" Is a question that seems simple, but it's truly unanswerable. Impossible to quantify. It's too nebulous.\n[It's my understanding (correct me if I'm wrong\\) that you started this process by writing out the whole trilogy.](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepic1w?context=5)|But this: \"How much has the basic skeleton of the story changed since you started revising for print?\" Is much easier.\n[That got me to thinking... how much as the story changed since those first drafts?  I'm sure there's been a tremendous amount of adding and subtracting and tweaking, but how much has the basic skeleton of the story changed since you started revising for print?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepic1w?context=5)|I'd say 60% has changed compared to my original draft.\n[Thanks so much for writing such wonderful books!](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepic1w?context=5)|It's a *lot* different. \n[What's the best joke you know?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepsito?context=5)|A doe walks out of the forest and says, \"That's the last time I do that for two bucks.\" \n[George RR Martin has a famous quote about how authors are either architects (plan meticulously from the beginning\\) or gardeners (let it develop organically and see where it goes\\).  Which one are you?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepsuck?context=5)|I'm firmly a gardener. \n[I just wanted to say thank you for writing such excellent books!  I'm fairly certain that my boyfriend (who is also a big fan of yours\\) is eagerly trying to figure out the seven words to make someone love you. Can you throw him a bone?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepi3d5?context=5)|Are... are you asking me to bone your boyfriend? \n[What was the most recent thing that Oot did to make you melt?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepsn67?context=5)|The best thing recently was Oot saying, \"Dad, the baby looks a little flabbergasted.\"\n |That's just awesome. My 4 year old is already using words that I cannot spell... \n[Hello, I saw you speak in the city of orange california.  During the Q and A I asked what your favorite fan theory was that isn't true.  Your answer was that the next book will be out in a year.  Today's question: what is your second favorite fan theory that isn't true?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cephtp6?context=5)|Sorry. Disproving a theory is still a bit of a spoiler... It's a reverse spoiler, if you see where I'm coming from... \n[If you, Jim butcher, Brandon Sanderson, Scott lynch and Brent Weeks were in a survival show together in the Venezuelan rain forest, who would come out on top?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepikss?context=5)|Hmmm... if we were actually fighting, smart money would probably be on Jim or Scott.\n[What would the 3 items you bring be?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepikss?context=5)|Move us to a Scandinavian climate and I'd have a better shot. I don't do well in the heat. \n[Can you give me a seven word review on the last movie you watched?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepiwbh?context=5)|Big robots punching monsters is pretty cool. \n[Hey Pat. I have a question, but first I just want to say that you're writing is the most deliberate style I've ever seen. It feels like every phrase has been chosen to the letter.](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepii7u?context=5)|I've been asked this question, or questions very similar to it dozens of times. And I wish I had a good answer to it, but I really don't.\n[Thank you for another AMA. After seeing the incredible success of the Name of the Wind playing card Kickstarter have you considered letting other people use your world, for examples table top games, map books ect?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepigxt?context=5)|Your phrasing here is interesting and inadvertently appropriate. You ask, \"have you considered letting other people use your world.\"\n[If Kvothe was a character in A Song of Ice and Fire, which house would he belong to?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepmbaq?context=5)|Kvothe would have probably been sent to the wall long ago... \n[Hey mr Rothfuss, What is your favorite fantasy world ever created by another author?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepiv7i?context=5)|Hmmm... That's a good question. Not what's my favorite story. What's my favorite *world.*\n |Off the top of my head, I'd probably say the Mistborn world. That's something new and different, and Brandon has been doing some cool things with it. \n[This might have already been answered, BUT... do you have actual compositions for Kvothe's songbook, or just general ideas of what they would sound like in your head? (I think we would all love to hear them sung/played!\\)](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepsw38?context=5)|[Link to www.youtube.com](http://www.youtube.com/watch?v=9ZHkr9KRM_c) \n[So.. I heard a rumour about a lesbian kissing contest. Is it true that you won? What's the story to that?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepskql?context=5)|I did win. I very won.\n |But that, my friend, is a long story for a different time. \n[Who currently owns the rights to the College Survival Guide? And, if it's you, have you considered having it digitized and re-released online?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepiic9?context=5)|I own it. And I've been thinking about re-releasing it myself and selling it through our online store (The Tinker's Packs) with the proceeds going to charity.\n |It would be a bit of a project though. I don't know when I'll have time for that... \n[Do you worry that someone will get a permanent marking (say a tattoo\\) related to the book that will end up being terrible due to book three?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepsvn1?context=5)|Sometimes. Yeah. \n[I would get a landscape under my navel that someone would see as they were unzipping my jeans. Off in the distance, a tree.](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepuwdo?context=5)|Is there a word that means cool and creepy and unsettling and kinda hot?\n |That word. Here. \n[Hey Pat,](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepl0e8?context=5)|I'm never a fan of forcing a book on someone. In my opinion, it's the easiest way to ruin a book for someone.\n[I have a friend who is starting to like some fantasy books, but she's more into the Harry Potter level of things. I've let her borrow The Name of the Wind, and she's had it for almost two weeks now and keeps saying she'll get to it. What is one thing, directly from the author, that I can tell her so that she'll get off her lazy ass and read it?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepl0e8?context=5)|Two weeks is nothing. I have books I've been meaning to read for *years.* Just leave her alone, and odds are she'll get around to it eventually. My book's not going anywhere... \n[What's your favorite (craft\\) beer at the moment?  Also, my friend has a seemingly difficult time pronouncing Rothfuss so he has recently resorted to calling you pattie-cakes.  Does this offend you, and if so would you like me to ask him to stop?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepj7cf?context=5)|Nah. It's cool. I've been called worse. \n[Hey, I'm turning thirty today and was wondering what piece of non-beard advice you'd give about writing and getting older?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepjv7h?context=5)|30: Don't sweat it. It's not a big deal.\n |Writing: Sit your ass down and write.\n |Getting older: Do the things you want to do now. You don't want to look back when you're 40 and kick yourself. \n[Can you* settle a wager for me? My friend doesn't believe that Oot and Snoo are your boy's real names. I can't find any evidence to the contrary (using my google skills\\). Who is right?  Edit: proofreading.](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepskgc?context=5)|Those are my kids public names. I keep their real names private. \n[As a musician I'm continually amazed by your ability to write about music. Are you a musician and/or did you grow up raised with music in your family? ](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepr9dt?context=5)|Nope/not really.\n |I didn't even listen to much music at all until I was a sophomore in high school.\n[If not, why?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepk1lq?context=5)|Why? Allergic.  Also, I'm not a big fan of having boxes of shit in my house.\n[Hello Pat. I'm so excited that you're doing another AMA! And this time, I get to ask a question too! Boy oh boy.  OK, here goes: do you have the lyrics to Tinker Tanner somewhere?  And (sorry if I'm greedy\\) - can we *please, pretty please* have at least the first verse? Or the chorus?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepo055?context=5)|There's a full verse of Tinker Tanner hidden in The Name of the Wind if you look closely enough... And another verse in Wise Man's fear. (Not hidden at all.)\n[Will you encourage Oot to grow a beard when the time comes? ](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepqfpu?context=5)|Nah. He can do whatever he wants when he gets older.\n |I will probably advise him against getting a soul patch though... \n[Hi Pat. Do you have any updates on the (possible\\) KKC TV series? Love the books!](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepir61?context=5)|No real updates yet. The project hasn't been canceled though, so that's something... \n[Do you have any advice for a newbie to table top role playing? I'm not a complete and total newb, however, as I've been watching and sitting in on his games for quite awhile now. I have my own built in coach at least, which is great, but I'm curious for your input. ](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepsk56?context=5)|Also, it's more fun with the right group of people. \n |Role playing is like sex.\n[Do people who live in Wisconsin ever get sick of eating cheese curds? ](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepsnqh?context=5)|We sometimes get sick *from* eating cheese curds... \n[Hello Pat, I really liked your usage of the first person perspective in the Kingkiller Chronicles, so I'd like to ask; what are a couple of your favourite pieces of fictional first person writing?(other than your own of course\\)](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepjcxt?context=5)|Psion by Vinge.\n |Robin Hobb's Farseer.\n |The Dresden files. \n[Which character (in the Four Corners\\) is most likely a cylon?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepsimo?context=5)|Auri. \n[What do you feel are your greatest strengths/weaknesses as an author?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepjayp?context=5)|My greatest strengths are my nigh-invulnerability and my ability to fly.\n |My greatest weakness is kryptonite.\n |No... wait. That's superman, isn't it? Where the fuck are my notes... \n[My husband introduced me to your books a couple years ago and the fascination with your writing hasn't wavered for either of us.  Last night, I came home to find him huddled over his computer... Listening to an interview of yours. We didn't even greet each other until it was over so thanks for being a part of our marriage. :\\)  In parting, would you rather fight one draccus sized duck or a hundred duck sized draccus (draccusi?\\)?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepkuck?context=5)|I'd take the hundred draccus ducks... \n[Hi Pat! What's your favorite fantasy series of novels?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepj1u5?context=5)|Right now? The Dresden files. I'm severely geeked about them. \n[Psh who cares.  What the people really want to know is, when does The Thorn of Emberlain come out?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepmeys?context=5)|I'll admit I'm really looking forward to that one... \n[What would be Kvothes opinion on iTunes?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepi6jd?context=5)|\"A musician is not a music box.\" \n[Any plans to continue your bardish career as Viari?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepl4kq?context=5)|I hope to. I had a lot of fun with that... \n[Pat just read Road Dahl's Charlie and the Chocolate Factory with his son, Oot. You should read his review of the book on goodreads.](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepoztg?context=5)|I'm also reading Oot the Hobbit. \n[Have you a favourite Charater? Which one?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/ceps19o?context=5)|My own characters? It changes from day to day. Currently I'm fond of Auri.  \n[Did you base the Adem fighting style off of another fighting style, or did you just wing it? ](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepk9fe?context=5)|I drew from some real-world sources... But some of it I made up, too. It's a melange at this point. \n[Would you consider running a tabletop game while cosplaying as Jim Butcher?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepsm4o?context=5)|I would consider it. I am right now considering it. \n[Hello Patrick, is Wil Wheaton a dick? ](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepsq5u?context=5)|Not in my experience. Every time I've hung out with him, he's been an incredibly kind, gracious guy. I'm rather fond of him, actually. \n[I'm curious how you got involved with Wizards of the Coast's Acquisitions Inc. demo game. What was the process like? Did you already know Jerry, Mike, and Scott? Had you ever played the new edition before they got you involved?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepk3hd?context=5)|Mike and Jerry invited me in. I hadn't played D&D for ages, but I had a great time... \n[Hey Pat,  Just an apology. I attempted to grow a beard as epic as the one you have.  I feel that I have failed the beard community by attempting such.  :(  Will you accept my apology?  ](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepkrt4?context=5)|*Pats you on the back in a consoling way*\n[Got any more live D&D games coming up in the style of Acquisition Inc. or the author D&D game?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepidgy?context=5)|I had to miss the Author D&D game this year. But I am hoping to do Acquisitions again soon... \n[Do you read to your kids?  I have trouble finding things that are exciting so they will listen but not too scary to keep them awake.](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepiksn?context=5)|There's a ton of wonderful kids books out there.\n |I should probably put more of my favorite up on goodreads. I'm pretty active on there...\n |[Link to www.goodreads.com](https://www.goodreads.com/author/show/108424.Patrick_Rothfuss)\n[Kvothe seems to be a frequent coffee or hot chocolate drinker.  Is this a reflection of what you do while you're writing? Also, Dunkin Donuts or Tim Horton's?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepj8v3?context=5)|Nah. I'm a tea drinker these days for the most part. \n[Write a book maybe?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cept9mi?context=5)|This is a much better answer than any of the ones that I came up with.\n |I would probably expand on it to say: Write a book *and* publish it. \n[I recently saw on your blog that someone sang one of the songs you wrote for your world, called 'Knackerman'. Is there any chance of hearing 'The Lay of Sir Savien Traliard' in the future, or maybe 'Tinker Tanner'? ](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepj2fk?context=5)|Tinker Tanner will probably happen before too long.\n |Sir Savien would be trickier. I'd be really hesitant to see that put to music... \n[With the twig communication system that Kvothe used from time to time, why doesn't it pull the other person when Kvothe is walking with it in his pocket?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepiavi?context=5)|They aren't bound together until he makes the link. When they're just walking around, the twigs aren't bound together... \n[What albums are you listening to these days?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepjkai?context=5)|Lasers and Feelings by the Doubleclicks. \n[Hi Pat! I love reading (and re-reading\\) your books.  I know *The Last Unicorn* is one of your favorite books, but if you had to pick one non-fantasy, non-scifi book as your favorite, what would it be?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepjkmm?context=5)|Canterbury tales? Cyrano DeBergerac? Midsummer Night's Dream? \n[What brand of peanut butter do you use? If you like crunchy, i reserve the right to judge you.](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepitns?context=5)|I don't think I've eaten peanut butter in 20 years.\n |But when I did, rest assured I mostly went for smooth. \n[The real question is, who would win in a battle of flightiness, Denna or Sabetha?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepudax?context=5)|Touche. \n[I just wanted to thank you again for being such a downright decent human being. I came up to you at the hotel bar at Origins a few years ago and asked if you'd talk to my friend over my phone for his birthday and you did it no questions asked.  My question: Do you read any Urban Fantasy and, if so, who is your favorite author in the genre?](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepj9wf?context=5)|Butcher. \n[Interestingly enough research shows that all languages get information across at about the same speed. The denser the language the slower people tend to speak.](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepm526?context=5)|That's really interesting. I don't suppose you have a link or anything you could point us at? \n[*edit: reworded so that it made more sense*](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepj76f?context=5)|It can be a lot of fun speculating about what's going to happen in a book. But not if you actually *know* what's going to happen. \n[Funniest thing Oot has ever done... GO!](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepsot5?context=5)|Took a picture of his own penis with the camera we got him for Christmas.\n |He better not grow up to be a politician.\n[Prison libraries are always in desperate need of book donations.](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepu9b9?context=5)|Amanda, if you read this, let's look into what we could do to send some books along to prisons. There has to be a fairly easy way for us to do that...\n[Hi Patrick. I don't actually have a question, I just wanted to thank you for the hours I've enjoyed reading your books, for your blog introducing me to the Lies of Locke Lamora, and your work with World Builders. You are a gentleman and a scholar.](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepsoya?context=5)|Thank you kindly. I'm glad you liked Lies... And I'm glad you're enjoying Worldbuilders. \n[He didn't specify gender...](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/ceq5dmu?context=5)|No. No I did not. \n[This is a great question. I hope he gets to this. ](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepnlqc?context=5)|It is a good question, but unfortunately, it's unthinkably vast. There's no way I could answer it here in any sort of timely fashion. I'm sorry. \n[*(Here's the quote, more or less\\)*](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepnzjf?context=5)|Wow. I have no memory of writing that at all.\n[\"I could give a fuck. They can think he's a dolphin if they want, it doesn't make them right.\"](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepnzjf?context=5)|I agree with it wholeheartedly though... \n[Unfortunately, he wouldn't get the fast writing ability, but some other power Sanderson has... like his ability at Magic the Gathering or something.  ](http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepvd9k?context=5)|I'm already awesome at MTG... \n\n\n*Last updated: 2014-01-19 14:42 UTC*\n\n*This post was generated by a robot! Send all complaints to [epsy](/message/compose/?to=epsy).*\n\n",
  "gilded": 0,
  "score": 20,
  "removal_reason": null,
  "approved_by": null,
  "created_utc": 1389814020.0,
  "is_self": true,
  "stickied": false,
  "edited": 1390142577.0,
  "distinguished": null,
  "permalink": "https://www.reddit.com/r/tabled/comments/1vaulz/table_fantasy_heya_everybody_im_patrick_rothfuss/?ref=search_posts",
  "banned_by": null,
  "from_id": null,
  "likes": null,
  "_underscore_names": null,
  "num_reports": null,
  "link_flair_css_class": null,
  "_info_url": "https://api.reddit.com/api/info/",
  "id": "1vaulz",
  "archived": true,
  "secure_media": null,
  "from_kind": null,
  "saved": false,
  "domain": "self.tabled",
  "ups": 20,
  "suggested_sort": null,
  "quarantine": false,
  "over_18": false,
  "hide_score": false,
  "url": "https://www.reddit.com/r/tabled/comments/1vaulz/table_fantasy_heya_everybody_im_patrick_rothfuss/",
  "subreddit_id": "t5_2tkmw",
  "_params": {},
  "_comments": null,
  "_replaced_more": false,
  "_comments_by_id": {},
  "user_reports": [],
  "media_embed": {},
  "created": 1389817620.0,
  "author_flair_text": "",
  "visited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Verified?</strong> <em>(This bot cannot verify AMAs just yet)</em></p>\n\n<p><strong>Date:</strong> 2014-01-14</p>\n\n<p><strong><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/\">Link to submission</a></strong> (<em>Has self-text</em>)</p>\n\n<p><strong><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/tabledresser/ceqega9\">Link to my post</a></strong></p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Questions</th>\n<th align=\"left\">Answers</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cept5uc?context=5\">Two novellas about Auri and Bast? I think I love you. Auri is by far my favourite character!</a></td>\n<td align=\"left\">You&#39;re not alone...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/ceptjxm?context=5\">As a veteran of the first two WoW forums, I&#39;ll have you know my eye started twitching again.  The left one (which we all know is the more serious one).</a></td>\n<td align=\"left\">That&#39;s what I get for trying to answer 200 questions inside of two hours...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cephxt6?context=5\"><strong>Alert: very fanboyish question ahead</strong>: Is one day in the four-corners world longer than in our world?  The reason I ask is that, apart from the prelude/interlude chapters in your books, you make it very clear that what we&#39;re reading in the novels is exactly Kote&#39;s word-by-word dictation to Chronicler. And each book is Kote&#39;s narration happening on one day. So how can the books be so long (the audiobooks, especially Wise Man&#39;s Fear, are much longer than 24 hours)? Could it be that a day in the Four Corners world is much longer than 24 hours?</a></td>\n<td align=\"left\">It is not unreasonable to think that a day in the four corners is a different length than ours.   I know this last one to be true because I know the prologue of the book very well, so when I read it out loud, I tend to go about 50% faster than the narrator of the audio book.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Kvothe would probably tell his story much more quickly than a narrator would read it.  Anyone who has ever listened to an audiobook on 1.5 speed knows what I&#39;m talking about. The story doesn&#39;t sound very different at all. The compression they use just trims out the empty pauses between words and sentences...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cephw13?context=5\">What kind of pants does Kvothe wear?</a></td>\n<td align=\"left\">You&#39;re assuming...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepof4y?context=5\">Right. Noted. So when I cosplay him next week, for the Worldbuilders charity, it&#39;s pants free?</a></td>\n<td align=\"left\">Um...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cephw69?context=5\">Hey, Pat! I&#39;m a big fan of your books and on your work domesticating owlbears (also making the world a better place for years to come, yadda yadda). I recently got my girlfriend to start reading NotW and she really likes it but had a comment I&#39;d like to send your way. Every one of Kvothe&#39;s friends (especially the ladies) are described as good looking, not an ugly one in the bunch. Was it a conscious decision to give him such a beautiful group of friends?</a></td>\n<td align=\"left\">In his book, &quot;Born Standing Up&quot; Steve Martin talks about the fact that he lived through a time in US history when having sex with someone was pretty much as common and casual as saying hello. (I&#39;m paraphrasing here, as I don&#39;t have the book at hand.)</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">He&#39;s said that people asked him if the women he knew at that point in his life were beautiful, and he said. &quot;We were in our twenties. We were all beautiful.&quot;</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">There&#39;s a lot of truth to that...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepxjfm?context=5\">Motherfuck, that was a good answer.</a></td>\n<td align=\"left\">Woo! I&#39;m awesome!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepjtr1?context=5\">Who would win in a battle of wits, Kvothe or Locke Lamora?</a></td>\n<td align=\"left\">Truth is, I&#39;ve spent more than a little time thinking about this.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">If Kvothe and Locke got together in the right circumstances, I think they would get along. I actually think they&#39;d like each other, in a reserved, professional sort of way.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Here&#39;s the key piece of dialogue from their conversation...</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Locke: You know, for a thief, you&#39;re one hell of a performer.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Kvothe: Thanks. As a performer, you&#39;re one hell of a thief.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepk1mg?context=5\">Hey Patrick.  Both Brandon and you would create a group of characters separately for one book. Each chapter would trade off between the two of you with the characters doing their own story and fighting between the two groups. When y&#39;all got down to the last 10% of the book, it would be given over to George R.R. Martin to decide who lives, who dies, and who wins.  My question is: When will we get this incredibly awesome collaboration?</a></td>\n<td align=\"left\">Heh. This is honestly the first time I&#39;ve heard this story. If you just made it up, my hat is off to you.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepx7qy?context=5\">I asked him about it at a later signing (I was the original asker mentioned in the comment) and he assured me you knew about it! One of you is trying very hard to mess with my head...</a></td>\n<td align=\"left\">It would probably be better to say that I don&#39;t <em>remember</em> this story.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I have a notoriously bad memory.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cephram?context=5\">Congrats on being a new dad! (Again, I know, but each time is worth celebrating!) Do you think being a father has changed anything about how you write? [I&#39;m putting aside my usual snarky Reddit persona because, dude, you&#39;re likely sleep deprived, and ya don&#39;t kick a guy when he&#39;s bleary.]</a></td>\n<td align=\"left\">Heya Brent,</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I&#39;d probably say that it has changed the way I write, but probably not in the way most people would assume...</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">We all draw from our own personal experiences when we write. And being a father has given me a whole bucketful of new experiences to draw from. So in some ways it&#39;s given me more grist for the mill.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">What&#39;s more, being a father is a pretty universal experience, so it&#39;s really useful grist.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">That said, becoming a father hasn&#39;t really turned my life on its head the way it does to some people. I think that&#39;s probably because I didn&#39;t have a kid until I was 35...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepstrz?context=5\">Can a person learn their own true name?  If so could they command it?</a></td>\n<td align=\"left\">This is a <em>very</em> good question.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepiccq?context=5\">Hey pat. This cute girl in my archaeology class has her dimples pierced. We flirted all day today. I&#39;m not sure if I&#39;m a fan of the dimple piercings though. It&#39;s tough. What should I do? Do you like dimple piercings? (on her face obviously) </a></td>\n<td align=\"left\">I honestly do not think I&#39;ve ever seen a dimple piercing, though now I&#39;m extremely curious.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I&#39;m from small-town Wisconsin, you realize. We&#39;re rustic folk around here...</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">As for what you should do? If you like her, keep talking to her.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Other than that, I&#39;m not the sort of person you want to ask for advice for flirting. Seriously.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepjeec?context=5\">Has anyone in the Four Corners ever looked at the Moon with a telescope?  If so, what did they see? </a></td>\n<td align=\"left\">That&#39;s a really good question.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepiah9?context=5\">What&#39;s your favorite fantasy weapon?</a></td>\n<td align=\"left\">I&#39;ll forgive the double question here because it&#39;s an easy answer for me:</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepiah9?context=5\"> what book are you most looking forward to reading in 2014 (released or expected to be released)?</a></td>\n<td align=\"left\">Skin Game. (I&#39;m crazy for the Dresden files.)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepqoor?context=5\">Do the Tinkers have a magical ability to give good recommendations? And if so is it inherent (like a knack) or is it gained upon becoming a Tinker?</a></td>\n<td align=\"left\">This is a good question. It makes me happy that you&#39;re asking it.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepsnkx?context=5\">How do we know this is not Mary Robinette Kowal?</a></td>\n<td align=\"left\">Congratulations. You just won reddit.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepz48c?context=5\">Never believe anyone on the internet who says he&#39;s Patrick Rothfuss. The statistics are against you. 0_0.</a></td>\n<td align=\"left\">In retrospect, I totally should have had Mary come in and do this AMA with me...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepi9ri?context=5\">What was it like reading The Wind Comes (Kvothe erotica fanfiction, created as a milestone reward for this year&#39;s Worldbuilders drive) by /u/MaryRobinette Kowal? How do you think she did in terms of nailing your voice?</a></td>\n<td align=\"left\">Honestly? I haven&#39;t had a chance to read it yet. Things have been pure madness around here. I&#39;m trying to get some writing done, we&#39;re in the middle of the fundraiser, and I just had another kid, so I&#39;m working hard on not being a shitty father.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Also, I&#39;m kinda saving it for when I need something to cheer me up.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I can say though, Mary has a knack for mimicry. I&#39;m pretty sure it&#39;s her mutant power...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepvs4w?context=5\">Why do I have the feeling you&#39;re going to be reading it for the first time on camera?</a></td>\n<td align=\"left\">I&#39;ve considered that too. I think it would be fun to walk into it competely cold and see if I could do it.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/ceptaho?context=5\">Is Felurian by any chance blue? WHY DO I IMAGINE HER BLUE, does it make any sense?</a></td>\n<td align=\"left\">It might be because it&#39;s always twilight/nighttime when we see her. And moonlight tends to make pale skin bluish.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">But no, she&#39;s not blue.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Here eyes are twilight blue. So that might be why so many other folks made the connection too.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Also, she has the purple butterfly patterning on her eyelids. That might have contributed to it as well...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/ceptg35?context=5\">Confirmed here: Most of Pat&#39;s readers are criminals! </a></td>\n<td align=\"left\">I would like to point out that correlation is not the same as causation...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepssqa?context=5\">What is Fela&#39;s cup size?  For uh, science. </a></td>\n<td align=\"left\">Probably a generous C. Perhaps a D.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepyje4?context=5\">U/PRothfuss answering the only questions that matter.</a></td>\n<td align=\"left\">Well... they did say it was for science. I&#39;m a big fan of... science.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepic1w?context=5\">I remember you saying at one point that, if you&#39;d simply released an earlier draft of your book, the character Auri wouldn&#39;t even exist.</a></td>\n<td align=\"left\">Your follow-up question here is really good, &quot;How much has the story changed?&quot; Is a question that seems simple, but it&#39;s truly unanswerable. Impossible to quantify. It&#39;s too nebulous.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepic1w?context=5\">It&#39;s my understanding (correct me if I&#39;m wrong) that you started this process by writing out the whole trilogy.</a></td>\n<td align=\"left\">But this: &quot;How much has the basic skeleton of the story changed since you started revising for print?&quot; Is much easier.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepic1w?context=5\">That got me to thinking... how much as the story changed since those first drafts?  I&#39;m sure there&#39;s been a tremendous amount of adding and subtracting and tweaking, but how much has the basic skeleton of the story changed since you started revising for print?</a></td>\n<td align=\"left\">I&#39;d say 60% has changed compared to my original draft.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepic1w?context=5\">Thanks so much for writing such wonderful books!</a></td>\n<td align=\"left\">It&#39;s a <em>lot</em> different.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepsito?context=5\">What&#39;s the best joke you know?</a></td>\n<td align=\"left\">A doe walks out of the forest and says, &quot;That&#39;s the last time I do that for two bucks.&quot;</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepsuck?context=5\">George RR Martin has a famous quote about how authors are either architects (plan meticulously from the beginning) or gardeners (let it develop organically and see where it goes).  Which one are you?</a></td>\n<td align=\"left\">I&#39;m firmly a gardener.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepi3d5?context=5\">I just wanted to say thank you for writing such excellent books!  I&#39;m fairly certain that my boyfriend (who is also a big fan of yours) is eagerly trying to figure out the seven words to make someone love you. Can you throw him a bone?</a></td>\n<td align=\"left\">Are... are you asking me to bone your boyfriend?</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepsn67?context=5\">What was the most recent thing that Oot did to make you melt?</a></td>\n<td align=\"left\">The best thing recently was Oot saying, &quot;Dad, the baby looks a little flabbergasted.&quot;</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">That&#39;s just awesome. My 4 year old is already using words that I cannot spell...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cephtp6?context=5\">Hello, I saw you speak in the city of orange california.  During the Q and A I asked what your favorite fan theory was that isn&#39;t true.  Your answer was that the next book will be out in a year.  Today&#39;s question: what is your second favorite fan theory that isn&#39;t true?</a></td>\n<td align=\"left\">Sorry. Disproving a theory is still a bit of a spoiler... It&#39;s a reverse spoiler, if you see where I&#39;m coming from...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepikss?context=5\">If you, Jim butcher, Brandon Sanderson, Scott lynch and Brent Weeks were in a survival show together in the Venezuelan rain forest, who would come out on top?</a></td>\n<td align=\"left\">Hmmm... if we were actually fighting, smart money would probably be on Jim or Scott.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepikss?context=5\">What would the 3 items you bring be?</a></td>\n<td align=\"left\">Move us to a Scandinavian climate and I&#39;d have a better shot. I don&#39;t do well in the heat.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepiwbh?context=5\">Can you give me a seven word review on the last movie you watched?</a></td>\n<td align=\"left\">Big robots punching monsters is pretty cool.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepii7u?context=5\">Hey Pat. I have a question, but first I just want to say that you&#39;re writing is the most deliberate style I&#39;ve ever seen. It feels like every phrase has been chosen to the letter.</a></td>\n<td align=\"left\">I&#39;ve been asked this question, or questions very similar to it dozens of times. And I wish I had a good answer to it, but I really don&#39;t.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepigxt?context=5\">Thank you for another AMA. After seeing the incredible success of the Name of the Wind playing card Kickstarter have you considered letting other people use your world, for examples table top games, map books ect?</a></td>\n<td align=\"left\">Your phrasing here is interesting and inadvertently appropriate. You ask, &quot;have you considered letting other people use your world.&quot;</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepmbaq?context=5\">If Kvothe was a character in A Song of Ice and Fire, which house would he belong to?</a></td>\n<td align=\"left\">Kvothe would have probably been sent to the wall long ago...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepiv7i?context=5\">Hey mr Rothfuss, What is your favorite fantasy world ever created by another author?</a></td>\n<td align=\"left\">Hmmm... That&#39;s a good question. Not what&#39;s my favorite story. What&#39;s my favorite <em>world.</em></td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Off the top of my head, I&#39;d probably say the Mistborn world. That&#39;s something new and different, and Brandon has been doing some cool things with it.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepsw38?context=5\">This might have already been answered, BUT... do you have actual compositions for Kvothe&#39;s songbook, or just general ideas of what they would sound like in your head? (I think we would all love to hear them sung/played!)</a></td>\n<td align=\"left\"><a href=\"http://www.youtube.com/watch?v=9ZHkr9KRM_c\">Link to www.youtube.com</a></td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepskql?context=5\">So.. I heard a rumour about a lesbian kissing contest. Is it true that you won? What&#39;s the story to that?</a></td>\n<td align=\"left\">I did win. I very won.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">But that, my friend, is a long story for a different time.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepiic9?context=5\">Who currently owns the rights to the College Survival Guide? And, if it&#39;s you, have you considered having it digitized and re-released online?</a></td>\n<td align=\"left\">I own it. And I&#39;ve been thinking about re-releasing it myself and selling it through our online store (The Tinker&#39;s Packs) with the proceeds going to charity.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">It would be a bit of a project though. I don&#39;t know when I&#39;ll have time for that...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepsvn1?context=5\">Do you worry that someone will get a permanent marking (say a tattoo) related to the book that will end up being terrible due to book three?</a></td>\n<td align=\"left\">Sometimes. Yeah.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepuwdo?context=5\">I would get a landscape under my navel that someone would see as they were unzipping my jeans. Off in the distance, a tree.</a></td>\n<td align=\"left\">Is there a word that means cool and creepy and unsettling and kinda hot?</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">That word. Here.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepl0e8?context=5\">Hey Pat,</a></td>\n<td align=\"left\">I&#39;m never a fan of forcing a book on someone. In my opinion, it&#39;s the easiest way to ruin a book for someone.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepl0e8?context=5\">I have a friend who is starting to like some fantasy books, but she&#39;s more into the Harry Potter level of things. I&#39;ve let her borrow The Name of the Wind, and she&#39;s had it for almost two weeks now and keeps saying she&#39;ll get to it. What is one thing, directly from the author, that I can tell her so that she&#39;ll get off her lazy ass and read it?</a></td>\n<td align=\"left\">Two weeks is nothing. I have books I&#39;ve been meaning to read for <em>years.</em> Just leave her alone, and odds are she&#39;ll get around to it eventually. My book&#39;s not going anywhere...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepj7cf?context=5\">What&#39;s your favorite (craft) beer at the moment?  Also, my friend has a seemingly difficult time pronouncing Rothfuss so he has recently resorted to calling you pattie-cakes.  Does this offend you, and if so would you like me to ask him to stop?</a></td>\n<td align=\"left\">Nah. It&#39;s cool. I&#39;ve been called worse.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepjv7h?context=5\">Hey, I&#39;m turning thirty today and was wondering what piece of non-beard advice you&#39;d give about writing and getting older?</a></td>\n<td align=\"left\">30: Don&#39;t sweat it. It&#39;s not a big deal.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Writing: Sit your ass down and write.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Getting older: Do the things you want to do now. You don&#39;t want to look back when you&#39;re 40 and kick yourself.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepskgc?context=5\">Can you* settle a wager for me? My friend doesn&#39;t believe that Oot and Snoo are your boy&#39;s real names. I can&#39;t find any evidence to the contrary (using my google skills). Who is right?  Edit: proofreading.</a></td>\n<td align=\"left\">Those are my kids public names. I keep their real names private.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepr9dt?context=5\">As a musician I&#39;m continually amazed by your ability to write about music. Are you a musician and/or did you grow up raised with music in your family? </a></td>\n<td align=\"left\">Nope/not really.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I didn&#39;t even listen to much music at all until I was a sophomore in high school.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepk1lq?context=5\">If not, why?</a></td>\n<td align=\"left\">Why? Allergic.  Also, I&#39;m not a big fan of having boxes of shit in my house.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepo055?context=5\">Hello Pat. I&#39;m so excited that you&#39;re doing another AMA! And this time, I get to ask a question too! Boy oh boy.  OK, here goes: do you have the lyrics to Tinker Tanner somewhere?  And (sorry if I&#39;m greedy) - can we <em>please, pretty please</em> have at least the first verse? Or the chorus?</a></td>\n<td align=\"left\">There&#39;s a full verse of Tinker Tanner hidden in The Name of the Wind if you look closely enough... And another verse in Wise Man&#39;s fear. (Not hidden at all.)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepqfpu?context=5\">Will you encourage Oot to grow a beard when the time comes? </a></td>\n<td align=\"left\">Nah. He can do whatever he wants when he gets older.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I will probably advise him against getting a soul patch though...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepir61?context=5\">Hi Pat. Do you have any updates on the (possible) KKC TV series? Love the books!</a></td>\n<td align=\"left\">No real updates yet. The project hasn&#39;t been canceled though, so that&#39;s something...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepsk56?context=5\">Do you have any advice for a newbie to table top role playing? I&#39;m not a complete and total newb, however, as I&#39;ve been watching and sitting in on his games for quite awhile now. I have my own built in coach at least, which is great, but I&#39;m curious for your input. </a></td>\n<td align=\"left\">Also, it&#39;s more fun with the right group of people.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Role playing is like sex.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepsnqh?context=5\">Do people who live in Wisconsin ever get sick of eating cheese curds? </a></td>\n<td align=\"left\">We sometimes get sick <em>from</em> eating cheese curds...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepjcxt?context=5\">Hello Pat, I really liked your usage of the first person perspective in the Kingkiller Chronicles, so I&#39;d like to ask; what are a couple of your favourite pieces of fictional first person writing?(other than your own of course)</a></td>\n<td align=\"left\">Psion by Vinge.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Robin Hobb&#39;s Farseer.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">The Dresden files.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepsimo?context=5\">Which character (in the Four Corners) is most likely a cylon?</a></td>\n<td align=\"left\">Auri.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepjayp?context=5\">What do you feel are your greatest strengths/weaknesses as an author?</a></td>\n<td align=\"left\">My greatest strengths are my nigh-invulnerability and my ability to fly.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">My greatest weakness is kryptonite.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">No... wait. That&#39;s superman, isn&#39;t it? Where the fuck are my notes...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepkuck?context=5\">My husband introduced me to your books a couple years ago and the fascination with your writing hasn&#39;t wavered for either of us.  Last night, I came home to find him huddled over his computer... Listening to an interview of yours. We didn&#39;t even greet each other until it was over so thanks for being a part of our marriage. :)  In parting, would you rather fight one draccus sized duck or a hundred duck sized draccus (draccusi?)?</a></td>\n<td align=\"left\">I&#39;d take the hundred draccus ducks...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepj1u5?context=5\">Hi Pat! What&#39;s your favorite fantasy series of novels?</a></td>\n<td align=\"left\">Right now? The Dresden files. I&#39;m severely geeked about them.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepmeys?context=5\">Psh who cares.  What the people really want to know is, when does The Thorn of Emberlain come out?</a></td>\n<td align=\"left\">I&#39;ll admit I&#39;m really looking forward to that one...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepi6jd?context=5\">What would be Kvothes opinion on iTunes?</a></td>\n<td align=\"left\">&quot;A musician is not a music box.&quot;</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepl4kq?context=5\">Any plans to continue your bardish career as Viari?</a></td>\n<td align=\"left\">I hope to. I had a lot of fun with that...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepoztg?context=5\">Pat just read Road Dahl&#39;s Charlie and the Chocolate Factory with his son, Oot. You should read his review of the book on goodreads.</a></td>\n<td align=\"left\">I&#39;m also reading Oot the Hobbit.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/ceps19o?context=5\">Have you a favourite Charater? Which one?</a></td>\n<td align=\"left\">My own characters? It changes from day to day. Currently I&#39;m fond of Auri.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepk9fe?context=5\">Did you base the Adem fighting style off of another fighting style, or did you just wing it? </a></td>\n<td align=\"left\">I drew from some real-world sources... But some of it I made up, too. It&#39;s a melange at this point.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepsm4o?context=5\">Would you consider running a tabletop game while cosplaying as Jim Butcher?</a></td>\n<td align=\"left\">I would consider it. I am right now considering it.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepsq5u?context=5\">Hello Patrick, is Wil Wheaton a dick? </a></td>\n<td align=\"left\">Not in my experience. Every time I&#39;ve hung out with him, he&#39;s been an incredibly kind, gracious guy. I&#39;m rather fond of him, actually.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepk3hd?context=5\">I&#39;m curious how you got involved with Wizards of the Coast&#39;s Acquisitions Inc. demo game. What was the process like? Did you already know Jerry, Mike, and Scott? Had you ever played the new edition before they got you involved?</a></td>\n<td align=\"left\">Mike and Jerry invited me in. I hadn&#39;t played D&amp;D for ages, but I had a great time...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepkrt4?context=5\">Hey Pat,  Just an apology. I attempted to grow a beard as epic as the one you have.  I feel that I have failed the beard community by attempting such.  :(  Will you accept my apology?  </a></td>\n<td align=\"left\"><em>Pats you on the back in a consoling way</em></td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepidgy?context=5\">Got any more live D&amp;D games coming up in the style of Acquisition Inc. or the author D&amp;D game?</a></td>\n<td align=\"left\">I had to miss the Author D&amp;D game this year. But I am hoping to do Acquisitions again soon...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepiksn?context=5\">Do you read to your kids?  I have trouble finding things that are exciting so they will listen but not too scary to keep them awake.</a></td>\n<td align=\"left\">There&#39;s a ton of wonderful kids books out there.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I should probably put more of my favorite up on goodreads. I&#39;m pretty active on there...</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\"><a href=\"https://www.goodreads.com/author/show/108424.Patrick_Rothfuss\">Link to www.goodreads.com</a></td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepj8v3?context=5\">Kvothe seems to be a frequent coffee or hot chocolate drinker.  Is this a reflection of what you do while you&#39;re writing? Also, Dunkin Donuts or Tim Horton&#39;s?</a></td>\n<td align=\"left\">Nah. I&#39;m a tea drinker these days for the most part.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cept9mi?context=5\">Write a book maybe?</a></td>\n<td align=\"left\">This is a much better answer than any of the ones that I came up with.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I would probably expand on it to say: Write a book <em>and</em> publish it.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepj2fk?context=5\">I recently saw on your blog that someone sang one of the songs you wrote for your world, called &#39;Knackerman&#39;. Is there any chance of hearing &#39;The Lay of Sir Savien Traliard&#39; in the future, or maybe &#39;Tinker Tanner&#39;? </a></td>\n<td align=\"left\">Tinker Tanner will probably happen before too long.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Sir Savien would be trickier. I&#39;d be really hesitant to see that put to music...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepiavi?context=5\">With the twig communication system that Kvothe used from time to time, why doesn&#39;t it pull the other person when Kvothe is walking with it in his pocket?</a></td>\n<td align=\"left\">They aren&#39;t bound together until he makes the link. When they&#39;re just walking around, the twigs aren&#39;t bound together...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepjkai?context=5\">What albums are you listening to these days?</a></td>\n<td align=\"left\">Lasers and Feelings by the Doubleclicks.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepjkmm?context=5\">Hi Pat! I love reading (and re-reading) your books.  I know <em>The Last Unicorn</em> is one of your favorite books, but if you had to pick one non-fantasy, non-scifi book as your favorite, what would it be?</a></td>\n<td align=\"left\">Canterbury tales? Cyrano DeBergerac? Midsummer Night&#39;s Dream?</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepitns?context=5\">What brand of peanut butter do you use? If you like crunchy, i reserve the right to judge you.</a></td>\n<td align=\"left\">I don&#39;t think I&#39;ve eaten peanut butter in 20 years.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">But when I did, rest assured I mostly went for smooth.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepudax?context=5\">The real question is, who would win in a battle of flightiness, Denna or Sabetha?</a></td>\n<td align=\"left\">Touche.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepj9wf?context=5\">I just wanted to thank you again for being such a downright decent human being. I came up to you at the hotel bar at Origins a few years ago and asked if you&#39;d talk to my friend over my phone for his birthday and you did it no questions asked.  My question: Do you read any Urban Fantasy and, if so, who is your favorite author in the genre?</a></td>\n<td align=\"left\">Butcher.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepm526?context=5\">Interestingly enough research shows that all languages get information across at about the same speed. The denser the language the slower people tend to speak.</a></td>\n<td align=\"left\">That&#39;s really interesting. I don&#39;t suppose you have a link or anything you could point us at?</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepj76f?context=5\"><em>edit: reworded so that it made more sense</em></a></td>\n<td align=\"left\">It can be a lot of fun speculating about what&#39;s going to happen in a book. But not if you actually <em>know</em> what&#39;s going to happen.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepsot5?context=5\">Funniest thing Oot has ever done... GO!</a></td>\n<td align=\"left\">Took a picture of his own penis with the camera we got him for Christmas.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">He better not grow up to be a politician.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepu9b9?context=5\">Prison libraries are always in desperate need of book donations.</a></td>\n<td align=\"left\">Amanda, if you read this, let&#39;s look into what we could do to send some books along to prisons. There has to be a fairly easy way for us to do that...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepsoya?context=5\">Hi Patrick. I don&#39;t actually have a question, I just wanted to thank you for the hours I&#39;ve enjoyed reading your books, for your blog introducing me to the Lies of Locke Lamora, and your work with World Builders. You are a gentleman and a scholar.</a></td>\n<td align=\"left\">Thank you kindly. I&#39;m glad you liked Lies... And I&#39;m glad you&#39;re enjoying Worldbuilders.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/ceq5dmu?context=5\">He didn&#39;t specify gender...</a></td>\n<td align=\"left\">No. No I did not.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepnlqc?context=5\">This is a great question. I hope he gets to this. </a></td>\n<td align=\"left\">It is a good question, but unfortunately, it&#39;s unthinkably vast. There&#39;s no way I could answer it here in any sort of timely fashion. I&#39;m sorry.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepnzjf?context=5\"><em>(Here&#39;s the quote, more or less)</em></a></td>\n<td align=\"left\">Wow. I have no memory of writing that at all.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepnzjf?context=5\">&quot;I could give a fuck. They can think he&#39;s a dolphin if they want, it doesn&#39;t make them right.&quot;</a></td>\n<td align=\"left\">I agree with it wholeheartedly though...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/Fantasy/comments/1v7nb6/heya_everybody_im_patrick_rothfuss_ama/cepvd9k?context=5\">Unfortunately, he wouldn&#39;t get the fast writing ability, but some other power Sanderson has... like his ability at Magic the Gathering or something.  </a></td>\n<td align=\"left\">I&#39;m already awesome at MTG...</td>\n</tr>\n</tbody></table>\n\n<p><em>Last updated: 2014-01-19 14:42 UTC</em></p>\n\n<p><em>This post was generated by a robot! Send all complaints to <a href=\"/message/compose/?to=epsy\">epsy</a>.</em></p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "_comment_sort": null,
  "report_reasons": null,
  "name": "t3_1vaulz",
  "from": null,
  "hidden": false,
  "clicked": false,
  "media": null,
  "json_dict": null,
  "_api_link": "https://api.reddit.com/r/tabled/comments/1vaulz/table_fantasy_heya_everybody_im_patrick_rothfuss/?ref=search_posts",
  "secure_media_embed": {},
  "mod_reports": [],
  "_orphaned": {},
  "_uniq": null,
  "num_comments": 0,
  "link_flair_text": null,
  "title": "[Table] Fantasy: Heya everybody, I'm Patrick Rothfuss - AMA",
  "_has_fetched": true,
  "author_flair_css_class": "tabler",
  "thumbnail": ""
}