{
  "downs": 0,
  "mod_reports": [],
  "secure_media_embed": {},
  "_info_url": "https://api.reddit.com/api/info/",
  "gilded": 0,
  "num_comments": 17,
  "_orphaned": {},
  "hidden": false,
  "ups": 5,
  "url": "https://www.reddit.com/r/BitcoinKinetics/comments/2aj2ox/project_blockchain_valley/",
  "_has_fetched": true,
  "quarantine": false,
  "name": "t3_2aj2ox",
  "user_reports": [],
  "saved": false,
  "permalink": "https://www.reddit.com/r/BitcoinKinetics/comments/2aj2ox/project_blockchain_valley/?ref=search_posts",
  "over_18": false,
  "is_self": true,
  "_params": {},
  "thumbnail": "self",
  "created_utc": 1405196502.0,
  "_replaced_more": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>PROJECT BLOCKCHAIN VALLEY</strong></p>\n\n<p>My name is Morgan Rockwell, I am CEO of Bitcoin Kinetics Inc. Now founder of Kinetics - Blockchain, Automation &amp; Energy. I created the first Bitcoin Operated Service Machine to allow Bitcoin to be used in the real world in all machines &amp; businesses. We are rapidly expanding &amp; growing into new territories, industries and concepts to help build the Bitcoin &amp; Blockchain based industries into a competitive &amp; profitable environment. We have began the process of issuing equity on the NYSE in New York City. We have purchased a new building to house the buildings office &amp; factory. We have made several partnerships with many Bitcoin Business Leaders, Ethereum, Micro-controller &amp; Chip Makers, DIY companies and many more important players in the new technology industries. We now need your help before we are forced to ask help from the banking sector, tyrants or billionaires..</p>\n\n<p>We now need 10000 Bitcoins to create the greatest Bitcoin Based Economy the world will ever see, including the first Bitcoin Town... Ill give you keys to the company, all of the equity, I do not want a dollar. </p>\n\n<p>There will be always be a loan offer out there for the purchase of the main street property of 1000 BTC for immediate purchase &amp; payback with base interest rate of 15% on the 1000 BTC - giving 1150 BTC payback in 5 years or equivalent in USD value of equity in the corporation we are creating to be listed on the NYSE. When that loan contract is fulfilled by someone there will be another 1000 BTC loan contact available within 7 days for someone else to bid on. The bidding price will be based on a lower competitive interest rate and this will be done Over The Counter through personal communications.</p>\n\n<p>We require an immediate range of 7000-10000 BTC to build the entire region into a fully functional Blockchain based industry zone. This will be self sustaining in regards to energy consumption &amp; economic production. A am building partnerships with many smart people, strong businesses and influencers in industry to get these goals accomplished. I need the lending community, the Bitcoin community, the cryptocurrency communities to help make Blockchain Valley become a reality.</p>\n\n<p><strong>Anyone up for that offer? It would be able to change the world if you can contact me &amp; send me that I have contracts ready and waiting.</strong></p>\n\n<ul>\n<li><p>We are in the process of filing with the SEC &amp; NYSE to issue the countries first REAL Bitcoin IPO on wall street.</p></li>\n<li><p>I have personally acquired a 3000+ sqft $200,000 gas station/garage to move Bitcoin Kinetics into a more productive environment.</p></li>\n<li><p>On the main street in an empty, no industry town, that has lost its only industry &amp; now needs a new one.</p></li>\n</ul>\n\n<p>This is where the future begins.</p>\n\n<p><strong>Along side that move a NEW company is created, to compete with the likes of Google, Apple, GE, Visa &amp; CHASE. It will be called &quot;KINETICS Inc&quot;.</strong></p>\n\n<p><strong>Kinetics - Blockchain, Automation &amp; Energy</strong> <a href=\"http://www.Kinetics.cc\">www.Kinetics.cc</a></p>\n\n<p>KINETICS is facilitator of several Bitcoin &amp; Blockchain projects including:</p>\n\n<ul>\n<li>General Bitcoin</li>\n<li>Bitcoin Kinetics</li>\n<li>Bitcoin Petroleum</li>\n<li>The Bitcoin Academy</li>\n<li>Bitcoin Bootcamp</li>\n<li>CoinSheriff / CoinEnforce</li>\n<li>Axiomity</li>\n<li>BitCongress</li>\n<li>Coincanna</li>\n<li>US Cryptobank</li>\n<li>OEX.cc</li>\n<li>Bitcoin H20</li>\n<li></li>\n<li>and much more...</li>\n</ul>\n\n<p>KINETICS is going to be incorporated in Delaware as a C Corporation. The fully functional business such as #BitcoinKinetics, #BitcoinAcademy &amp; #Axiomity will be managed, funded and operated by KINETICS Inc.</p>\n\n<p>KINETICS Inc &amp; Bitcoin Kinetics Inc will both be located at our new shop in Upper Lake, CA in Lake County.</p>\n\n<p><strong>9450 Main St, Upper Lake, CA 95485</strong></p>\n\n<p>This buildings rent is $800 per month, to be reduced from $200,000 price for full cash purchase of property. I have plans to purchase the entire building full cash in the next 90 days, until then i&#39;m moving in 7/13/2014 SUN &amp; paying rent to own for 90 days. I have been told I can purchase the entire block including over 20 different store fronts, garages, a bank, a post office, a saloon, a large antique shop, several window display store front shops and even large areas of land for crypto mining data centers, fields of solar panels &amp; wind generators, as well as the fact that all of California&#39;s fresh water is within 2000 yards of the building in several lakes. There is over 100,000 sq ft of empty store &amp; office spaces on the main street. All of it has been personally offered to me.</p>\n\n<ul>\n<li>This Town NEEDS YOU, ME &amp; ALL OF US Bitcoin community.</li>\n</ul>\n\n<p>We are committed to partnering with #TeslaMotors to convert the old gas station into a Tesla Super Charger Station equipped with SuperChargers, solar power &amp; a lounge to busy the drivers as they charge their vehicle. We will be creating a Bitcoin ATM friendly lounge where customers can purchase all things Bitcoin, Hardware &amp; even use Bitcoins at all the local shops. Ill be putting <a href=\"http://www.CryptoCrates.com\">www.CryptoCrates.com</a> in one of the shops on the block giving the worlds first Bitcoin Record Store a physical location.</p>\n\n<p>There are now many possibilities with this HUGE opportunity here before us all. We are in talks with #Ethereum and several lenders, venture capitalists, bankers &amp; Bitcoin investors to make this dream of a physical Bitcoin world a reality. We can turn Upper Lake into the start of what will be the home of #BitcoinTOWN, a place where all Bitcoin Business will want to come and have their offices. Eventually growing into a &quot;#BlockchainValley&quot;</p>\n\n<p>There is so much money involved &amp; needed for this long term 100 year plan, In the next 10 years up to 10,000 BTC will be needed to pay: </p>\n\n<ul>\n<li>materials</li>\n<li>taxes, </li>\n<li>utilities, </li>\n<li>payroll for up to 2000 new employees, </li>\n<li>purchase more buildings to give to the Bitcoin Community, </li>\n<li>pay for licensing, contacts, </li>\n<li>down payments for construction teams, </li>\n<li>graphic design, marketing, </li>\n<li>advertisement &amp; PR materials, </li>\n<li>SEC &amp; NYSE filings will have many fees &amp; collected costs, </li>\n<li>inventory must be expanded rapidly in many areas to allow services, products &amp; customers to flock to the new town.</li>\n</ul>\n\n<p><strong>If you build it, they will come.</strong></p>\n\n<p>There is much to be done, its is all the start of jobs, money &amp; Bitcoins value going to the moon. Building something in the real world with Bitcoins lending technology.</p>\n\n<p>I have over 15 years of construction, civil engineering, electrical engineering &amp; business development. I am the best human on earth to get this mission accomplished and to get the job done. We are in a state ware Bitcoin is now legal tender, the time is NOW. I can make everything happen, i talk well, i don&#39;t sleep and work non stop until the goal is reached, i have networked with everyone from the rich to the poor, to the entire Bitcoin community. This is an opportunity to be within 1 1/2 hours of San Francisco and 2 hours from Sacramento. This deal with Tesla Motors gives me the ONLY charging station in this North California region giving the loop from San Francisco, Mendocino, &amp; The i5 to Sacramento a complete loop allowing the Tesla vehicles to travel up into the Forest Area. This will bring HUGE revenue, HUGE partnerships &amp; many many new Bitcoin users and Kinetics customers will all be flocking up from San Francisco to the new land of Bitcoin...</p>\n\n<p><strong>All of you should help us and ill personally make you a very rich Bitcoiner, and you will save the world from fiat, from centralization &amp; from tyranny...</strong></p>\n\n<ul>\n<li>I personally dont WANT or need money, im a minimalist.</li>\n<li>I DO want to give everyone a Bitcoin paying job, thats my passion &amp; my goal in the end.</li>\n<li>I DO own the first historic Gas Station on the main street, soon to be Tesla Charging Station</li>\n<li>I DO own pretty much the main street soon as I have a few $100-500K USD</li>\n<li>I have been committed to working on <a href=\"http://www.BitCongress.org\">www.BitCongress.org</a> to help democracy &amp; voting, it needs a home!</li>\n<li>I have created over 50 BitSwitch Units for Bitcoin Kinetics Inc to allow any machine to accept Bitcoin directly.</li>\n<li>I have successfully funded the first Bitcoin Corporation in California from the ground up using nothing but Bitcoins.</li>\n<li>I DO have equipment, 3D Printers, Arduino, Raspberry Pi, Tools, Materials, Washing Machines Parking Meters, CNC, Mill</li>\n<li>I DO have up to 30 people in hand ready to build, work and get paid in Bitcoin to buid Bitcoin machines.</li>\n<li>I DO have millions of dollars of resources at my access in both Lake County, Mendocino County &amp; Sanoma County.</li>\n<li>I have communicated with people from Tesla, Virgin, BitPay, Goldman Sachs, USPS, Treasury, DHS, &amp; the SEC</li>\n<li>I Am MOVING into the new building on SUNDAY 7/13/2014</li>\n</ul>\n\n<p>To purchase the main street property only need <strong>1000 BTC</strong> as soon as possible with 1150 BTC payed back in 5 Years. That is a 15% payback on a 1000 BTC loan that can be bid on by lenders If you can even participate in this loan in fractions, partial or full, please contact us ASAP as moves need to be made immediately. This allows us to acquire the main drag of Main Street, Upper Lake, CA and all of its shops.</p>\n\n<p>We will convert it into a Solar Roadway/SolarCity filled block, with Bitcoin ATMs on every corner, Bitcoin Laundromats, Bitcoin Bank, Bitcoin Friendly Shops, A Blockchain Node in every business, A Tesla Charging Station right in front of the 1920s original Gas Station, a Restaurant Called Satoshi&#39;s Grill, with 5 star Chefs already ready to join the team, a record and music shop that takes all crypto currency, The Bitcoin Academy giving a local education center for all to access the newest information, technologies and educators, a Coffee shop friendly to all things Bitcoin &amp; The Blockchain, giving rise to Bitcoin Gift card usage, lounge environment with data center tools. The entire town will have a 4G tower system with the first going behind the Gas Station in the yard &amp; FREE WIFI, LIFI &amp; MESH networking covering the entire area.</p>\n\n<p><strong>We ask you the #Bitcoin Community for funding before we ever ask a Banker, so please help us before we are forced to go ask Goldman Sachs for fiat... The community can gather 1, 10, 100, 1000 or 10000 Bitcoins to make Bitcoin usable in all machines. As a loan of 15% would be very helpful to us and to you in circulating Bitcoin &amp; funding this community venture.</strong></p>\n\n<p>Contact us if you are willing to support this new venture as time is of the essence, moves need to be made NOW, and your Bitcoin&#39;s future depends on people like us &amp; you giving Bitcoin real world use. Help us bring the future into the now...</p>\n\n<p><strong>THE BITCOIN TOWN / BLOCKCHAIN VALLEY PLAN</strong></p>\n\n<ul>\n<li>PHASE 1, Purchase &amp; Acquire the Main Street Buildings.</li>\n<li>PHASE 2, Modify Town Power, Communications &amp; Energy Usage</li>\n<li>PHASE 3, Create New City Plan With Sheriff, Mayor, City Council &amp; Locals</li>\n<li>PHASE 4, Create, License, Employ, Inventory &amp; Market New Businesses</li>\n<li>PHASE 5, Purchase &amp; Acquire Surrounding Land for Clean Energy Production</li>\n<li>PHASE 6, Build Housing, Corporate Offices, Hotels, Vacation Rentals</li>\n<li>PHASE 7, Advertise Town In San Francisco, Sacramento &amp; Silicon Valley</li>\n<li>PHASE 8, Create Indoor Aquaponic Towers For Plants, Chickens &amp; Fish</li>\n<li>PHASE 9, Create Farmers Market, Blockchain Block Party Fair, BitFest!</li>\n<li>PHASE 10, Build Automated Transportation Systems To Cities Down South</li>\n</ul>\n\n<p>These <em>10 Phases</em> will take money, people, passion and motivation. Time will only get in the way if you don&#39;t become involved with both your Bitcoin, Your Mind, &amp; Your Sweat, Blood &amp; Tears. We will help make this a reality, but first comes capital, participants &amp; the plan. We are all here to help grow into a better world, Bitcoin gives us that last chance for humanity to stand up and shake off its slack. If we can come together and show the world how this technology works in the real world, the planet will see, it will feel, it will hear and know Bitcoin as reality. Over night the world can change if we put out foot down, take a stand, and create the world as we see it to be. People are at war, starving and suffering in the most horrible ways, all I personally can do is fight the good fight with Bitcoin in my hand, there is a chance now for us to have sanctuary and a place to build our plan of attack from. We now have shelter, not just for Kinetics, but for the entire Bitcoin community of users, businesses &amp; investors. You all now will have a safe and friendly place to live, work, shop, learn and grow...</p>\n\n<p>I thank you for your time and your care for the world. Thank You.</p>\n\n<p><strong>MORGAN ROCKWELL</strong></p>\n\n<ul>\n<li><p>You can send any BTC / Bitcoin to this address for Kinetics Inc Seed Funding\nPlease Send Me ALL CONTACT INFORMATION if you send us any Bitcoin.</p></li>\n<li><p>THANK YOU</p></li>\n<li><p><a href=\"https://blockchain.info/address/1LgZHt6Ug4iPnafMCDh4euDdVco5qoCor5\">https://blockchain.info/address/1LgZHt6Ug4iPnafMCDh4euDdVco5qoCor5</a></p></li>\n<li><p>1LgZHt6Ug4iPnafMCDh4euDdVco5qoCor5</p></li>\n</ul>\n\n<p>Lets get this ball rolling now...Time is running out...</p>\n\n<hr/>\n\n<p><strong>Learn More About Me, Who I Am, What Im About, Bitcoin Kinetics Inc &amp; The Future Im Creating:</strong></p>\n\n<ul>\n<li><a href=\"https://www.linkedin.com/in/bitcoinkinetics\">https://www.linkedin.com/in/bitcoinkinetics</a> (RESUME)</li>\n<li><a href=\"https://soundcloud.com/metaballo\">https://soundcloud.com/metaballo</a> (MUSIC)</li>\n<li><a href=\"https://myspace.com/metab\">https://myspace.com/metab</a> (MUSIC)</li>\n<li><a href=\"https://localbitcoins.com/accounts/profile/Metaballo/\">https://localbitcoins.com/accounts/profile/Metaballo/</a> (MY BITCOIN TRADES)</li>\n<li><a href=\"https://www.youtube.com/user/TheREALMetaballo\">https://www.youtube.com/user/TheREALMetaballo</a> (My VIDEO/MUSIC ART)</li>\n<li><a href=\"https://www.youtube.com/watch?v=B5zyjDUW8Hk\">https://www.youtube.com/watch?v=B5zyjDUW8Hk</a> (ADAM vs THE MAN Interview)</li>\n<li><a href=\"https://www.youtube.com/watch?v=V319im1M0nE\">https://www.youtube.com/watch?v=V319im1M0nE</a> ( Lets Talk Bitcoin Interview)</li>\n</ul>\n\n<p><strong>Morgan Rockwell - CEO</strong></p>\n\n<ul>\n<li>Bitcoin Kinetics Inc <a href=\"http://www.BitcoinKinetics.cc/\">http://www.BitcoinKinetics.cc/</a></li>\n<li>Kinetics - Blockchain, Automation &amp; Energy <a href=\"http://www.Kinetics.cc\">http://www.Kinetics.cc</a></li>\n<li><p><a href=\"https://www.facebook.com/KineticsCO\">https://www.facebook.com/KineticsCO</a></p></li>\n<li><p>+0016197213384</p></li>\n<li><p>9450 Main Street, Upper Lake, CA 95485</p></li>\n</ul>\n</div><!-- SC_ON -->",
  "subreddit_id": "t5_3075r",
  "archived": true,
  "domain": "self.BitcoinKinetics",
  "clicked": false,
  "score": 5,
  "id": "2aj2ox",
  "stickied": false,
  "media_embed": {},
  "visited": false,
  "selftext": "**PROJECT BLOCKCHAIN VALLEY**\n\nMy name is Morgan Rockwell, I am CEO of Bitcoin Kinetics Inc. Now founder of Kinetics - Blockchain, Automation & Energy. I created the first Bitcoin Operated Service Machine to allow Bitcoin to be used in the real world in all machines & businesses. We are rapidly expanding & growing into new territories, industries and concepts to help build the Bitcoin & Blockchain based industries into a competitive & profitable environment. We have began the process of issuing equity on the NYSE in New York City. We have purchased a new building to house the buildings office & factory. We have made several partnerships with many Bitcoin Business Leaders, Ethereum, Micro-controller & Chip Makers, DIY companies and many more important players in the new technology industries. We now need your help before we are forced to ask help from the banking sector, tyrants or billionaires..\n\nWe now need 10000 Bitcoins to create the greatest Bitcoin Based Economy the world will ever see, including the first Bitcoin Town... Ill give you keys to the company, all of the equity, I do not want a dollar. \n\nThere will be always be a loan offer out there for the purchase of the main street property of 1000 BTC for immediate purchase & payback with base interest rate of 15% on the 1000 BTC - giving 1150 BTC payback in 5 years or equivalent in USD value of equity in the corporation we are creating to be listed on the NYSE. When that loan contract is fulfilled by someone there will be another 1000 BTC loan contact available within 7 days for someone else to bid on. The bidding price will be based on a lower competitive interest rate and this will be done Over The Counter through personal communications.\n\nWe require an immediate range of 7000-10000 BTC to build the entire region into a fully functional Blockchain based industry zone. This will be self sustaining in regards to energy consumption & economic production. A am building partnerships with many smart people, strong businesses and influencers in industry to get these goals accomplished. I need the lending community, the Bitcoin community, the cryptocurrency communities to help make Blockchain Valley become a reality.\n\n**Anyone up for that offer? It would be able to change the world if you can contact me & send me that I have contracts ready and waiting.**\n\n* We are in the process of filing with the SEC & NYSE to issue the countries first REAL Bitcoin IPO on wall street.\n\n* I have personally acquired a 3000+ sqft $200,000 gas station/garage to move Bitcoin Kinetics into a more productive environment.\n\n* On the main street in an empty, no industry town, that has lost its only industry & now needs a new one.\n\nThis is where the future begins.\n\n**Along side that move a NEW company is created, to compete with the likes of Google, Apple, GE, Visa & CHASE. It will be called \"KINETICS Inc\".**\n\n**Kinetics - Blockchain, Automation & Energy** www.Kinetics.cc\n\nKINETICS is facilitator of several Bitcoin & Blockchain projects including:\n\n* General Bitcoin\n* Bitcoin Kinetics\n* Bitcoin Petroleum\n* The Bitcoin Academy\n* Bitcoin Bootcamp\n* CoinSheriff / CoinEnforce\n* Axiomity\n* BitCongress\n* Coincanna\n* US Cryptobank\n* OEX.cc\n* Bitcoin H20\n* \n* and much more...\n\nKINETICS is going to be incorporated in Delaware as a C Corporation. The fully functional business such as #BitcoinKinetics, #BitcoinAcademy & #Axiomity will be managed, funded and operated by KINETICS Inc.\n\nKINETICS Inc & Bitcoin Kinetics Inc will both be located at our new shop in Upper Lake, CA in Lake County.\n\n**9450 Main St, Upper Lake, CA 95485**\n\nThis buildings rent is $800 per month, to be reduced from $200,000 price for full cash purchase of property. I have plans to purchase the entire building full cash in the next 90 days, until then i'm moving in 7/13/2014 SUN & paying rent to own for 90 days. I have been told I can purchase the entire block including over 20 different store fronts, garages, a bank, a post office, a saloon, a large antique shop, several window display store front shops and even large areas of land for crypto mining data centers, fields of solar panels & wind generators, as well as the fact that all of California's fresh water is within 2000 yards of the building in several lakes. There is over 100,000 sq ft of empty store & office spaces on the main street. All of it has been personally offered to me.\n\n* This Town NEEDS YOU, ME & ALL OF US Bitcoin community.\n\nWe are committed to partnering with #TeslaMotors to convert the old gas station into a Tesla Super Charger Station equipped with SuperChargers, solar power & a lounge to busy the drivers as they charge their vehicle. We will be creating a Bitcoin ATM friendly lounge where customers can purchase all things Bitcoin, Hardware & even use Bitcoins at all the local shops. Ill be putting www.CryptoCrates.com in one of the shops on the block giving the worlds first Bitcoin Record Store a physical location.\n\nThere are now many possibilities with this HUGE opportunity here before us all. We are in talks with #Ethereum and several lenders, venture capitalists, bankers & Bitcoin investors to make this dream of a physical Bitcoin world a reality. We can turn Upper Lake into the start of what will be the home of #BitcoinTOWN, a place where all Bitcoin Business will want to come and have their offices. Eventually growing into a \"#BlockchainValley\"\n\nThere is so much money involved & needed for this long term 100 year plan, In the next 10 years up to 10,000 BTC will be needed to pay: \n\n* materials\n* taxes, \n* utilities, \n* payroll for up to 2000 new employees, \n* purchase more buildings to give to the Bitcoin Community, \n* pay for licensing, contacts, \n* down payments for construction teams, \n* graphic design, marketing, \n* advertisement & PR materials, \n* SEC & NYSE filings will have many fees & collected costs, \n* inventory must be expanded rapidly in many areas to allow services, products & customers to flock to the new town.\n\n**If you build it, they will come.**\n\nThere is much to be done, its is all the start of jobs, money & Bitcoins value going to the moon. Building something in the real world with Bitcoins lending technology.\n\nI have over 15 years of construction, civil engineering, electrical engineering & business development. I am the best human on earth to get this mission accomplished and to get the job done. We are in a state ware Bitcoin is now legal tender, the time is NOW. I can make everything happen, i talk well, i don't sleep and work non stop until the goal is reached, i have networked with everyone from the rich to the poor, to the entire Bitcoin community. This is an opportunity to be within 1 1/2 hours of San Francisco and 2 hours from Sacramento. This deal with Tesla Motors gives me the ONLY charging station in this North California region giving the loop from San Francisco, Mendocino, & The i5 to Sacramento a complete loop allowing the Tesla vehicles to travel up into the Forest Area. This will bring HUGE revenue, HUGE partnerships & many many new Bitcoin users and Kinetics customers will all be flocking up from San Francisco to the new land of Bitcoin...\n\n**All of you should help us and ill personally make you a very rich Bitcoiner, and you will save the world from fiat, from centralization & from tyranny...**\n\n* I personally dont WANT or need money, im a minimalist.\n* I DO want to give everyone a Bitcoin paying job, thats my passion & my goal in the end.\n* I DO own the first historic Gas Station on the main street, soon to be Tesla Charging Station\n* I DO own pretty much the main street soon as I have a few $100-500K USD\n* I have been committed to working on www.BitCongress.org to help democracy & voting, it needs a home!\n* I have created over 50 BitSwitch Units for Bitcoin Kinetics Inc to allow any machine to accept Bitcoin directly.\n* I have successfully funded the first Bitcoin Corporation in California from the ground up using nothing but Bitcoins.\n* I DO have equipment, 3D Printers, Arduino, Raspberry Pi, Tools, Materials, Washing Machines Parking Meters, CNC, Mill\n* I DO have up to 30 people in hand ready to build, work and get paid in Bitcoin to buid Bitcoin machines.\n* I DO have millions of dollars of resources at my access in both Lake County, Mendocino County & Sanoma County.\n* I have communicated with people from Tesla, Virgin, BitPay, Goldman Sachs, USPS, Treasury, DHS, & the SEC\n* I Am MOVING into the new building on SUNDAY 7/13/2014\n\nTo purchase the main street property only need **1000 BTC** as soon as possible with 1150 BTC payed back in 5 Years. That is a 15% payback on a 1000 BTC loan that can be bid on by lenders If you can even participate in this loan in fractions, partial or full, please contact us ASAP as moves need to be made immediately. This allows us to acquire the main drag of Main Street, Upper Lake, CA and all of its shops.\n\nWe will convert it into a Solar Roadway/SolarCity filled block, with Bitcoin ATMs on every corner, Bitcoin Laundromats, Bitcoin Bank, Bitcoin Friendly Shops, A Blockchain Node in every business, A Tesla Charging Station right in front of the 1920s original Gas Station, a Restaurant Called Satoshi's Grill, with 5 star Chefs already ready to join the team, a record and music shop that takes all crypto currency, The Bitcoin Academy giving a local education center for all to access the newest information, technologies and educators, a Coffee shop friendly to all things Bitcoin & The Blockchain, giving rise to Bitcoin Gift card usage, lounge environment with data center tools. The entire town will have a 4G tower system with the first going behind the Gas Station in the yard & FREE WIFI, LIFI & MESH networking covering the entire area.\n\n**We ask you the #Bitcoin Community for funding before we ever ask a Banker, so please help us before we are forced to go ask Goldman Sachs for fiat... The community can gather 1, 10, 100, 1000 or 10000 Bitcoins to make Bitcoin usable in all machines. As a loan of 15% would be very helpful to us and to you in circulating Bitcoin & funding this community venture.**\n\nContact us if you are willing to support this new venture as time is of the essence, moves need to be made NOW, and your Bitcoin's future depends on people like us & you giving Bitcoin real world use. Help us bring the future into the now...\n\n**THE BITCOIN TOWN / BLOCKCHAIN VALLEY PLAN**\n\n* PHASE 1, Purchase & Acquire the Main Street Buildings.\n* PHASE 2, Modify Town Power, Communications & Energy Usage\n* PHASE 3, Create New City Plan With Sheriff, Mayor, City Council & Locals\n* PHASE 4, Create, License, Employ, Inventory & Market New Businesses\n* PHASE 5, Purchase & Acquire Surrounding Land for Clean Energy Production\n* PHASE 6, Build Housing, Corporate Offices, Hotels, Vacation Rentals\n* PHASE 7, Advertise Town In San Francisco, Sacramento & Silicon Valley\n* PHASE 8, Create Indoor Aquaponic Towers For Plants, Chickens & Fish\n* PHASE 9, Create Farmers Market, Blockchain Block Party Fair, BitFest!\n* PHASE 10, Build Automated Transportation Systems To Cities Down South\n\nThese *10 Phases* will take money, people, passion and motivation. Time will only get in the way if you don't become involved with both your Bitcoin, Your Mind, & Your Sweat, Blood & Tears. We will help make this a reality, but first comes capital, participants & the plan. We are all here to help grow into a better world, Bitcoin gives us that last chance for humanity to stand up and shake off its slack. If we can come together and show the world how this technology works in the real world, the planet will see, it will feel, it will hear and know Bitcoin as reality. Over night the world can change if we put out foot down, take a stand, and create the world as we see it to be. People are at war, starving and suffering in the most horrible ways, all I personally can do is fight the good fight with Bitcoin in my hand, there is a chance now for us to have sanctuary and a place to build our plan of attack from. We now have shelter, not just for Kinetics, but for the entire Bitcoin community of users, businesses & investors. You all now will have a safe and friendly place to live, work, shop, learn and grow...\n\nI thank you for your time and your care for the world. Thank You.\n\n**MORGAN ROCKWELL**\n\n* You can send any BTC / Bitcoin to this address for Kinetics Inc Seed Funding\nPlease Send Me ALL CONTACT INFORMATION if you send us any Bitcoin.\n\n* THANK YOU\n\n* https://blockchain.info/address/1LgZHt6Ug4iPnafMCDh4euDdVco5qoCor5\n\n* 1LgZHt6Ug4iPnafMCDh4euDdVco5qoCor5\n\nLets get this ball rolling now...Time is running out...\n\n_________\n\n**Learn More About Me, Who I Am, What Im About, Bitcoin Kinetics Inc & The Future Im Creating:**\n\n* https://www.linkedin.com/in/bitcoinkinetics (RESUME)\n* https://soundcloud.com/metaballo (MUSIC)\n* https://myspace.com/metab (MUSIC)\n* https://localbitcoins.com/accounts/profile/Metaballo/ (MY BITCOIN TRADES)\n* https://www.youtube.com/user/TheREALMetaballo (My VIDEO/MUSIC ART)\n* https://www.youtube.com/watch?v=B5zyjDUW8Hk (ADAM vs THE MAN Interview)\n* https://www.youtube.com/watch?v=V319im1M0nE ( Lets Talk Bitcoin Interview)\n\n**Morgan Rockwell - CEO**\n\n* Bitcoin Kinetics Inc http://www.BitcoinKinetics.cc/\n* Kinetics - Blockchain, Automation & Energy http://www.Kinetics.cc\n* https://www.facebook.com/KineticsCO\n\n* +0016197213384\n\n* 9450 Main Street, Upper Lake, CA 95485",
  "hide_score": false,
  "_api_link": "https://api.reddit.com/r/BitcoinKinetics/comments/2aj2ox/project_blockchain_valley/?ref=search_posts",
  "locked": false,
  "edited": 1406327837.0,
  "title": "Project Blockchain Valley",
  "created": 1405196502.0,
  "_comments_by_id": {}
}