{
  "downs": 0,
  "mod_reports": [],
  "secure_media_embed": {},
  "_info_url": "https://api.reddit.com/api/info/",
  "gilded": 0,
  "num_comments": 18,
  "_orphaned": {},
  "hidden": false,
  "ups": 24,
  "url": "https://www.reddit.com/r/NASCAR/comments/2ttaee/26_days_until_the_daytona_500/",
  "_has_fetched": true,
  "quarantine": false,
  "name": "t3_2ttaee",
  "author_flair_text": "/r/NASCAR Historian",
  "user_reports": [],
  "saved": false,
  "permalink": "https://www.reddit.com/r/NASCAR/comments/2ttaee/26_days_until_the_daytona_500/?ref=search_posts",
  "over_18": false,
  "is_self": true,
  "_params": {},
  "thumbnail": "self",
  "created_utc": 1422338078.0,
  "_replaced_more": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Sorry I&#39;m a bit late posting tonight, I spent today, er... yesterday, prepping for Winter Storm Juno and doing a lot of homework (because in Grad School &quot;Snow Day&quot; and &quot;Work Day&quot; mean the same thing).</p>\n\n<p>In Sprint Cup Series competition the #26 car has started 1075 races and has 22 wins, 36 poles, 116 top 5s, 259 top 10s, and 369 DNFs. </p>\n\n<ul>\n<li><p><a href=\"http://cyberwombat.com/images/nascar/buick/1987/26_bodine_1990.jpg\">Brett Bodine</a> has the most starts in #26 with 147 from 1990-1994 including Brett’s only career win. Driving the #26 Quaker State Buick Regal for champion drag racer Kenny Bernstein, Bodine won his first race at <a href=\"https://www.youtube.com/watch?v=mtm4MsKItqU\">North Wilkesboro Speedway</a>, which came under some controversy. During a long 17-lap caution flag, scoring was mixed up, and some felt that Darrell Waltrip was robbed of the win because of the error. It was found that Waltrip was up front but by the time it was clear that Waltrip won, Bodine had already been declared the winner officially. When Waltrip protested Bill France said &quot;You leave this kid alone DW...it is his first win and you will win more races.&quot; The win stood, and before the season was over, Bodine had won his first pole position at the fall event at Charlotte Motor Speedway and was 12th in the championship standings. Bodine wasn&#39;t able to equal his 1990 effort, and parted ways with Bernstein after the 1994 season. Sprint Car Champion <a href=\"http://api.ning.com/files/ntM8gSusREnUCJU85g7iaUY2RIkRVGAfogxYYHEjY4Jy6JoyguRr1JkI68izHpAbmIR-0BoZ*uUxdcI-Yl9G23Wxf9BoSU1V/SteveKinser.jpg\">Steve Kinser</a> was hired to replace Bodine in 1995, but after only 5 races was replaced by <a href=\"http://i.imgur.com/AhUtjnw.jpg\">Hut Stricklin</a> for the remainder of the year.</p></li>\n<li><p><a href=\"http://www.pyramidracing.com/contents/media/2009-mcmurray-talladega.jpg\">Jamie McMurray</a> started #26 144 times between 2006-2009 including 2 wins. After leaving Ganassi Racing following 2005, McMurray was originally to go to the #6 Ford in 2006, but since Mark Martin announced he would race for another year, McMurray instead took over for Kurt Busch in the #97 Crown Royal/IRWIN Tools Ford (which was then renumbered #26). 2006 was a hard season for McMurray. McMurray&#39;s best finish of the 2006 season came at Dover International Speedway, where he finished second after leading the most laps. McMurray would record three top fives, seven top tens and finish a disappointing 25th in points.</p>\n\n<p>On June 22, 2007, he won his third career Cup pole, for the Toyota Save/Mart 350. On lap 1, he was passed by Robby Gordon. With about 45 laps left, McMurray took the lead and dominated the final laps, but with 7 to go Cup rookie and his future teammate Juan Pablo Montoya passed him and held him off until McMurray eventually ran out of gas with 2 to go and resulted 37th. On July 7 at the Pepsi 400, McMurray led a few laps in the first stages. However, on lap 30, McMurray was then black-flagged by NASCAR for slipping out of bounds. He then spent the rest of the race charging back through the field eventually getting back to the front on lap 155. McMurray then led the final stages but battled Kyle Busch for five laps. On the last lap, Busch was the leader next to McMurray and charged to the finish, but at the last second, McMurray charged one last time and barely beat Busch to <a href=\"http://youtu.be/-U2Bkw-mscc?t=4m31s\">win the Pepsi 400</a> for his second career Cup win. The margin was 0.005 of a second, and the finish resembled the Daytona 500 of the year&#39;s finish when Kevin Harvick beat Mark Martin at the last second of the race that year. The <a href=\"http://www.gannett-cdn.com/-mm-/d841160ad1aef11bc8b030336d89ab891585d9f6/c=0-1081-2553-3000&amp;r=x404&amp;c=534x401/local/-/media/USATODAY/USATODAY/2014/07/05/1404582019000-IB05-NASCAR-09.jpg\">photo finish</a> was the closest in Daytona International Speedway history and tied for the second closest finish (1993 DieHard 500) since the advent of electronic scoring in 1993. McMurray finished the year 17th in the point standings.</p>\n\n<p>In the beginning of the 2008 season, McMurray encountered a string of poor finishes that relegated him to 36th in points and thus not guaranteed a spot when NASCAR reached the spring Martinsville race. McMurray finished 16th in the standings. On November 1, 2009, McMurray won the AMP Energy 500 at <a href=\"https://www.youtube.com/watch?v=cmv6ya6dl1c\">Talladega</a> after leading over 20 laps and passing David Stremme with 8 laps to go. He then survived a green-white checkered finish to earn his second restrictor-plate win. Roush released him and the #26 team at the end of the season due to NASCAR&#39;s four team limit and the expiration of Roush Fenway Racing&#39;s exemption that allowed a 5th team. McMurray decided to ask former boss Chip Ganassi for another chance following his disastrous era on Roush-Fenway Racing and Ganassi granted him a contract to let him drive the #1 car for his merged team with Dale Earnhardt Inc., Earnhardt Ganassi Racing.</p></li>\n<li><p><a href=\"http://api.ning.com/files/8bhwoUnh34DbT1I07mTjL-NnbXJobr9CUBYoEpcMM0bTkKTSHMUsXUzwsaemqLNe/Image29.jpg\">Earl Brooks</a> started #26 109 times from 1962-1973. As one of the earliest professionals of any sport, he played the game simply to feed his family and to be a breadwinner to his family. Brooks never had the money or the time attract corporate sponsors for his racing team. His &quot;second job&quot; was being a mechanic for a garage on Lynchburg&#39;s Mayflower Drive; where he worked from Monday to Friday to pay off any bills that NASCAR couldn&#39;t help with. In the summertime, Earl would wear sandals while racing; something that would eventually become banned as NASCAR became more safety conscious. Like any other driver who raced during the formative years of NASCAR, Brooks was a humble man who would sometime race for meager &quot;awards&quot; like a block of cheese or a tin of crackers to eat for a snack after the race. While Richard Petty and David Pearson could buy new parts for their vehicles through their corporate sponsors spending money like there was no tomorrow, Earl had to scrounge around for vehicle components. Due to Brooks being unable to win a race in the NASCAR Cup Series, he is ineligible for the NASCAR Hall of Fame.</p></li>\n<li><p><a href=\"http://images51.fotki.com/v423/photos/6/61479/1127389/26KMart2001refa-vi.jpg\">Jimmy Spencer</a> drove #26 for 70 starts from 2000-2001. After a 20th-place finish in 1999, Winston left the Travis Carter #23 team, and Kmart became the team&#39;s new sponsor, causing Spencer to switch to the #26 to accommodate the new sponsor, who was already backing the #66 car driven by Spencer&#39;s teammate, Darrell Waltrip. Spencer had two top-fives and in 2001 won the pole positions at Indianapolis Motor Speedway and Lowe&#39;s Motor Speedway and advanced to sixteenth in points. He departed the team at the end of the season.</p></li>\n<li><p><a href=\"http://www.modelroundup.com/v/vspfiles/photos/RMX-2553-2.jpg\">Johnny Benson Jr.</a> drove the Roush Racing #26 General Mills/Cheerios Ford Taurus in 66 races in the 1998 &amp; 1999 seasons.  In1998, he missed the season opening Daytona 500, then finished 30th at the following race. He then had a streak of no finishes worse than ninth over the next five races and rose as high as tenth in points, before he finished 38th and 41st in the next two races. For the rest of the season, his best finish was ninth and he qualified no higher than second. He finished 20th in points. Benson had numerous crew chiefs in 1999. He had two top 10 finishes and finished 28th in the final standings. After a long negotiation, he was able to buy out his contract and announced he would leave Roush.</p></li>\n<li><p><a href=\"http://cyberwombat.com/images/nascar/buick/1991/ruddy.jpg\">Ricky Rudd</a> earned 2 wins in his 58 starts from 1988-1989. Rudd joined King Racing beginning in <a href=\"https://www.youtube.com/watch?v=mvghIVOwog8\">1988</a> in the #26 Quaker State Buick Regal owned by Kenny Bernstein. He struggled with engine failures all season long and finished 11th in the standings, his worst points finish in eight years. After his only win of 1989, which came at the inaugural <a href=\"http://youtu.be/MCIeGYN_bTM?t=3m53s\">Sears Point</a> event, Rudd departed the operation, and in 1990 he signed with Hendrick Motorsports to drive the #5 Levi Garrett Chevrolet Lumina.</p></li>\n<li><p><a href=\"http://www.nationalspeedsportnews.com/wp-content/uploads/2014/10/N-DB1-1963-3-5.jpg\">Junior Johnson</a> raced his #26 car 40 times from 1963-1966 including 12 wins. As an owner Johnson fielded the #26 with many of the sport’s great names like <a href=\"http://www.macsmotorcitygarage.com/wp-content/uploads/2013/01/26-Fred-Lorenzen-66-Ford-.jpg\">Fred Lorenzon</a>, <a href=\"http://images109.fotki.com/v142/photos/6/88566/7288521/26vi-vi.jpg\">Curtis Turner</a>, <a href=\"http://images15.fotki.com/v588/photos/6/88566/7288521/266vi-vi.jpg\">Bobby Isaac</a>, <a href=\"http://www.notinhalloffame.com/UserFiles/Image/article_images/Nascar/NASCAR%2036%20Darel%20Dieringer.jpg\">Darel Dieringer</a> and <a href=\"http://i280.photobucket.com/albums/kk171/crabber1967/Facebook/Lee%20Roy%20Yarbrough%20NASCARs%20Tragic%20Hero/535663_10151694923245261_255918475_n.jpg\">LeeRoy Yarbrough</a>. </p></li>\n<li><p>In 2014 <a href=\"http://www2.pictures.zimbio.com/gi/Cole+Whitt+Las+Vegas+Motor+Speedway+Day+2+YTl1rk8gwYnl.jpg\">Cole Whitt</a> started all 36 races for Swan Racing. Whitt will not return in 2015 as he moves to the #35 of Front Row Motorsports.</p></li>\n<li><p><a href=\"http://i.imgur.com/Mhied0Z.jpg\">Dave Terrell</a> started 34 races in #26 from 1953-1954. He drove #26 in exactly half of his career starts. </p></li>\n<li><p><a href=\"http://api.ning.com/files/0KeYXF-63DMDUbZof0FmfjpMHiRcdw7Vdf*5MAM*aforZ68q*RomhcATIR9BSTgZsQn7zJuspDmAPOEpVHz8AmOyw*vvDsYd/26JoeRuttman1986TheBudweiserattheGlen.jpg\">Joe Ruttman</a> drove the Kenny Bernstein #26 in 29 races during the 1986 season. <a href=\"http://s.hswstatic.com/gif/1987-nascar-4.jpg\">Morgan Shepherd</a> drove the number both before Ruttman and after for 31 starts in 1985 &amp; 1987. </p></li>\n<li><p><a href=\"/u/dogedriver\">/u/dogedriver</a> <a href=\"http://2.bp.blogspot.com/-VjN9EZc9DhY/T2ZcjcuX0GI/AAAAAAAABFk/nJs3MQ96Vqo/s1600/c26joshwise.jpg\">Josh Wise</a> competed for the Rookie of the Year in 2012 driving the #26 in 30 starts for Front Row Motorsports. </p></li>\n<li><p>In the twilight of Travis Carter’s team the #26 was fielded by several drivers in 2002 before lack of sponsorship dove the team out of business. The drivers included <a href=\"http://media.crash.net/original/39960.jpg\">Todd Bodine</a> with 21 starts, <a href=\"http://www.jayski.com/schemes/2002cup/26kmart-front.jpg\">Joe Nemechek</a> with 7 starts, <a href=\"http://www.jayski.com/schemes/2002cup/26advance-rear.jpg\">Frank Kimmel</a> with 6 starts, and Geoff Bodine with 1 start. Yep, all 3 Bodine Brothers have driven #26.</p></li>\n<li><p>Fictional driver <a href=\"https://johnbarr1.files.wordpress.com/2010/04/photo_13_hires.jpg\">Ricky Bobby</a> drives the #26 in the comedy movie <a href=\"https://www.youtube.com/watch?v=Bvi9zpHlrvg\">&quot;Talladega Nights:The Ballad of Ricky Bobby&quot;</a></p></li>\n</ul>\n\n<p>Other notable names in #26</p>\n\n<ul>\n<li><p>David Stremme, 11 starts</p></li>\n<li><p>Dave Marcis, 6 starts</p></li>\n<li><p>Boris Said, 5 starts</p></li>\n<li><p>Ken Schrader, 1 start</p></li>\n<li><p>Tony Raines, 1 start</p></li>\n<li><p>Michael Waltrip, 1 start</p></li>\n<li><p>Dick Trickle, 1 start</p></li>\n<li><p>Bill Elliott, 1 start</p></li>\n<li><p>David Pearson, 1 start</p></li>\n</ul>\n\n<hr/>\n\n<p>The 26th annual <a href=\"https://www.youtube.com/watch?v=AHrIEb07Nfs\">Daytona 500</a> was held February 19, 1984, at Daytona International Speedway. Cale Yarborough completed a lap of 201.848 miles per hour (324.843 km/h), officially breaking the 200 miles per hour (320 km/h) barrier at Daytona. He won the race for the second year in a row, and fourth time in his career, with the identical last-lap pass, this time victimizing Darrell Waltrip who would later go on to win the same race in 1989.</p>\n\n<p>The drivers expressed their concern by staging a safe 500, which had no serious incidents. President Ronald Reagan gave the command &quot;Gentlemen, start your engines!&quot; by phone from the White House. Yarborough,Allison, Dale Earnhardt and Richard Petty took turns leading the early laps of the race, but Petty and Allison fell out early with mechanical problems. Yarborough clearly had the strongest car, leading 51 of the first 100 laps. Yarborough&#39;s car was so fast, he twice passed leading cars on the outside of the third turn.</p>\n\n<p>Yarborough led most of the second half of the race, but Earnhardt and Terry Labonte were also strong, as well as Bill Elliott and Darrell Waltrip, who lead for the first time on lap 142. Waltrip took the lead again on lap 162 during green flag pit stops. The race&#39;s final caution came at lap 177, but four leaders, Waltrip, Yarborough, Labonte and Earnhardt-decided to remain on the track and hold their positions.</p>\n\n<p>After the race resumed on lap 183, six cars pulled away from the field. And as the final lap started, it was Waltrip,Yarborough,Earnhardt, Neil Bonnett, Harry Gant, and Bill Elliott. For 38 laps, Waltrip had grimly hung onto the point. But he knew how fast Yarborough was. Yarborough made his move on the backstretch-the same move that had failed spectaculary in 1979 against Donnie Allison but worked perfectly in 1983 against Baker. Waltrip moved to the middle of the track, but did not aggressively block. Yarborough made the pass without drafting help.</p>\n\n<p>Earnhardt also moved on Waltrip, but didn&#39;t begin his pass until turn four. He nipped Waltrip at the line, while Bonnett held off Elliott for fourth. Yarborough won by eight car lengths. For the sixth time in his career, Yarborough had a chance to make a last-lap pass for victory in a NASACR race. For the sixth time, he did it. And for the first time since Fireball Roberts in 1962, a single driver had won the pole, his qualifying race and the 500.</p>\n\n<hr/>\n\n<p><strong>TRIVIA TIME</strong></p>\n\n<p><a href=\"/u/colegnd\">/u/colegnd</a>  has offered a reward of Dogecoins to the first person to correctly answer a daily trivia question related to each number! No Google, Wikipedia, or internet allowed, just your own knowledge! Thanks to <a href=\"/u/colegnd\">/u/colegnd</a> for the idea and dogecoins! If you are declared the winner of the trivia contest and would like to donate you prize money to charity, please let me know in the comments.</p>\n\n<ul>\n<li><p>Yesterday’s Answer: <a href=\"/spoiler\">Tommy Kendall, Watkins Glen.</a>  </p></li>\n<li><p>Today’s Question: Todd Bodine, the youngest brother, is the only of the 3 Bodines who still races full time. Both Brett and Geoff now have other jobs to occupy their time. What are the professions of the older 2 Bodine Bros?</p></li>\n</ul>\n</div><!-- SC_ON -->",
  "author_flair_css_class": "Champ",
  "subreddit_id": "t5_2qs08",
  "archived": true,
  "domain": "self.NASCAR",
  "clicked": false,
  "score": 24,
  "id": "2ttaee",
  "stickied": false,
  "media_embed": {},
  "link_flair_css_class": "discussion",
  "visited": false,
  "selftext": "Sorry I'm a bit late posting tonight, I spent today, er... yesterday, prepping for Winter Storm Juno and doing a lot of homework (because in Grad School \"Snow Day\" and \"Work Day\" mean the same thing).\n\n\nIn Sprint Cup Series competition the #26 car has started 1075 races and has 22 wins, 36 poles, 116 top 5s, 259 top 10s, and 369 DNFs. \n\n\n* [Brett Bodine](http://cyberwombat.com/images/nascar/buick/1987/26_bodine_1990.jpg) has the most starts in #26 with 147 from 1990-1994 including Brett’s only career win. Driving the #26 Quaker State Buick Regal for champion drag racer Kenny Bernstein, Bodine won his first race at [North Wilkesboro Speedway](https://www.youtube.com/watch?v=mtm4MsKItqU), which came under some controversy. During a long 17-lap caution flag, scoring was mixed up, and some felt that Darrell Waltrip was robbed of the win because of the error. It was found that Waltrip was up front but by the time it was clear that Waltrip won, Bodine had already been declared the winner officially. When Waltrip protested Bill France said \"You leave this kid alone DW...it is his first win and you will win more races.\" The win stood, and before the season was over, Bodine had won his first pole position at the fall event at Charlotte Motor Speedway and was 12th in the championship standings. Bodine wasn't able to equal his 1990 effort, and parted ways with Bernstein after the 1994 season. Sprint Car Champion [Steve Kinser](http://api.ning.com/files/ntM8gSusREnUCJU85g7iaUY2RIkRVGAfogxYYHEjY4Jy6JoyguRr1JkI68izHpAbmIR-0BoZ*uUxdcI-Yl9G23Wxf9BoSU1V/SteveKinser.jpg) was hired to replace Bodine in 1995, but after only 5 races was replaced by [Hut Stricklin](http://i.imgur.com/AhUtjnw.jpg) for the remainder of the year.\n\n\n*  [Jamie McMurray](http://www.pyramidracing.com/contents/media/2009-mcmurray-talladega.jpg) started #26 144 times between 2006-2009 including 2 wins. After leaving Ganassi Racing following 2005, McMurray was originally to go to the #6 Ford in 2006, but since Mark Martin announced he would race for another year, McMurray instead took over for Kurt Busch in the #97 Crown Royal/IRWIN Tools Ford (which was then renumbered #26). 2006 was a hard season for McMurray. McMurray's best finish of the 2006 season came at Dover International Speedway, where he finished second after leading the most laps. McMurray would record three top fives, seven top tens and finish a disappointing 25th in points.\n\n On June 22, 2007, he won his third career Cup pole, for the Toyota Save/Mart 350. On lap 1, he was passed by Robby Gordon. With about 45 laps left, McMurray took the lead and dominated the final laps, but with 7 to go Cup rookie and his future teammate Juan Pablo Montoya passed him and held him off until McMurray eventually ran out of gas with 2 to go and resulted 37th. On July 7 at the Pepsi 400, McMurray led a few laps in the first stages. However, on lap 30, McMurray was then black-flagged by NASCAR for slipping out of bounds. He then spent the rest of the race charging back through the field eventually getting back to the front on lap 155. McMurray then led the final stages but battled Kyle Busch for five laps. On the last lap, Busch was the leader next to McMurray and charged to the finish, but at the last second, McMurray charged one last time and barely beat Busch to [win the Pepsi 400](http://youtu.be/-U2Bkw-mscc?t=4m31s) for his second career Cup win. The margin was 0.005 of a second, and the finish resembled the Daytona 500 of the year's finish when Kevin Harvick beat Mark Martin at the last second of the race that year. The [photo finish](http://www.gannett-cdn.com/-mm-/d841160ad1aef11bc8b030336d89ab891585d9f6/c=0-1081-2553-3000&r=x404&c=534x401/local/-/media/USATODAY/USATODAY/2014/07/05/1404582019000-IB05-NASCAR-09.jpg) was the closest in Daytona International Speedway history and tied for the second closest finish (1993 DieHard 500) since the advent of electronic scoring in 1993. McMurray finished the year 17th in the point standings.\n\n\n In the beginning of the 2008 season, McMurray encountered a string of poor finishes that relegated him to 36th in points and thus not guaranteed a spot when NASCAR reached the spring Martinsville race. McMurray finished 16th in the standings. On November 1, 2009, McMurray won the AMP Energy 500 at [Talladega](https://www.youtube.com/watch?v=cmv6ya6dl1c) after leading over 20 laps and passing David Stremme with 8 laps to go. He then survived a green-white checkered finish to earn his second restrictor-plate win. Roush released him and the #26 team at the end of the season due to NASCAR's four team limit and the expiration of Roush Fenway Racing's exemption that allowed a 5th team. McMurray decided to ask former boss Chip Ganassi for another chance following his disastrous era on Roush-Fenway Racing and Ganassi granted him a contract to let him drive the #1 car for his merged team with Dale Earnhardt Inc., Earnhardt Ganassi Racing.\n\n\n* [Earl Brooks](http://api.ning.com/files/8bhwoUnh34DbT1I07mTjL-NnbXJobr9CUBYoEpcMM0bTkKTSHMUsXUzwsaemqLNe/Image29.jpg) started #26 109 times from 1962-1973. As one of the earliest professionals of any sport, he played the game simply to feed his family and to be a breadwinner to his family. Brooks never had the money or the time attract corporate sponsors for his racing team. His \"second job\" was being a mechanic for a garage on Lynchburg's Mayflower Drive; where he worked from Monday to Friday to pay off any bills that NASCAR couldn't help with. In the summertime, Earl would wear sandals while racing; something that would eventually become banned as NASCAR became more safety conscious. Like any other driver who raced during the formative years of NASCAR, Brooks was a humble man who would sometime race for meager \"awards\" like a block of cheese or a tin of crackers to eat for a snack after the race. While Richard Petty and David Pearson could buy new parts for their vehicles through their corporate sponsors spending money like there was no tomorrow, Earl had to scrounge around for vehicle components. Due to Brooks being unable to win a race in the NASCAR Cup Series, he is ineligible for the NASCAR Hall of Fame.\n\n\n\n\n* [Jimmy Spencer](http://images51.fotki.com/v423/photos/6/61479/1127389/26KMart2001refa-vi.jpg) drove #26 for 70 starts from 2000-2001. After a 20th-place finish in 1999, Winston left the Travis Carter #23 team, and Kmart became the team's new sponsor, causing Spencer to switch to the #26 to accommodate the new sponsor, who was already backing the #66 car driven by Spencer's teammate, Darrell Waltrip. Spencer had two top-fives and in 2001 won the pole positions at Indianapolis Motor Speedway and Lowe's Motor Speedway and advanced to sixteenth in points. He departed the team at the end of the season.\n\n\n\n* [Johnny Benson Jr.](http://www.modelroundup.com/v/vspfiles/photos/RMX-2553-2.jpg) drove the Roush Racing #26 General Mills/Cheerios Ford Taurus in 66 races in the 1998 & 1999 seasons.  In1998, he missed the season opening Daytona 500, then finished 30th at the following race. He then had a streak of no finishes worse than ninth over the next five races and rose as high as tenth in points, before he finished 38th and 41st in the next two races. For the rest of the season, his best finish was ninth and he qualified no higher than second. He finished 20th in points. Benson had numerous crew chiefs in 1999. He had two top 10 finishes and finished 28th in the final standings. After a long negotiation, he was able to buy out his contract and announced he would leave Roush.\n\n \n\n\n* [Ricky Rudd](http://cyberwombat.com/images/nascar/buick/1991/ruddy.jpg) earned 2 wins in his 58 starts from 1988-1989. Rudd joined King Racing beginning in [1988](https://www.youtube.com/watch?v=mvghIVOwog8) in the #26 Quaker State Buick Regal owned by Kenny Bernstein. He struggled with engine failures all season long and finished 11th in the standings, his worst points finish in eight years. After his only win of 1989, which came at the inaugural [Sears Point](http://youtu.be/MCIeGYN_bTM?t=3m53s) event, Rudd departed the operation, and in 1990 he signed with Hendrick Motorsports to drive the #5 Levi Garrett Chevrolet Lumina.\n\n\n* [Junior Johnson](http://www.nationalspeedsportnews.com/wp-content/uploads/2014/10/N-DB1-1963-3-5.jpg) raced his #26 car 40 times from 1963-1966 including 12 wins. As an owner Johnson fielded the #26 with many of the sport’s great names like [Fred Lorenzon](http://www.macsmotorcitygarage.com/wp-content/uploads/2013/01/26-Fred-Lorenzen-66-Ford-.jpg), [Curtis Turner](http://images109.fotki.com/v142/photos/6/88566/7288521/26vi-vi.jpg), [Bobby Isaac](http://images15.fotki.com/v588/photos/6/88566/7288521/266vi-vi.jpg), [Darel Dieringer](http://www.notinhalloffame.com/UserFiles/Image/article_images/Nascar/NASCAR%2036%20Darel%20Dieringer.jpg) and [LeeRoy Yarbrough](http://i280.photobucket.com/albums/kk171/crabber1967/Facebook/Lee%20Roy%20Yarbrough%20NASCARs%20Tragic%20Hero/535663_10151694923245261_255918475_n.jpg). \n\n\n* In 2014 [Cole Whitt](http://www2.pictures.zimbio.com/gi/Cole+Whitt+Las+Vegas+Motor+Speedway+Day+2+YTl1rk8gwYnl.jpg) started all 36 races for Swan Racing. Whitt will not return in 2015 as he moves to the #35 of Front Row Motorsports.\n\n* [Dave Terrell](http://i.imgur.com/Mhied0Z.jpg) started 34 races in #26 from 1953-1954. He drove #26 in exactly half of his career starts. \n\n* [Joe Ruttman](http://api.ning.com/files/0KeYXF-63DMDUbZof0FmfjpMHiRcdw7Vdf*5MAM*aforZ68q*RomhcATIR9BSTgZsQn7zJuspDmAPOEpVHz8AmOyw*vvDsYd/26JoeRuttman1986TheBudweiserattheGlen.jpg) drove the Kenny Bernstein #26 in 29 races during the 1986 season. [Morgan Shepherd](http://s.hswstatic.com/gif/1987-nascar-4.jpg) drove the number both before Ruttman and after for 31 starts in 1985 & 1987. \n\n* /u/dogedriver [Josh Wise](http://2.bp.blogspot.com/-VjN9EZc9DhY/T2ZcjcuX0GI/AAAAAAAABFk/nJs3MQ96Vqo/s1600/c26joshwise.jpg) competed for the Rookie of the Year in 2012 driving the #26 in 30 starts for Front Row Motorsports. \n\n* In the twilight of Travis Carter’s team the #26 was fielded by several drivers in 2002 before lack of sponsorship dove the team out of business. The drivers included [Todd Bodine](http://media.crash.net/original/39960.jpg) with 21 starts, [Joe Nemechek](http://www.jayski.com/schemes/2002cup/26kmart-front.jpg) with 7 starts, [Frank Kimmel](http://www.jayski.com/schemes/2002cup/26advance-rear.jpg) with 6 starts, and Geoff Bodine with 1 start. Yep, all 3 Bodine Brothers have driven #26.\n\n\n* Fictional driver [Ricky Bobby](https://johnbarr1.files.wordpress.com/2010/04/photo_13_hires.jpg) drives the #26 in the comedy movie [\"Talladega Nights:The Ballad of Ricky Bobby\"](https://www.youtube.com/watch?v=Bvi9zpHlrvg)\n\n\n\n\nOther notable names in #26\n\n\n\n* David Stremme, 11 starts\n\n* Dave Marcis, 6 starts\n\n* Boris Said, 5 starts\n\n* Ken Schrader, 1 start\n\n* Tony Raines, 1 start\n\n* Michael Waltrip, 1 start\n\n* Dick Trickle, 1 start\n\n* Bill Elliott, 1 start\n\n* David Pearson, 1 start\n\n------------------------ \n\nThe 26th annual [Daytona 500](https://www.youtube.com/watch?v=AHrIEb07Nfs) was held February 19, 1984, at Daytona International Speedway. Cale Yarborough completed a lap of 201.848 miles per hour (324.843 km/h), officially breaking the 200 miles per hour (320 km/h) barrier at Daytona. He won the race for the second year in a row, and fourth time in his career, with the identical last-lap pass, this time victimizing Darrell Waltrip who would later go on to win the same race in 1989.\n\nThe drivers expressed their concern by staging a safe 500, which had no serious incidents. President Ronald Reagan gave the command \"Gentlemen, start your engines!\" by phone from the White House. Yarborough,Allison, Dale Earnhardt and Richard Petty took turns leading the early laps of the race, but Petty and Allison fell out early with mechanical problems. Yarborough clearly had the strongest car, leading 51 of the first 100 laps. Yarborough's car was so fast, he twice passed leading cars on the outside of the third turn.\n\nYarborough led most of the second half of the race, but Earnhardt and Terry Labonte were also strong, as well as Bill Elliott and Darrell Waltrip, who lead for the first time on lap 142. Waltrip took the lead again on lap 162 during green flag pit stops. The race's final caution came at lap 177, but four leaders, Waltrip, Yarborough, Labonte and Earnhardt-decided to remain on the track and hold their positions.\n\nAfter the race resumed on lap 183, six cars pulled away from the field. And as the final lap started, it was Waltrip,Yarborough,Earnhardt, Neil Bonnett, Harry Gant, and Bill Elliott. For 38 laps, Waltrip had grimly hung onto the point. But he knew how fast Yarborough was. Yarborough made his move on the backstretch-the same move that had failed spectaculary in 1979 against Donnie Allison but worked perfectly in 1983 against Baker. Waltrip moved to the middle of the track, but did not aggressively block. Yarborough made the pass without drafting help.\n\nEarnhardt also moved on Waltrip, but didn't begin his pass until turn four. He nipped Waltrip at the line, while Bonnett held off Elliott for fourth. Yarborough won by eight car lengths. For the sixth time in his career, Yarborough had a chance to make a last-lap pass for victory in a NASACR race. For the sixth time, he did it. And for the first time since Fireball Roberts in 1962, a single driver had won the pole, his qualifying race and the 500.\n\n\n-----------------\n\n\n**TRIVIA TIME**\n\n/u/colegnd  has offered a reward of Dogecoins to the first person to correctly answer a daily trivia question related to each number! No Google, Wikipedia, or internet allowed, just your own knowledge! Thanks to /u/colegnd for the idea and dogecoins! If you are declared the winner of the trivia contest and would like to donate you prize money to charity, please let me know in the comments.\n\n* Yesterday’s Answer: [Tommy Kendall, Watkins Glen.](/spoiler)  \n\n \n* Today’s Question: Todd Bodine, the youngest brother, is the only of the 3 Bodines who still races full time. Both Brett and Geoff now have other jobs to occupy their time. What are the professions of the older 2 Bodine Bros?\n\n",
  "hide_score": false,
  "_api_link": "https://api.reddit.com/r/NASCAR/comments/2ttaee/26_days_until_the_daytona_500/?ref=search_posts",
  "locked": false,
  "edited": 1422370859.0,
  "title": "26 Days until the Daytona 500!",
  "created": 1422338078.0,
  "_comments_by_id": {}
}