{
  "selftext": "Firstly, any of the /r/shitblanksays subreddits are, by necessity, going to be circlejerky in nature. 'Us v Them' is their mission statement. And no one does Us v Them better than libertarians. Already the sub is opening strong; it's got 'statist' right in the title, the go-to shutdown insult for anyone who fancies themselves a free thinker but doesn't want to devote time to constructive discussion. *Statist* is to libertarians what *feminazi* (to substitute for more vulgar terms) is to Men's Rights Activists, what *hamplanet* is to /FPS, what *neckbeard* is to us. It's a cartoon character they've constructed to represent their opposition. Encountering this discussion strategy in the wild is more frustrating than amusing, but discovering a subreddit *devoted* to seeking out these cartoon characters is like seeing an orangutan in a zoo; maybe in a different context I might be in awe, or even a little scared, but that one in the corner is picking his butt and I can't help but laugh.\n\nOur heroes are united under a common philosophy: *The Federal government was created by the Devil to test our faith in the Free Market*. Ok, that's a little flippant, but I think the point remains salient. I wanted to focus on just one aspect of their philosophy (\"in *my* America, statists get stoned\"), but their absolute hate for the Federal government emerges in some various and often-surprising circlejerks. \n\nThe sub links to comments in other threads with the offending quote used as the headline, but I will try to focus on the comments themselves rather than chasing them through all of their debates.\n\nLet's sort by top:this week and have at it! This might get long.\n\n**1. [12 Reasons](http://www.np.reddit.com/r/Shitstatistssay/comments/1qty4k/12_reasons_why_obama_is_one_of_the_best/) Why Obama is the Best President Ever.**\n\n[Oh boy.](http://youtu.be/CTJsW7UYZIc?t=15s) Now, I definitely don't agree Obama is teh best *evar*, but I can point to a few solid reasons why I think that is. Now, since it is a shitblanksays sub, I'm not expecting constructive discussion on the pros and cons of this submission. But, since \"Just use good arguments and logic.\" is in their sidebar, I was hoping for something at least... novel, and not torn directly from the pages of the two-party system they detest so much.\n\n>Hitler was misunderstood. All he wanted was peace too. He was a painter. Those jews were jealous of his success.\n\nBAM! DAE think Obama is just counting down the days til he can round up all the billionaires in camps across the nation? That's probably what FEMA is doing, and why the SSA is buying up all that ammo.\n\n>1. He's black\n>2. He's black\n>3. He's black\n>4. He's black\n>5. He's black\n>6. He's black\n>7. He's black\n>8. He's black\n>9. He's black\n>10. He's black\n>11. He's black\n>12. He's black\n\nHe's got it figured out, guys. Black people only like Obama because he's black. They can't think for themselves, because if they could they'd be libertarians. \n\nAnd it's two child comments?\n\n>I will be completely honest here. Before I had even clicked the article I had assumed 2 things. **The first being that the author would be black**. The 2nd was that no actual facts/evidence/sources would be used.\n\nEmphasis mine.\n\n>I just typed this exact comment, then scrolled down and found yours. Bravo.\n\n\"I agree with your conclusion, but it is very important to me for you to know that I reached that conclusion on my own. Of course, I didn't post it because I'm at least self-aware enough to recognize the racism, but after seeing your 27 upvotes I've decided it's safe to express this opinion as well and try to cash in on the karma train you're riding.\"\n\n>k, I may not like Obama so I may seem a bit biased, but I cannot for the life of me figure out why people think he's a good speaker. IMO, BHO comes across as extremely arrogant and aloof. I've watched quite a few of his speeches actively trying to feel anything in his rhetoric and I just can't. Can anyone feel me on this one? I don't understand what his speaking appeal is. He's an average orator at best.\n\n\"Does anyone else erroneously believe they could debate circles around the president? I mean, he was only elected because he was black.\"\n\n>Yeah I dunno I once asked a soviet citizen and they said both Lenin and Stalin were good speakers, and for whatever reason he then scoffed at Hitler even though I didn't even bring him up.\n\nOoh, a three-fer. Lenin, Stalin, AND Hitler.\n\n>I'll never understand why people take anything on that site seriously. That fucking sidebar, man...\n\nThey should [take inspiration](http://www.np.reddit.com/r/Shitstatistssay/) from our own tasteful sidebar. \n\n**2. [The villain](http://www.np.reddit.com/r/Shitstatistssay/comments/1qjnjj/the_villain_in_the_new_lego_movie_is_named_lord/) in the new Lego Movie is named \"Lord Business\".....subtle, guys, real subtle.**\n\nSurprisingly, a ctrl-f for 'indoctrinate' only turned up one hit, so that's a pleasant surprise. \n\n>Maybe he'll collude with Lord Government.\n\nBusiness can't be evil unless the Federales are involved.\n\n>Lord Government is probably the hero\n\n\"And Sir Healthcare Reform probably gets a blowie from Lady Raise-the-Capital-Gains-Tax. What propagandistic garbage.\"\n\n>I think you may be looking into this a bit too much, but:\nLego is a brand by The Lego Group who rakes in $3.51 () Billion in revenue.\nThe movie is being distributed by Warner Bros. Entertainment Inc. who make $12 Billion in revenue, overshadowed by the even larger Time Warner Inc. with a whopping $28.7 Billion.\nSo if there is some sort of anti-buisiness or socialist message behind this movie, they aren't doing a very good job and convincing me.\n\nReason! And upvoted, too! But the OPs response?\n\n>You do know that Karl Marx was given room and board and practically all of his efforts were funded by a rich industrialist, right? Just because you make lots of money doesn't mean you don't have an anti-business slant (See: MSNBC)\n\n\"I guarantee you this movie is going to be almost indistinguishable from *Das Kommunistische Manifest*. Also, research funding is more or less the exact same thinking as making a product and hoping to turn a profit on it, right?\"\n\n>Statist businesses push anti-business agendas, because the outcome is really anti-competition veiled as consumer protection.\n\n\"Look, man, LEGO is practically *synonymous* with crony capitalism.\"\n\nIn response to the notion that maybe people are pulling it apart too much:\n\n>Wow, really? This is the battle of ideas. It's a bad thing that the \"evil businessman villain\" is a trope. It's highly improbable that they're going to talk about the evils of corporatism and the abuse of government authority which means, by default, it will be anti-capitalism (CEOs are sociopaths who don't care about their employees and would sell their mother down the river). If I were going to guess, it will have marxist \"everyone do their fair share\" theme since that's what sells. Is it any surprise Obamacare was sold under the same ideas?\n\n\"This is a *war*, man, and LEGO just declared sides. If a movie *doesn't* tell kids that all of the ills in the world are the government's fault, then *by default* that means it's telling kids that businesses are at fault.\"\n\nSame guy, different post:\n\n>Where do you think people get the ideas that form their opinions? You're simply ignorant and that's hilarious. ... It's really cute that you think movies are harmless and have no ability to indoctrinate.\"\n\n\"You think people are capable of forming their own opinions on complicated subjects? HA! They get them from the same place I got *my* opinions; other people!\" Also, there's the starring part of our single 'indoctrinate', with a special cameo appearance from Smug Condescension. \n\n**3. [This comment.](http://www.np.reddit.com/r/Shitstatistssay/comments/1qp5e3/not_wanting_your_insurance_plan_to_cover_things/cdf5riq) An unexpected blossoming of r/redpill.**\n\n>Well really it's the same reason you don't see that many women libertarians. They have to override thousands of years of biological motivation to secure as much for themselves and their offspring as possible, and because of government now they have a way to accomplish this through the use of overwhelming violence.\n\nJesus Christ. I don't have any jokes.\n\n>Usually they abandon those tactics after they hook up with a man\n\nAnd a responder:\n\n>Before marriage they benefit greatly from government's money. Unmarried women vote democrat.\nAfter marriage they benefit greatly from their husband's money. They want his money for themselves and not redistributed to others. Married women vote republican.\nWe will have statism for as long as statism benefits women. Once it no longer does we will see a surge in libertarian women and our victory over the state will be on the horizon.\n\nOoooooh. [I knew these ideas sounded familiar](http://upload.wikimedia.org/wikipedia/commons/6/6b/Ann_Coulter_by_Gage_Skidmore_3.jpg). \n\nThe good news is this comment chain taught me a new a word to keep an eye out for: \"Welfarethink\".\n\n>Welfarethink at its finest. Find a person who is really the exception, and then find a way to relate your first world problems to them.\n\nOk, this post is getting really long. I'll end with a few choice comments from other threads.\n\n>No, no, no... What you gotta do is find out why they would become criminals in the first place.. You ban things such as homelessness and poverty and then no one will be poor and everyone will have a house!\n\n\"Because that's what people are suggesting, right? The only thing the government does is declare things illegal/not illegal, there's no such thing as policy decisions.\"\n\n(In response to \"capitalism cannot function without regulation\"):\n\n>That's right. Go to an island, you and one other person.\nNeither of you can trade, at all, until Government creates some regulations. You physically are prevented from it.\n\n\"Even though I base my entire existence around the free market and mocking those who are skeptical of it, I fail to have a working definition of what 'capitalism' or 'regulation' is.\"\n\n>Unfortunately, at the end of the day, the Statist does not respect my wishes to not be coerced and will use violence, if necessary, to make me be apart of their \"society.\"\n\n\"I mean, this is different from *my* insistence that they destroy the only society they know so that we can realign it among arbitrary principles that please *me*, because... uh... well, because I'm right.\"\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
  "gilded": 0,
  "score": 95,
  "removal_reason": null,
  "approved_by": null,
  "created_utc": 1384829955.0,
  "is_self": true,
  "stickied": false,
  "edited": 1384830711.0,
  "distinguished": null,
  "permalink": "https://www.reddit.com/r/circlebroke/comments/1qy5ou/shitstatistssay_a_bastion_of_libertarian_bravery/?ref=search_posts",
  "banned_by": null,
  "from_id": null,
  "likes": null,
  "_underscore_names": null,
  "num_reports": null,
  "link_flair_css_class": null,
  "_info_url": "https://api.reddit.com/api/info/",
  "id": "1qy5ou",
  "archived": true,
  "secure_media": null,
  "from_kind": null,
  "saved": false,
  "domain": "self.circlebroke",
  "ups": 95,
  "suggested_sort": null,
  "quarantine": false,
  "over_18": false,
  "hide_score": false,
  "url": "https://www.reddit.com/r/circlebroke/comments/1qy5ou/shitstatistssay_a_bastion_of_libertarian_bravery/",
  "subreddit_id": "t5_2tnz9",
  "_params": {},
  "_comments": null,
  "_replaced_more": false,
  "_comments_by_id": {},
  "user_reports": [],
  "media_embed": {},
  "created": 1384829955.0,
  "author_flair_text": null,
  "visited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Firstly, any of the <a href=\"/r/shitblanksays\">/r/shitblanksays</a> subreddits are, by necessity, going to be circlejerky in nature. &#39;Us v Them&#39; is their mission statement. And no one does Us v Them better than libertarians. Already the sub is opening strong; it&#39;s got &#39;statist&#39; right in the title, the go-to shutdown insult for anyone who fancies themselves a free thinker but doesn&#39;t want to devote time to constructive discussion. <em>Statist</em> is to libertarians what <em>feminazi</em> (to substitute for more vulgar terms) is to Men&#39;s Rights Activists, what <em>hamplanet</em> is to /FPS, what <em>neckbeard</em> is to us. It&#39;s a cartoon character they&#39;ve constructed to represent their opposition. Encountering this discussion strategy in the wild is more frustrating than amusing, but discovering a subreddit <em>devoted</em> to seeking out these cartoon characters is like seeing an orangutan in a zoo; maybe in a different context I might be in awe, or even a little scared, but that one in the corner is picking his butt and I can&#39;t help but laugh.</p>\n\n<p>Our heroes are united under a common philosophy: <em>The Federal government was created by the Devil to test our faith in the Free Market</em>. Ok, that&#39;s a little flippant, but I think the point remains salient. I wanted to focus on just one aspect of their philosophy (&quot;in <em>my</em> America, statists get stoned&quot;), but their absolute hate for the Federal government emerges in some various and often-surprising circlejerks. </p>\n\n<p>The sub links to comments in other threads with the offending quote used as the headline, but I will try to focus on the comments themselves rather than chasing them through all of their debates.</p>\n\n<p>Let&#39;s sort by top:this week and have at it! This might get long.</p>\n\n<p><strong>1. <a href=\"http://www.np.reddit.com/r/Shitstatistssay/comments/1qty4k/12_reasons_why_obama_is_one_of_the_best/\">12 Reasons</a> Why Obama is the Best President Ever.</strong></p>\n\n<p><a href=\"http://youtu.be/CTJsW7UYZIc?t=15s\">Oh boy.</a> Now, I definitely don&#39;t agree Obama is teh best <em>evar</em>, but I can point to a few solid reasons why I think that is. Now, since it is a shitblanksays sub, I&#39;m not expecting constructive discussion on the pros and cons of this submission. But, since &quot;Just use good arguments and logic.&quot; is in their sidebar, I was hoping for something at least... novel, and not torn directly from the pages of the two-party system they detest so much.</p>\n\n<blockquote>\n<p>Hitler was misunderstood. All he wanted was peace too. He was a painter. Those jews were jealous of his success.</p>\n</blockquote>\n\n<p>BAM! DAE think Obama is just counting down the days til he can round up all the billionaires in camps across the nation? That&#39;s probably what FEMA is doing, and why the SSA is buying up all that ammo.</p>\n\n<blockquote>\n<ol>\n<li>He&#39;s black</li>\n<li>He&#39;s black</li>\n<li>He&#39;s black</li>\n<li>He&#39;s black</li>\n<li>He&#39;s black</li>\n<li>He&#39;s black</li>\n<li>He&#39;s black</li>\n<li>He&#39;s black</li>\n<li>He&#39;s black</li>\n<li>He&#39;s black</li>\n<li>He&#39;s black</li>\n<li>He&#39;s black</li>\n</ol>\n</blockquote>\n\n<p>He&#39;s got it figured out, guys. Black people only like Obama because he&#39;s black. They can&#39;t think for themselves, because if they could they&#39;d be libertarians. </p>\n\n<p>And it&#39;s two child comments?</p>\n\n<blockquote>\n<p>I will be completely honest here. Before I had even clicked the article I had assumed 2 things. <strong>The first being that the author would be black</strong>. The 2nd was that no actual facts/evidence/sources would be used.</p>\n</blockquote>\n\n<p>Emphasis mine.</p>\n\n<blockquote>\n<p>I just typed this exact comment, then scrolled down and found yours. Bravo.</p>\n</blockquote>\n\n<p>&quot;I agree with your conclusion, but it is very important to me for you to know that I reached that conclusion on my own. Of course, I didn&#39;t post it because I&#39;m at least self-aware enough to recognize the racism, but after seeing your 27 upvotes I&#39;ve decided it&#39;s safe to express this opinion as well and try to cash in on the karma train you&#39;re riding.&quot;</p>\n\n<blockquote>\n<p>k, I may not like Obama so I may seem a bit biased, but I cannot for the life of me figure out why people think he&#39;s a good speaker. IMO, BHO comes across as extremely arrogant and aloof. I&#39;ve watched quite a few of his speeches actively trying to feel anything in his rhetoric and I just can&#39;t. Can anyone feel me on this one? I don&#39;t understand what his speaking appeal is. He&#39;s an average orator at best.</p>\n</blockquote>\n\n<p>&quot;Does anyone else erroneously believe they could debate circles around the president? I mean, he was only elected because he was black.&quot;</p>\n\n<blockquote>\n<p>Yeah I dunno I once asked a soviet citizen and they said both Lenin and Stalin were good speakers, and for whatever reason he then scoffed at Hitler even though I didn&#39;t even bring him up.</p>\n</blockquote>\n\n<p>Ooh, a three-fer. Lenin, Stalin, AND Hitler.</p>\n\n<blockquote>\n<p>I&#39;ll never understand why people take anything on that site seriously. That fucking sidebar, man...</p>\n</blockquote>\n\n<p>They should <a href=\"http://www.np.reddit.com/r/Shitstatistssay/\">take inspiration</a> from our own tasteful sidebar. </p>\n\n<p><strong>2. <a href=\"http://www.np.reddit.com/r/Shitstatistssay/comments/1qjnjj/the_villain_in_the_new_lego_movie_is_named_lord/\">The villain</a> in the new Lego Movie is named &quot;Lord Business&quot;.....subtle, guys, real subtle.</strong></p>\n\n<p>Surprisingly, a ctrl-f for &#39;indoctrinate&#39; only turned up one hit, so that&#39;s a pleasant surprise. </p>\n\n<blockquote>\n<p>Maybe he&#39;ll collude with Lord Government.</p>\n</blockquote>\n\n<p>Business can&#39;t be evil unless the Federales are involved.</p>\n\n<blockquote>\n<p>Lord Government is probably the hero</p>\n</blockquote>\n\n<p>&quot;And Sir Healthcare Reform probably gets a blowie from Lady Raise-the-Capital-Gains-Tax. What propagandistic garbage.&quot;</p>\n\n<blockquote>\n<p>I think you may be looking into this a bit too much, but:\nLego is a brand by The Lego Group who rakes in $3.51 () Billion in revenue.\nThe movie is being distributed by Warner Bros. Entertainment Inc. who make $12 Billion in revenue, overshadowed by the even larger Time Warner Inc. with a whopping $28.7 Billion.\nSo if there is some sort of anti-buisiness or socialist message behind this movie, they aren&#39;t doing a very good job and convincing me.</p>\n</blockquote>\n\n<p>Reason! And upvoted, too! But the OPs response?</p>\n\n<blockquote>\n<p>You do know that Karl Marx was given room and board and practically all of his efforts were funded by a rich industrialist, right? Just because you make lots of money doesn&#39;t mean you don&#39;t have an anti-business slant (See: MSNBC)</p>\n</blockquote>\n\n<p>&quot;I guarantee you this movie is going to be almost indistinguishable from <em>Das Kommunistische Manifest</em>. Also, research funding is more or less the exact same thinking as making a product and hoping to turn a profit on it, right?&quot;</p>\n\n<blockquote>\n<p>Statist businesses push anti-business agendas, because the outcome is really anti-competition veiled as consumer protection.</p>\n</blockquote>\n\n<p>&quot;Look, man, LEGO is practically <em>synonymous</em> with crony capitalism.&quot;</p>\n\n<p>In response to the notion that maybe people are pulling it apart too much:</p>\n\n<blockquote>\n<p>Wow, really? This is the battle of ideas. It&#39;s a bad thing that the &quot;evil businessman villain&quot; is a trope. It&#39;s highly improbable that they&#39;re going to talk about the evils of corporatism and the abuse of government authority which means, by default, it will be anti-capitalism (CEOs are sociopaths who don&#39;t care about their employees and would sell their mother down the river). If I were going to guess, it will have marxist &quot;everyone do their fair share&quot; theme since that&#39;s what sells. Is it any surprise Obamacare was sold under the same ideas?</p>\n</blockquote>\n\n<p>&quot;This is a <em>war</em>, man, and LEGO just declared sides. If a movie <em>doesn&#39;t</em> tell kids that all of the ills in the world are the government&#39;s fault, then <em>by default</em> that means it&#39;s telling kids that businesses are at fault.&quot;</p>\n\n<p>Same guy, different post:</p>\n\n<blockquote>\n<p>Where do you think people get the ideas that form their opinions? You&#39;re simply ignorant and that&#39;s hilarious. ... It&#39;s really cute that you think movies are harmless and have no ability to indoctrinate.&quot;</p>\n</blockquote>\n\n<p>&quot;You think people are capable of forming their own opinions on complicated subjects? HA! They get them from the same place I got <em>my</em> opinions; other people!&quot; Also, there&#39;s the starring part of our single &#39;indoctrinate&#39;, with a special cameo appearance from Smug Condescension. </p>\n\n<p><strong>3. <a href=\"http://www.np.reddit.com/r/Shitstatistssay/comments/1qp5e3/not_wanting_your_insurance_plan_to_cover_things/cdf5riq\">This comment.</a> An unexpected blossoming of <a href=\"/r/redpill\">r/redpill</a>.</strong></p>\n\n<blockquote>\n<p>Well really it&#39;s the same reason you don&#39;t see that many women libertarians. They have to override thousands of years of biological motivation to secure as much for themselves and their offspring as possible, and because of government now they have a way to accomplish this through the use of overwhelming violence.</p>\n</blockquote>\n\n<p>Jesus Christ. I don&#39;t have any jokes.</p>\n\n<blockquote>\n<p>Usually they abandon those tactics after they hook up with a man</p>\n</blockquote>\n\n<p>And a responder:</p>\n\n<blockquote>\n<p>Before marriage they benefit greatly from government&#39;s money. Unmarried women vote democrat.\nAfter marriage they benefit greatly from their husband&#39;s money. They want his money for themselves and not redistributed to others. Married women vote republican.\nWe will have statism for as long as statism benefits women. Once it no longer does we will see a surge in libertarian women and our victory over the state will be on the horizon.</p>\n</blockquote>\n\n<p>Ooooooh. <a href=\"http://upload.wikimedia.org/wikipedia/commons/6/6b/Ann_Coulter_by_Gage_Skidmore_3.jpg\">I knew these ideas sounded familiar</a>. </p>\n\n<p>The good news is this comment chain taught me a new a word to keep an eye out for: &quot;Welfarethink&quot;.</p>\n\n<blockquote>\n<p>Welfarethink at its finest. Find a person who is really the exception, and then find a way to relate your first world problems to them.</p>\n</blockquote>\n\n<p>Ok, this post is getting really long. I&#39;ll end with a few choice comments from other threads.</p>\n\n<blockquote>\n<p>No, no, no... What you gotta do is find out why they would become criminals in the first place.. You ban things such as homelessness and poverty and then no one will be poor and everyone will have a house!</p>\n</blockquote>\n\n<p>&quot;Because that&#39;s what people are suggesting, right? The only thing the government does is declare things illegal/not illegal, there&#39;s no such thing as policy decisions.&quot;</p>\n\n<p>(In response to &quot;capitalism cannot function without regulation&quot;):</p>\n\n<blockquote>\n<p>That&#39;s right. Go to an island, you and one other person.\nNeither of you can trade, at all, until Government creates some regulations. You physically are prevented from it.</p>\n</blockquote>\n\n<p>&quot;Even though I base my entire existence around the free market and mocking those who are skeptical of it, I fail to have a working definition of what &#39;capitalism&#39; or &#39;regulation&#39; is.&quot;</p>\n\n<blockquote>\n<p>Unfortunately, at the end of the day, the Statist does not respect my wishes to not be coerced and will use violence, if necessary, to make me be apart of their &quot;society.&quot;</p>\n</blockquote>\n\n<p>&quot;I mean, this is different from <em>my</em> insistence that they destroy the only society they know so that we can realign it among arbitrary principles that please <em>me</em>, because... uh... well, because I&#39;m right.&quot;</p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "_comment_sort": null,
  "report_reasons": null,
  "name": "t3_1qy5ou",
  "from": null,
  "hidden": false,
  "clicked": false,
  "media": null,
  "json_dict": null,
  "_api_link": "https://api.reddit.com/r/circlebroke/comments/1qy5ou/shitstatistssay_a_bastion_of_libertarian_bravery/?ref=search_posts",
  "secure_media_embed": {},
  "mod_reports": [],
  "_orphaned": {},
  "_uniq": null,
  "num_comments": 132,
  "link_flair_text": null,
  "title": "/ShitStatistsSay, a bastion of libertarian bravery in a world overrun by welfare queens and brainwashed authoritarian drones.",
  "_has_fetched": true,
  "author_flair_css_class": null,
  "thumbnail": ""
}