{
  "selftext": "**What is the Detroit Mower Gang?**\n\nThe Detroit Mower Gang is a group of volunteers that meet every other Wednesday to clean up parks in Detroit. If you haven't noticed, the City of Detroit is in a *bit* of a financial crisis at the moment, and can't afford to maintain its massive number of parks. As a result, many of the parks become completely overgrown. This often results in blight, trash dumping, crime, and general badness in the area. Rather than writing strongly-worded letters to City Council, the Detroit Mower Gang decided to take matters into their own hands with direct action.\n\n**When are the Detroit Mower Gang events?**\n\nThe location is posted [on the Facebook page](https://www.facebook.com/MowerGang) a few days before the event. People tend to arrive between 5-6PM, and the event usually goes until dusk. Check the [Events page](https://www.facebook.com/MowerGang/events) for the date, time, and location. There's usually between 10-20 people at each event.\n\n**Do I need a mower?**\n\nNo, you just need to bring your lovely self. There's plenty of non-mower work than can be done: trash disposal, tree and branch trimming, grass clipping removal, playscape cleanup, etc. If you *do* have a mower, it always helps to bring it. Riding mowers are the staple of what we do, but push mowers excel in hitting the smaller areas that the riding mowers can't reach. There's always a need for raw grunt work. The goal is to get the park into a usable condition by the time it gets dark, and this often involves a lot more than just cutting grass.\n\n**What do I need to bring?**\n\nAny tools of flora destruction: trash bags, mowers, string trimmers, leaf blowers, branch cutters, weed and grass killer, etc. Basically, anything that can be used to help tame an overgrown park. If you don't have any of those, there's usually extra tools laying around that can be utilized. As mentioned above, a lot of this is grunt work that doesn't require any particular tools. There's *always* something to do if you volunteer.\n\n**What do other people bring?**\n\n- Riding lawnmowers.\n- Push mowers.\n- Trash grabbers and trash bags. Empty 40s and liquor bottles don't mix well with a mower blade, and it saves you from having to constantly bend over to pick them up.\n- Gloves. You *really* want to bring work gloves. The trash can get exceptionally nasty. I was not aware that an empty chip bag could be used as a portable urinal until I started doing this. Seriously, bring gloves. You'll thank me later.\n- Eye protection. Crap gets thrown everywhere. I wear [a set of these](http://www.amazon.com/20-Eyedefend-Allergy-Glasses-Earthtone/dp/B007RM28PO) to keep everything out of my eyes.\n- Ear protection. It can get loud when you've got 10-15 riding mowers running at the same time. I prefer [electronic ear protection](http://www.amazon.com/Howard-Leight-R-01526-Electronic-Earmuff/dp/B001T7QJ9O/) so I can block out the noise while still being able to hold a conversation.\n- Water. It gets hot out. We don't need people passing out.\n- Branch cutters. A lot of overgrowth gets tangled in fences and just about everything else.\n- Leaf blowers. This is more for grass than leaves. The grass is often 3+ feet tall. This results in *a lot* of grass clippings, and eventually causes the mowers to choke. As we're mowing, someone can hit the piles of grass clippings with the blower to spread them out a bit.\n- String trimmers. These are useful for cleaning up around the edges.\n- Eye drops and allergy pills. There's a crazy amount of grass and pollen in the air once we get moving. I forgot these last time, and my eyes were damn near swollen shut by the time it was over. However, thanks to the wonders of modern medicine, a few drops and a Benadryl can take care of the \"I have grass and pollen allergies\" excuse :). \n- Closed-toe shoes. Boots are better, but anything that covers your feet will work. Do not attempt to wear Crocs, sandals, or anything that exposes your toes. Actually, just don't wear Crocs. Ever.\n\n**Where can I get Detroit Mower Gang swag?**\n\nTalk to Tom Nardone, our leader and saviour. He's at every event. Tom has a system worked out with t-shirts, gloves, hoodies, etc based on the number of times you've volunteered. After enough times, you can eventually earn [a fighter jet](http://en.wikipedia.org/wiki/Leonard_v._Pepsico,_Inc.).\n\nHope this helps! There's a few other volunteers on here that can help answer any questions.",
  "gilded": 0,
  "score": 78,
  "removal_reason": null,
  "approved_by": null,
  "created_utc": 1373137239.0,
  "is_self": true,
  "stickied": false,
  "edited": 1373146561.0,
  "distinguished": null,
  "permalink": "https://www.reddit.com/r/Detroit/comments/1hrayg/want_to_volunteer_with_the_detroit_mower_gang/?ref=search_posts",
  "banned_by": null,
  "from_id": null,
  "likes": null,
  "_underscore_names": null,
  "num_reports": null,
  "link_flair_css_class": null,
  "_info_url": "https://api.reddit.com/api/info/",
  "id": "1hrayg",
  "archived": true,
  "secure_media": null,
  "from_kind": null,
  "saved": false,
  "domain": "self.Detroit",
  "ups": 78,
  "suggested_sort": null,
  "quarantine": false,
  "over_18": false,
  "hide_score": false,
  "url": "https://www.reddit.com/r/Detroit/comments/1hrayg/want_to_volunteer_with_the_detroit_mower_gang/",
  "subreddit_id": "t5_2qkko",
  "_params": {},
  "_comments": null,
  "_replaced_more": false,
  "_comments_by_id": {},
  "user_reports": [],
  "media_embed": {},
  "created": 1373137239.0,
  "author_flair_text": "iraqicamel's pants",
  "visited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>What is the Detroit Mower Gang?</strong></p>\n\n<p>The Detroit Mower Gang is a group of volunteers that meet every other Wednesday to clean up parks in Detroit. If you haven&#39;t noticed, the City of Detroit is in a <em>bit</em> of a financial crisis at the moment, and can&#39;t afford to maintain its massive number of parks. As a result, many of the parks become completely overgrown. This often results in blight, trash dumping, crime, and general badness in the area. Rather than writing strongly-worded letters to City Council, the Detroit Mower Gang decided to take matters into their own hands with direct action.</p>\n\n<p><strong>When are the Detroit Mower Gang events?</strong></p>\n\n<p>The location is posted <a href=\"https://www.facebook.com/MowerGang\">on the Facebook page</a> a few days before the event. People tend to arrive between 5-6PM, and the event usually goes until dusk. Check the <a href=\"https://www.facebook.com/MowerGang/events\">Events page</a> for the date, time, and location. There&#39;s usually between 10-20 people at each event.</p>\n\n<p><strong>Do I need a mower?</strong></p>\n\n<p>No, you just need to bring your lovely self. There&#39;s plenty of non-mower work than can be done: trash disposal, tree and branch trimming, grass clipping removal, playscape cleanup, etc. If you <em>do</em> have a mower, it always helps to bring it. Riding mowers are the staple of what we do, but push mowers excel in hitting the smaller areas that the riding mowers can&#39;t reach. There&#39;s always a need for raw grunt work. The goal is to get the park into a usable condition by the time it gets dark, and this often involves a lot more than just cutting grass.</p>\n\n<p><strong>What do I need to bring?</strong></p>\n\n<p>Any tools of flora destruction: trash bags, mowers, string trimmers, leaf blowers, branch cutters, weed and grass killer, etc. Basically, anything that can be used to help tame an overgrown park. If you don&#39;t have any of those, there&#39;s usually extra tools laying around that can be utilized. As mentioned above, a lot of this is grunt work that doesn&#39;t require any particular tools. There&#39;s <em>always</em> something to do if you volunteer.</p>\n\n<p><strong>What do other people bring?</strong></p>\n\n<ul>\n<li>Riding lawnmowers.</li>\n<li>Push mowers.</li>\n<li>Trash grabbers and trash bags. Empty 40s and liquor bottles don&#39;t mix well with a mower blade, and it saves you from having to constantly bend over to pick them up.</li>\n<li>Gloves. You <em>really</em> want to bring work gloves. The trash can get exceptionally nasty. I was not aware that an empty chip bag could be used as a portable urinal until I started doing this. Seriously, bring gloves. You&#39;ll thank me later.</li>\n<li>Eye protection. Crap gets thrown everywhere. I wear <a href=\"http://www.amazon.com/20-Eyedefend-Allergy-Glasses-Earthtone/dp/B007RM28PO\">a set of these</a> to keep everything out of my eyes.</li>\n<li>Ear protection. It can get loud when you&#39;ve got 10-15 riding mowers running at the same time. I prefer <a href=\"http://www.amazon.com/Howard-Leight-R-01526-Electronic-Earmuff/dp/B001T7QJ9O/\">electronic ear protection</a> so I can block out the noise while still being able to hold a conversation.</li>\n<li>Water. It gets hot out. We don&#39;t need people passing out.</li>\n<li>Branch cutters. A lot of overgrowth gets tangled in fences and just about everything else.</li>\n<li>Leaf blowers. This is more for grass than leaves. The grass is often 3+ feet tall. This results in <em>a lot</em> of grass clippings, and eventually causes the mowers to choke. As we&#39;re mowing, someone can hit the piles of grass clippings with the blower to spread them out a bit.</li>\n<li>String trimmers. These are useful for cleaning up around the edges.</li>\n<li>Eye drops and allergy pills. There&#39;s a crazy amount of grass and pollen in the air once we get moving. I forgot these last time, and my eyes were damn near swollen shut by the time it was over. However, thanks to the wonders of modern medicine, a few drops and a Benadryl can take care of the &quot;I have grass and pollen allergies&quot; excuse :). </li>\n<li>Closed-toe shoes. Boots are better, but anything that covers your feet will work. Do not attempt to wear Crocs, sandals, or anything that exposes your toes. Actually, just don&#39;t wear Crocs. Ever.</li>\n</ul>\n\n<p><strong>Where can I get Detroit Mower Gang swag?</strong></p>\n\n<p>Talk to Tom Nardone, our leader and saviour. He&#39;s at every event. Tom has a system worked out with t-shirts, gloves, hoodies, etc based on the number of times you&#39;ve volunteered. After enough times, you can eventually earn <a href=\"http://en.wikipedia.org/wiki/Leonard_v._Pepsico,_Inc.\">a fighter jet</a>.</p>\n\n<p>Hope this helps! There&#39;s a few other volunteers on here that can help answer any questions.</p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "_comment_sort": null,
  "report_reasons": null,
  "name": "t3_1hrayg",
  "from": null,
  "hidden": false,
  "clicked": false,
  "media": null,
  "json_dict": null,
  "_api_link": "https://api.reddit.com/r/Detroit/comments/1hrayg/want_to_volunteer_with_the_detroit_mower_gang/?ref=search_posts",
  "secure_media_embed": {},
  "mod_reports": [],
  "_orphaned": {},
  "_uniq": null,
  "num_comments": 0,
  "link_flair_text": null,
  "title": "Want to volunteer with the Detroit Mower Gang? Here's an unofficial primer.",
  "_has_fetched": true,
  "author_flair_css_class": null,
  "thumbnail": "self"
}