{
  "downs": 0,
  "mod_reports": [],
  "secure_media_embed": {},
  "_info_url": "https://api.reddit.com/api/info/",
  "gilded": 0,
  "num_comments": 0,
  "_orphaned": {},
  "hidden": false,
  "ups": 2,
  "url": "https://www.reddit.com/r/tabled/comments/25i91i/table_iama_ryan_walker_touring_member_of_imagine/",
  "_has_fetched": true,
  "quarantine": false,
  "name": "t3_25i91i",
  "author_flair_text": "",
  "user_reports": [],
  "saved": false,
  "permalink": "https://www.reddit.com/r/tabled/comments/25i91i/table_iama_ryan_walker_touring_member_of_imagine/?ref=search_posts",
  "over_18": false,
  "is_self": true,
  "_params": {},
  "thumbnail": "",
  "created_utc": 1400039468.0,
  "_replaced_more": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Verified?</strong> <em>(This bot cannot verify AMAs just yet)</em></p>\n\n<p><strong>Date:</strong> 2014-05-14</p>\n\n<p><strong><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/\">Link to submission</a></strong> (<em>Has self-text</em>)</p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Questions</th>\n<th align=\"left\">Answers</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhv8o1?context=5\">When I was in college I used to practice standup to Dan occasionally because he always laughed at my jokes. At the time he was hoping to make it big in music and I was an aspiring comedian.  One day a girl in my apartment complex wanted to meet him. I didn&#39;t think it was a big deal at the time because, well, he was just Dan, not famous or anything. But she was nervous so I told we could walk over there since the band was practicing and I’d make a joke about the song they had needing &quot;more cowbell.&quot; Well I didn&#39;t have a cowbell, so I took over a $6 triangle I had.  I came in with the girl who wanted to meet him and said &quot;you know what this song needs? More triangle!&quot; Then he said &quot;that sounds good&quot; and grabbed it to add to the song. It sounded really good, and I let him borrow the triangle. I think he and the girl went on a date later too (he was single at this point).  The other day I was listening to one of his songs and heard the triangle. Suddenly I remembered he never gave it back to me. Now, before he had the triangle you guys weren&#39;t famous, and after he got the triangle, you guys became famous. So I think we can agree that I&#39;m a large reason Imagine Dragons is famous.  So with that being said, can I get my triangle back? I&#39;ll also accept royalties. </a></td>\n<td align=\"left\">HAHA! Thats an amazing story. It sounds like you had a big part of the magic push. I will check with Dan and find out where the triangle is. Oh, and Dan going on a date with your guest doesn&#39;t surprise me. ;) He&#39;s happily married now with a beautiful baby girl. Talk soon!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhbzl4?context=5\">Do you often follow strangers on Instagram?  Also, are you going to Pittsburgh in June?  If so, can you bring me some vinyl from your bands?  In addition, if question two is true you should buy a nice pair if shoes before hand (and maybe cut your hair 😬)</a></td>\n<td align=\"left\">HA! I do follow strangers! @whoisryanwalker and yes I think I will be in Pittsburgh in June. #BlackandYellow BTW, why should I buy a nice pair of shoes?</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhc1ik?context=5\">When did you first start playing music?  Was the keyboard your first and only instrument you have played?</a></td>\n<td align=\"left\">When I was 12. My band was called Monkey Meets the Banana. We hit Vista, CA up with stickers all over town. I started on guitar and eventually moved to other instruments. Thanks for asking!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhukj7?context=5\">Why do you think there has been such an explosion of generic radio friendly corporate &quot;rock&quot; bands over the last decade?  Do you think it has to  do with the industry being driven more by singles and less by albums because of the digital revolution or do you have another theory?  Is hard rock (i.e. bands like Zepplin, Nirvana, etc) as a popular cultural phenomenon dead now?</a></td>\n<td align=\"left\">I think there has always been corporate radio friendly rock music. At least on some kind of level. The music industry is always evolving and changing. I can only imagine where things will be in another ten years.. singles vs full albums, downloads vs steaming. I really see downloads becoming less and less over the years to come as streaming sites like Spotify and Beats music keep growing. Leaving a major gap in sells and royalties for artists. I think the new Nirvana&#39;s are bands like Cage The Elephant &amp; Tame Impala. My buddy @socialsoundsystem has his ears to the industry if you would ever like to pick his brain. Rock on!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhesmc?context=5\">Hey, Ryan! I saw you play with Dragons 3 times in 2013. Amazing every time. I was in the front row of the Orlando show in September and it was the best show I&#39;ve ever had the pleasure of attending. I met you and the rest of the guys after the show and you were all nothing but humble and kind. Mac even helped me in completing my collection of the band&#39;s work (it&#39;s grown pretty out of control at this point). Anyway, thanks for the amazing memories. I hope there&#39;s another tour soon, I&#39;ve been craving to see a few more shows! Anyway, that aside. What&#39;s your funniest memory during the Night Visions tours? </a></td>\n<td align=\"left\">That would probably have to be Ben walking out in his underwear on stage during the support band&#39;s final song/set of tour. Atlas Genius, X Ambassadors, etc.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhc5dh?context=5\">Ryan! I met you at a coffee shop before a concert last spring in Minneapolis. You gave my 2 tickets to the sold out show and then we then barhopped after the concert with my friend and that girl Katie that worked at The Varsity (you knew her previously). That was one of the best nights of my college career and still one of my favorite stories to tell :) Thanks for being so chill and open to hanging out with people you don&#39;t even know!  2 questions: 1) Do you remember that? and 2) What is your favorite city that you visited on tour?</a></td>\n<td align=\"left\">I remember that! I was late to meet you guys. Beer / Mexican food place, right? My favorite city is Amsterdam.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhc269?context=5\">Hey bae  how&#39;s it like  NOT being on tour? I know it must be weird but great at the same time </a></td>\n<td align=\"left\">I write music all day but it can be boring. That&#39;s why I&#39;m doing this stuff.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhmpc4?context=5\">If they made a movie about your life,  who would play you (other than yourself)?</a></td>\n<td align=\"left\">Ethnicity aside, I would say Will Smith! Love that dude.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhce7h?context=5\">I have this mental image of you and Platz being best bro friends, pranking everyone else, goofing around, hitting on girls in bars (hint hint let&#39;s go to a bar??? ;)), basically causing a hilarious ruckus. Please comment??</a></td>\n<td align=\"left\">Platz it a big time lover and one of my best friends. Actually, Platz is the only one who won&#39;t prank. We talk sports rather than hit bars. ;)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chheefd?context=5\">You mentioned listening to The Beach Boys in that Tweet. Now may I ask for your favorite Beach Boys song, album, member, and lyric? In addition, do you feel the aforementioned group has had any sort of influence on them Dragons? Thank you for your time Mr. Walker.</a></td>\n<td align=\"left\">Nothing to do with Imagine Dragons and mores Dreamers. Four-piece harmonies are where it&#39;s at.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Favorite song: God Only Knows, Pet Sounds, Carl and Brian because he&#39;s still active and still plays.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhc509?context=5\">What was it like playing Radioactive live on SNL with Kendrick Lamar?  That was a pretty spectacular rendition.. </a></td>\n<td align=\"left\">It was a dream come true. Kendrick is the most talented MC in the game right now. Amazing.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhf39e?context=5\">Will you be touring with Imagine Dragons when they promote their next album? Or was it just a one time thing?</a></td>\n<td align=\"left\">Of course! I&#39;m a touring member you&#39;ll see me on stage as long as Imagine Dragons is around <em>fingers crossed</em></td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhebnv?context=5\">What&#39;s your favourite song off the dreamers album? i&#39;m torn between the dreamers, snapback and little things (the whole album is incredible it&#39;s so hard to choose)</a></td>\n<td align=\"left\">Thanks! Snapback is my favorite song off that record... The opening guitar riff is one of my favorite I&#39;ve ever written. It has this weird long bridge. There&#39;s basically  no rules to the structure of that song.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhc4w0?context=5\">Why &quot;Wolf&quot;? Also I know you like hats, what&#39;s your favorite kind? </a></td>\n<td align=\"left\">Anything that helps when I have a bad hair day!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhcgcs?context=5\">Haha I don&#39;t think you can have a bad hair day!</a></td>\n<td align=\"left\">Is that a dare?</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhgmn4?context=5\">I must to go sleep and my creativity has gone so my lasts questions are:  1)Have you afraid of break your neck when you shake your head on stage? I have, take care haha but I love see you jump.  2) Do you like books? If yes, what&#39;s your favorite?  Also, wish me a good night and good Dreams? The same to you xo.</a></td>\n<td align=\"left\">I stretch so my neck is ok. For now. Good morning and I hope you had nice dreams. #DreamersCanDream.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhc33y?context=5\">Greetings from Ireland! Where did you get the nickname &quot;Wolf&quot; from?</a></td>\n<td align=\"left\">Dan from the band named me wolf bc of my eyes. I guess. ha.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhhjjh?context=5\">Hey Ryan! I&#39;m currently going to school for live sound and I&#39;m an aspiring monitor engineer.  Whats the best advice you could give me?</a></td>\n<td align=\"left\">Thats awesome! I don&#39;t know too much about monitor engineering but I know how valuable you are to the entertainment industry. Our guy Jared is super talented and we consider him a fifth member of the band. Thats how important he is to us. We use in ears. If you like to travel you can really do well between working for a touring act and having a steady local venue gig. Good luck and keep me posted on your progress!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhcvm5?context=5\">Hey Ryan!  Does Dreamers have any plans to do some shows in Canada in the future? (OSHEAGA MONTRÉAL is coming up again wink wink!)  How did you end up playing for Imagine Dragons?  Favourite place in the world, either then home? </a></td>\n<td align=\"left\">No plans of touring right now. Just writing music at the moment!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhct78?context=5\">How did you get your passion for music? </a></td>\n<td align=\"left\">Standing on side stage at a venue called Soma in San Diego. I was a concert junky so the venue eventually just let me in free whenever I wanted to go to a show. Bad Religion, Korn, Blink etc.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhedg4?context=5\">Hey! I miss jamming out front row with you haha, can&#39;t wait to see y&#39;all again whenever that may be! BUT my question is, which two teams do you think are going to the NBA Finals? And, if you could only watch one thing for the rest of your life (movie, tv show, funny video, whatever!), what would it be?</a></td>\n<td align=\"left\">I freakin&#39; love sports. NBA Finals: San Antonio and Miami (Again...)</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">As far as watching something... Maybe It&#39;s Always Sunny In Philadelphia. Shit is amazing. When The Gang Tries Desperately to Win an Award... the ending with Charlie is classic.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">GO FUCK YOURSELF!!! Hahadhgfh.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">There&#39;s a spider deep in my soul!!! Oh my god I was crying...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhwa3f?context=5\">What are the best and worst parts of being in a famous band?</a></td>\n<td align=\"left\">Best: traveling the world and meeting new people. Worst: People think I have money. NOT THE CASE for a touring member. ;)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhf4j3?context=5\">What is the craziest thing a fan has done?? Other than some chick driving from LA to Vegas just to see you ;) </a></td>\n<td align=\"left\">Me stepping over a girl outside of my hotel room in Japan in the morning. She slept there.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">That&#39;s funny on my google hangout earlier today someone said my new album should be called Hotel Singles because I only get to work on my music in hotel rooms.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhc27z?context=5\">Wolf wolf wolf. its cori :-) whats your favorite thing about NYC?</a></td>\n<td align=\"left\">Central Park and all the Museums!</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Stay away from Time Square.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhcxtk?context=5\">Where did you get the band name &quot;Dreamers&quot;? The name suits so well with the music especially &quot;The Dreamers&quot; and &quot;Silence to Science&quot;, they both have such a dreamy quality! The excellent music videos definitely add to this effect!</a></td>\n<td align=\"left\">Thank you! I came from sitting on the beach in Santa Monica playing my guitar. It just pop&#39;d in my head.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhd8yi?context=5\">Last questions from me as it&#39;s 2:30AM and I need to dream! What is your favourite thing about touring and what is your favourite song to perform live?</a></td>\n<td align=\"left\">Tip Toe is my favorite song to play live.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Favorite part of touring is meeting fans. It&#39;s a trip.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhcm6u?context=5\">Do you think you&#39;ll have vinyls of the new album?</a></td>\n<td align=\"left\">I&#39;m sure they will. We&#39;re listening to the Beach Boys on vinyl right now.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhcnqs?context=5\">Do you have a snapchat account for fans like Ben&#39;s?</a></td>\n<td align=\"left\">No snapchat but I&#39;m trying out this burner app thing.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhc3qo?context=5\">Where are your favorite places in LA to hangout? And can you wish me a happy belated 24th birthday? My birthday was on Sunday :)</a></td>\n<td align=\"left\">El Compadre, Gold Room, Cactus Tacos, Hermosa Beach. Happy Birthday! Have a great one.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhdfx0?context=5\">Just over a month until you play a festival in switzerland! you looking forward to it? (and are you looking forward to seeing me and lucy again?)</a></td>\n<td align=\"left\">Beautiful people, beautiful country. I can&#39;t wait to visit!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhcyeb?context=5\">Will there be hard copy CDs of the new dreamers album? And will you go on tour with dreamers? </a></td>\n<td align=\"left\">Yes! Check back as music comes out. Talk soon!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhij5l?context=5\">What are some pros and cons with being well known. Now that a lot of people know who you are do you find yourself doing things differently?</a></td>\n<td align=\"left\">I&#39;m not really well known at this point in my career and I honestly really don&#39;t care to be. I&#39;m finding myself steering away from pictures etc. I rarely get recognized when I&#39;m in public and thats a really nice thing. It&#39;s amazing that I can have that kind of freedom and still support a really hot band like Imagine Dragons. When I am recognized I don&#39;t mind talking with fans and taking pictures... I&#39;ll stick around and chat as long as they want. I like interacting with everyone. It&#39;s enjoyable to me. In my mind nothing really separates me from a fan. I guess I just don&#39;t see myself as someone who is famous.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhc3rr?context=5\">Ryan, care to explain where you learned to give such awesome hugs??</a></td>\n<td align=\"left\">From fans like you!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhemuh?context=5\">When you were a child, what profession you wanted have? Before you want be a musician.</a></td>\n<td align=\"left\">I always wanted to be a musician. The first time I saw Michael Jackson I wanted to be a musician... I can&#39;t remember back that far. That was it.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I think it was a pepsi commercial. I don&#39;t know. HA!</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\"><em>EDIT</em> Oh shit! Thats the one he got burned! That&#39;s crazy when I think of that.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhdd3t?context=5\">Where did we get the ideas for the The Dreamers and Silence to Science videos? </a></td>\n<td align=\"left\">My brother Barry Walker is a super talented director. He did the The Dreamers video in a single take.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I think he shot this vid for my friends in <a href=\"http://www.youtube.com/watch?v=dQsQtuEM7Oo\">Iration</a> recently</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhwuvq?context=5\">Hey! I&#39;m back.  What you like to do when are with your family? Ah, I have to say that Carter is so cute, I love see pics of you two. </a></td>\n<td align=\"left\">Thanks! We enjoy going to the Oceanside harbor, bowling, watching movies, exploring Downtown Los Angeles (where I live), farmers markets, cooking, games and camping. Carter is the best! My lil homie.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhebzk?context=5\">Hey wolf! Do you plan to visit new orleans?</a></td>\n<td align=\"left\">New Orleans is one of my favorite cities in the US. So much fun and so much history/&quot;class.&quot; We got to play there for the Sugar Bowl this past year.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Laissez les bon temps rouler!!!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chherbc?context=5\">That&#39;s awesome! can&#39;t wait to see you again sometime! I was in the front row of that concert! You were amazing but that tambourine catch...</a></td>\n<td align=\"left\">Ha! Did I drop it???</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhcwgw?context=5\">About the shirts: will they be available to buy even after they reach 30 sales? </a></td>\n<td align=\"left\">These will be available for 2 weeks and that&#39;s it! Thinking about doing a limited edition shirt for each release.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhd1lc?context=5\">THAT MAKES ME VERY STRESSED BUT I WILL MAKE SURE TO GET ONE </a></td>\n<td align=\"left\">If it reaches 30 sales that means it will go into print. We will have the Dreamers official logo tee on the Dreamers website which is launching next week too.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhf0jr?context=5\">Just got tickets today to see the Black Keys live in Dallas! Wanna come with?</a></td>\n<td align=\"left\">Does that mean flights as well? j/k Enjoy Cage the Elephant. Say hello to Matt for me!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhfe7e?context=5\">Have you ever thought in paint your hair with any crazy color? </a></td>\n<td align=\"left\">When I was in my high school punk band I&#39;d dye my hair blue and red and bleach it.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhcepf?context=5\">What made you want to tour with them?</a></td>\n<td align=\"left\">I started as tour manager before the band found out I can play music. Luck me!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhe7gk?context=5\">Will there be a dreamers tour soon? </a></td>\n<td align=\"left\">No Dreamers tours planned yet. I still need to form a band! HA.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhft9c?context=5\">What&#39;s your favorite kind of candies?</a></td>\n<td align=\"left\">Anything with peanut butter and chocolate.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhdyg3?context=5\">I&#39;m curious. What time is it where you are? Haha </a></td>\n<td align=\"left\">PST. 7:10pm. You?</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhfdnp?context=5\">Been a fan of you guys only for about 2 years. I went to the first show in Minnesota. But my question is is when did you guys realize you were going to hit it big? I saw the look on everyone&#39;s face on stage when we were singing the songs. </a></td>\n<td align=\"left\">I think that &quot;Oh shit&quot; moment was at Red Rocks. That&#39;s when there was no turning back.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">We still love the Varsity Theatre! We love Minnesota :)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhctd7?context=5\">Hey I LOVE your music sooo much. You are a big inspiration and it would mean so much to me if you followed me!@hannadowns76-twitter hanna__banana7-Instagram But I would like to know how did your interest in music start?</a></td>\n<td align=\"left\">It started when my brother was the manager for the band Korn. They taught me how to play guitar.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhd9n9?context=5\">Not Thomas. Not even close man. Not even close.</a></td>\n<td align=\"left\">No, no. I call bro&#39;s and dudes Thomas!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhc5ea?context=5\">What do you feel about the #44 pick in the NFL draft Cyrus Kouandjio walking out to Radioactive.</a></td>\n<td align=\"left\">He&#39;s alright with me since he&#39;s in a different conference.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">In other news, I&#39;m very happy with the Chargers CB pickup Jason Verrett.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhf03q?context=5\">Omg he wrote radioactive!</a></td>\n<td align=\"left\">I didn&#39;t write Radioactive, the guys wrote it.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhel85?context=5\">Hello! I love your song Radioactive and was wondering what was your though process when crafting the song thanks&lt;333.</a></td>\n<td align=\"left\">I didn&#39;t write it.. Dan did!</td>\n</tr>\n</tbody></table>\n\n<p><em>Last updated: 2014-05-18 01:52 UTC</em></p>\n\n<p><em>This post was generated by a robot! Send all complaints to <a href=\"/message/compose/?to=epsy\">epsy</a>.</em></p>\n</div><!-- SC_ON -->",
  "author_flair_css_class": "tabler",
  "subreddit_id": "t5_2tkmw",
  "archived": true,
  "domain": "self.tabled",
  "clicked": false,
  "score": 2,
  "id": "25i91i",
  "stickied": false,
  "media_embed": {},
  "visited": false,
  "selftext": "**Verified?** *(This bot cannot verify AMAs just yet)*\n\n**Date:** 2014-05-14\n\n**[Link to submission](http://www.reddit.com/r/IAmA/comments/25hxo7/)** (*Has self-text*)\n\n\n\nQuestions|Answers\n:--|:--\n[When I was in college I used to practice standup to Dan occasionally because he always laughed at my jokes. At the time he was hoping to make it big in music and I was an aspiring comedian.  One day a girl in my apartment complex wanted to meet him. I didn't think it was a big deal at the time because, well, he was just Dan, not famous or anything. But she was nervous so I told we could walk over there since the band was practicing and I’d make a joke about the song they had needing \"more cowbell.\" Well I didn't have a cowbell, so I took over a $6 triangle I had.  I came in with the girl who wanted to meet him and said \"you know what this song needs? More triangle!\" Then he said \"that sounds good\" and grabbed it to add to the song. It sounded really good, and I let him borrow the triangle. I think he and the girl went on a date later too (he was single at this point\\).  The other day I was listening to one of his songs and heard the triangle. Suddenly I remembered he never gave it back to me. Now, before he had the triangle you guys weren't famous, and after he got the triangle, you guys became famous. So I think we can agree that I'm a large reason Imagine Dragons is famous.  So with that being said, can I get my triangle back? I'll also accept royalties. ](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhv8o1?context=5)|HAHA! Thats an amazing story. It sounds like you had a big part of the magic push. I will check with Dan and find out where the triangle is. Oh, and Dan going on a date with your guest doesn't surprise me. ;) He's happily married now with a beautiful baby girl. Talk soon! \n[Do you often follow strangers on Instagram?  Also, are you going to Pittsburgh in June?  If so, can you bring me some vinyl from your bands?  In addition, if question two is true you should buy a nice pair if shoes before hand (and maybe cut your hair 😬\\)](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhbzl4?context=5)|HA! I do follow strangers! @whoisryanwalker and yes I think I will be in Pittsburgh in June. #BlackandYellow BTW, why should I buy a nice pair of shoes? \n[When did you first start playing music?  Was the keyboard your first and only instrument you have played?](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhc1ik?context=5)|When I was 12. My band was called Monkey Meets the Banana. We hit Vista, CA up with stickers all over town. I started on guitar and eventually moved to other instruments. Thanks for asking! \n[Why do you think there has been such an explosion of generic radio friendly corporate \"rock\" bands over the last decade?  Do you think it has to  do with the industry being driven more by singles and less by albums because of the digital revolution or do you have another theory?  Is hard rock (i.e. bands like Zepplin, Nirvana, etc\\) as a popular cultural phenomenon dead now?](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhukj7?context=5)|I think there has always been corporate radio friendly rock music. At least on some kind of level. The music industry is always evolving and changing. I can only imagine where things will be in another ten years.. singles vs full albums, downloads vs steaming. I really see downloads becoming less and less over the years to come as streaming sites like Spotify and Beats music keep growing. Leaving a major gap in sells and royalties for artists. I think the new Nirvana's are bands like Cage The Elephant & Tame Impala. My buddy @socialsoundsystem has his ears to the industry if you would ever like to pick his brain. Rock on! \n[Hey, Ryan! I saw you play with Dragons 3 times in 2013. Amazing every time. I was in the front row of the Orlando show in September and it was the best show I've ever had the pleasure of attending. I met you and the rest of the guys after the show and you were all nothing but humble and kind. Mac even helped me in completing my collection of the band's work (it's grown pretty out of control at this point\\). Anyway, thanks for the amazing memories. I hope there's another tour soon, I've been craving to see a few more shows! Anyway, that aside. What's your funniest memory during the Night Visions tours? ](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhesmc?context=5)|That would probably have to be Ben walking out in his underwear on stage during the support band's final song/set of tour. Atlas Genius, X Ambassadors, etc. \n[Ryan! I met you at a coffee shop before a concert last spring in Minneapolis. You gave my 2 tickets to the sold out show and then we then barhopped after the concert with my friend and that girl Katie that worked at The Varsity (you knew her previously\\). That was one of the best nights of my college career and still one of my favorite stories to tell :\\) Thanks for being so chill and open to hanging out with people you don't even know!  2 questions: 1\\) Do you remember that? and 2\\) What is your favorite city that you visited on tour?](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhc5dh?context=5)|I remember that! I was late to meet you guys. Beer / Mexican food place, right? My favorite city is Amsterdam. \n[Hey bae  how's it like  NOT being on tour? I know it must be weird but great at the same time ](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhc269?context=5)|I write music all day but it can be boring. That's why I'm doing this stuff.\n[If they made a movie about your life,  who would play you (other than yourself\\)?](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhmpc4?context=5)|Ethnicity aside, I would say Will Smith! Love that dude.\n[I have this mental image of you and Platz being best bro friends, pranking everyone else, goofing around, hitting on girls in bars (hint hint let's go to a bar??? ;\\)\\), basically causing a hilarious ruckus. Please comment??](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhce7h?context=5)|Platz it a big time lover and one of my best friends. Actually, Platz is the only one who won't prank. We talk sports rather than hit bars. ;) \n[You mentioned listening to The Beach Boys in that Tweet. Now may I ask for your favorite Beach Boys song, album, member, and lyric? In addition, do you feel the aforementioned group has had any sort of influence on them Dragons? Thank you for your time Mr. Walker.](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chheefd?context=5)|Nothing to do with Imagine Dragons and mores Dreamers. Four-piece harmonies are where it's at.\n |Favorite song: God Only Knows, Pet Sounds, Carl and Brian because he's still active and still plays.\n[What was it like playing Radioactive live on SNL with Kendrick Lamar?  That was a pretty spectacular rendition.. ](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhc509?context=5)|It was a dream come true. Kendrick is the most talented MC in the game right now. Amazing.\n[Will you be touring with Imagine Dragons when they promote their next album? Or was it just a one time thing?](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhf39e?context=5)|Of course! I'm a touring member you'll see me on stage as long as Imagine Dragons is around *fingers crossed*\n[What's your favourite song off the dreamers album? i'm torn between the dreamers, snapback and little things (the whole album is incredible it's so hard to choose\\)](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhebnv?context=5)|Thanks! Snapback is my favorite song off that record... The opening guitar riff is one of my favorite I've ever written. It has this weird long bridge. There's basically  no rules to the structure of that song.\n[Why \"Wolf\"? Also I know you like hats, what's your favorite kind? ](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhc4w0?context=5)|Anything that helps when I have a bad hair day!\n[Haha I don't think you can have a bad hair day!](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhcgcs?context=5)|Is that a dare?\n[I must to go sleep and my creativity has gone so my lasts questions are:  1\\)Have you afraid of break your neck when you shake your head on stage? I have, take care haha but I love see you jump.  2\\) Do you like books? If yes, what's your favorite?  Also, wish me a good night and good Dreams? The same to you xo.](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhgmn4?context=5)|I stretch so my neck is ok. For now. Good morning and I hope you had nice dreams. #DreamersCanDream.\n[Greetings from Ireland! Where did you get the nickname \"Wolf\" from?](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhc33y?context=5)|Dan from the band named me wolf bc of my eyes. I guess. ha. \n[Hey Ryan! I'm currently going to school for live sound and I'm an aspiring monitor engineer.  Whats the best advice you could give me?](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhhjjh?context=5)|Thats awesome! I don't know too much about monitor engineering but I know how valuable you are to the entertainment industry. Our guy Jared is super talented and we consider him a fifth member of the band. Thats how important he is to us. We use in ears. If you like to travel you can really do well between working for a touring act and having a steady local venue gig. Good luck and keep me posted on your progress! \n[Hey Ryan!  Does Dreamers have any plans to do some shows in Canada in the future? (OSHEAGA MONTRÉAL is coming up again wink wink!\\)  How did you end up playing for Imagine Dragons?  Favourite place in the world, either then home? ](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhcvm5?context=5)|No plans of touring right now. Just writing music at the moment! \n[How did you get your passion for music? ](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhct78?context=5)|Standing on side stage at a venue called Soma in San Diego. I was a concert junky so the venue eventually just let me in free whenever I wanted to go to a show. Bad Religion, Korn, Blink etc. \n[Hey! I miss jamming out front row with you haha, can't wait to see y'all again whenever that may be! BUT my question is, which two teams do you think are going to the NBA Finals? And, if you could only watch one thing for the rest of your life (movie, tv show, funny video, whatever!\\), what would it be?](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhedg4?context=5)|I freakin' love sports. NBA Finals: San Antonio and Miami (Again...)\n |As far as watching something... Maybe It's Always Sunny In Philadelphia. Shit is amazing. When The Gang Tries Desperately to Win an Award... the ending with Charlie is classic.\n |GO FUCK YOURSELF!!! Hahadhgfh.\n |There's a spider deep in my soul!!! Oh my god I was crying... \n[What are the best and worst parts of being in a famous band?](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhwa3f?context=5)|Best: traveling the world and meeting new people. Worst: People think I have money. NOT THE CASE for a touring member. ;) \n[What is the craziest thing a fan has done?? Other than some chick driving from LA to Vegas just to see you ;\\) ](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhf4j3?context=5)|Me stepping over a girl outside of my hotel room in Japan in the morning. She slept there.\n |That's funny on my google hangout earlier today someone said my new album should be called Hotel Singles because I only get to work on my music in hotel rooms.\n[Wolf wolf wolf. its cori :-\\) whats your favorite thing about NYC?](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhc27z?context=5)|Central Park and all the Museums!\n |Stay away from Time Square.\n[Where did you get the band name \"Dreamers\"? The name suits so well with the music especially \"The Dreamers\" and \"Silence to Science\", they both have such a dreamy quality! The excellent music videos definitely add to this effect!](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhcxtk?context=5)|Thank you! I came from sitting on the beach in Santa Monica playing my guitar. It just pop'd in my head. \n[Last questions from me as it's 2:30AM and I need to dream! What is your favourite thing about touring and what is your favourite song to perform live?](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhd8yi?context=5)|Tip Toe is my favorite song to play live.\n |Favorite part of touring is meeting fans. It's a trip.\n[Do you think you'll have vinyls of the new album?](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhcm6u?context=5)|I'm sure they will. We're listening to the Beach Boys on vinyl right now.\n[Do you have a snapchat account for fans like Ben's?](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhcnqs?context=5)|No snapchat but I'm trying out this burner app thing.\n[Where are your favorite places in LA to hangout? And can you wish me a happy belated 24th birthday? My birthday was on Sunday :\\)](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhc3qo?context=5)|El Compadre, Gold Room, Cactus Tacos, Hermosa Beach. Happy Birthday! Have a great one. \n[Just over a month until you play a festival in switzerland! you looking forward to it? (and are you looking forward to seeing me and lucy again?\\)](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhdfx0?context=5)|Beautiful people, beautiful country. I can't wait to visit!\n[Will there be hard copy CDs of the new dreamers album? And will you go on tour with dreamers? ](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhcyeb?context=5)|Yes! Check back as music comes out. Talk soon! \n[What are some pros and cons with being well known. Now that a lot of people know who you are do you find yourself doing things differently?](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhij5l?context=5)|I'm not really well known at this point in my career and I honestly really don't care to be. I'm finding myself steering away from pictures etc. I rarely get recognized when I'm in public and thats a really nice thing. It's amazing that I can have that kind of freedom and still support a really hot band like Imagine Dragons. When I am recognized I don't mind talking with fans and taking pictures... I'll stick around and chat as long as they want. I like interacting with everyone. It's enjoyable to me. In my mind nothing really separates me from a fan. I guess I just don't see myself as someone who is famous.\n[Ryan, care to explain where you learned to give such awesome hugs??](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhc3rr?context=5)|From fans like you! \n[When you were a child, what profession you wanted have? Before you want be a musician.](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhemuh?context=5)|I always wanted to be a musician. The first time I saw Michael Jackson I wanted to be a musician... I can't remember back that far. That was it.\n |I think it was a pepsi commercial. I don't know. HA!\n |*EDIT* Oh shit! Thats the one he got burned! That's crazy when I think of that.\n[Where did we get the ideas for the The Dreamers and Silence to Science videos? ](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhdd3t?context=5)|My brother Barry Walker is a super talented director. He did the The Dreamers video in a single take.\n |I think he shot this vid for my friends in [Iration](http://www.youtube.com/watch?v=dQsQtuEM7Oo) recently \n[Hey! I'm back.  What you like to do when are with your family? Ah, I have to say that Carter is so cute, I love see pics of you two. ](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhwuvq?context=5)|Thanks! We enjoy going to the Oceanside harbor, bowling, watching movies, exploring Downtown Los Angeles (where I live), farmers markets, cooking, games and camping. Carter is the best! My lil homie. \n[Hey wolf! Do you plan to visit new orleans?](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhebzk?context=5)|New Orleans is one of my favorite cities in the US. So much fun and so much history/\"class.\" We got to play there for the Sugar Bowl this past year.\n |Laissez les bon temps rouler!!!\n[That's awesome! can't wait to see you again sometime! I was in the front row of that concert! You were amazing but that tambourine catch...](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chherbc?context=5)|Ha! Did I drop it???\n[About the shirts: will they be available to buy even after they reach 30 sales? ](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhcwgw?context=5)|These will be available for 2 weeks and that's it! Thinking about doing a limited edition shirt for each release.\n[THAT MAKES ME VERY STRESSED BUT I WILL MAKE SURE TO GET ONE ](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhd1lc?context=5)|If it reaches 30 sales that means it will go into print. We will have the Dreamers official logo tee on the Dreamers website which is launching next week too.\n[Just got tickets today to see the Black Keys live in Dallas! Wanna come with?](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhf0jr?context=5)|Does that mean flights as well? j/k Enjoy Cage the Elephant. Say hello to Matt for me!\n[Have you ever thought in paint your hair with any crazy color? ](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhfe7e?context=5)|When I was in my high school punk band I'd dye my hair blue and red and bleach it. \n[What made you want to tour with them?](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhcepf?context=5)|I started as tour manager before the band found out I can play music. Luck me! \n[Will there be a dreamers tour soon? ](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhe7gk?context=5)|No Dreamers tours planned yet. I still need to form a band! HA.\n[What's your favorite kind of candies?](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhft9c?context=5)|Anything with peanut butter and chocolate.\n[I'm curious. What time is it where you are? Haha ](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhdyg3?context=5)|PST. 7:10pm. You? \n[Been a fan of you guys only for about 2 years. I went to the first show in Minnesota. But my question is is when did you guys realize you were going to hit it big? I saw the look on everyone's face on stage when we were singing the songs. ](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhfdnp?context=5)|I think that \"Oh shit\" moment was at Red Rocks. That's when there was no turning back.\n |We still love the Varsity Theatre! We love Minnesota :)\n[Hey I LOVE your music sooo much. You are a big inspiration and it would mean so much to me if you followed me!@hannadowns76-twitter hanna__banana7-Instagram But I would like to know how did your interest in music start?](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhctd7?context=5)|It started when my brother was the manager for the band Korn. They taught me how to play guitar. \n[Not Thomas. Not even close man. Not even close.](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhd9n9?context=5)|No, no. I call bro's and dudes Thomas! \n[What do you feel about the #44 pick in the NFL draft Cyrus Kouandjio walking out to Radioactive.](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhc5ea?context=5)|He's alright with me since he's in a different conference.\n |In other news, I'm very happy with the Chargers CB pickup Jason Verrett.\n[Omg he wrote radioactive!](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhf03q?context=5)|I didn't write Radioactive, the guys wrote it.\n[Hello! I love your song Radioactive and was wondering what was your though process when crafting the song thanks<333.](http://www.reddit.com/r/IAmA/comments/25hxo7/iama_ryan_walker_touring_member_of_imagine/chhel85?context=5)|I didn't write it.. Dan did!\n\n\n*Last updated: 2014-05-18 01:52 UTC*\n\n*This post was generated by a robot! Send all complaints to [epsy](/message/compose/?to=epsy).*\n\n",
  "hide_score": false,
  "_api_link": "https://api.reddit.com/r/tabled/comments/25i91i/table_iama_ryan_walker_touring_member_of_imagine/?ref=search_posts",
  "locked": false,
  "edited": 1400378126.0,
  "title": "[Table] IAmA: Ryan Walker, touring member of Imagine Dragons, part-Wolf, part-Shark, and full-time Dreamer. Ask Me Anything!",
  "created": 1400039468.0,
  "_comments_by_id": {}
}