{
  "downs": 0,
  "mod_reports": [],
  "secure_media_embed": {},
  "_info_url": "https://api.reddit.com/api/info/",
  "gilded": 0,
  "num_comments": 6,
  "_orphaned": {},
  "hidden": false,
  "ups": 10,
  "url": "https://www.reddit.com/r/hitchhiking/comments/2y8okf/its_too_cold_to_travel_now_so_heres_a_few/",
  "_has_fetched": true,
  "quarantine": false,
  "name": "t3_2y8okf",
  "user_reports": [],
  "saved": false,
  "permalink": "https://www.reddit.com/r/hitchhiking/comments/2y8okf/its_too_cold_to_travel_now_so_heres_a_few/?ref=search_posts",
  "over_18": false,
  "is_self": true,
  "_params": {},
  "thumbnail": "",
  "created_utc": 1425737981.0,
  "_replaced_more": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been working on the book for years. (kind of)  </p>\n\n<p>Here&#39;s some of it- still in rough draft form.  </p>\n\n<p>Sometimes It’s hard to bum a ride. but the best one comes when you least expect it..  </p>\n\n<p>I go a ride with an old man in a shiny grey Cadillac who said he had a staff of people working for him offered me some vague form of a driving job.  He had to be in his seventies, but still active enough to drive.  He talked rather slow and asked me questions about where I grew up and what I did as a kid in Wisconsin.  he told me he would take me to a movie.  HE told me he would give me a steady job driving.. He kept asking me- “would you like that, enoz_moth_balls?”  I said of course, yes.    </p>\n\n<p>We drove south into Santa Barbera on the 101.  He handed me twenty seven dollars.  I wrote down his phone number at his insistence.   He had a slight gay vibe but made no pass at me.  He was nice enough, even dropped me off in a fancy restaurant and told the head waiter to take care of me.  I had the feeling the waiter didn’t recognize him, and the old guy was trying to make it seemed to me like he was a regular customer there.    </p>\n\n<p>But I was wrong because the server told me I was taken care of so get whatever.  I had  two beers, Roast Duck L’orange and whipped potatoes with creme brulee for dessert and a glass of pink wine.  Then I walked outside into the bright sunlight. I crumpled up dudes number and tossed it in  trash can  as I headed down the sidewalk.  I passed some guys playing guitar and listened to their music for a few brief moments.  I put two dollars in their hat and walked on with a spring in my step.    </p>\n\n<p>That night I slept on the beach with the ocean tides lulling me to sleep.  The next morning I hitchhiked south towards san diego.   </p>\n\n<p>Now I have a sign.   </p>\n\n<p>This morning I woke up on cement in a park in central san diego.  I had a court date to go to.  A law officer on a motorcycle had given me a ticket for walking on the street with an open beer, which he dumped out in front of me.  That was four weeks ago or so.   </p>\n\n<p>Anyway, at the courthouse they first won’t let me in through the doors because a scan of my bag indicates a roll of duct tape, my pocket knife, an aerosol can, and a pair of fake handcuffs.  I went back outside, wrapped all that shit up and stuck it in a bush.  I went back inside, through security, and waited in line for an hour.   </p>\n\n<p>When i got to the window she looked up my name and found nothing. she let me go.  and  I said to myself- “what the fuck?  Why not go for it?”  By “it” I meant my dream, my goal, to go from california to florida hitchhiking by the end of the year.  Of course I’ll probably end up in wisconsin before I make it to florida, or i’ll be dead.    </p>\n\n<p>I’ve come to the conclusion that anyone who picks up hitchhikers can fit into four or five basic categories.  1. all around good, nice people. 2. violent psychopaths. 3. lonely people 4. horny people and there’s a fifth type too, but damned if I know what it is yet.   </p>\n\n<p>So back to the story of my day.  I walked from the courthouse to a bus, getting a ride to fashion valley.  I helped an old woman lift her walker onto the bus.  I felt all proud, my good deed for the week had been done, and now I could cause some damage. Just kidding.   </p>\n\n<p>I headed up an on ramp to hwy 8.  My plan now is to take the eight to florida.    </p>\n\n<p>Hitched a ride with a tow truck driver named george.  He bought me a soda pop.  While we were at the counter paying a commotion outside caught our attention.  An attendant was screaming accident and pointing, four of us ran outside to see the damage. a little black car had sideswiped a white pickup truck, which had flipped sideways.    </p>\n\n<p>As I approached The female driver of the small black car, dressed all in black was crying.  She said she had dodged another car  that was in the wrong lane and her swerving caused the collision.  I saw a man jump out of the passenger window of the truck, apparently unharmed. I saw three people call 911. The driver of the truck laid still for a few moments.   He started moving slowly but he wasn’t responding.    </p>\n\n<p>I dunno.  Then we left.   </p>\n\n<p>My next ride was from a deadhead who had been to 27 shows.  But that was nothing compared to his brother, who had been to over 60 shows.  I was riveted.  I told him about the guy I met who had been a light and sound guy for the dead and how he had a seizure in santa monica.   </p>\n\n<p>So the deadhead guy dropped me off at vista point, a spot for people to park and lookout at the mountains and stuff.  mostly truckers.  two big rigs were in the parking spaces.  I went up to the first one, a yellow cab, and got the man’s attention.  He was mexican, and in his late forties.  I asked him if he could give me a lift.  He said no right off the bat.  I said o.k, that’s cool.  I moved on.  I couldn&#39;t see anyone in the next cab, so i walked to the fence line, jumped it, and took a pis in the bushes.   </p>\n\n<p>As I was coming back from that I saw the old mexican trucker and an old mexican woman.  The man handed me an apple and a can of diet caffeine free pepsi.  “I can and will give you a ride to the next town.  His name was hector, and hers was Mona.  They had six kids, and spent most of the ride talking about their three hot daughters, one of whom was a fbi agent, one of whom was a model, and one still in school.  Their 26 year old son had a daughter, lived on the streets, did drugs, never called home, and was generally a negative influence on their happy life. Hector used to love to drink until mona said booze or family.  He chose family.   </p>\n\n<p>Mona also talked him into picking me up.  She had been a trucker for five years, him for 26.  In all that time, neither one had ever picked up a hitchhiker.  They were good people.  they gave me two pairs of socks, which every traveller knows and respects the importance of.  Also he slipped me eleven bucks, as long as I promised to spend it on a shower and food. Which I did.  I took a long shower  and had a burger meal with a rootbeer float.  Now I’m broke again, stuck the fuck in yuma, with my clean socks soaking up my sweat because it’s inhumanely hot.    </p>\n\n<p>It’s 8-14-02.  Yuma arizona is hell on earth.  The last time I was stuck here with  my friend thomas and our grey cat oacia, four different people used the word hell to describe this place.  That time we were stuck here for two days.  We spent the one hundred and nineteen degree day  swimming in the colorado river.  That night we slept on the cool green grass.  until 2:30 am when the lawn sprinklers woke us up.  So we ducked under a bridge for the night.   </p>\n\n<p>Now I am here alone, in the stifling  heat of hell itself, the first night of my long journey, my coast to coast adventure.  I’m at a 76 gas station, the same one  me and tom sat at for hours on end last time, and i’m reflecting on life.    </p>\n\n<p>I’ve been on tour of california  for three months now, hitchhiking, riding the amtrak, the greyhound and city busses, riding the trolley, walking.  I mostly stuck to the beaches, pacific beach, ocean beach, clam beach, la jolla, venice, long beach, mission, imperial, huntington, laguna, newport, oceanside, refugio, san clemente, el capitan state beach, port hueneme, and about a dozen others, living it up soaking up the sun, watching hot girls wearing barely nothing flaunt perfect bodies all day long and eating good food everywhere I went.  Most everywhere I went I was within easy reach of food.     </p>\n\n<p>I don’t like panhandling.  It makes me feel funky.  I did it occasionally in the past, but mostly people in cali just handed me money or food or sticks of deodorant as they drove me around in their cars.  I got a lot of rides from nice rich people.  I was offered two jobs.  Yup california was fun.  I think I’ll come back.  I guess I’ll see what happens.  </p>\n\n<p>After a long reflection I remembered the best part of yuma was swimming in the colorado river, so I walked the few miles to the swimming spot.  The crisp water was clear, crisp and refreshing.  I emerged an hour later baptized, renewed, ready to hit the road ready to tackle the day.  My aura clear, I redressed and walked to the road,  Within twenty minutes, I had just begun to lightly sweat again. I got a ride from a 26 year old college girl on her way home to visit family.  She only drove me a few miles though, as she had to turn off the highway to head to her parent’s house in the desert somewhere.    </p>\n\n<p>I was suddenly on the side of a deserted empty on-ramp with nothing but sand and dunes around for miles.  Traffic whizzed by on the highway  below me, but no cars came for a long time.  Now, it’s illegal to walk on the highways, in most states, I assumed everywhere at the time, and there are signs on the edge of on-ramps.  My few dealing with police officers about the subject up until this point had taught me that legally you can’t go past the signs, but if you stand on the side of the ramp near the top in front of the sign, it’s okay.  This has lead to significant amounts of time standing on on-ramps like this, but significantly less fines and jail time, which is the trade off I have had to make.   </p>\n\n<p>Hitchhiking would be so much easier if I could walk the highways, but alas it’s illegal.  After a semi finally rolled passed me ten minutes later, one vehicle in ten minutes, as at least a hundred had gone by below me on the highway, I decided it was worth the legal risk.  I walked down the ramp onto the side of the highway.  For a while I walked backward, thumb in the air, and for a while I walked forward, arm out the the side, sometimes looking over my shoulder to make eye contact.  I couldn&#39;t see faces over the sun&#39;s glare on most of the windshields.  I tried waving my hands at people, as I walked backwards again.  </p>\n\n<p>Within twenty minutes, and old man stopped.  Jeff had been a mason and a foundry worker most of his life, he told me about his grandkids and his ex wife suzy,  How much they meant to him and how much he truly loved them. and all about how him and suzy were still best friends they just lived in different towns now and realized they couldn’t be forever. They still talked more than once a week.  We drove for an hour before he dropped me off at a carl’s juniors with  a value meal and six bucks on top of it.     </p>\n\n<p>After refilling my water bottle I stepped out into the sun, fully refreshed.  A woman in the parking lot asked where I was going and I told her.  She said sorry and she was going the other direction.  She handed me twelve dollars and wished me luck.  I think she really wanted to give me a ride.  I blew her a kiss as she drove away and she smiled.  </p>\n\n<p>I sat in the shade for twenty minutes outside of the gas station and flashed my eastbound sign at  a few people, not really trying to catch attention, just relaxing and enjoying  being in a populated area, after all that time on the side of the road alone in the heat.  </p>\n\n<p>When I felt the time was right, I headed to the ramp and resumed my post.  very shortly after that I got a ride from a young man with crooked teeth and a wild shock of sandy blonde hair.  He looked sun baked, and was in an excellent mood.  He was on his way to a new job and was happy to be leaving his old life behind.  We talked about the funny paths that life can take, and he told me to always take risks and try new things, and teach yourself some important skills with your hands, so you always have your tools with you, and you can go anywhere.  He dropped me off at jack in the box, handed me twenty five bucks and said &quot;go getcha something to eat and have a safe trip.&quot;    </p>\n\n<p>Well I wasn&#39;t hungry, but I did drink a big glass of water in the shade.  As I was leaving the restaurant, a short skinny brunette asked me if I had any money.  I said maybe suspiciously.  She was cute, with tattoos and and piercings.  She had seen my sign while I was inside.  She was also going eastbound, but was out of money and trying to get to pueblo Colorado to work as a toe-ring salesgirls at the Denver state fair.    </p>\n\n<p>I had only ever been to Colorado on the greyhound. The desire to spend any time with this hottie, plus the fact that I had just been handed almost forty bucks today, plus the fact that I had wanted to join a carnival after hearing about Thomas&#39;s experience, all lead to me saying yes. I handed her my money.   </p>\n\n<p>We walked over to her car, and filled the tank.   </p>\n\n<p>After driving for a while, she wanted to drop me off when she cut north to go to Colorado, but I insisted on riding to pueblo with her.  I had given her all of my money, and I intended to ride this out to the end.  Being young and horny and stupid, I thought there was a chance here.  Plus, I figured I would get a job with the carnival.    </p>\n\n<p>I had to take my shoes off because my feet were tore up, walking for miles in the sand and not having access to regular showers and clean socks had turned my feet into callused, blistered, sand-hole pock marked tore up stink machines.  I knew they smelled bad, but I couldn&#39;t go ten more minutes without taking my shoes off.  They hurt so bad.  I leaned back and stuck my feet out the window.  It was like heaven.    </p>\n\n<p>She wasn&#39;t having any of that.  “Um could you put your shoes back on?” She said disapprovingly.  And so I learned an important lesson about getting too comfortable in other people’s cars.    </p>\n\n<p>She had topless mermaids tattooed on each arm.  They were fresh, from a friend of hers. So we talked about that for a while, and tattoos in general.  She kept saying she wanted to go swimming, and we were both hoping to pass a river or something at some point.  Eventually we pulled into pueblo.  She pulled onto the carnival lot and said. “Well, here we are.  Good luck, budddy.”  She pulled away quickly as I stepped out.</p>\n</div><!-- SC_ON -->",
  "subreddit_id": "t5_2qhwl",
  "archived": true,
  "domain": "self.hitchhiking",
  "clicked": false,
  "score": 10,
  "id": "2y8okf",
  "stickied": false,
  "media_embed": {},
  "visited": false,
  "selftext": "I've been working on the book for years. (kind of)  \n\nHere's some of it- still in rough draft form.  \n\nSometimes It’s hard to bum a ride. but the best one comes when you least expect it..  \n\nI go a ride with an old man in a shiny grey Cadillac who said he had a staff of people working for him offered me some vague form of a driving job.  He had to be in his seventies, but still active enough to drive.  He talked rather slow and asked me questions about where I grew up and what I did as a kid in Wisconsin.  he told me he would take me to a movie.  HE told me he would give me a steady job driving.. He kept asking me- “would you like that, enoz_moth_balls?”  I said of course, yes.    \n\n We drove south into Santa Barbera on the 101.  He handed me twenty seven dollars.  I wrote down his phone number at his insistence.   He had a slight gay vibe but made no pass at me.  He was nice enough, even dropped me off in a fancy restaurant and told the head waiter to take care of me.  I had the feeling the waiter didn’t recognize him, and the old guy was trying to make it seemed to me like he was a regular customer there.    \n\n But I was wrong because the server told me I was taken care of so get whatever.  I had  two beers, Roast Duck L’orange and whipped potatoes with creme brulee for dessert and a glass of pink wine.  Then I walked outside into the bright sunlight. I crumpled up dudes number and tossed it in  trash can  as I headed down the sidewalk.  I passed some guys playing guitar and listened to their music for a few brief moments.  I put two dollars in their hat and walked on with a spring in my step.    \n\n That night I slept on the beach with the ocean tides lulling me to sleep.  The next morning I hitchhiked south towards san diego.   \n\n\nNow I have a sign.   \n\nThis morning I woke up on cement in a park in central san diego.  I had a court date to go to.  A law officer on a motorcycle had given me a ticket for walking on the street with an open beer, which he dumped out in front of me.  That was four weeks ago or so.   \n\n Anyway, at the courthouse they first won’t let me in through the doors because a scan of my bag indicates a roll of duct tape, my pocket knife, an aerosol can, and a pair of fake handcuffs.  I went back outside, wrapped all that shit up and stuck it in a bush.  I went back inside, through security, and waited in line for an hour.   \n\nWhen i got to the window she looked up my name and found nothing. she let me go.  and  I said to myself- “what the fuck?  Why not go for it?”  By “it” I meant my dream, my goal, to go from california to florida hitchhiking by the end of the year.  Of course I’ll probably end up in wisconsin before I make it to florida, or i’ll be dead.    \n\nI’ve come to the conclusion that anyone who picks up hitchhikers can fit into four or five basic categories.  1. all around good, nice people. 2. violent psychopaths. 3. lonely people 4. horny people and there’s a fifth type too, but damned if I know what it is yet.   \n\nSo back to the story of my day.  I walked from the courthouse to a bus, getting a ride to fashion valley.  I helped an old woman lift her walker onto the bus.  I felt all proud, my good deed for the week had been done, and now I could cause some damage. Just kidding.   \n\nI headed up an on ramp to hwy 8.  My plan now is to take the eight to florida.    \n\nHitched a ride with a tow truck driver named george.  He bought me a soda pop.  While we were at the counter paying a commotion outside caught our attention.  An attendant was screaming accident and pointing, four of us ran outside to see the damage. a little black car had sideswiped a white pickup truck, which had flipped sideways.    \n\nAs I approached The female driver of the small black car, dressed all in black was crying.  She said she had dodged another car  that was in the wrong lane and her swerving caused the collision.  I saw a man jump out of the passenger window of the truck, apparently unharmed. I saw three people call 911. The driver of the truck laid still for a few moments.   He started moving slowly but he wasn’t responding.    \n\nI dunno.  Then we left.   \n\nMy next ride was from a deadhead who had been to 27 shows.  But that was nothing compared to his brother, who had been to over 60 shows.  I was riveted.  I told him about the guy I met who had been a light and sound guy for the dead and how he had a seizure in santa monica.   \n\nSo the deadhead guy dropped me off at vista point, a spot for people to park and lookout at the mountains and stuff.  mostly truckers.  two big rigs were in the parking spaces.  I went up to the first one, a yellow cab, and got the man’s attention.  He was mexican, and in his late forties.  I asked him if he could give me a lift.  He said no right off the bat.  I said o.k, that’s cool.  I moved on.  I couldn't see anyone in the next cab, so i walked to the fence line, jumped it, and took a pis in the bushes.  \t\n\nAs I was coming back from that I saw the old mexican trucker and an old mexican woman.  The man handed me an apple and a can of diet caffeine free pepsi.  “I can and will give you a ride to the next town.  His name was hector, and hers was Mona.  They had six kids, and spent most of the ride talking about their three hot daughters, one of whom was a fbi agent, one of whom was a model, and one still in school.  Their 26 year old son had a daughter, lived on the streets, did drugs, never called home, and was generally a negative influence on their happy life. Hector used to love to drink until mona said booze or family.  He chose family.   \n\nMona also talked him into picking me up.  She had been a trucker for five years, him for 26.  In all that time, neither one had ever picked up a hitchhiker.  They were good people.  they gave me two pairs of socks, which every traveller knows and respects the importance of.  Also he slipped me eleven bucks, as long as I promised to spend it on a shower and food. Which I did.  I took a long shower  and had a burger meal with a rootbeer float.  Now I’m broke again, stuck the fuck in yuma, with my clean socks soaking up my sweat because it’s inhumanely hot.    \n\nIt’s 8-14-02.  Yuma arizona is hell on earth.  The last time I was stuck here with  my friend thomas and our grey cat oacia, four different people used the word hell to describe this place.  That time we were stuck here for two days.  We spent the one hundred and nineteen degree day  swimming in the colorado river.  That night we slept on the cool green grass.  until 2:30 am when the lawn sprinklers woke us up.  So we ducked under a bridge for the night.   \n\nNow I am here alone, in the stifling  heat of hell itself, the first night of my long journey, my coast to coast adventure.  I’m at a 76 gas station, the same one  me and tom sat at for hours on end last time, and i’m reflecting on life.    \n\nI’ve been on tour of california  for three months now, hitchhiking, riding the amtrak, the greyhound and city busses, riding the trolley, walking.  I mostly stuck to the beaches, pacific beach, ocean beach, clam beach, la jolla, venice, long beach, mission, imperial, huntington, laguna, newport, oceanside, refugio, san clemente, el capitan state beach, port hueneme, and about a dozen others, living it up soaking up the sun, watching hot girls wearing barely nothing flaunt perfect bodies all day long and eating good food everywhere I went.  Most everywhere I went I was within easy reach of food.     \n \nI don’t like panhandling.  It makes me feel funky.  I did it occasionally in the past, but mostly people in cali just handed me money or food or sticks of deodorant as they drove me around in their cars.  I got a lot of rides from nice rich people.  I was offered two jobs.  Yup california was fun.  I think I’ll come back.  I guess I’ll see what happens.  \n\nAfter a long reflection I remembered the best part of yuma was swimming in the colorado river, so I walked the few miles to the swimming spot.  The crisp water was clear, crisp and refreshing.  I emerged an hour later baptized, renewed, ready to hit the road ready to tackle the day.  My aura clear, I redressed and walked to the road,  Within twenty minutes, I had just begun to lightly sweat again. I got a ride from a 26 year old college girl on her way home to visit family.  She only drove me a few miles though, as she had to turn off the highway to head to her parent’s house in the desert somewhere.    \n\nI was suddenly on the side of a deserted empty on-ramp with nothing but sand and dunes around for miles.  Traffic whizzed by on the highway  below me, but no cars came for a long time.  Now, it’s illegal to walk on the highways, in most states, I assumed everywhere at the time, and there are signs on the edge of on-ramps.  My few dealing with police officers about the subject up until this point had taught me that legally you can’t go past the signs, but if you stand on the side of the ramp near the top in front of the sign, it’s okay.  This has lead to significant amounts of time standing on on-ramps like this, but significantly less fines and jail time, which is the trade off I have had to make.   \n\n Hitchhiking would be so much easier if I could walk the highways, but alas it’s illegal.  After a semi finally rolled passed me ten minutes later, one vehicle in ten minutes, as at least a hundred had gone by below me on the highway, I decided it was worth the legal risk.  I walked down the ramp onto the side of the highway.  For a while I walked backward, thumb in the air, and for a while I walked forward, arm out the the side, sometimes looking over my shoulder to make eye contact.  I couldn't see faces over the sun's glare on most of the windshields.  I tried waving my hands at people, as I walked backwards again.  \n\nWithin twenty minutes, and old man stopped.  Jeff had been a mason and a foundry worker most of his life, he told me about his grandkids and his ex wife suzy,  How much they meant to him and how much he truly loved them. and all about how him and suzy were still best friends they just lived in different towns now and realized they couldn’t be forever. They still talked more than once a week.  We drove for an hour before he dropped me off at a carl’s juniors with  a value meal and six bucks on top of it.  \t \n\nAfter refilling my water bottle I stepped out into the sun, fully refreshed.  A woman in the parking lot asked where I was going and I told her.  She said sorry and she was going the other direction.  She handed me twelve dollars and wished me luck.  I think she really wanted to give me a ride.  I blew her a kiss as she drove away and she smiled.  \n\nI sat in the shade for twenty minutes outside of the gas station and flashed my eastbound sign at  a few people, not really trying to catch attention, just relaxing and enjoying  being in a populated area, after all that time on the side of the road alone in the heat.  \n\nWhen I felt the time was right, I headed to the ramp and resumed my post.  very shortly after that I got a ride from a young man with crooked teeth and a wild shock of sandy blonde hair.  He looked sun baked, and was in an excellent mood.  He was on his way to a new job and was happy to be leaving his old life behind.  We talked about the funny paths that life can take, and he told me to always take risks and try new things, and teach yourself some important skills with your hands, so you always have your tools with you, and you can go anywhere.  He dropped me off at jack in the box, handed me twenty five bucks and said \"go getcha something to eat and have a safe trip.\"    \n\nWell I wasn't hungry, but I did drink a big glass of water in the shade.  As I was leaving the restaurant, a short skinny brunette asked me if I had any money.  I said maybe suspiciously.  She was cute, with tattoos and and piercings.  She had seen my sign while I was inside.  She was also going eastbound, but was out of money and trying to get to pueblo Colorado to work as a toe-ring salesgirls at the Denver state fair.  \t\n\nI had only ever been to Colorado on the greyhound. The desire to spend any time with this hottie, plus the fact that I had just been handed almost forty bucks today, plus the fact that I had wanted to join a carnival after hearing about Thomas's experience, all lead to me saying yes. I handed her my money.   \n\nWe walked over to her car, and filled the tank.   \n\nAfter driving for a while, she wanted to drop me off when she cut north to go to Colorado, but I insisted on riding to pueblo with her.  I had given her all of my money, and I intended to ride this out to the end.  Being young and horny and stupid, I thought there was a chance here.  Plus, I figured I would get a job with the carnival.    \n\nI had to take my shoes off because my feet were tore up, walking for miles in the sand and not having access to regular showers and clean socks had turned my feet into callused, blistered, sand-hole pock marked tore up stink machines.  I knew they smelled bad, but I couldn't go ten more minutes without taking my shoes off.  They hurt so bad.  I leaned back and stuck my feet out the window.  It was like heaven.    \n\nShe wasn't having any of that.  “Um could you put your shoes back on?” She said disapprovingly.  And so I learned an important lesson about getting too comfortable in other people’s cars.    \n\t\nShe had topless mermaids tattooed on each arm.  They were fresh, from a friend of hers. So we talked about that for a while, and tattoos in general.  She kept saying she wanted to go swimming, and we were both hoping to pass a river or something at some point.  Eventually we pulled into pueblo.  She pulled onto the carnival lot and said. “Well, here we are.  Good luck, budddy.”  She pulled away quickly as I stepped out.\n",
  "hide_score": false,
  "_api_link": "https://api.reddit.com/r/hitchhiking/comments/2y8okf/its_too_cold_to_travel_now_so_heres_a_few/?ref=search_posts",
  "locked": false,
  "edited": 1425738797.0,
  "title": "It's too cold to travel now, so here's a few hitchhiking memories I'd like to share with anyone and everyone!",
  "created": 1425737981.0,
  "_comments_by_id": {}
}