{
  "clicked": false,
  "_replaced_more": false,
  "archived": false,
  "post_hint": "self",
  "num_comments": 17,
  "created": 1435856484.0,
  "saved": false,
  "selftext": "I was so free to copy the reveals from the Image site. I will update them with more picture and info if they happen to get posted the coming days (which is something that happened last few EXPOs).\n\nComment for missing info that should be added.\n\nSource: https://imagecomics.com/content/view/july-2015-image-expo-announcements-revealed\n\nKeynotes: https://imagecomics.com/content/view/image-expo-publisher-eric-stephensons-july-2015-keynote-address\n\n> Today Image Comics made a slew of exciting creator-owned announcements at Image Expo.\n\n> “I’m so pleased with how many amazing, talented creators we’re welcoming into the Image Comics family this coming year,” said Eric Stephenson, Publisher at Image Comics. “These individuals bring to life stories that run the gamut in genre from thrillers and horror to science-fiction and comedy and I can’t wait to see their breathtaking work hit the shelves.”\n\n> Image Comics revealed the following creator-owned projects set to launch in the coming year.\n\n\n\n> [**INVINCIBLE: REBOOT**](http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-31.jpg)\n\n> THE WALKING DEAD editor and Skybound Entertainment’s Editorial Director Sean Mackiewicz announced the forthcoming reboot of Kirkman’s long-running superhero series, INVINCIBLE.\n\n> In this new direction for INVINCIBLE, Mark suddenly finds himself without powers. Back home... but aware of everything he’s lived through. What does he change, who can he save... and how will he deal with his father now that he knows what’s coming?\n\n> The INVINCIBLE reboot will begin with issue #124 and is set to launch on October 21 and will retain the same creative team with THE WALKING DEAD writer Robert Kirkman and art by Ryan Ottley, Cliff Rathburn, and Jean-Francois Beaulieu.\n\n\n\n> [**CODENAME BABOUSHKA: THE CONCLAVE OF DEATH**](http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-13.jpg)\n\n> What if the sexy Russian Bond girl was actually the hero?\n\n> Written by Antony Johnston (THE FUSE, The Coldest City, Daredevil) with art by Shari Chankhamma (SHELTERED, The Sisters’ Luck), and letters by Simon Bowland, CODENAME BABOUSHKA is an action-packed modern pulp spy thriller. Full of high-stakes thrills in exotic locations, CODENAME BABOUSHKA follows a kick-ass female hero in the style of James Bond and Modesty Blaise!\n\n> \"Codename Baboushka has everything you'd expect from me: a kick-ass female hero, bags of tension, and deep, dark secrets that everyone's trying to figure out,” said Johnston. “But it's also way more high-octane than anything I've done before, with guns, fists, and explosions everywhere!”\n\n> The enigmatic Contessa is a wealthy socialite, the last heiress to a noble Russian line—and secretly a deadly assassin! Blackmailed by the US government to carry out dirty jobs even the CIA can’t sanction, she’s got nothing to lose... and everything to fight for!\n\n> CODENAME BABOUSHKA #1 hits this October 2015.\n\n\n\n> [**CAMP MIDNIGHT**](http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-4.jpg)\n\n> From Man of Action's Steven T. Seagle and The New Yorker artist Jason Adam Katzenstein comes CAMP MIDNIGHT, an original 256-page graphic novel set to hit stores in early October 2015, just in time for Halloween reading.\n\n> Reluctant camper Skye is accidentally sent to the wrong camp for the summer. Not wanting to please her “step monster,” Skye is dead-set on not fitting in. Luckily, that won’t be a problem, as everyone at Camp Midnight—with the exception of fellow camper and fast-friend Mia—seems to be a full-fledged monster.\n\n> \"Camp Midnight is a brilliant graphic novel debut for cartoonist Jason Adam Katzenstein, and it's the perfect book for readers who loved Raina Telgemeier's Smile, but wished it had more bowls of gooey eyeballs during the dinner scenes,\" said Seagle.\n\n> Can Skye keep her identity as a human secret until she catches the bus for home? Is all of this a figment of her overactive imagination? And what about Skye’s major crush on a boy who is far, really far, from her usual type? Find out in CAMP MIDNIGHT.\n\n> **BLUE MONDAY: THIEVES LIKE US**\n\nhttp://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-5.jpg\n\n> BLUE MONDAY: THIEVES LIKE US makes its triumphant return with an all-new series from Eisner and Harvey Award-nominated cartoonist Chynna Clugston Flores. Bleu, Clover, Victor, Alan, and the entire gang from Fresburger, California are back! Winter has thawed into spring, the whole world is thinking about sex, and it’s all Bleu’s fault! Or at least, it seems that way.\n\n> Maybe Bleu should just suck it up and try to get some experience in these matters so that she can finally woo her history teacher, Mr. Bishop, once and for all. What schemes will she cook up to achieve her outrageous goal? And what the heck is going on between Clover and Victor? And Alan and Erin?! Is that really a thing now? Find out in this new series of teenage calamities and catastrophes that’s repeatedly been likened to “Archie Comics on crack.”\n\n> **BLUE MONDAY: GERMFREE ADOLESCENTS**\n\n> For the first time ever, Chynna Clugston Flores’ entire original catalog of BLUE MONDAY comics are collected together in one, massive volume from Image Comics in BLUE MONDAY: GERMFREE ADOLESCENTS. Experience the Pepsi-fueled misadventures of Bleu L. Finnegan, comics’ favorite blue-haired, Buster Keaton-obsessed, Adam Ant-worshipping teenager from the very beginning.\n\n> GERMFREE ADOLESCENTS collects in order all of the previously-published miniseries and one-shot comics, along with all of the rare short stories of the critically-acclaimed comedy that has often been compared to the comics work of Rumiko Takahashi and the John Hughes/Molly Ringwald film collaborations of the 1980s. This collection also includes tons of behind-the-scenes material you won’t want to miss.\n\n> **SCOOTER GIRL**\n\n> Chynna Clugston Flores also announced an all-new series, SCOOTER GIRL, a love letter to southern California mod and scooter culture. SCOOTER GIRL is Chynna Clugston Flores’ screwball romantic comedy classic. Ashton Archer has it all. He’s the biggest man on his high school campus, he’s got a huge family fortune waiting for him, and his closet and garage are full of the coolest accoutrements available, from flashy suits to swank shoes to a slick Vespa scooter.\n\n> It appears that nothing can go wrong for this hard-hearted hottie—that is, until the confident and fashionable Margaret Sheldon motors by on her Lambretta. At that moment, Ashton’s life takes a turn for the worse. Everyone at school suddenly hates him, his father declares bankruptcy, and his scooter gets run over by a truck. Even high-tailing it out of town does him no good, because wherever he goes, Margaret follows. How can he get out of the black curse this woman has placed on his life? By getting her to fall in love with him, or else!\n\n> “I am extremely excited to be announcing that Blue Monday and Scooter Girl are back to print with Image Comics,” said Clugston Flores. “These series are near and dear to my heart, I’m hoping that not only new readers will embrace them, but that original fans will be pleased to see these sharp new collections as well as brand new Blue Monday material. There’s a lot in store, a lot of laughs, and a hell of a lot of fun to be had!”\n\n> **THROWAWAYS**\n\nhttp://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-6.jpg\n\n> Throwaway (n.):\n> Cold War slang for a deniable asset, a disposable assassin meant to die alongside their target.\n\n> 1973: Project MK-ULTRA shuts down for good, its goal of creating brainwashed assassins and psychic spies unrealized. That's the story the world believes for thirty years, until Dean Logan, son of a successful ULTRA test subject, narrowly escapes a team of enhanced operatives sent to kidnap him back into the fold. On the run—not just from the dirtiest secret the CIA ever funded—but his own out of control psychic abilities, Dean is saved by Abby Palmer, a former Army Ranger taken by ULTRA in Afghanistan and reprogrammed to be an unstoppable, disposable killer.\n\n> Except Abby survived her expiration date, and now she's turned her deadly skillset toward one goal: destroying the ULTRA program and dragging its masterminds into the light. Teaming up to take them down, Dean and Abby quickly discover ULTRA's leadership has gone rogue, and the program's charismatic head doctor has her own plans—for Dean and Abby, for ULTRA, and for the United States itself.\n\n> Looking into a future of superpowered assassins, telepathic intelligence agents, and far-reaching, government-toppling conspiracies, THROWAWAYS written by Caitlin Kittredge with art by Steve Sanders is the spy thriller as you've never seen it before.\n\n> **SUNSET PARK**\n\nhttp://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-7.jpg\n\n> Something's up in Sunset Park, and it ain't just the rent. Are Brooklyn's gentrifiers more than just economic vampires? A cartoonist draws a macabre story from a collection of notes, journals, movies and other ephemera he finds boxed, abandoned in the studio he's recently rented along the latest frontline in gentrification's relentless march over Brooklyn in SUNSET PARK.\n\n> Among the boxed items are what could be a copy of an old Warhol vampire film and what looks to be a journal belonging to Jean Michel Basquiat. SUNSET PARK is an all-new, limited series by Ron Wimberly coming from Image Comics.\n\n> **SLAVE PUNK**\n\nhttp://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-8-1000x566.jpg\n\n> Ron Wimberly teased a second forthcoming project with Image Comics, SLAVE PUNK: WHITE COAL. SLAVE PUNK tells the story of how a genius slave defied the powerful King Cotton and ignited the Civil War in an attempt to end slavery.\n\n> **CRY HAVOC**\n\n> Image Comics announced CRY HAVOC, a new series written by Simon Spurrier (X-Men Legacy, Marvel Zombies, The Spire), with art by Ryan Kelly (Lucifer, Northlanders, Three), and featuring colors by Lee Loughridge and Matt Wilson, letters by Simon Bowland, and design by Emma Price. CRY HAVOC is a journey into war-torn Afghanistan in the company of monsters, a London street-musician savaged by a ghostly hound, and a terrified prisoner tangled in a folkloric insurrection.\n\n> “Beneath all its snark, fanged horror-beasts, deadly firefights and exploding billy-goats, Cry Havoc is the intimate tale of one woman struggling to keep her life from falling apart,” said Spurrier. “To depict it all I've been lucky enough to partner with Ryan, who's genuinely one of the greatest storytellers our medium has—not to mention a next-level monster-wrangler. Add to that some narrative mold breaking by our roster of superstar colorists and Cry Havoc is snarling to be set loose.”\n\n> CRY HAVOC features three parallel and interwoven story threads in the life of Lou Canton: an extraordinary woman being consumed by chaos with three different colorists lending their artistic takes in order to define the separate phases of the story.\n\n> Best described as Jarhead via Pan's Labyrinth, CRY HAVOC is a modern mix of myth, military, and monstrosity.\n\n> **BLACK MAGICK**\n\nhttp://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-10-1000x567.jpg\n\n> Bestselling writer Greg Rucka and artist Nicola Scott team up to conjure an all-new ongoing series in BLACK MAGICK, set to launch just in time for Halloween.\n\n> “I’m calling it witch-noir, because it’s not quite crime and it’s not wholly about the supernatural, but the two are somehow dancing together,” said Rucka. “And with Nicola’s art, it’s turned into a beautiful dance, indeed. I’ve been waiting six years to share Rowan’s story with the world, waiting even longer to get to work with Nicola on something creator-owned. This is that chance, and we’re both seizing it!”\n\n> BLACK MAGICK follows Rowan Black, robbery/homicide detective in the city of Portsmouth, and the latest in a line of traditional witches who can trace their lineage—and memories—back to before the library of Alexandria burned. Rowan has carefully built a wall between her professional life and her faith, but now that barrier is cracking.\n\n> If magick is the power to impose one’s own will on reality, where does that leave the rest of us?\n\n> **CROSSWIND**\n\nhttp://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-9.jpg\n\n> CROSSWIND is the cutting edge story of a suave, sharp hitman from Chicago and a seemingly unremarkable housewife from Seattle, and how they accidentally end up switching lives. It's a suspense fantasy full of sex, violence, and the blackest of humor. Written with sardonic wit by Gail Simone and stunningly realized by Cat Staggs, CROSSWIND will be one of the most talked about books of the year.\n\n> Simone assured fans: “This is the comic that might make Dr. Wertham come back from the dead to try to ban comics again.”\n\n> **THE GODDAMNED**\n\n> SOUTHERN BASTARDS writer Jason Aaron, artist R.M. Guerra of Scalped, and colorist Giulia Brusco turn their attention to… The Bible in THE GODDAMNED.\n\n> Before the great flood, the world is filled with violence and wickedness. In just a couple thousand years, humanity has gone from paradise to depravity and ruin. God is beginning to seriously regret having ever created man in the first place.\n\n> Welcome to the world of THE GODDAMNED, an all-new, ongoing series to launch from Image Comics in November 2015. Set just before the Biblical flood, in a world so out of control with violence and depravity, God is just about to pull the plug. “It's part caveman adventure story, part stark and brutal western,” said Aaron. “And did I mention there are dinosaurs? Imagine if Quentin Tarantino was hired to direct the movie version of the book of Genesis. That's pretty much what we're aiming for.”\n\n> **THE OTHER SIDE: Deluxe Edition**\n\nhttp://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-1.png\n\n> Jason Aaron and Cameron Stewart also announced that a new, deluxe edition of THE OTHER SIDE would be coming to Image Comics.\n\n> **HEARTLESS**\n\nhttp://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-11.jpg\n\n> Legendary comics writer Warren Ellis teams up with artist Tula Lotay again for a modern folktale about love, revenge, and the deadly grip of the supernatural in, HEARTLESS.\n\n> A female musician returns to northern England, where her family owned a little cottage in the middle of a forest. She wrote her first album there, and she's \"going back to the countryside,\" as musicians used to, to write her next one. But the forest doesn't want her there. She's returning to face her demons—one in particular—and put herself back together, but the forest remembers what she did, and the devil wants his due.\n\n> Ellis said of the new project: “I wrote this for Tula, and it's full of all the stuff we love: the spooky stories, the landscape, the folklore, and the things that haunt us.”\n\n> **HUCK**\n\nhttp://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-12.jpg\n\n> Bestselling writer Mark Millar (Kingsman: The Secret Service, Kick-Ass, WANTED) will team up with artist Rafael Albuquerque (American Vampire) for an all-new project to be titled, HUCK.\n\n> Millar said of the project: \"All the best old comics were about people you didn’t expect becoming empowered. Peter Parker wasn’t a classic hero. He was a lonely teenager. Matt Murdock was blind. Tony Stark had a heart condition. Doctor Donald Blake couldn’t walk without a stick. So we wanted to do something incredibly sweet about a small-town guy with learning difficulties who could do all these amazing things. He’s the purest, most decent character you’ve ever seen in a comic book. A big guy who just wants to help people and does it in secret so nobody even knows he even exists. It’s the ultimate feel good comic. A Frank Capra superhero story I guess about a small town and a close-knit community and an amazing guy they just all want to shelter from the outside world. He’s Captain America meets Forrest Gump. He’s just a nice guy in a very classic mould.\n\n> “Working with Rafael has been amazing. I’ve always been a fan, but you really only fully appreciate an artist when you see what he does with one of your scripts. I think this is one of the most beautifully drawn comics I’ve ever had my name on and it’s been such a pleasure. I finished the whole project in early summer and I’m starting the second arc soon. We’ve got three of these stories planned, each one six issues long, and we’re just having a good time. I think you stumble on something special every once in a while as a creator and my gut tells me we’ve got a project like that here.”\n\n> **PRIVATE EYE: The Deluxe Hardcover**\n\nhttp://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-14.jpg\n\n> Nominated for three Eisner Awards, PanelSyndicate.com’s digital comics sensation THE PRIVATE EYE by Brian K. Vaughan and Marcos Martin with colors by Muntsa Vincente is finally coming to print in a gorgeous deluxe hardcover edition. The book will hit stores this November 2015.\n\n> “Readers and retailers have been begging us for a physical version of this story ever since we first announced our hard-boiled parable about the future of privacy in America,” said Vaughan. “So when the time came, Marcos and I knew that we had to go with Image Comics, the most creator-friendly publisher of print comics ever.”\n\n> Set in an inevitable future where everyone has a secret identity, THE PRIVATE EYE is an eerily prescient sci-fi mystery about an unlicensed private investigator who stumbles onto the most important case of his life.\n\n> **SNOTGIRL**\n\nhttp://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-15.jpg\n\n> New York Times bestselling writer Bryan Lee O’Malley teams up with artist Leslie Hung, colorist Mickey Quinn, and letterer/designer Maré Odomo for SNOTGIRL, a dark comedy set in the world of fashion bloggers.\n\n> “Snotgirl is funny and f*cked up,” O’Malley warned. “It’s full of fascinating characters you’ll love to hate. Leslie’s art is lush and beautiful.”\n\n> Lottie is a huge success—she’s blog famous! Her online persona is flawless and fun, but her real life is filled with woes. She has terrible allergies, she just got dumped, and her blogger friends don’t understand her. Things turn around when Lottie instantly clicks with Caroline, a new girl on the scene… but can she turn chemistry into friendship, or will she ruin everything?\n\n> Hung added: “This is my first ongoing series, so I’m really excited. Snotgirl is going to be the best comic ever, if we don’t die making it!”\n\n> **VIRGIL OGN**\n\nhttp://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-16.jpg\n\n> Betrayed, beaten, and banished by his own, an outed cop fights his way across Jamaica for revenge.\n\n> UNDERTOW and Midnighter writer Steve Orlando and Murder Book artist JD Faith present a brand new, “queersploitation” graphic novel on the streets of Jamaica in, VIRGIL, in stores this September 2015.\n\n> This is a Foxy Brown-style revenge action with a new face and new fists. Holding his gun and his badge, Virgil thought he was safe in the police force, hiding who he is. But when his own brothers on the force out him in the papers, it doesn't bring him down. It sets him free!\n\n> Now, he's out for revenge. And he's not leaving town without his man, and some blood on his hands.\n\n> From the foreword: \"Steve Orlando and J.D. Faith have taken the conventions of the revenge thriller, mixed them in with elements of queersploitation, and managed to deliver a graphic novel that is entertaining, relevant, and politicized.\" —David Walker, writer of Shaft, Cyborg\n\n> **HADRIAN’S WALL**\n\nhttp://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-17.jpg\n\n> From the creative team behind the critically-acclaimed series C.O.W.L.—Kyle Higgins, Alec Siegel, and Rod Reis—comes a new psychological thriller in HADRIAN’S WALL, where the secrets of everyone involved are as dark as the space that surrounds them. The series is set to launch from Image Comics this November 2015.\n\n> In 1983, tensions between the United States and the Soviet Union culminated with nuclear detonations in New York City and Moscow. In the decades following, the two superpowers found peace through a partnership focused on building the first colony in space. But now, seventy years later, a new Cold War simmers… between Earth and that very Colony.\n\n> “With C.O.W.L., Image afforded us the tremendous opportunity to launch a creator-owned series focusing on dark, complex, morally ambiguous characters in a time of great change,” said Higgins. “We’re thrilled to continue that trend with Hadrian’s Wall, and even more thrilled to continue our partnership with Image.”\n\n> When a crewmember dies aboard one of Earth’s survey ships, HADRIAN’S WALL, investigator Simon Moore looks to determine whether foul play is involved. However, once on board, it doesn’t take Simon long to realize that few things are what they seem... including the identities of the crew and the real reason HADRIAN’S WALL is on the edges of Colony Space. With every crewmember a suspect, and tensions between Earth and the Colony mounting, the fate of both worlds may come down to one man and a ship.\n\n> **AXCEND**\n\nhttp://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-20.jpg\n\n> Creator and writer/artist Shane Davis alongside inker Michelle Delecki and colorist Morry Hollowell bring AXCEND to Image Comics this October 2015.\n\n> “In Axcend, teenager, Eric Morn's life revolves around gaming,” said Davis. “He quickly finds himself locked against a vicious player only to realize the game, Axcend, has carried over into the real world with apocalyptic consequences.”\n\n> What happens when a video game decides to come to our reality to play? When there are no extra lives, and Armageddon looms on the horizon, when your life revolves around gaming like teenager Eric Morn, you Press Start.\n\n> **FASTER THAN LIGHT**\n\nhttp://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-18.jpg\n\n> Written and drawn by Brian Haberlin, Shadowline/Image Comics is pleased to introduce readers to an all-new, interactive storytelling experience in FASTER THAN LIGHT, launching this September 2015.\n\n> In the very near future we discover the secret of faster-than-light travel. Suddenly the universe is wide open to us, but are we ready for it? With all the idealism of the original Star Trek and the grit and immediacy of Gravity, the story of humanity's first thrilling and terrifying adventures to the stars takes flight!\n\n> Every issue features Anomaly's free cutting edge Augmented Reality app, which makes it look like interactive holograms are coming out of the book!\n\n> **EXPIRED**\n\n> Written by Jimmie Robinson (THE EMPTY) with art by Richard Pace, Shadowline/Image Comics also announced an all-new, five-issue supernatural crime series, EXPIRED. \n\n> In EXPIRED, a homeless war vet ends up helping a ghost who is connected to an old coin-operated parking meter. He can only see and communicate with her as long as he feeds the meter.  He has to solve the murder before the city replaces the meter with a modern version — and before the killer finds him, but who’s going to believe a homeless guy who looks like he’s talking to himself?\n\n> **THE ONE%**\n\nhttp://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-19.jpg\n\n> Critically-acclaimed writer/artist/director Kaare Kyle Andrews (Spider-Man: Reign, Iron Fist: The Living Weapon) targets THE ONE% with his very first creator-owned comic.\n\n> In THE ONE%, they own more than half the world, and Renato Jones is going to even the score... one percent at a time.\n\n> \"Creator-owned comics have always been part of the plan,” said Andrews. “I can't believe I've waited so long to make the leap. I am hungry, I am angry, and I am throwing everything I have into this series. A dark neo-noir tribute to focus all of my rage and revenge.”\n\n> **RINGSIDE**\n\nhttp://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-21.jpg\n\n> RINGSIDE is an ongoing drama written by Joe Keatinge (SHUTTER, TECH JACKET), with art by Nick Barber, colors by Simon Gough, and letters by Ariana Maher set around the world of professional wrestling and coming from Image Comics this November. The series explores the artistry of performers rotating as cogs in the corporate machinery of an industry built to sell myth to the masses.\n\n> “Ever since I was a kid I've been caught up in the mythology professional wrestling sells us, that these larger-than-life men and women are unstoppable titans locked in a never-ending, action-packed drama,” said Keatinge. “However, in time you learn that they're just as human as anyone else, that they're very much putting their lives on the line to entertain us, that they're just as much part of a corporate machine built for profit as anyone else. Ringside's a book about taking apart that machine and seeing how the industry functions and the lives it affects from a rotating set of angles including the wrestlers themselves, the creatives they work with, the suits in charge and the fans cheering them all on.\"\n\n> RINGSIDE starts with three perspectives: a retired veteran forced to fight his greatest battle in the real world, a rookie struggling to get his first shot and a writer frustrated over lack of control.\n\n> But they're just the beginning.\n\n> The real violence is outside the ring.",
  "mod_reports": [],
  "secure_media_embed": {},
  "edited": 1435882193.0,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was so free to copy the reveals from the Image site. I will update them with more picture and info if they happen to get posted the coming days (which is something that happened last few EXPOs).</p>\n\n<p>Comment for missing info that should be added.</p>\n\n<p>Source: <a href=\"https://imagecomics.com/content/view/july-2015-image-expo-announcements-revealed\">https://imagecomics.com/content/view/july-2015-image-expo-announcements-revealed</a></p>\n\n<p>Keynotes: <a href=\"https://imagecomics.com/content/view/image-expo-publisher-eric-stephensons-july-2015-keynote-address\">https://imagecomics.com/content/view/image-expo-publisher-eric-stephensons-july-2015-keynote-address</a></p>\n\n<blockquote>\n<p>Today Image Comics made a slew of exciting creator-owned announcements at Image Expo.</p>\n\n<p>“I’m so pleased with how many amazing, talented creators we’re welcoming into the Image Comics family this coming year,” said Eric Stephenson, Publisher at Image Comics. “These individuals bring to life stories that run the gamut in genre from thrillers and horror to science-fiction and comedy and I can’t wait to see their breathtaking work hit the shelves.”</p>\n\n<p>Image Comics revealed the following creator-owned projects set to launch in the coming year.</p>\n\n<p><a href=\"http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-31.jpg\"><strong>INVINCIBLE: REBOOT</strong></a></p>\n\n<p>THE WALKING DEAD editor and Skybound Entertainment’s Editorial Director Sean Mackiewicz announced the forthcoming reboot of Kirkman’s long-running superhero series, INVINCIBLE.</p>\n\n<p>In this new direction for INVINCIBLE, Mark suddenly finds himself without powers. Back home... but aware of everything he’s lived through. What does he change, who can he save... and how will he deal with his father now that he knows what’s coming?</p>\n\n<p>The INVINCIBLE reboot will begin with issue #124 and is set to launch on October 21 and will retain the same creative team with THE WALKING DEAD writer Robert Kirkman and art by Ryan Ottley, Cliff Rathburn, and Jean-Francois Beaulieu.</p>\n\n<p><a href=\"http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-13.jpg\"><strong>CODENAME BABOUSHKA: THE CONCLAVE OF DEATH</strong></a></p>\n\n<p>What if the sexy Russian Bond girl was actually the hero?</p>\n\n<p>Written by Antony Johnston (THE FUSE, The Coldest City, Daredevil) with art by Shari Chankhamma (SHELTERED, The Sisters’ Luck), and letters by Simon Bowland, CODENAME BABOUSHKA is an action-packed modern pulp spy thriller. Full of high-stakes thrills in exotic locations, CODENAME BABOUSHKA follows a kick-ass female hero in the style of James Bond and Modesty Blaise!</p>\n\n<p>&quot;Codename Baboushka has everything you&#39;d expect from me: a kick-ass female hero, bags of tension, and deep, dark secrets that everyone&#39;s trying to figure out,” said Johnston. “But it&#39;s also way more high-octane than anything I&#39;ve done before, with guns, fists, and explosions everywhere!”</p>\n\n<p>The enigmatic Contessa is a wealthy socialite, the last heiress to a noble Russian line—and secretly a deadly assassin! Blackmailed by the US government to carry out dirty jobs even the CIA can’t sanction, she’s got nothing to lose... and everything to fight for!</p>\n\n<p>CODENAME BABOUSHKA #1 hits this October 2015.</p>\n\n<p><a href=\"http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-4.jpg\"><strong>CAMP MIDNIGHT</strong></a></p>\n\n<p>From Man of Action&#39;s Steven T. Seagle and The New Yorker artist Jason Adam Katzenstein comes CAMP MIDNIGHT, an original 256-page graphic novel set to hit stores in early October 2015, just in time for Halloween reading.</p>\n\n<p>Reluctant camper Skye is accidentally sent to the wrong camp for the summer. Not wanting to please her “step monster,” Skye is dead-set on not fitting in. Luckily, that won’t be a problem, as everyone at Camp Midnight—with the exception of fellow camper and fast-friend Mia—seems to be a full-fledged monster.</p>\n\n<p>&quot;Camp Midnight is a brilliant graphic novel debut for cartoonist Jason Adam Katzenstein, and it&#39;s the perfect book for readers who loved Raina Telgemeier&#39;s Smile, but wished it had more bowls of gooey eyeballs during the dinner scenes,&quot; said Seagle.</p>\n\n<p>Can Skye keep her identity as a human secret until she catches the bus for home? Is all of this a figment of her overactive imagination? And what about Skye’s major crush on a boy who is far, really far, from her usual type? Find out in CAMP MIDNIGHT.</p>\n\n<p><strong>BLUE MONDAY: THIEVES LIKE US</strong></p>\n</blockquote>\n\n<p><a href=\"http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-5.jpg\">http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-5.jpg</a></p>\n\n<blockquote>\n<p>BLUE MONDAY: THIEVES LIKE US makes its triumphant return with an all-new series from Eisner and Harvey Award-nominated cartoonist Chynna Clugston Flores. Bleu, Clover, Victor, Alan, and the entire gang from Fresburger, California are back! Winter has thawed into spring, the whole world is thinking about sex, and it’s all Bleu’s fault! Or at least, it seems that way.</p>\n\n<p>Maybe Bleu should just suck it up and try to get some experience in these matters so that she can finally woo her history teacher, Mr. Bishop, once and for all. What schemes will she cook up to achieve her outrageous goal? And what the heck is going on between Clover and Victor? And Alan and Erin?! Is that really a thing now? Find out in this new series of teenage calamities and catastrophes that’s repeatedly been likened to “Archie Comics on crack.”</p>\n\n<p><strong>BLUE MONDAY: GERMFREE ADOLESCENTS</strong></p>\n\n<p>For the first time ever, Chynna Clugston Flores’ entire original catalog of BLUE MONDAY comics are collected together in one, massive volume from Image Comics in BLUE MONDAY: GERMFREE ADOLESCENTS. Experience the Pepsi-fueled misadventures of Bleu L. Finnegan, comics’ favorite blue-haired, Buster Keaton-obsessed, Adam Ant-worshipping teenager from the very beginning.</p>\n\n<p>GERMFREE ADOLESCENTS collects in order all of the previously-published miniseries and one-shot comics, along with all of the rare short stories of the critically-acclaimed comedy that has often been compared to the comics work of Rumiko Takahashi and the John Hughes/Molly Ringwald film collaborations of the 1980s. This collection also includes tons of behind-the-scenes material you won’t want to miss.</p>\n\n<p><strong>SCOOTER GIRL</strong></p>\n\n<p>Chynna Clugston Flores also announced an all-new series, SCOOTER GIRL, a love letter to southern California mod and scooter culture. SCOOTER GIRL is Chynna Clugston Flores’ screwball romantic comedy classic. Ashton Archer has it all. He’s the biggest man on his high school campus, he’s got a huge family fortune waiting for him, and his closet and garage are full of the coolest accoutrements available, from flashy suits to swank shoes to a slick Vespa scooter.</p>\n\n<p>It appears that nothing can go wrong for this hard-hearted hottie—that is, until the confident and fashionable Margaret Sheldon motors by on her Lambretta. At that moment, Ashton’s life takes a turn for the worse. Everyone at school suddenly hates him, his father declares bankruptcy, and his scooter gets run over by a truck. Even high-tailing it out of town does him no good, because wherever he goes, Margaret follows. How can he get out of the black curse this woman has placed on his life? By getting her to fall in love with him, or else!</p>\n\n<p>“I am extremely excited to be announcing that Blue Monday and Scooter Girl are back to print with Image Comics,” said Clugston Flores. “These series are near and dear to my heart, I’m hoping that not only new readers will embrace them, but that original fans will be pleased to see these sharp new collections as well as brand new Blue Monday material. There’s a lot in store, a lot of laughs, and a hell of a lot of fun to be had!”</p>\n\n<p><strong>THROWAWAYS</strong></p>\n</blockquote>\n\n<p><a href=\"http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-6.jpg\">http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-6.jpg</a></p>\n\n<blockquote>\n<p>Throwaway (n.):\nCold War slang for a deniable asset, a disposable assassin meant to die alongside their target.</p>\n\n<p>1973: Project MK-ULTRA shuts down for good, its goal of creating brainwashed assassins and psychic spies unrealized. That&#39;s the story the world believes for thirty years, until Dean Logan, son of a successful ULTRA test subject, narrowly escapes a team of enhanced operatives sent to kidnap him back into the fold. On the run—not just from the dirtiest secret the CIA ever funded—but his own out of control psychic abilities, Dean is saved by Abby Palmer, a former Army Ranger taken by ULTRA in Afghanistan and reprogrammed to be an unstoppable, disposable killer.</p>\n\n<p>Except Abby survived her expiration date, and now she&#39;s turned her deadly skillset toward one goal: destroying the ULTRA program and dragging its masterminds into the light. Teaming up to take them down, Dean and Abby quickly discover ULTRA&#39;s leadership has gone rogue, and the program&#39;s charismatic head doctor has her own plans—for Dean and Abby, for ULTRA, and for the United States itself.</p>\n\n<p>Looking into a future of superpowered assassins, telepathic intelligence agents, and far-reaching, government-toppling conspiracies, THROWAWAYS written by Caitlin Kittredge with art by Steve Sanders is the spy thriller as you&#39;ve never seen it before.</p>\n\n<p><strong>SUNSET PARK</strong></p>\n</blockquote>\n\n<p><a href=\"http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-7.jpg\">http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-7.jpg</a></p>\n\n<blockquote>\n<p>Something&#39;s up in Sunset Park, and it ain&#39;t just the rent. Are Brooklyn&#39;s gentrifiers more than just economic vampires? A cartoonist draws a macabre story from a collection of notes, journals, movies and other ephemera he finds boxed, abandoned in the studio he&#39;s recently rented along the latest frontline in gentrification&#39;s relentless march over Brooklyn in SUNSET PARK.</p>\n\n<p>Among the boxed items are what could be a copy of an old Warhol vampire film and what looks to be a journal belonging to Jean Michel Basquiat. SUNSET PARK is an all-new, limited series by Ron Wimberly coming from Image Comics.</p>\n\n<p><strong>SLAVE PUNK</strong></p>\n</blockquote>\n\n<p><a href=\"http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-8-1000x566.jpg\">http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-8-1000x566.jpg</a></p>\n\n<blockquote>\n<p>Ron Wimberly teased a second forthcoming project with Image Comics, SLAVE PUNK: WHITE COAL. SLAVE PUNK tells the story of how a genius slave defied the powerful King Cotton and ignited the Civil War in an attempt to end slavery.</p>\n\n<p><strong>CRY HAVOC</strong></p>\n\n<p>Image Comics announced CRY HAVOC, a new series written by Simon Spurrier (X-Men Legacy, Marvel Zombies, The Spire), with art by Ryan Kelly (Lucifer, Northlanders, Three), and featuring colors by Lee Loughridge and Matt Wilson, letters by Simon Bowland, and design by Emma Price. CRY HAVOC is a journey into war-torn Afghanistan in the company of monsters, a London street-musician savaged by a ghostly hound, and a terrified prisoner tangled in a folkloric insurrection.</p>\n\n<p>“Beneath all its snark, fanged horror-beasts, deadly firefights and exploding billy-goats, Cry Havoc is the intimate tale of one woman struggling to keep her life from falling apart,” said Spurrier. “To depict it all I&#39;ve been lucky enough to partner with Ryan, who&#39;s genuinely one of the greatest storytellers our medium has—not to mention a next-level monster-wrangler. Add to that some narrative mold breaking by our roster of superstar colorists and Cry Havoc is snarling to be set loose.”</p>\n\n<p>CRY HAVOC features three parallel and interwoven story threads in the life of Lou Canton: an extraordinary woman being consumed by chaos with three different colorists lending their artistic takes in order to define the separate phases of the story.</p>\n\n<p>Best described as Jarhead via Pan&#39;s Labyrinth, CRY HAVOC is a modern mix of myth, military, and monstrosity.</p>\n\n<p><strong>BLACK MAGICK</strong></p>\n</blockquote>\n\n<p><a href=\"http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-10-1000x567.jpg\">http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-10-1000x567.jpg</a></p>\n\n<blockquote>\n<p>Bestselling writer Greg Rucka and artist Nicola Scott team up to conjure an all-new ongoing series in BLACK MAGICK, set to launch just in time for Halloween.</p>\n\n<p>“I’m calling it witch-noir, because it’s not quite crime and it’s not wholly about the supernatural, but the two are somehow dancing together,” said Rucka. “And with Nicola’s art, it’s turned into a beautiful dance, indeed. I’ve been waiting six years to share Rowan’s story with the world, waiting even longer to get to work with Nicola on something creator-owned. This is that chance, and we’re both seizing it!”</p>\n\n<p>BLACK MAGICK follows Rowan Black, robbery/homicide detective in the city of Portsmouth, and the latest in a line of traditional witches who can trace their lineage—and memories—back to before the library of Alexandria burned. Rowan has carefully built a wall between her professional life and her faith, but now that barrier is cracking.</p>\n\n<p>If magick is the power to impose one’s own will on reality, where does that leave the rest of us?</p>\n\n<p><strong>CROSSWIND</strong></p>\n</blockquote>\n\n<p><a href=\"http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-9.jpg\">http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-9.jpg</a></p>\n\n<blockquote>\n<p>CROSSWIND is the cutting edge story of a suave, sharp hitman from Chicago and a seemingly unremarkable housewife from Seattle, and how they accidentally end up switching lives. It&#39;s a suspense fantasy full of sex, violence, and the blackest of humor. Written with sardonic wit by Gail Simone and stunningly realized by Cat Staggs, CROSSWIND will be one of the most talked about books of the year.</p>\n\n<p>Simone assured fans: “This is the comic that might make Dr. Wertham come back from the dead to try to ban comics again.”</p>\n\n<p><strong>THE GODDAMNED</strong></p>\n\n<p>SOUTHERN BASTARDS writer Jason Aaron, artist R.M. Guerra of Scalped, and colorist Giulia Brusco turn their attention to… The Bible in THE GODDAMNED.</p>\n\n<p>Before the great flood, the world is filled with violence and wickedness. In just a couple thousand years, humanity has gone from paradise to depravity and ruin. God is beginning to seriously regret having ever created man in the first place.</p>\n\n<p>Welcome to the world of THE GODDAMNED, an all-new, ongoing series to launch from Image Comics in November 2015. Set just before the Biblical flood, in a world so out of control with violence and depravity, God is just about to pull the plug. “It&#39;s part caveman adventure story, part stark and brutal western,” said Aaron. “And did I mention there are dinosaurs? Imagine if Quentin Tarantino was hired to direct the movie version of the book of Genesis. That&#39;s pretty much what we&#39;re aiming for.”</p>\n\n<p><strong>THE OTHER SIDE: Deluxe Edition</strong></p>\n</blockquote>\n\n<p><a href=\"http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-1.png\">http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-1.png</a></p>\n\n<blockquote>\n<p>Jason Aaron and Cameron Stewart also announced that a new, deluxe edition of THE OTHER SIDE would be coming to Image Comics.</p>\n\n<p><strong>HEARTLESS</strong></p>\n</blockquote>\n\n<p><a href=\"http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-11.jpg\">http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-11.jpg</a></p>\n\n<blockquote>\n<p>Legendary comics writer Warren Ellis teams up with artist Tula Lotay again for a modern folktale about love, revenge, and the deadly grip of the supernatural in, HEARTLESS.</p>\n\n<p>A female musician returns to northern England, where her family owned a little cottage in the middle of a forest. She wrote her first album there, and she&#39;s &quot;going back to the countryside,&quot; as musicians used to, to write her next one. But the forest doesn&#39;t want her there. She&#39;s returning to face her demons—one in particular—and put herself back together, but the forest remembers what she did, and the devil wants his due.</p>\n\n<p>Ellis said of the new project: “I wrote this for Tula, and it&#39;s full of all the stuff we love: the spooky stories, the landscape, the folklore, and the things that haunt us.”</p>\n\n<p><strong>HUCK</strong></p>\n</blockquote>\n\n<p><a href=\"http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-12.jpg\">http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-12.jpg</a></p>\n\n<blockquote>\n<p>Bestselling writer Mark Millar (Kingsman: The Secret Service, Kick-Ass, WANTED) will team up with artist Rafael Albuquerque (American Vampire) for an all-new project to be titled, HUCK.</p>\n\n<p>Millar said of the project: &quot;All the best old comics were about people you didn’t expect becoming empowered. Peter Parker wasn’t a classic hero. He was a lonely teenager. Matt Murdock was blind. Tony Stark had a heart condition. Doctor Donald Blake couldn’t walk without a stick. So we wanted to do something incredibly sweet about a small-town guy with learning difficulties who could do all these amazing things. He’s the purest, most decent character you’ve ever seen in a comic book. A big guy who just wants to help people and does it in secret so nobody even knows he even exists. It’s the ultimate feel good comic. A Frank Capra superhero story I guess about a small town and a close-knit community and an amazing guy they just all want to shelter from the outside world. He’s Captain America meets Forrest Gump. He’s just a nice guy in a very classic mould.</p>\n\n<p>“Working with Rafael has been amazing. I’ve always been a fan, but you really only fully appreciate an artist when you see what he does with one of your scripts. I think this is one of the most beautifully drawn comics I’ve ever had my name on and it’s been such a pleasure. I finished the whole project in early summer and I’m starting the second arc soon. We’ve got three of these stories planned, each one six issues long, and we’re just having a good time. I think you stumble on something special every once in a while as a creator and my gut tells me we’ve got a project like that here.”</p>\n\n<p><strong>PRIVATE EYE: The Deluxe Hardcover</strong></p>\n</blockquote>\n\n<p><a href=\"http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-14.jpg\">http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-14.jpg</a></p>\n\n<blockquote>\n<p>Nominated for three Eisner Awards, PanelSyndicate.com’s digital comics sensation THE PRIVATE EYE by Brian K. Vaughan and Marcos Martin with colors by Muntsa Vincente is finally coming to print in a gorgeous deluxe hardcover edition. The book will hit stores this November 2015.</p>\n\n<p>“Readers and retailers have been begging us for a physical version of this story ever since we first announced our hard-boiled parable about the future of privacy in America,” said Vaughan. “So when the time came, Marcos and I knew that we had to go with Image Comics, the most creator-friendly publisher of print comics ever.”</p>\n\n<p>Set in an inevitable future where everyone has a secret identity, THE PRIVATE EYE is an eerily prescient sci-fi mystery about an unlicensed private investigator who stumbles onto the most important case of his life.</p>\n\n<p><strong>SNOTGIRL</strong></p>\n</blockquote>\n\n<p><a href=\"http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-15.jpg\">http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-15.jpg</a></p>\n\n<blockquote>\n<p>New York Times bestselling writer Bryan Lee O’Malley teams up with artist Leslie Hung, colorist Mickey Quinn, and letterer/designer Maré Odomo for SNOTGIRL, a dark comedy set in the world of fashion bloggers.</p>\n\n<p>“Snotgirl is funny and f*cked up,” O’Malley warned. “It’s full of fascinating characters you’ll love to hate. Leslie’s art is lush and beautiful.”</p>\n\n<p>Lottie is a huge success—she’s blog famous! Her online persona is flawless and fun, but her real life is filled with woes. She has terrible allergies, she just got dumped, and her blogger friends don’t understand her. Things turn around when Lottie instantly clicks with Caroline, a new girl on the scene… but can she turn chemistry into friendship, or will she ruin everything?</p>\n\n<p>Hung added: “This is my first ongoing series, so I’m really excited. Snotgirl is going to be the best comic ever, if we don’t die making it!”</p>\n\n<p><strong>VIRGIL OGN</strong></p>\n</blockquote>\n\n<p><a href=\"http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-16.jpg\">http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-16.jpg</a></p>\n\n<blockquote>\n<p>Betrayed, beaten, and banished by his own, an outed cop fights his way across Jamaica for revenge.</p>\n\n<p>UNDERTOW and Midnighter writer Steve Orlando and Murder Book artist JD Faith present a brand new, “queersploitation” graphic novel on the streets of Jamaica in, VIRGIL, in stores this September 2015.</p>\n\n<p>This is a Foxy Brown-style revenge action with a new face and new fists. Holding his gun and his badge, Virgil thought he was safe in the police force, hiding who he is. But when his own brothers on the force out him in the papers, it doesn&#39;t bring him down. It sets him free!</p>\n\n<p>Now, he&#39;s out for revenge. And he&#39;s not leaving town without his man, and some blood on his hands.</p>\n\n<p>From the foreword: &quot;Steve Orlando and J.D. Faith have taken the conventions of the revenge thriller, mixed them in with elements of queersploitation, and managed to deliver a graphic novel that is entertaining, relevant, and politicized.&quot; —David Walker, writer of Shaft, Cyborg</p>\n\n<p><strong>HADRIAN’S WALL</strong></p>\n</blockquote>\n\n<p><a href=\"http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-17.jpg\">http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-17.jpg</a></p>\n\n<blockquote>\n<p>From the creative team behind the critically-acclaimed series C.O.W.L.—Kyle Higgins, Alec Siegel, and Rod Reis—comes a new psychological thriller in HADRIAN’S WALL, where the secrets of everyone involved are as dark as the space that surrounds them. The series is set to launch from Image Comics this November 2015.</p>\n\n<p>In 1983, tensions between the United States and the Soviet Union culminated with nuclear detonations in New York City and Moscow. In the decades following, the two superpowers found peace through a partnership focused on building the first colony in space. But now, seventy years later, a new Cold War simmers… between Earth and that very Colony.</p>\n\n<p>“With C.O.W.L., Image afforded us the tremendous opportunity to launch a creator-owned series focusing on dark, complex, morally ambiguous characters in a time of great change,” said Higgins. “We’re thrilled to continue that trend with Hadrian’s Wall, and even more thrilled to continue our partnership with Image.”</p>\n\n<p>When a crewmember dies aboard one of Earth’s survey ships, HADRIAN’S WALL, investigator Simon Moore looks to determine whether foul play is involved. However, once on board, it doesn’t take Simon long to realize that few things are what they seem... including the identities of the crew and the real reason HADRIAN’S WALL is on the edges of Colony Space. With every crewmember a suspect, and tensions between Earth and the Colony mounting, the fate of both worlds may come down to one man and a ship.</p>\n\n<p><strong>AXCEND</strong></p>\n</blockquote>\n\n<p><a href=\"http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-20.jpg\">http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-20.jpg</a></p>\n\n<blockquote>\n<p>Creator and writer/artist Shane Davis alongside inker Michelle Delecki and colorist Morry Hollowell bring AXCEND to Image Comics this October 2015.</p>\n\n<p>“In Axcend, teenager, Eric Morn&#39;s life revolves around gaming,” said Davis. “He quickly finds himself locked against a vicious player only to realize the game, Axcend, has carried over into the real world with apocalyptic consequences.”</p>\n\n<p>What happens when a video game decides to come to our reality to play? When there are no extra lives, and Armageddon looms on the horizon, when your life revolves around gaming like teenager Eric Morn, you Press Start.</p>\n\n<p><strong>FASTER THAN LIGHT</strong></p>\n</blockquote>\n\n<p><a href=\"http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-18.jpg\">http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-18.jpg</a></p>\n\n<blockquote>\n<p>Written and drawn by Brian Haberlin, Shadowline/Image Comics is pleased to introduce readers to an all-new, interactive storytelling experience in FASTER THAN LIGHT, launching this September 2015.</p>\n\n<p>In the very near future we discover the secret of faster-than-light travel. Suddenly the universe is wide open to us, but are we ready for it? With all the idealism of the original Star Trek and the grit and immediacy of Gravity, the story of humanity&#39;s first thrilling and terrifying adventures to the stars takes flight!</p>\n\n<p>Every issue features Anomaly&#39;s free cutting edge Augmented Reality app, which makes it look like interactive holograms are coming out of the book!</p>\n\n<p><strong>EXPIRED</strong></p>\n\n<p>Written by Jimmie Robinson (THE EMPTY) with art by Richard Pace, Shadowline/Image Comics also announced an all-new, five-issue supernatural crime series, EXPIRED. </p>\n\n<p>In EXPIRED, a homeless war vet ends up helping a ghost who is connected to an old coin-operated parking meter. He can only see and communicate with her as long as he feeds the meter.  He has to solve the murder before the city replaces the meter with a modern version — and before the killer finds him, but who’s going to believe a homeless guy who looks like he’s talking to himself?</p>\n\n<p><strong>THE ONE%</strong></p>\n</blockquote>\n\n<p><a href=\"http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-19.jpg\">http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-19.jpg</a></p>\n\n<blockquote>\n<p>Critically-acclaimed writer/artist/director Kaare Kyle Andrews (Spider-Man: Reign, Iron Fist: The Living Weapon) targets THE ONE% with his very first creator-owned comic.</p>\n\n<p>In THE ONE%, they own more than half the world, and Renato Jones is going to even the score... one percent at a time.</p>\n\n<p>&quot;Creator-owned comics have always been part of the plan,” said Andrews. “I can&#39;t believe I&#39;ve waited so long to make the leap. I am hungry, I am angry, and I am throwing everything I have into this series. A dark neo-noir tribute to focus all of my rage and revenge.”</p>\n\n<p><strong>RINGSIDE</strong></p>\n</blockquote>\n\n<p><a href=\"http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-21.jpg\">http://www.comicsbeat.com/wp-content/uploads/2015/07/unnamed-21.jpg</a></p>\n\n<blockquote>\n<p>RINGSIDE is an ongoing drama written by Joe Keatinge (SHUTTER, TECH JACKET), with art by Nick Barber, colors by Simon Gough, and letters by Ariana Maher set around the world of professional wrestling and coming from Image Comics this November. The series explores the artistry of performers rotating as cogs in the corporate machinery of an industry built to sell myth to the masses.</p>\n\n<p>“Ever since I was a kid I&#39;ve been caught up in the mythology professional wrestling sells us, that these larger-than-life men and women are unstoppable titans locked in a never-ending, action-packed drama,” said Keatinge. “However, in time you learn that they&#39;re just as human as anyone else, that they&#39;re very much putting their lives on the line to entertain us, that they&#39;re just as much part of a corporate machine built for profit as anyone else. Ringside&#39;s a book about taking apart that machine and seeing how the industry functions and the lives it affects from a rotating set of angles including the wrestlers themselves, the creatives they work with, the suits in charge and the fans cheering them all on.&quot;</p>\n\n<p>RINGSIDE starts with three perspectives: a retired veteran forced to fight his greatest battle in the real world, a rookie struggling to get his first shot and a writer frustrated over lack of control.</p>\n\n<p>But they&#39;re just the beginning.</p>\n\n<p>The real violence is outside the ring.</p>\n</blockquote>\n</div><!-- SC_ON -->",
  "downs": 0,
  "user_reports": [],
  "over_18": false,
  "score": 15,
  "stickied": false,
  "domain": "self.ImageComics",
  "is_self": true,
  "hidden": false,
  "_orphaned": {},
  "_api_link": "https://api.reddit.com/r/ImageComics/comments/3bvvci/image_expo_megathread/?ref=search_posts",
  "_comments_by_id": {},
  "visited": false,
  "thumbnail": "self",
  "_has_fetched": true,
  "gilded": 0,
  "hide_score": false,
  "_info_url": "https://api.reddit.com/api/info/",
  "created_utc": 1435856484.0,
  "subreddit_id": "t5_2u0en",
  "id": "3bvvci",
  "_params": {},
  "media_embed": {},
  "name": "t3_3bvvci",
  "quarantine": false,
  "permalink": "https://www.reddit.com/r/ImageComics/comments/3bvvci/image_expo_megathread/?ref=search_posts",
  "ups": 15,
  "url": "https://www.reddit.com/r/ImageComics/comments/3bvvci/image_expo_megathread/",
  "title": "IMAGE EXPO Megathread",
  "preview": {
    "images": [
      {
        "resolutions": [
          {
            "width": 108,
            "height": 54,
            "url": "https://i.redditmedia.com/mvj7Dk0ItWq55v6U2S5jVW1TgD6qDcm2tUsRSb3ebUQ.jpg?fit=crop&crop=faces%2Centropy&arh=2&w=108&s=6e1a1438c4bbfe122870f06bb87d71e3"
          },
          {
            "width": 216,
            "height": 108,
            "url": "https://i.redditmedia.com/mvj7Dk0ItWq55v6U2S5jVW1TgD6qDcm2tUsRSb3ebUQ.jpg?fit=crop&crop=faces%2Centropy&arh=2&w=216&s=d75fbcdcb066afeb80beb9d725e1f452"
          },
          {
            "width": 320,
            "height": 161,
            "url": "https://i.redditmedia.com/mvj7Dk0ItWq55v6U2S5jVW1TgD6qDcm2tUsRSb3ebUQ.jpg?fit=crop&crop=faces%2Centropy&arh=2&w=320&s=1066b39adaaee386b210eed75e6ba831"
          },
          {
            "width": 640,
            "height": 322,
            "url": "https://i.redditmedia.com/mvj7Dk0ItWq55v6U2S5jVW1TgD6qDcm2tUsRSb3ebUQ.jpg?fit=crop&crop=faces%2Centropy&arh=2&w=640&s=0727f70a4a96517d486082b9c868bf4c"
          }
        ],
        "id": "VwUjMMyGbAfFZ7s7olD4Jft4q9UQux2H4cUPsyNMuwE",
        "variants": {},
        "source": {
          "width": 900,
          "height": 454,
          "url": "https://i.redditmedia.com/mvj7Dk0ItWq55v6U2S5jVW1TgD6qDcm2tUsRSb3ebUQ.jpg?s=0a4f508b1f6067ee1768ba4095f962c4"
        }
      }
    ]
  }
}