{
  "downs": 0,
  "mod_reports": [],
  "secure_media_embed": {},
  "_info_url": "https://api.reddit.com/api/info/",
  "gilded": 0,
  "num_comments": 382,
  "_orphaned": {},
  "hidden": false,
  "ups": 815,
  "url": "https://www.reddit.com/r/atheism/comments/cb6fp/i_have_a_depressing_story_about_a_faith_healer/",
  "_has_fetched": true,
  "quarantine": false,
  "name": "t3_cb6fp",
  "user_reports": [],
  "saved": false,
  "permalink": "https://www.reddit.com/r/atheism/comments/cb6fp/i_have_a_depressing_story_about_a_faith_healer/?ref=search_posts",
  "over_18": false,
  "is_self": true,
  "_params": {},
  "thumbnail": "self",
  "created_utc": 1275604217.0,
  "_replaced_more": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>---inspired by <a href=\"http://www.reddit.com/r/atheism/comments/cb0b9/i_dont_see_any_need_for_evidence_when_you/\">this post/thread</a>---</p>\n\n<p><strong>WARNING:</strong> If you wanna throw up in your mouth a little, read on...</p>\n\n<p>I went to see <a href=\"http://www.bennyhinn.org/default.cfm\">Benny Hinn</a> with a coworker in Denver a few years back.  Benny Hinn is a self-proclaimed faith healer who puts on a <em>huge</em> spectacle.  I was reluctant to go, but I went anyway.  I was told, &quot;You don&#39;t have to believe anything to enjoy the gospel choir- it&#39;s pretty impressive.&quot;  This was true.</p>\n\n<p>So many people were packed into the Pepsi Center (a 20,000+ venue) that there was standing room only.</p>\n\n<p>We sat next to a latino family who, by the looks of their clothes, did not have a pot to piss in.  Upon the first offertory (and there were 4 offertories that evening), the family father cut a check for $3500 and slipped it into the lock box carried by one of the three dozen visibly armed ushers.  Each lock box had a sign on the front reading, <em>Suggested Donation: $1000.00.</em>  The family gave additional money each time the lock box went by, but I am not sure how much.  My coworker slipped a check in the box as well.</p>\n\n<p>On the dais were <em>the afflicted people-</em> about 15 people, each claiming to have some sort of disorder that Benny Hinn intended to <em>heal</em> on stage.  We watched a deaf man hear, two people get out of their wheelchairs, one person theatrically disconnect from an oxygen tank, and a blind lady freely jog around stage with her seeing-eye dog... <em>MIRACLES!</em></p>\n\n<p>That wasn&#39;t the worst of it.  This was:</p>\n\n<p>Soon it was time to find people in the audience that needed the help of Benny Hinn... while the people on the platform were being cured of their ills in the show, about 50-some staff members in blue shirts were seeking out <em>stage-worthy</em> people from the audience to cure.  They roped off an area near the far end of the arena to &quot;practice&quot; the activity that would be the result of the healing.  We saw them take a walker away from an old lady- she tried to walk, and despite all the prayer and encouragement, she fell right over!  That was <em>funny!</em>  So we had to go over and get a closer look.</p>\n\n<p>There were about 200 people in the line to have their <em>heal-ability</em> tested, and about half of them were in wheelchairs, and about half of the people in wheelchairs were kids.</p>\n\n<p>Well, the old lady who fell was crying.  Not because she injured herself.  But because the men in blue told her (according to one of the Pepsi Center employees who allowed us to stand nearby) that she couldn&#39;t be healed because <em>her faith in God was not 100%.</em>  She was told to stand against the wall until she confessed to God that her faith was shaken and be forgiven for it, or confess the sin she was hiding that was preventing God from healing her.  A sixtysomething woman, bawling her eyes out (old people crying really gets me).</p>\n\n<p>And that <em>still</em> wasn&#39;t the worst of it...</p>\n\n<p>Next in line was a kid in a wheelchair, probably 9 or 10 years old, with <em>malformed legs.</em>  SOMEHOW, this child was going to walk on them.  First of all, the kid was shivering with fear, and did not want to participate.  A man in blue stood him up, and the kid fell back in his chair.  And the kid was <em>embarrassed</em>.</p>\n\n<p>&quot;C&#39;mon honey, don&#39;t you wanna walk?&quot; asked his mom.</p>\n\n<p>&quot;This is why we came here! You&#39;ve got to <em>tryyy</em>,&quot; said his dad.</p>\n\n<p>My coworker and I were overlooking the railing from about twenty feet up- at least, at this point, my coworker couldn&#39;t stomach it anymore.  &quot;I&#39;m sorry I dragged you here.&quot; </p>\n\n<p>The man in blue grabbed another man in blue, and they suggested to form a prayer circle around the boy to <em>channel God.</em>  The prayer circle was getting louder and louder, and more and more men in blue came to pray- yet this kid still managed to cry over them all.</p>\n\n<p>A man in blue got on his knees and, nodding his head, says to the kid, &quot;Do you believe in God?  Do you believe he&#39;ll make you walk?  Just believe.  Just pray.&quot;  The kid is too frightened to respond.</p>\n\n<p>The kids dad is in the prayer circle with his eyes clamped tightly shut, praying through clenched teeth.  His mom is hysterical, crying and sweating, digging her fingernails into the kids forearm, &quot;Baby, you gotta get out of your seat!  Stand up, baby, just stand up!&quot;</p>\n\n<p>They get this kid to start screaming at the top of his lungs, &quot;I WANNA WALK!  I WANNA WALK!&quot; as they all chant a call-and-response prayer led by a man in blue.  Mom and Dad pick this kid up from under his armpits out of his chair, with his twisted legs dangling lifelessly, his shoes brushing the floor.  Mom, Dad, and Son were all beet-red, screaming and crying.  Mom was especially overwrought with desperation.</p>\n\n<p>The prayer leader stopped.  He looked at the kids parents and said, &quot;This isn&#39;t gonna work.  Sorry.  He&#39;s [motioning to their son] just not ready for this.&quot;</p>\n\n<p><em>Ugghh...</em> my insides sank.</p>\n\n<p>The kids Mom collapsed to her knees and smothered her anguished shrieks (&quot;Nooo, baby, nooo!&quot;) with her face buried in her son&#39;s lap.  And the look on the kid&#39;s face revealed that he truly believed <em>it was all his fault.</em></p>\n\n<p>My coworker couldn&#39;t take it and wanted a smoke, so we went outside.  We were in disbelief.  I expected a silly, unconvincing show.  I didn&#39;t anticipate witnessing gut-wrenching evil.  My coworker&#39;s eyes watered up; he looked at me and said, &quot;I gave them a thousand dollars.&quot;</p>\n\n<p>We went back in, and missed a large portion of the finale.  Of the 200 people that went to <em>healer tryouts</em>, less than ten made the cut.</p>\n\n<p>After the show, my coworker suggested we should go out back by the tour busses and see, just in case, if any of <em>the afflicted people</em> boarded.  They all did, capably.  I recognized the long-haired wheelchair man and the blind jogger.</p>\n\n<p>EDIT: sp</p>\n\n<p><strong>tl;dr:</strong> Faith healing isn&#39;t just a farce.  It&#39;s damnable.</p>\n\n<p><strong>EDIT #2</strong></p>\n\n<p>Apparently I overshot the capacity of the Pepsi Center.  I&#39;m pretty sure I got the 35K I originally submitted because the Benny Hinn people announced the event attendance... my fault for believing even the remotest, extraneous statistic (thanks Azkar).  And, yes, part of the reason I agreed to attend Benny Hinn is that his name is two lowercase letters away from Benny Hill.  Fine.  I admit it.  I wasn&#39;t expecting Yakity Sax, but if I got it... man, that&#39;d be something...</p>\n\n<p><strong>EDIT #3</strong></p>\n\n<p><strong>I HAD NO IDEA THIS STORY WOULD GARNER THIS MUCH POPULARITY.  I&#39;M GLAD I TOLD IT WELL-ENOUGH TO HOPEFULLY GET THROUGH TO SOME PEOPLE!</strong></p>\n\n<p>I&#39;m semi-new to Reddit and suppose an &quot;EDIT&quot; (vs, a new post) is the appropriate way to continue a story... I invited my Benny Hinn accomplice to a local watering hole tonight to watch the basketball game... (yes, I&#39;m completely intoxicated while writing this, and will try to triple-check spelling and grammar)... but it&#39;s kinda funny...</p>\n\n<p><strong>HERE IS A FOLLOW-UP</strong> with regards to my coworker:</p>\n\n<p>My friend said that after we went to the Benny Hinn thing, he was really upset.  But not upset enough to talk to his wife about it.  He and his wife were supposed to go together, but his wife, a registered nurse at a local hospital, wound up having to work.  I was apparently invited last-minute.  And he and his wife discussed donating $1000 prior to going to the event.  He left it with his wife as &quot;a good, inspirational show&quot;.</p>\n\n<p>Anyway, all the events transpired.  The following Friday, my coworkers and spouses, etc., met at Happy Hour together.  Apparently, I couldn&#39;t keep my mouth shut (I remember this) about how miserable the Benny Hinn show was.  I remember describing the old, arthritic woman and the crippled boy, and I confounded everyone with this re-telling... everyone agreed with me.  Even my coworker&#39;s wife.  She went home, aghast.</p>\n\n<p>According to my friend, he and his wife previously discussed the $1000 donation together.  But after my Happy Hour <em>Sermon on the Mountain,</em> I exposed Benny Hinn to the degree that my coworker&#39;s wife was appalled.  Of course, by this time, the check had been cashed.  She and my coworker fought for several weeks over this financial matter.</p>\n\n<p>&quot;Well, what&#39;d she have to say?&quot; I asked.</p>\n\n<p>&quot;You should&#39;ve had the sense,&quot; he said.</p>\n\n<p>&quot;Yeah, you should&#39;ve.&quot;</p>\n\n<p>--&quot;Easy for her to say.  If I came home and explained I didn&#39;t give the money, she&#39;d&#39;ve been pissed and assumed it was because of you or something.&quot;</p>\n\n<p>&quot;Yeah, but you&#39;d have a thousand more dollars...&quot;</p>\n\n<p>--&quot;True...&quot;</p>\n\n<p>My former coworker blamed me (entirely) for bringing up the subject at Happy Hour.  I assured him that <em>he</em> was at fault for ever writing the check to begin with.  I asked him, &quot;Your wife&#39;s an RN, does she <em>really</em> believe in this stuff?&quot;</p>\n\n<p>--&quot;Yeah.  She says she&#39;s seen too much crazy stuff <em>not</em> to believe.&quot;</p>\n\n<p>&quot;Maybe so... but... to the degree that <em>faith-healing</em> is a viable cure?&quot;</p>\n\n<p>--&quot;Probably not,&quot; he admitted.</p>\n\n<p>I&#39;m an overbearing bastard.  &quot;If I went to Benny Hinn with your wife, would <em>she</em> have donated the money?&quot;</p>\n\n<p>--&quot;No.&quot;</p>\n\n<p>So that&#39;s that.  Apart from that, and the Lakers&#39; victory, we enjoyed the basketball game.</p>\n\n<p><strong>tl;dr:</strong> Coworker didn&#39;t cancel the check out of fear of reprisal from wife.  Wife <em>reprised</em> anyway.</p>\n</div><!-- SC_ON -->",
  "subreddit_id": "t5_2qh2p",
  "archived": true,
  "domain": "self.atheism",
  "clicked": false,
  "score": 815,
  "id": "cb6fp",
  "stickied": false,
  "media_embed": {},
  "visited": false,
  "selftext": "---inspired by [this post/thread](http://www.reddit.com/r/atheism/comments/cb0b9/i_dont_see_any_need_for_evidence_when_you/)---\r\n\r\n**WARNING:** If you wanna throw up in your mouth a little, read on...\r\n\r\nI went to see [Benny Hinn](http://www.bennyhinn.org/default.cfm) with a coworker in Denver a few years back.  Benny Hinn is a self-proclaimed faith healer who puts on a *huge* spectacle.  I was reluctant to go, but I went anyway.  I was told, \"You don't have to believe anything to enjoy the gospel choir- it's pretty impressive.\"  This was true.\r\n\r\nSo many people were packed into the Pepsi Center (a 20,000+ venue) that there was standing room only.\r\n\r\nWe sat next to a latino family who, by the looks of their clothes, did not have a pot to piss in.  Upon the first offertory (and there were 4 offertories that evening), the family father cut a check for $3500 and slipped it into the lock box carried by one of the three dozen visibly armed ushers.  Each lock box had a sign on the front reading, *Suggested Donation: $1000.00.*  The family gave additional money each time the lock box went by, but I am not sure how much.  My coworker slipped a check in the box as well.\r\n\r\nOn the dais were *the afflicted people-* about 15 people, each claiming to have some sort of disorder that Benny Hinn intended to *heal* on stage.  We watched a deaf man hear, two people get out of their wheelchairs, one person theatrically disconnect from an oxygen tank, and a blind lady freely jog around stage with her seeing-eye dog... *MIRACLES!*\r\n\r\nThat wasn't the worst of it.  This was:\r\n\r\nSoon it was time to find people in the audience that needed the help of Benny Hinn... while the people on the platform were being cured of their ills in the show, about 50-some staff members in blue shirts were seeking out *stage-worthy* people from the audience to cure.  They roped off an area near the far end of the arena to \"practice\" the activity that would be the result of the healing.  We saw them take a walker away from an old lady- she tried to walk, and despite all the prayer and encouragement, she fell right over!  That was *funny!*  So we had to go over and get a closer look.\r\n\r\nThere were about 200 people in the line to have their *heal-ability* tested, and about half of them were in wheelchairs, and about half of the people in wheelchairs were kids.\r\n\r\nWell, the old lady who fell was crying.  Not because she injured herself.  But because the men in blue told her (according to one of the Pepsi Center employees who allowed us to stand nearby) that she couldn't be healed because *her faith in God was not 100%.*  She was told to stand against the wall until she confessed to God that her faith was shaken and be forgiven for it, or confess the sin she was hiding that was preventing God from healing her.  A sixtysomething woman, bawling her eyes out (old people crying really gets me).\r\n\r\nAnd that *still* wasn't the worst of it...\r\n\r\nNext in line was a kid in a wheelchair, probably 9 or 10 years old, with *malformed legs.*  SOMEHOW, this child was going to walk on them.  First of all, the kid was shivering with fear, and did not want to participate.  A man in blue stood him up, and the kid fell back in his chair.  And the kid was *embarrassed*.\r\n\r\n\"C'mon honey, don't you wanna walk?\" asked his mom.\r\n\r\n\"This is why we came here! You've got to *tryyy*,\" said his dad.\r\n\r\nMy coworker and I were overlooking the railing from about twenty feet up- at least, at this point, my coworker couldn't stomach it anymore.  \"I'm sorry I dragged you here.\" \r\n\r\nThe man in blue grabbed another man in blue, and they suggested to form a prayer circle around the boy to *channel God.*  The prayer circle was getting louder and louder, and more and more men in blue came to pray- yet this kid still managed to cry over them all.\r\n\r\nA man in blue got on his knees and, nodding his head, says to the kid, \"Do you believe in God?  Do you believe he'll make you walk?  Just believe.  Just pray.\"  The kid is too frightened to respond.\r\n\r\nThe kids dad is in the prayer circle with his eyes clamped tightly shut, praying through clenched teeth.  His mom is hysterical, crying and sweating, digging her fingernails into the kids forearm, \"Baby, you gotta get out of your seat!  Stand up, baby, just stand up!\"\r\n\r\nThey get this kid to start screaming at the top of his lungs, \"I WANNA WALK!  I WANNA WALK!\" as they all chant a call-and-response prayer led by a man in blue.  Mom and Dad pick this kid up from under his armpits out of his chair, with his twisted legs dangling lifelessly, his shoes brushing the floor.  Mom, Dad, and Son were all beet-red, screaming and crying.  Mom was especially overwrought with desperation.\r\n\r\nThe prayer leader stopped.  He looked at the kids parents and said, \"This isn't gonna work.  Sorry.  He's [motioning to their son] just not ready for this.\"\r\n\r\n*Ugghh...* my insides sank.\r\n\r\nThe kids Mom collapsed to her knees and smothered her anguished shrieks (\"Nooo, baby, nooo!\") with her face buried in her son's lap.  And the look on the kid's face revealed that he truly believed *it was all his fault.*\r\n\r\nMy coworker couldn't take it and wanted a smoke, so we went outside.  We were in disbelief.  I expected a silly, unconvincing show.  I didn't anticipate witnessing gut-wrenching evil.  My coworker's eyes watered up; he looked at me and said, \"I gave them a thousand dollars.\"\r\n\r\nWe went back in, and missed a large portion of the finale.  Of the 200 people that went to *healer tryouts*, less than ten made the cut.\r\n\r\nAfter the show, my coworker suggested we should go out back by the tour busses and see, just in case, if any of *the afflicted people* boarded.  They all did, capably.  I recognized the long-haired wheelchair man and the blind jogger.\r\n\r\nEDIT: sp\r\n\r\n**tl;dr:** Faith healing isn't just a farce.  It's damnable.\r\n\r\n**EDIT #2**\r\n\r\nApparently I overshot the capacity of the Pepsi Center.  I'm pretty sure I got the 35K I originally submitted because the Benny Hinn people announced the event attendance... my fault for believing even the remotest, extraneous statistic (thanks Azkar).  And, yes, part of the reason I agreed to attend Benny Hinn is that his name is two lowercase letters away from Benny Hill.  Fine.  I admit it.  I wasn't expecting Yakity Sax, but if I got it... man, that'd be something...\r\n\r\n**EDIT #3**\r\n\r\n**I HAD NO IDEA THIS STORY WOULD GARNER THIS MUCH POPULARITY.  I'M GLAD I TOLD IT WELL-ENOUGH TO HOPEFULLY GET THROUGH TO SOME PEOPLE!**\r\n\r\nI'm semi-new to Reddit and suppose an \"EDIT\" (vs, a new post) is the appropriate way to continue a story... I invited my Benny Hinn accomplice to a local watering hole tonight to watch the basketball game... (yes, I'm completely intoxicated while writing this, and will try to triple-check spelling and grammar)... but it's kinda funny...\r\n\r\n**HERE IS A FOLLOW-UP** with regards to my coworker:\r\n\r\nMy friend said that after we went to the Benny Hinn thing, he was really upset.  But not upset enough to talk to his wife about it.  He and his wife were supposed to go together, but his wife, a registered nurse at a local hospital, wound up having to work.  I was apparently invited last-minute.  And he and his wife discussed donating $1000 prior to going to the event.  He left it with his wife as \"a good, inspirational show\".\r\n\r\nAnyway, all the events transpired.  The following Friday, my coworkers and spouses, etc., met at Happy Hour together.  Apparently, I couldn't keep my mouth shut (I remember this) about how miserable the Benny Hinn show was.  I remember describing the old, arthritic woman and the crippled boy, and I confounded everyone with this re-telling... everyone agreed with me.  Even my coworker's wife.  She went home, aghast.\r\n\r\nAccording to my friend, he and his wife previously discussed the $1000 donation together.  But after my Happy Hour *Sermon on the Mountain,* I exposed Benny Hinn to the degree that my coworker's wife was appalled.  Of course, by this time, the check had been cashed.  She and my coworker fought for several weeks over this financial matter.\r\n\r\n\"Well, what'd she have to say?\" I asked.\r\n\r\n\"You should've had the sense,\" he said.\r\n\r\n\"Yeah, you should've.\"\r\n\r\n--\"Easy for her to say.  If I came home and explained I didn't give the money, she'd've been pissed and assumed it was because of you or something.\"\r\n\r\n\"Yeah, but you'd have a thousand more dollars...\"\r\n\r\n--\"True...\"\r\n\r\nMy former coworker blamed me (entirely) for bringing up the subject at Happy Hour.  I assured him that *he* was at fault for ever writing the check to begin with.  I asked him, \"Your wife's an RN, does she *really* believe in this stuff?\"\r\n\r\n--\"Yeah.  She says she's seen too much crazy stuff *not* to believe.\"\r\n\r\n\"Maybe so... but... to the degree that *faith-healing* is a viable cure?\"\r\n\r\n--\"Probably not,\" he admitted.\r\n\r\nI'm an overbearing bastard.  \"If I went to Benny Hinn with your wife, would *she* have donated the money?\"\r\n\r\n--\"No.\"\r\n\r\nSo that's that.  Apart from that, and the Lakers' victory, we enjoyed the basketball game.\r\n\r\n**tl;dr:** Coworker didn't cancel the check out of fear of reprisal from wife.  Wife *reprised* anyway.",
  "hide_score": false,
  "_api_link": "https://api.reddit.com/r/atheism/comments/cb6fp/i_have_a_depressing_story_about_a_faith_healer/?ref=search_posts",
  "locked": false,
  "edited": true,
  "title": "I Have a Depressing Story About a Faith Healer...",
  "created": 1275604217.0,
  "_comments_by_id": {}
}