{
  "clicked": false,
  "_replaced_more": false,
  "archived": true,
  "num_comments": 3,
  "created": 1329579644.0,
  "saved": false,
  "selftext": "**Verified?** *(This bot cannot verify AMAs just yet)*\n\n**Date:** 2012-02-01\n\n**[Link to submission](http://www.reddit.com/r/thewalkingdead/comments/p67lt/)**\n\n**[Link to my post](http://www.reddit.com/r/thewalkingdead/comments/p67lt/tabledresser/c3sicae)**\n\n\n\nQuestions|Answers\n:--|:--\n[I've heard that the main cast avoids the zombies when not filming, is that true? Also it just a method acting deal where they want to appear shocked when they see them? Or is it some rule about extras not associating with the cast?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mumwy?context=5)|No it's definitely not that we're too good to be with the extras or whatever. Haha. Everyone always goes up to the walkers and introduces themselves to them. We try so hard to make them feel like part of the cast, because they are. They all work so hard, and we put them through so much that it would be awful if we didnt show them appreciation for that.   That being said, it's hard to introduce yourself to all 200 zombies. Haha. I tried to personally hang out as much as I could with them, but there's always designated areas for each, and most of the time we're just too busy to chat. It also has something to do with the fact that Greg and his team make some of the most horrific looking things I've ever seen in my entire life. Sometimes its hard to talk to a corpse and not be a little skeeved out. haha.\n[Why helllllllo! Huge fan of the show. You guys got a good thing goin' on. Silly question, but does Andrew Lincoln talk with his normal accent off camera? Most of the interviews I've seen with him he's been using an American accent, and even on some promos I saw awhile back. Also, can Norman Reedus really shoot that crossbow well? Have an awesome day:D.](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mtxdg?context=5)|Hi there! I was actually really excited to find that out myself going into the job. When we're on set Andy is always in character. He told me that it was something that Frank Darabont asked of him when he first started the show. All season I've only heard him slide Ito his native accent 3 times while we were on set.   As for Norm and the crossbow, it depends on the shot and if he's actually hitting a person or not, but I don't trust him with it. Haha.\n[You could get a supporting role in any other TV series running right now - which one would you choose? And in any other series that has ever been produced?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mu8pn?context=5)|Oh God what a good couple questions. My absolute favorite show of all time is Doctor Who. I'm not british so it would be a miracle to even be an extra in that show, but that's definitely top of my list. Other than that maybe Community or House. One of my dreams is to be a patient one episode. Haha.\n[ to ask a TWD-related question: Without giving anything away of course, what do you look forward to the most this season?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3n6ddu?context=5)|Oh wow. Hmm tricky. Well I'm really looking forward to a few new characters that pop up. The next two episodes really begin showing off some ridiculously fantastic performances. As the season goes people are definitely going to be getting new favorites for sure. These guys never pull any punches. It's so so so good.\n[Do you have a favorite doctor and companion?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mzbyv?context=5)|Tennant and Donna. Hands down all time favorite TV duo. Although an absurdly close second is Matt smith and River song. Their relationship is AMAZING.\n[Do you read the comics? If so, what do you think of them? Which character from the show would you most want supporting you?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mu2ub?context=5)|I personally don't know enough about either to really form a useful opinion, but from what I do know I think Censorship is wrong on that level. The internet needs this freedom and to have people strip it away would be such a tragedy. Again, I'm lacking the full picture though.\n[If a zombie apocalypse occurred what would be the first thing you would do? Hide somewhere? Get on an aircraft carrier? What are your opinions on the proposed SOPA and PIPA bills? Do you think piracy would decrease significantly if content was more readily available?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mu2ub?context=5)|I think an aircraft carrier would probably be pretty choice. I think I'd cry in a ball and lock the doors.\n[If you could make/star in any movie about anything, what would it be about, and what would it be called?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mu2ub?context=5)|I have the single most interesting relationship history of all time. From the end of my second girlfriend and I, to the end of my most recent girlfriend, I have never heard a more interesting story. Some day I'll turn it into a TV show. Haven't thought of a name yet though. Something tongue in cheek.\n[How I Met My Now-Ex-Girlfriends?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3n008c?context=5)|Big Argument Theory.\n[Can you give us a quick summary of your relationship story? I'd love to hear it.](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mx5tb?context=5)|Haha, and let someone steal it? No way! Some day you'll see it on TV and be glad you waited. =)\n[Rockin' the bowtie, too! Did you get to meet him?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3n0p3o?context=5)|Not yet no! I've been in touch with Joe Bereta from Barats and Bereta and I'm hopping to collaborate with everybody at some point. =)\n[By the way, I noticed you are from Georgia, what part exactly? I'm in Gwinnett :)](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3n0p3o?context=5)|I'm from Coweta county!\n[Where did you get that snazzy purple bow-tie?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mtynw?context=5)|Haha, an obscure shopping center where I lived before I moved to LA. I actually got it for a [prom](http://i.imgur.com/tmWMS.jpg) I went to earlier that year.\n[You realize who you're talking about, right?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mxm33?context=5)|Oh trust me I know. He reminded me every day. ;)\n[Hey, Jamie. I actually went to high school with you and we kinda know each other but for you to always wonder who I am is kinda funny. I think you're very talented as do many people and stoked that you're going after your dream. I can't seem to think of a good question right now... Well anyway, I know you just moved out to LA and I know the show shoots in GA so I was wondering if you'll be coming back to shoot? If you guys are in the middle of shooting? etc..](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mu07l?context=5)|Oh wow! Small world! I'd love to find out who this is! Anyone who calls me Jamie is clearly from home. Haha.   Well everyone kind of did their own thing. We wrapped the whole season last november before Thanksgiving, and since then everyone kind of took off in different directions for the holidays. Some people stayed home, but like steven and Jon, I came out to see if I could grab some work. You're never done looking in this business.\n[Hello James, huge fan of the show! I just wanted to know how is it going since the change in direction? Do you like it better/worse?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mty9k?context=5)|Well there are comic purists who will bash the show for changing so much, but I think it's brilliant. We try very hard to keep the comics and the TV show separately entertaining. Some people like the comics, and some people like the TV show more, but no matter what people love The Walking Dead. I'm personally really amazed with the direction the show has taken.\n[Why do you think it is brilliant? If you didn't think it was brilliant, would you ever admit as much?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3ptdjl?context=5)|I think it's really intelligent because I think if you watch enough of this, having read all of the comics, you'll get bored with always knowing what's around the corner every time. The first episode was really close to the beginning of the comics but I think it would show a real lack of creativity if we did everything frame by frame.\n[Since I'm pretty sure the answer to #2 is No, How do you address the issue of your confirmation bias in the answer to #1?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3ptdjl?context=5)|Fact of the matter is I was a huge fan of the first season before I ever got on the second. I was just as concerned about changing the story line as everyone else but when I read the scripts it was really obvious that they knew what they were doing in that writers room. Assume what you want about my bias, I don't have to lie about how much ass this show kicks, I stand by it because it's really impossible not to love it.\n[Which episodes do you enjoy filming more:  the ones that focus on the acting and the interactions between individual characters, or the episodes based more upon actions of the characters and killing zombies?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mu889?context=5)|This show does a good job of wearing you out regardless of if you're doing something physical or emotional, but whats awesome is that we do them both with such importance. Of course the most dramatic stuff is going to be the most fun though. Fishing zombies out of a lake? Ridiculous.\n[Man, you are pretty adorable.](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mwrs0?context=5)|No YOU'RE adorable.\n[Hey James, thanks for taking the time to do this!  The special effects in TWD have always seemed extremely realistic. Do you ever find yourself getting frightened when there's 'zombies' walking around set?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3muh8d?context=5)|Oh god yeah. So the actors have this table set up that's full of every kind of snack you can think of. That's our craft table, and the walkers have their own personal craft table because usually theres so many of them they need their own. Well sometimes either they would get confused, or I would get confused and go to the wrong table, and that was always a really uncomfortable 5 seconds when you'd forget that they were just walking around. I had one guy ask for some crackers one time and when I turned to give him some I almost punched him in the mouth.\n[Are you a fan of classic zombie films like Night of the Living Dead, and if so, is that what made you want to audition for TWD?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3musdc?context=5)|What made me want to audition for TWD wasn't that it was a Zombie show, that definitely appealed to me in a huge way dont get me wrong, but I realized that the show is more importantly about the characters. The show is just plain real and I have always been in love with that. I just wanted so bad to contribute to that and I feel amazingly lucky to have had that opportunity.\n[Also, did you have fun during your down time on the set or was it basically your chance to get some rest?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3musdc?context=5)|Haha it depended, to be honest %80 of being an actor is getting your hair and make up done, or waiting for a scene to start. It was a great chance to get to know every body and get advice, or play guitar or something. But if it was a 16 hour shoot, which a couple days it was, down time was \"Where can I lie down?\" time. I think I slept in every corner of that house. haha.\n[The Evil Dead series is my favorite, too! Marry me, please? <3.](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mwaut?context=5)|I'm yours!\n[Swoon * <3 you're adorable.](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mxixm?context=5)|That's you!\n[How realistic is the make up for the zombies up close?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mudog?context=5)|It's amazing. Greg is such an incredible artist. I literally couldn't look at a few people they were so bad. Like the woman who plays Beth's mom in the barn, up close it was the most grotesque thing I've ever seen. Yuck.\n[How much of the comic book series have you read?  Have you read any of Robert Kirkman's other works?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mubaf?context=5)|I haven't read the latest issue, but I've read all the way until there. As a wrap present Gale gave me The Rise of the Governor book, and so far I'm in love with it.\n[I sometimes have really vivid zombie nightmares after watching the show. Do you ever come home from a long day on the set and get plagued with visions of crusty zombies all night?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mvngt?context=5)|Oh my God you have no idea.I think everyone does. It's one thing to watch a show and get scared, but to see these monsters for entire weeks at a time up close, and to LIVE the situation really messes with your head. There's some stuff towards the end of this season that kept me up at night for a long time.\n[ do you visualize it when you're on the set with some actor-fu tricks?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mv04n?context=5)|One of the coolest things I've seen done in post though is when Laurie (Andrea) swings a pitch fork type thing into a zombies face in the next episode. That was actually shot in reverse when she swung it. You can't tell at all.\n[You don't need to answer too specifically, but do you hang out with any of the cast off-set?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mulku?context=5)|OH jeez, I'm not sure. There's this show called \"Zombie Prom.\" It's a cornball musical about a nuclear zombie and it's hilarious. I don't know if it's my favorite but I love the hell out of it.\n[Steve = Steven Yeun (aka Glenn)?  Also, do duck-sized horses scare you as well?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mx4qg?context=5)|And yes yes they do. yeesh Yeah sorry, that steve. Haha.\n[How does one go about being casted to become a zombie? Have any of the zombies been so well dressed up you were genuinely scared of them?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mu4z5?context=5)|Oh absolutely. Haha. This show is so real it seems wrong sometimes. Haha.  We have a huge talent pool in Ga, and they use a company called \"Extras Casting Atlanta\" to find their background. People get picked based on how well Greg thinks he can physically use them and how good they are with stunts.   Oddly enough the two lake zombies from the last episode were actually stunt people. They were father and daughter and the nightgown walker is actually Lauren's (maggie) stunt double. Weirdly without the make up she's one of the most gorgeous people I've ever seen. It really caught me off guard. haha.\n[If you could play a different character on the show, one that exists already or a new, made up character, who would it be and why?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mva7g?context=5)|Oh wow, I think I'd want to be Shane. What a deliciously intricate character. Jon really nails it too. I would ruin that character if I got to be him. I've always wanted to play the villain though.\n[How did you get this role? What did you have to go through as an actor to finally get cast into the show?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mva7g?context=5)|I basically just bugged my agent to get me an audition. Haha, I said it up there, but I was never actually supposed to audition,somehow my tape got to Frank and by some miracle he liked it. It was just one tape of me reading a scene that eventually got cut out. I never actually met any casting directors. I got SO lucky. haha.\n[... if you could be on any show, ever, what would it be?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mva7g?context=5)|I already answered this one too, but aside from Doctor who or Community, probably Sherlock. Again another BBC show, but oh my God is it incredible. Everyone needs to go watch that show RIGHT NOW.\n[Has there been any scenes that you've shot that have wound up cut out of the final show? If so, what was the nature of those scenes?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mucmr?context=5)|There's always little things here and there that get moved around. Typically what you see is 98% of what we planned for everyone to see, the rest is cut for time or continuity or what have you. I personally cant think of anything right off the jump.\n[Is Norman Reedus as cool off screen as he is onscreen? Also, do you and the other cast members get the chance to explore around Georgia during breaks?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mw4yh?context=5)|Haha, he's just a cool guy in general. Total butthole but I love him ;)  Well I'm from Ga so I got to kind of show them around which was cool. I actually lived only 30 minutes away from set actually.\n[I have always wondered this about horror movie/television actors.  Even though you see the process taking place, do you still get creeped out by the scarier aspects of the show?  Disturbing scenes, grotesque makeup, etc.?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3muomr?context=5)|Well that's the idea of acting, its really technical a lot of the time, but it's always a battle to put yourself in a situation and feel like you're actually there. The make up really helps that, and things do in fact get really horrifying sometimes. That lake scene in 208 was horrifying. We're truthfully living in imaginary circumstances.\n[Are things gonna get more interesting as the survivors move away from the safety of the farm?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mu5i6?context=5)|Who ever said the farm was safe? Haha. I think it's one of the safer places we've seen so far but things havent gotten any easier. As for if we move away from the farm or not, you'll have to keep watching!\n[How much does Kirkman do behind the scenes?  Is he fairly involved in the production?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3muu2i?context=5)|I think a lot of the days Robert came by I was doing other stuff. He's an absurdly busy guy, but he is always in the writers room. He is heavily involved in every episode, even if he isn't on set.\n[I'm guessing you've met him in person before?  Is his beard as epic as it is in pictures?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mwkh1?context=5)|Even more so. I think I was looking into his beard way more than his eyes the first time I met him.\n[What are your current and upcoming projects?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mvil9?context=5)|When we wrapped the second season, Jon and I actually got another project right after called \"Snitch.\" It's a Ric Roman Waugh film and it comes out next year. =)\n[Hi James! Thanks for doing this!  My question is about Billy Greene from the comics: it has been suggested that your character is the show's version of Billy, do you agree with this in some ways? You've read the prison arc, where Billy becomes a more significant character than he is on the farm - would you like it if Jimmy did the same?  Edit: Remembered my other question: If something bad happens to Jimmy, do you hope you get to be zombified? Would it be fun or does all the makeup etc. seem like a hassle?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mx1x7?context=5)|Oh tricky territory. Sure I kind of looked to billy as reference because I really feel like thats where Jimmy came from. I mean put a bandage around my head and I look exactly like him, but again this is an entirely different story line now. Who knows whatll happen ;)\n[Do you feel more prepared for the real Zompocalypse because of the show?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mui6r?context=5)|Actually I was pretty well prepared before the show started. One of my buddies has a serious phobia of the whole thing and I've really learned from his planning how to cope. I sleep with a Gerber Machete under my bed.\n[Wait, does Norman Reedus honestly wear womans underwear? No joke?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mypyp?context=5)|Daryl does. He was telling me that on afew occasions he wore in the hopes that at some point the lace would show, and someone might catch it. He wanted to confuse people, but I don't think he was actually implying anything for his character, other than he wears what he can find. haha.\n[-What's the most stressful thing about shooting for this show? -If you were in a zombie apocalypse like this, but not exact to your role, what would be your strategy for survival?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3n26ty?context=5)|This is notoriously one of the hardest shows to work on for a lot of different reasons. I didn't realize that going into it, but a couple days in it became very apparent that this was going to be a crash course in acting, and I was very right. There isn't anything about doing the show I don't like, but something that can be very stressful is when you sit down and just think about who's keeping eyes on you. Every day I had Gale Anne Hurd and Denise Huth, and Glenn Mazarra and all these incredibly talented, incredibly powerful people watching my every move. That's the kind of stuff you just kind of have to forget about on the day, but once its all said and done and you look at it. That's some ridiculous stuff. I mean Gale produced the Terminator movies for Christ sake. A lot of expectations to meet. My strategy would be to grab a sword and start hitting things, and most definitely die. I have no longevity as a survivor. haha.\n[-Besides The Walking Dead series, do you have any other favorite books or authors?  Who or what would you recommend? -And, last but not least, Coke or Pepsi?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3n26ty?context=5)|The best part was the feeling at the end of the day. Not that I constantly wanted to leave, this is the only job I've ever had where they called me at 5 in the morning and told me I had to come in at 7 instead of 11, and I was actually thrilled. It was just that at the end of the day, you peel off the mud and sweat stained wardrobe, you get in your car and you leave with this indescribable sense of pride and fulfillment. That on top of coming home to go to dinner with my friends just made for the best feeling ever. It was the best proof that I was doing exactly what I should be doing with my life. I mean Roberts work is about as good as it gets, but as far as comics I'm not sure. I'm just not much of a reader personally. My brain just clicks so much more with film and Television. Oh jeeze. Well I love Vault, and Coke will always remind me of my childhood around Christmas, but Mountain Dew Live Wire and Doctor pepper were my only friends in middle and highschool. (The life of a 250 pound 14 year old.) Hard choice. Depends on my mood, I don't discriminate.\n[How old are you, James? I really tried to Google it, but the results showed [this guy] (http://en.wikipedia.org/wiki/James_McCune_Smith)  Also, it's my Birthday soon and im not feeling to well.. could you... Say something to make a girl swoon/happier on her birthday please? *blush*](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mwtu8?context=5)|Awe you poor thing. Yeah that's definitely not me. Haha, I'm 21. I'll be 22 this June 18th. How about this, I dedicate [this song](http://www.youtube.com/watch?v=SZBU6p2d1TQ&list=UUxZSqd46lCmULpciul-LT6w&index=5&feature=plcp) to you. I recorded it last week but now it's for you =)\n[My initial question and why it lead to asking how old you were, was because I was wondering why and how you looked *so* baby-faced in the show - do you ever get ID'ed? I'm 20, I'll be 21 next week. :) Also, this is a question I've always wondered about celebrities, but I take it you have a girlfriend (oh lord, that sounds creepy, it's a good question, I swear) and basically, you're an actor, getting out there, hopefully going to be taking part in bigger roles to come. Now, when you become famous, like A-lister someday, do you think it's important to keep all your old friends (non-famous), *and* hypothetically speaking, if anything happened between you and your girlfriend (I hope for your happiness it doesn't) do you think it would be hard for you to find true love again now that you're famous, because of all the trouble of girls wanting you mostly because you're famous, you're rich, etc?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3n55ep?context=5)|Oh wow I'm so lad you think I'm worthy of Alist. Haha that's incredibly flattering thank you. I think the most important thing and actor can have is Thier old friends. Always knowing where I came from is something I'll always keep in mind and remind myself of every day. Again I'm no huge star or something but if someday I am I don't want to ever lose that mindset and think I'm too good for everyone back home. That'd be awful I just dont see it happening.\n[Which actor, living or dead, has most influenced your career?  If you could ask one actor (again, living or dead) a question, what would it be?  Also, I love you.](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mwt3i?context=5)|David Tennant. The man is a stone cold genius, and if I could some day be half the actor he is I could easily die happy.  Oh wow good question. I would probably ask David to work with me. He's one of Andy's good friends so it's nuts to me to think that it's a possibility.\n[Is your character in the comic books?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mxevv?context=5)|Not Jimmy, but there's a character named Billy who I'm obviously taken from. Two totally different characters though.\n[What 1 item would you deem necessary during a zombie apocalypse?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mwd3n?context=5)|Jon Bernthal.\n[Do you guys film the episodes separately, or do you shoot them in blocks on certain sets? Just wondering - for a guy like yourself who doesn't have a boat-load of screen time, do you spend a lot of time away from set, or do you shoot a lot of scenes in succession?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mvi6a?context=5)|We shoot an episode about every 8-10 days. It really depends on what's going on though. We tend to shoot things based on locations and time and stuff. For me I wasn't in things every single day so there was down time every once in a while, but I came and visited the set a lot, even when I wasn't shooting. I just love being there.\n[Awesome, thanks. One more question, if you don't mind. What's it like on set with a bunch of people in zombie makeup walking around? Is it weird seeing them sitting down eating lunch? Do they ever goof around with the other cast?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mxaqa?context=5)|Haha it's a trip for sure. I never know how to respond to them. They tend to try and scare us and the crew and stuff, but that's always made me nervous because Jon (Shane) f*cking HATES zombies. Like I thought I hated them but he gets so uncomfortable. If someone were to try and scare him he might unleash all that German boxing all over someone.\n[What do you think about the show deviating from the comic, such as with Shane's death?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mv54y?context=5)|Not really, when we're doing our stuff we have to focus on what's at hand and not what could be. Sometimes I would realize that Shane is still alive though. How incredible is that? We're seeing stuff that Shane was never meant to see, and look how much things change because of it.\n[Did you get to meet with Scott Ian (of Anthrax) when he was on the show as an extra?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3my4bk?context=5)|He was actually an extra in Gregs mini series so which was unrelated to Ricks storyline. I met him at the premiere though! Cool guy.\n[Do you think that the reaction to this half of Season 2 will be more positive?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3my4bk?context=5)|Oh the last half of this season is so incredible. We're all very proud of it. Trust me on this one, you're going to love it.\n[Do you think that the show is more of a character-based drama or an action-based series?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3my4bk?context=5)|Definitely character driven. So much so that the loss and anger created by the zombies and the action is itself a character. Rick carries it around every where he goes.\n[If you've gotten covered in fake gore, is it a disconcerting experience?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3my4bk?context=5)|Early last year I did a pilot for a show that covered me in blood and prosthetics. (Not the walking dead) Its really cool but at the end of the day you feel like garbage, and it's awful to scrape off of you. haha.\n[Are there any particularly good pranksters in the cast/crew?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3my4bk?context=5)|One of our directors, Billy, was always so funny. He just constantly messed with everyone. His humor is so deadpan its hilarious. Andy messed around some times too. Once we were doing an overhead crane shot of the whole group and we were supposed to disperse in different directions slowly. It was supposed to be really sad and deep. When they called action Andy had talked us into all running in different directions. Funny as hell. One of the few bloopers we have. haha.\n[If you were a zombie, whose brain would be the most delicious to eat?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mv03w?context=5)|I imagine Steve's would taste like Kimchi.\n[I'm so glad you would spend your time today answering questions! Most of mine have already been answered (I'm a little late) but I have one request. My sister is a huge fan of the show, but she isn't feeling well right now, would you be able to take a picture of you holding up a sign saying \"Get well soon Alicia\" and maybe PM it to me?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3myfhe?context=5)|Check your messages!\n[Man, TWD is honestly my favourite show right now, even through the break. I only have one question that hasn't already been answered, do the cast get any input in what happens on set? Do you ever get to improvise? Also, you're awesome!](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mxxfd?context=5)|We're actually a pretty tight show. Everyones so focused there isn't much playing around. But situations aren't just happening by the book either. Everyone is really living the part. When things are improvised they're always so authentic. You'd never guess.\n[Hi! Thanks for doing this AMA, I'm a huge fan and so excited for TWD to come back on the 12th!! I'm probably too late, but I was wondering what were some improvised scenes that you could think of off the top of your head?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3n5omv?context=5)|Never too late! Improving on some shows is really prominent and really encouraged. But for us we really follow our script. There are things we throw in for authenticity but what has been written is SO important to the story, you rarely have a chance to shoot something out. There was a lot of improv in the last scene of the mid season finale though. While Jon gave his speech, there was a lot of \"Shane no! Stop!\" you know stuff to keep it real. Very subtle.\n[How many takes do you usually need to nail a scene? An action packed one, such as the final scene in I think it was \"pretty much dead already\" when Shane opened the barn? Would you spend all day on it, or longer? Or  would you get it done in an hour or so?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mye2l?context=5)|That will always change. It has a lot of factors and most of the time that's based on the Director. I know Clark Jonson, who directed the new episode on the 12th likes to kinda hit it and quit it. He gets what he likes fast and moves on. However Michelle MacLauren who directed the episode you're talking about takes her time. She is very cut throat when it comes to that. Very slow, very precise. She knows what she needs and shes gonna get it.   That last scene of the mid-season finale from the conversation between shane when he handed out the guns, all the way until the last shot of the episode (which is all one scene, and from what I've seen the longest single seen ever) took 3-4 days. We began it at the end of one day, and then the rest was 3 full 14 hour days in front of the barn. I remember because I was coated in mud from head to toe, and they had to apply that every single day. Freezing in the morning, horrifically hot mid day. Whew. Definitely earned our paychecks that episode. Not nearly as much as the zombies though. They were such troopers. I have so much respect for those walkers.\n[As a follow-up to my original questions, how did you go straight from high school to acting? Did you know people in the business? Did you do networking? Did you just do the classic \"move to Hollywood and hope it works out\"? Since things seem to be going quite well for you so far, since you're only 21, I doubt it's the latter, but maybe it is and you got lucky?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3n12dx?context=5)|Well no one knows what they're doing when they first start. All I knew was to do musical theatre, so I kept doing musicals and one day decided to send my headshot to an agent in ATL. From there I auditioned for as much as I could, I got a few parts here and there for different things, but that started in 09, and I got the walking dead summer of 2011. Things happened pretty quick. I actually only moved out here to LA like 2.5 or 3 weeks ago. I never wanted to come out here unless I had my foot in the door, and this was a pretty nice one.\n[Hi James Allen McCune! You are excellent in Walking Dead. I would like to know, what is your favorite joke?](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mus0i?context=5)|Probably one that has the word \"boner\" in it.\n[What do you call a Xerox of a boner?  A hard copy.](http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mxm5x?context=5)|New favorite joke.\n\n\n*Last updated: 2012-02-22 13:46 UTC*\n\n*This post was generated by a robot! Send all complaints to [epsy](/message/compose/?to=epsy).*\n\n",
  "mod_reports": [],
  "secure_media_embed": {},
  "author_flair_css_class": "tabler",
  "edited": true,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Verified?</strong> <em>(This bot cannot verify AMAs just yet)</em></p>\n\n<p><strong>Date:</strong> 2012-02-01</p>\n\n<p><strong><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/\">Link to submission</a></strong></p>\n\n<p><strong><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/tabledresser/c3sicae\">Link to my post</a></strong></p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Questions</th>\n<th align=\"left\">Answers</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mumwy?context=5\">I&#39;ve heard that the main cast avoids the zombies when not filming, is that true? Also it just a method acting deal where they want to appear shocked when they see them? Or is it some rule about extras not associating with the cast?</a></td>\n<td align=\"left\">No it&#39;s definitely not that we&#39;re too good to be with the extras or whatever. Haha. Everyone always goes up to the walkers and introduces themselves to them. We try so hard to make them feel like part of the cast, because they are. They all work so hard, and we put them through so much that it would be awful if we didnt show them appreciation for that.   That being said, it&#39;s hard to introduce yourself to all 200 zombies. Haha. I tried to personally hang out as much as I could with them, but there&#39;s always designated areas for each, and most of the time we&#39;re just too busy to chat. It also has something to do with the fact that Greg and his team make some of the most horrific looking things I&#39;ve ever seen in my entire life. Sometimes its hard to talk to a corpse and not be a little skeeved out. haha.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mtxdg?context=5\">Why helllllllo! Huge fan of the show. You guys got a good thing goin&#39; on. Silly question, but does Andrew Lincoln talk with his normal accent off camera? Most of the interviews I&#39;ve seen with him he&#39;s been using an American accent, and even on some promos I saw awhile back. Also, can Norman Reedus really shoot that crossbow well? Have an awesome day:D.</a></td>\n<td align=\"left\">Hi there! I was actually really excited to find that out myself going into the job. When we&#39;re on set Andy is always in character. He told me that it was something that Frank Darabont asked of him when he first started the show. All season I&#39;ve only heard him slide Ito his native accent 3 times while we were on set.   As for Norm and the crossbow, it depends on the shot and if he&#39;s actually hitting a person or not, but I don&#39;t trust him with it. Haha.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mu8pn?context=5\">You could get a supporting role in any other TV series running right now - which one would you choose? And in any other series that has ever been produced?</a></td>\n<td align=\"left\">Oh God what a good couple questions. My absolute favorite show of all time is Doctor Who. I&#39;m not british so it would be a miracle to even be an extra in that show, but that&#39;s definitely top of my list. Other than that maybe Community or House. One of my dreams is to be a patient one episode. Haha.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3n6ddu?context=5\"> to ask a TWD-related question: Without giving anything away of course, what do you look forward to the most this season?</a></td>\n<td align=\"left\">Oh wow. Hmm tricky. Well I&#39;m really looking forward to a few new characters that pop up. The next two episodes really begin showing off some ridiculously fantastic performances. As the season goes people are definitely going to be getting new favorites for sure. These guys never pull any punches. It&#39;s so so so good.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mzbyv?context=5\">Do you have a favorite doctor and companion?</a></td>\n<td align=\"left\">Tennant and Donna. Hands down all time favorite TV duo. Although an absurdly close second is Matt smith and River song. Their relationship is AMAZING.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mu2ub?context=5\">Do you read the comics? If so, what do you think of them? Which character from the show would you most want supporting you?</a></td>\n<td align=\"left\">I personally don&#39;t know enough about either to really form a useful opinion, but from what I do know I think Censorship is wrong on that level. The internet needs this freedom and to have people strip it away would be such a tragedy. Again, I&#39;m lacking the full picture though.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mu2ub?context=5\">If a zombie apocalypse occurred what would be the first thing you would do? Hide somewhere? Get on an aircraft carrier? What are your opinions on the proposed SOPA and PIPA bills? Do you think piracy would decrease significantly if content was more readily available?</a></td>\n<td align=\"left\">I think an aircraft carrier would probably be pretty choice. I think I&#39;d cry in a ball and lock the doors.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mu2ub?context=5\">If you could make/star in any movie about anything, what would it be about, and what would it be called?</a></td>\n<td align=\"left\">I have the single most interesting relationship history of all time. From the end of my second girlfriend and I, to the end of my most recent girlfriend, I have never heard a more interesting story. Some day I&#39;ll turn it into a TV show. Haven&#39;t thought of a name yet though. Something tongue in cheek.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3n008c?context=5\">How I Met My Now-Ex-Girlfriends?</a></td>\n<td align=\"left\">Big Argument Theory.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mx5tb?context=5\">Can you give us a quick summary of your relationship story? I&#39;d love to hear it.</a></td>\n<td align=\"left\">Haha, and let someone steal it? No way! Some day you&#39;ll see it on TV and be glad you waited. =)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3n0p3o?context=5\">Rockin&#39; the bowtie, too! Did you get to meet him?</a></td>\n<td align=\"left\">Not yet no! I&#39;ve been in touch with Joe Bereta from Barats and Bereta and I&#39;m hopping to collaborate with everybody at some point. =)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3n0p3o?context=5\">By the way, I noticed you are from Georgia, what part exactly? I&#39;m in Gwinnett :)</a></td>\n<td align=\"left\">I&#39;m from Coweta county!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mtynw?context=5\">Where did you get that snazzy purple bow-tie?</a></td>\n<td align=\"left\">Haha, an obscure shopping center where I lived before I moved to LA. I actually got it for a <a href=\"http://i.imgur.com/tmWMS.jpg\">prom</a> I went to earlier that year.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mxm33?context=5\">You realize who you&#39;re talking about, right?</a></td>\n<td align=\"left\">Oh trust me I know. He reminded me every day. ;)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mu07l?context=5\">Hey, Jamie. I actually went to high school with you and we kinda know each other but for you to always wonder who I am is kinda funny. I think you&#39;re very talented as do many people and stoked that you&#39;re going after your dream. I can&#39;t seem to think of a good question right now... Well anyway, I know you just moved out to LA and I know the show shoots in GA so I was wondering if you&#39;ll be coming back to shoot? If you guys are in the middle of shooting? etc..</a></td>\n<td align=\"left\">Oh wow! Small world! I&#39;d love to find out who this is! Anyone who calls me Jamie is clearly from home. Haha.   Well everyone kind of did their own thing. We wrapped the whole season last november before Thanksgiving, and since then everyone kind of took off in different directions for the holidays. Some people stayed home, but like steven and Jon, I came out to see if I could grab some work. You&#39;re never done looking in this business.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mty9k?context=5\">Hello James, huge fan of the show! I just wanted to know how is it going since the change in direction? Do you like it better/worse?</a></td>\n<td align=\"left\">Well there are comic purists who will bash the show for changing so much, but I think it&#39;s brilliant. We try very hard to keep the comics and the TV show separately entertaining. Some people like the comics, and some people like the TV show more, but no matter what people love The Walking Dead. I&#39;m personally really amazed with the direction the show has taken.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3ptdjl?context=5\">Why do you think it is brilliant? If you didn&#39;t think it was brilliant, would you ever admit as much?</a></td>\n<td align=\"left\">I think it&#39;s really intelligent because I think if you watch enough of this, having read all of the comics, you&#39;ll get bored with always knowing what&#39;s around the corner every time. The first episode was really close to the beginning of the comics but I think it would show a real lack of creativity if we did everything frame by frame.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3ptdjl?context=5\">Since I&#39;m pretty sure the answer to #2 is No, How do you address the issue of your confirmation bias in the answer to #1?</a></td>\n<td align=\"left\">Fact of the matter is I was a huge fan of the first season before I ever got on the second. I was just as concerned about changing the story line as everyone else but when I read the scripts it was really obvious that they knew what they were doing in that writers room. Assume what you want about my bias, I don&#39;t have to lie about how much ass this show kicks, I stand by it because it&#39;s really impossible not to love it.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mu889?context=5\">Which episodes do you enjoy filming more:  the ones that focus on the acting and the interactions between individual characters, or the episodes based more upon actions of the characters and killing zombies?</a></td>\n<td align=\"left\">This show does a good job of wearing you out regardless of if you&#39;re doing something physical or emotional, but whats awesome is that we do them both with such importance. Of course the most dramatic stuff is going to be the most fun though. Fishing zombies out of a lake? Ridiculous.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mwrs0?context=5\">Man, you are pretty adorable.</a></td>\n<td align=\"left\">No YOU&#39;RE adorable.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3muh8d?context=5\">Hey James, thanks for taking the time to do this!  The special effects in TWD have always seemed extremely realistic. Do you ever find yourself getting frightened when there&#39;s &#39;zombies&#39; walking around set?</a></td>\n<td align=\"left\">Oh god yeah. So the actors have this table set up that&#39;s full of every kind of snack you can think of. That&#39;s our craft table, and the walkers have their own personal craft table because usually theres so many of them they need their own. Well sometimes either they would get confused, or I would get confused and go to the wrong table, and that was always a really uncomfortable 5 seconds when you&#39;d forget that they were just walking around. I had one guy ask for some crackers one time and when I turned to give him some I almost punched him in the mouth.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3musdc?context=5\">Are you a fan of classic zombie films like Night of the Living Dead, and if so, is that what made you want to audition for TWD?</a></td>\n<td align=\"left\">What made me want to audition for TWD wasn&#39;t that it was a Zombie show, that definitely appealed to me in a huge way dont get me wrong, but I realized that the show is more importantly about the characters. The show is just plain real and I have always been in love with that. I just wanted so bad to contribute to that and I feel amazingly lucky to have had that opportunity.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3musdc?context=5\">Also, did you have fun during your down time on the set or was it basically your chance to get some rest?</a></td>\n<td align=\"left\">Haha it depended, to be honest %80 of being an actor is getting your hair and make up done, or waiting for a scene to start. It was a great chance to get to know every body and get advice, or play guitar or something. But if it was a 16 hour shoot, which a couple days it was, down time was &quot;Where can I lie down?&quot; time. I think I slept in every corner of that house. haha.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mwaut?context=5\">The Evil Dead series is my favorite, too! Marry me, please? &lt;3.</a></td>\n<td align=\"left\">I&#39;m yours!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mxixm?context=5\">Swoon * &lt;3 you&#39;re adorable.</a></td>\n<td align=\"left\">That&#39;s you!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mudog?context=5\">How realistic is the make up for the zombies up close?</a></td>\n<td align=\"left\">It&#39;s amazing. Greg is such an incredible artist. I literally couldn&#39;t look at a few people they were so bad. Like the woman who plays Beth&#39;s mom in the barn, up close it was the most grotesque thing I&#39;ve ever seen. Yuck.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mubaf?context=5\">How much of the comic book series have you read?  Have you read any of Robert Kirkman&#39;s other works?</a></td>\n<td align=\"left\">I haven&#39;t read the latest issue, but I&#39;ve read all the way until there. As a wrap present Gale gave me The Rise of the Governor book, and so far I&#39;m in love with it.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mvngt?context=5\">I sometimes have really vivid zombie nightmares after watching the show. Do you ever come home from a long day on the set and get plagued with visions of crusty zombies all night?</a></td>\n<td align=\"left\">Oh my God you have no idea.I think everyone does. It&#39;s one thing to watch a show and get scared, but to see these monsters for entire weeks at a time up close, and to LIVE the situation really messes with your head. There&#39;s some stuff towards the end of this season that kept me up at night for a long time.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mv04n?context=5\"> do you visualize it when you&#39;re on the set with some actor-fu tricks?</a></td>\n<td align=\"left\">One of the coolest things I&#39;ve seen done in post though is when Laurie (Andrea) swings a pitch fork type thing into a zombies face in the next episode. That was actually shot in reverse when she swung it. You can&#39;t tell at all.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mulku?context=5\">You don&#39;t need to answer too specifically, but do you hang out with any of the cast off-set?</a></td>\n<td align=\"left\">OH jeez, I&#39;m not sure. There&#39;s this show called &quot;Zombie Prom.&quot; It&#39;s a cornball musical about a nuclear zombie and it&#39;s hilarious. I don&#39;t know if it&#39;s my favorite but I love the hell out of it.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mx4qg?context=5\">Steve = Steven Yeun (aka Glenn)?  Also, do duck-sized horses scare you as well?</a></td>\n<td align=\"left\">And yes yes they do. yeesh Yeah sorry, that steve. Haha.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mu4z5?context=5\">How does one go about being casted to become a zombie? Have any of the zombies been so well dressed up you were genuinely scared of them?</a></td>\n<td align=\"left\">Oh absolutely. Haha. This show is so real it seems wrong sometimes. Haha.  We have a huge talent pool in Ga, and they use a company called &quot;Extras Casting Atlanta&quot; to find their background. People get picked based on how well Greg thinks he can physically use them and how good they are with stunts.   Oddly enough the two lake zombies from the last episode were actually stunt people. They were father and daughter and the nightgown walker is actually Lauren&#39;s (maggie) stunt double. Weirdly without the make up she&#39;s one of the most gorgeous people I&#39;ve ever seen. It really caught me off guard. haha.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mva7g?context=5\">If you could play a different character on the show, one that exists already or a new, made up character, who would it be and why?</a></td>\n<td align=\"left\">Oh wow, I think I&#39;d want to be Shane. What a deliciously intricate character. Jon really nails it too. I would ruin that character if I got to be him. I&#39;ve always wanted to play the villain though.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mva7g?context=5\">How did you get this role? What did you have to go through as an actor to finally get cast into the show?</a></td>\n<td align=\"left\">I basically just bugged my agent to get me an audition. Haha, I said it up there, but I was never actually supposed to audition,somehow my tape got to Frank and by some miracle he liked it. It was just one tape of me reading a scene that eventually got cut out. I never actually met any casting directors. I got SO lucky. haha.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mva7g?context=5\">... if you could be on any show, ever, what would it be?</a></td>\n<td align=\"left\">I already answered this one too, but aside from Doctor who or Community, probably Sherlock. Again another BBC show, but oh my God is it incredible. Everyone needs to go watch that show RIGHT NOW.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mucmr?context=5\">Has there been any scenes that you&#39;ve shot that have wound up cut out of the final show? If so, what was the nature of those scenes?</a></td>\n<td align=\"left\">There&#39;s always little things here and there that get moved around. Typically what you see is 98% of what we planned for everyone to see, the rest is cut for time or continuity or what have you. I personally cant think of anything right off the jump.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mw4yh?context=5\">Is Norman Reedus as cool off screen as he is onscreen? Also, do you and the other cast members get the chance to explore around Georgia during breaks?</a></td>\n<td align=\"left\">Haha, he&#39;s just a cool guy in general. Total butthole but I love him ;)  Well I&#39;m from Ga so I got to kind of show them around which was cool. I actually lived only 30 minutes away from set actually.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3muomr?context=5\">I have always wondered this about horror movie/television actors.  Even though you see the process taking place, do you still get creeped out by the scarier aspects of the show?  Disturbing scenes, grotesque makeup, etc.?</a></td>\n<td align=\"left\">Well that&#39;s the idea of acting, its really technical a lot of the time, but it&#39;s always a battle to put yourself in a situation and feel like you&#39;re actually there. The make up really helps that, and things do in fact get really horrifying sometimes. That lake scene in 208 was horrifying. We&#39;re truthfully living in imaginary circumstances.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mu5i6?context=5\">Are things gonna get more interesting as the survivors move away from the safety of the farm?</a></td>\n<td align=\"left\">Who ever said the farm was safe? Haha. I think it&#39;s one of the safer places we&#39;ve seen so far but things havent gotten any easier. As for if we move away from the farm or not, you&#39;ll have to keep watching!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3muu2i?context=5\">How much does Kirkman do behind the scenes?  Is he fairly involved in the production?</a></td>\n<td align=\"left\">I think a lot of the days Robert came by I was doing other stuff. He&#39;s an absurdly busy guy, but he is always in the writers room. He is heavily involved in every episode, even if he isn&#39;t on set.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mwkh1?context=5\">I&#39;m guessing you&#39;ve met him in person before?  Is his beard as epic as it is in pictures?</a></td>\n<td align=\"left\">Even more so. I think I was looking into his beard way more than his eyes the first time I met him.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mvil9?context=5\">What are your current and upcoming projects?</a></td>\n<td align=\"left\">When we wrapped the second season, Jon and I actually got another project right after called &quot;Snitch.&quot; It&#39;s a Ric Roman Waugh film and it comes out next year. =)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mx1x7?context=5\">Hi James! Thanks for doing this!  My question is about Billy Greene from the comics: it has been suggested that your character is the show&#39;s version of Billy, do you agree with this in some ways? You&#39;ve read the prison arc, where Billy becomes a more significant character than he is on the farm - would you like it if Jimmy did the same?  Edit: Remembered my other question: If something bad happens to Jimmy, do you hope you get to be zombified? Would it be fun or does all the makeup etc. seem like a hassle?</a></td>\n<td align=\"left\">Oh tricky territory. Sure I kind of looked to billy as reference because I really feel like thats where Jimmy came from. I mean put a bandage around my head and I look exactly like him, but again this is an entirely different story line now. Who knows whatll happen ;)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mui6r?context=5\">Do you feel more prepared for the real Zompocalypse because of the show?</a></td>\n<td align=\"left\">Actually I was pretty well prepared before the show started. One of my buddies has a serious phobia of the whole thing and I&#39;ve really learned from his planning how to cope. I sleep with a Gerber Machete under my bed.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mypyp?context=5\">Wait, does Norman Reedus honestly wear womans underwear? No joke?</a></td>\n<td align=\"left\">Daryl does. He was telling me that on afew occasions he wore in the hopes that at some point the lace would show, and someone might catch it. He wanted to confuse people, but I don&#39;t think he was actually implying anything for his character, other than he wears what he can find. haha.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3n26ty?context=5\">-What&#39;s the most stressful thing about shooting for this show? -If you were in a zombie apocalypse like this, but not exact to your role, what would be your strategy for survival?</a></td>\n<td align=\"left\">This is notoriously one of the hardest shows to work on for a lot of different reasons. I didn&#39;t realize that going into it, but a couple days in it became very apparent that this was going to be a crash course in acting, and I was very right. There isn&#39;t anything about doing the show I don&#39;t like, but something that can be very stressful is when you sit down and just think about who&#39;s keeping eyes on you. Every day I had Gale Anne Hurd and Denise Huth, and Glenn Mazarra and all these incredibly talented, incredibly powerful people watching my every move. That&#39;s the kind of stuff you just kind of have to forget about on the day, but once its all said and done and you look at it. That&#39;s some ridiculous stuff. I mean Gale produced the Terminator movies for Christ sake. A lot of expectations to meet. My strategy would be to grab a sword and start hitting things, and most definitely die. I have no longevity as a survivor. haha.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3n26ty?context=5\">-Besides The Walking Dead series, do you have any other favorite books or authors?  Who or what would you recommend? -And, last but not least, Coke or Pepsi?</a></td>\n<td align=\"left\">The best part was the feeling at the end of the day. Not that I constantly wanted to leave, this is the only job I&#39;ve ever had where they called me at 5 in the morning and told me I had to come in at 7 instead of 11, and I was actually thrilled. It was just that at the end of the day, you peel off the mud and sweat stained wardrobe, you get in your car and you leave with this indescribable sense of pride and fulfillment. That on top of coming home to go to dinner with my friends just made for the best feeling ever. It was the best proof that I was doing exactly what I should be doing with my life. I mean Roberts work is about as good as it gets, but as far as comics I&#39;m not sure. I&#39;m just not much of a reader personally. My brain just clicks so much more with film and Television. Oh jeeze. Well I love Vault, and Coke will always remind me of my childhood around Christmas, but Mountain Dew Live Wire and Doctor pepper were my only friends in middle and highschool. (The life of a 250 pound 14 year old.) Hard choice. Depends on my mood, I don&#39;t discriminate.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mwtu8?context=5\">How old are you, James? I really tried to Google it, but the results showed <a href=\"http://en.wikipedia.org/wiki/James_McCune_Smith\">this guy</a>  Also, it&#39;s my Birthday soon and im not feeling to well.. could you... Say something to make a girl swoon/happier on her birthday please? <em>blush</em></a></td>\n<td align=\"left\">Awe you poor thing. Yeah that&#39;s definitely not me. Haha, I&#39;m 21. I&#39;ll be 22 this June 18th. How about this, I dedicate <a href=\"http://www.youtube.com/watch?v=SZBU6p2d1TQ&amp;list=UUxZSqd46lCmULpciul-LT6w&amp;index=5&amp;feature=plcp\">this song</a> to you. I recorded it last week but now it&#39;s for you =)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3n55ep?context=5\">My initial question and why it lead to asking how old you were, was because I was wondering why and how you looked <em>so</em> baby-faced in the show - do you ever get ID&#39;ed? I&#39;m 20, I&#39;ll be 21 next week. :) Also, this is a question I&#39;ve always wondered about celebrities, but I take it you have a girlfriend (oh lord, that sounds creepy, it&#39;s a good question, I swear) and basically, you&#39;re an actor, getting out there, hopefully going to be taking part in bigger roles to come. Now, when you become famous, like A-lister someday, do you think it&#39;s important to keep all your old friends (non-famous), <em>and</em> hypothetically speaking, if anything happened between you and your girlfriend (I hope for your happiness it doesn&#39;t) do you think it would be hard for you to find true love again now that you&#39;re famous, because of all the trouble of girls wanting you mostly because you&#39;re famous, you&#39;re rich, etc?</a></td>\n<td align=\"left\">Oh wow I&#39;m so lad you think I&#39;m worthy of Alist. Haha that&#39;s incredibly flattering thank you. I think the most important thing and actor can have is Thier old friends. Always knowing where I came from is something I&#39;ll always keep in mind and remind myself of every day. Again I&#39;m no huge star or something but if someday I am I don&#39;t want to ever lose that mindset and think I&#39;m too good for everyone back home. That&#39;d be awful I just dont see it happening.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mwt3i?context=5\">Which actor, living or dead, has most influenced your career?  If you could ask one actor (again, living or dead) a question, what would it be?  Also, I love you.</a></td>\n<td align=\"left\">David Tennant. The man is a stone cold genius, and if I could some day be half the actor he is I could easily die happy.  Oh wow good question. I would probably ask David to work with me. He&#39;s one of Andy&#39;s good friends so it&#39;s nuts to me to think that it&#39;s a possibility.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mxevv?context=5\">Is your character in the comic books?</a></td>\n<td align=\"left\">Not Jimmy, but there&#39;s a character named Billy who I&#39;m obviously taken from. Two totally different characters though.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mwd3n?context=5\">What 1 item would you deem necessary during a zombie apocalypse?</a></td>\n<td align=\"left\">Jon Bernthal.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mvi6a?context=5\">Do you guys film the episodes separately, or do you shoot them in blocks on certain sets? Just wondering - for a guy like yourself who doesn&#39;t have a boat-load of screen time, do you spend a lot of time away from set, or do you shoot a lot of scenes in succession?</a></td>\n<td align=\"left\">We shoot an episode about every 8-10 days. It really depends on what&#39;s going on though. We tend to shoot things based on locations and time and stuff. For me I wasn&#39;t in things every single day so there was down time every once in a while, but I came and visited the set a lot, even when I wasn&#39;t shooting. I just love being there.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mxaqa?context=5\">Awesome, thanks. One more question, if you don&#39;t mind. What&#39;s it like on set with a bunch of people in zombie makeup walking around? Is it weird seeing them sitting down eating lunch? Do they ever goof around with the other cast?</a></td>\n<td align=\"left\">Haha it&#39;s a trip for sure. I never know how to respond to them. They tend to try and scare us and the crew and stuff, but that&#39;s always made me nervous because Jon (Shane) f*cking HATES zombies. Like I thought I hated them but he gets so uncomfortable. If someone were to try and scare him he might unleash all that German boxing all over someone.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mv54y?context=5\">What do you think about the show deviating from the comic, such as with Shane&#39;s death?</a></td>\n<td align=\"left\">Not really, when we&#39;re doing our stuff we have to focus on what&#39;s at hand and not what could be. Sometimes I would realize that Shane is still alive though. How incredible is that? We&#39;re seeing stuff that Shane was never meant to see, and look how much things change because of it.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3my4bk?context=5\">Did you get to meet with Scott Ian (of Anthrax) when he was on the show as an extra?</a></td>\n<td align=\"left\">He was actually an extra in Gregs mini series so which was unrelated to Ricks storyline. I met him at the premiere though! Cool guy.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3my4bk?context=5\">Do you think that the reaction to this half of Season 2 will be more positive?</a></td>\n<td align=\"left\">Oh the last half of this season is so incredible. We&#39;re all very proud of it. Trust me on this one, you&#39;re going to love it.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3my4bk?context=5\">Do you think that the show is more of a character-based drama or an action-based series?</a></td>\n<td align=\"left\">Definitely character driven. So much so that the loss and anger created by the zombies and the action is itself a character. Rick carries it around every where he goes.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3my4bk?context=5\">If you&#39;ve gotten covered in fake gore, is it a disconcerting experience?</a></td>\n<td align=\"left\">Early last year I did a pilot for a show that covered me in blood and prosthetics. (Not the walking dead) Its really cool but at the end of the day you feel like garbage, and it&#39;s awful to scrape off of you. haha.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3my4bk?context=5\">Are there any particularly good pranksters in the cast/crew?</a></td>\n<td align=\"left\">One of our directors, Billy, was always so funny. He just constantly messed with everyone. His humor is so deadpan its hilarious. Andy messed around some times too. Once we were doing an overhead crane shot of the whole group and we were supposed to disperse in different directions slowly. It was supposed to be really sad and deep. When they called action Andy had talked us into all running in different directions. Funny as hell. One of the few bloopers we have. haha.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mv03w?context=5\">If you were a zombie, whose brain would be the most delicious to eat?</a></td>\n<td align=\"left\">I imagine Steve&#39;s would taste like Kimchi.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3myfhe?context=5\">I&#39;m so glad you would spend your time today answering questions! Most of mine have already been answered (I&#39;m a little late) but I have one request. My sister is a huge fan of the show, but she isn&#39;t feeling well right now, would you be able to take a picture of you holding up a sign saying &quot;Get well soon Alicia&quot; and maybe PM it to me?</a></td>\n<td align=\"left\">Check your messages!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mxxfd?context=5\">Man, TWD is honestly my favourite show right now, even through the break. I only have one question that hasn&#39;t already been answered, do the cast get any input in what happens on set? Do you ever get to improvise? Also, you&#39;re awesome!</a></td>\n<td align=\"left\">We&#39;re actually a pretty tight show. Everyones so focused there isn&#39;t much playing around. But situations aren&#39;t just happening by the book either. Everyone is really living the part. When things are improvised they&#39;re always so authentic. You&#39;d never guess.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3n5omv?context=5\">Hi! Thanks for doing this AMA, I&#39;m a huge fan and so excited for TWD to come back on the 12th!! I&#39;m probably too late, but I was wondering what were some improvised scenes that you could think of off the top of your head?</a></td>\n<td align=\"left\">Never too late! Improving on some shows is really prominent and really encouraged. But for us we really follow our script. There are things we throw in for authenticity but what has been written is SO important to the story, you rarely have a chance to shoot something out. There was a lot of improv in the last scene of the mid season finale though. While Jon gave his speech, there was a lot of &quot;Shane no! Stop!&quot; you know stuff to keep it real. Very subtle.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mye2l?context=5\">How many takes do you usually need to nail a scene? An action packed one, such as the final scene in I think it was &quot;pretty much dead already&quot; when Shane opened the barn? Would you spend all day on it, or longer? Or  would you get it done in an hour or so?</a></td>\n<td align=\"left\">That will always change. It has a lot of factors and most of the time that&#39;s based on the Director. I know Clark Jonson, who directed the new episode on the 12th likes to kinda hit it and quit it. He gets what he likes fast and moves on. However Michelle MacLauren who directed the episode you&#39;re talking about takes her time. She is very cut throat when it comes to that. Very slow, very precise. She knows what she needs and shes gonna get it.   That last scene of the mid-season finale from the conversation between shane when he handed out the guns, all the way until the last shot of the episode (which is all one scene, and from what I&#39;ve seen the longest single seen ever) took 3-4 days. We began it at the end of one day, and then the rest was 3 full 14 hour days in front of the barn. I remember because I was coated in mud from head to toe, and they had to apply that every single day. Freezing in the morning, horrifically hot mid day. Whew. Definitely earned our paychecks that episode. Not nearly as much as the zombies though. They were such troopers. I have so much respect for those walkers.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3n12dx?context=5\">As a follow-up to my original questions, how did you go straight from high school to acting? Did you know people in the business? Did you do networking? Did you just do the classic &quot;move to Hollywood and hope it works out&quot;? Since things seem to be going quite well for you so far, since you&#39;re only 21, I doubt it&#39;s the latter, but maybe it is and you got lucky?</a></td>\n<td align=\"left\">Well no one knows what they&#39;re doing when they first start. All I knew was to do musical theatre, so I kept doing musicals and one day decided to send my headshot to an agent in ATL. From there I auditioned for as much as I could, I got a few parts here and there for different things, but that started in 09, and I got the walking dead summer of 2011. Things happened pretty quick. I actually only moved out here to LA like 2.5 or 3 weeks ago. I never wanted to come out here unless I had my foot in the door, and this was a pretty nice one.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mus0i?context=5\">Hi James Allen McCune! You are excellent in Walking Dead. I would like to know, what is your favorite joke?</a></td>\n<td align=\"left\">Probably one that has the word &quot;boner&quot; in it.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/thewalkingdead/comments/p67lt/i_am_actor_james_allen_mccune_and_i_play_jimmy_on/c3mxm5x?context=5\">What do you call a Xerox of a boner?  A hard copy.</a></td>\n<td align=\"left\">New favorite joke.</td>\n</tr>\n</tbody></table>\n\n<p><em>Last updated: 2012-02-22 13:46 UTC</em></p>\n\n<p><em>This post was generated by a robot! Send all complaints to <a href=\"/message/compose/?to=epsy\">epsy</a>.</em></p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "user_reports": [],
  "author_flair_text": "",
  "over_18": false,
  "score": 49,
  "stickied": false,
  "domain": "self.tabled",
  "is_self": true,
  "hidden": false,
  "_orphaned": {},
  "_api_link": "https://api.reddit.com/r/tabled/comments/pva6w/thewalkingdead_i_am_actor_james_allen_mccune_and/?ref=search_posts",
  "_comments_by_id": {},
  "visited": false,
  "thumbnail": "",
  "_has_fetched": true,
  "gilded": 0,
  "hide_score": false,
  "_info_url": "https://api.reddit.com/api/info/",
  "created_utc": 1329579644.0,
  "subreddit_id": "t5_2tkmw",
  "id": "pva6w",
  "_params": {},
  "media_embed": {},
  "name": "t3_pva6w",
  "quarantine": false,
  "permalink": "https://www.reddit.com/r/tabled/comments/pva6w/thewalkingdead_i_am_actor_james_allen_mccune_and/?ref=search_posts",
  "ups": 49,
  "url": "https://www.reddit.com/r/tabled/comments/pva6w/thewalkingdead_i_am_actor_james_allen_mccune_and/",
  "title": "[thewalkingdead] I am actor James Allen McCune and I play Jimmy on The Walking Dead. AMAA!"
}