{
  "clicked": false,
  "_replaced_more": false,
  "archived": true,
  "num_comments": 10,
  "created": 1345844946.0,
  "saved": false,
  "selftext": "**Achievement list**\n\nFYI: I didnt make this. I think I found it on 420chan (I think) like 2 years ago. I have it as a Microsoft word document so PM me if you want it to share with friends or something. \n\n*0 or fewer points*\n\n•\t(-50) ARE YOU FOR REAL? - Blow into the bong while smoking and ruin the weed. (An additional -100 if the bong is connected to your vape and the water destroys it.) \n\n•\t(-50) Jesus Christ, It's a spider! Get in the car! - Get bitten by a tarantula while high. \n\n•\t(-25) DO A TRASHFACE! - Kick over a friends bong and break it. \n\n•\t(-15) Thou Shalt Not! - Spill weed upon the ground. (An additional -5 if the weed was ground up, and another -10 if it falls in something nasty or is otherwise unrecoverable.) \n\n•\t(-15) Green Out - Puke from smoking WAY too much weed by yourself. \n\n•\t(-10) Getting Shitty - Shit yourself while remembering something funny you did while stoned (-5 if people are around you when you shit yourself, but +20 if you shit yourself without anyone knowing about it). \n\n•\t(-10) JUST...CAN'T...STOP - Break open a piece to extract resin. \n\n•\t(-10) Old Faithful - Blow weed out of a bowl while attempting to take a hit for any particular reason (Laughing in the middle of a hit) \n\n•\t(0) Pound Of Flesh - Cut/scrape/stab yourself accidentally while smoking. Blood must be drawn. \n\n•\t(0) AW SHIT NIG, YOU'RE JUST DOING IT WRONG - Swallow a full hit of smoke. \n\n•\t(0) Sacrificial Virgin - Accidentally destroy a glass smoking piece before you have a chance to use it. \n\n•\t(0) The Cake is a Lie - Discover mold within your weed. \n\n•\t(0) You Will, DIE! - Smoke moldy weed. \n\n*5 points*\n\n•\t(5) One Way to Fight the Smell- Smoke in a portable toilet. \n\n•\t(5) \"Tell Me About The Fucking Golf Shoes\" - Go into a casino completely baked.* \n\n•\t(5) How Much for the Ape - Buy something you don't need because you're stoned. (See \"Shoppin' With Carlin\" from \"On Location\") \n\n•\t(5) Is This Not a Reasonable Place to Park? - Park on a sidewalk while blazed.* \n\n•\t(5) +10 Difficulty - Play an RPG while high. \n\n•\t(5) A Cannon! - Smoke from a Steam Roller. \n\n•\t(5) A Challenger Appears - Smoke out a stranger until one of you can't take it anymore. \n\n•\t(5) Against All Odds - Smoke while under probation.* \n\n•\t(5) Ahhhnold! - Go to the gym high. \n\n•\t(5) Always HI - Smoke weed from Hawaii. \n\n•\t(5) Apple of Eden - Smoke out of an apple. \n\n•\t(5) Bat Country - Smoke in the middle of the desert, completely away from human civilization. \n\n•\t(5) BRB, Mars - Smoke a full bowl of kief. \n\n•\t(5) BRB, Moon - Use a vaporizer. \n\n•\t(5) BRB, Milky Way - Use a vaporizer packed with kief. \n\n•\t(5) Butterfly - Smoke in a summer meadow. \n\n•\t(5) Carl Sagan - Stargaze while stoned out of your gourd. \n\n•\t(5) Cheap but effective - Smoke out of a pop can bowl. (WARNING SMOKING OUT OF A SODA CAN IS AN EXTREMELY BAD IDEA) \n\n•\t(5) Chemical Warfare - Smoke a bowl from a gas mask hooked up to a bong. \n\n•\t(5) Chong Would be Proud - Smoke from a bong. \n\n•\t(5) Christopher Columbus - Smoke at a campfire. \n\n•\t(5) Climb the Ladder - Meet your dealer's dealer. \n\n•\t(5) Collateral Damage - Give an innocent bystander a contact high. \n\n•\t(5) Commitment - Buy a $150 or more piece. \n\n•\t(5) Congratulations! You earned it - Smoke a blunt while driving around in a brand new car.* \n\n•\t(5) Cruelty Free - Make vegan edibles. \n\n•\t(5) Cupid's Green Arrow - Meet a future love interest through weed. \n\n•\t(5) Determined - Complete a tolerance break of at least two weeks. \n\n•\t(5) Dial C for Chronic - Call your boss high and tell him you're too sick to come in. \n\n•\t(5) The Ladies' Man - Smoke out 2 or more girls at once without any other guys there. (Male achievement)\n \n•\t(5) DICKS EVERYWHERE - Smoke out two or more guys at once without any other girls there. (Female achievement) \n\n•\t(5) Dishonest Doobie - Smoking a joint wrapped in an outer leaf. \n\n•\t(5) Dolla Dolla Bills - Roll a joint replacing the papers with a dollar bill. * \n\n•\t(5) Don't You Get the Same High That I Do From Lawn Care? - Get High then mow your lawn. \n\n•\t(5) Don Quixote - Convince someone you are someone else while smoking. \n\n•\t(5) Down the Rabbit Hole - Watch Alice in Wonderland while stoned. \n\n•\t(5) Down, boy! - Get a pet cat, dog, or other mammal high using second-hand smoke. \n\n•\t(5) Dr. Giggles - Provide first aid to a fellow stoner while both of you are high. \n\n•\t(5) Drink It Like Water - Make a Jamaican Smoothie. \n\n•\t(5) Duped - Pass the bong, and someone else unknowingly clears your stale hit. \n\n•\t(5) Elephant in the Room - Smoke with someone who weighs more than 300 pounds. \n\n•\t(5) Employee of the Month - Smoking up while at work. \n\n•\t(5) Every Man for Himself - Everyone gets their own weed and they smoke together, each having their own individual joint, blunt, bong, piece, etc to smoke from. \n\n•\t(5) Executive Suite - Smoke in a swanky hotel room. \n\n•\t(5) Eyes Open Toked - Take a hit with your eyes open for the first time. \n\n•\t(5) EZ Baked - Make weed cookies/brownies. \n\n•\t(5) Factory Worker - Listen to Industrial music non-stop while high. \n\n•\t(5) Farmer in the Dell - Grow your own weed outside. \n\n•\t(5) Fear Factor - Eat five roaches. \n\n•\t(5) Fiendin' - Scrape all your pieces for resin. \n\n•\t(5) Fight Fire with Fire - Smoke yourself sober. \n\n•\t(5) Filthy Beast - Smoke while using the toilet. \n\n•\t(5) Finish the Plate - Pack a bowl with all the available weed you have. \n\n•\t(5) Fire in the Hole! - Smoke from a bong without using ice or water. \n\n•\t(5) Firefly - Use up a fresh lighter in a day by yourself. \n\n•\t(5) Fire-pit - Saving the roaches from ten dank joints and putting them into one big joint sprinkled with hash. \n\n•\t(5) Flying Ninja - Smoke outside on a roof or awning at night. \n\n•\t(5) Frasier - Smoke weed while drinking wine. \n\n•\t(5) Friends with Benefits - Smoke with at least 6 people you know at the same time. \n\n•\t(5) Frosty - Using freshly fallen snow in a bong. \n\n•\t(5) Fruit Roll-Up - Buy every flavor of wraps, roll a joint for each kind, then smoke. \n\n•\t(5) Ghandi - Smoke at least two grams by yourself and consume no food during your trip. \n\n•\t(5) Ghostbuster - Hold a hit for so long, you blow out no smoke. \n\n•\t(5) Girl Scout - Sell homemade edibles. \n\n•\t(5) Giving Nature a Hand - Find a hole somewhere that some rodent or snake possibly lives in, bonus if you followed a rodent back there hole. Blow smoke into said hole. \n\n•\t(5) Glass Tax - Smoke from a glass pipe. \n\n•\t(5) Godhand - Roll a blunt (from a pre-rolled cigar) with only your left hand in the dark and then smoke it. \n\n•\t(5) Goldfish Award - Fish-bowl/clam-bake/hot-box your car till you can't see SHIT. \n\n•\t(5) Good to the Last Drop - Volunteer to take the last hit when offered. \n\n•\t(5) Got a Poké? - Roll a roach from one of your old Pokémon cards. 10 Points for a shiny card. This power can only be used once. \n\n•\t(5) Grasslete - Compete in a sport, stoned. \n\n•\t(5) Green is Green - Pay for a service or item with a nug. \n\n•\t(5) Groovy - Listen to only 60's music while blazing. \n\n•\t(5) Ground Control - Help out a friend who gets too blitzed. \n\n•\t(5) Han Solo - Enjoy a relaxed night smoking by yourself. \n\n•\t(5) Haters Gonna Hate - Smoke weed around people who think you're getting bad brain cells. \n\n•\t(5) Have Weed, Will Travel - Travel to another town exclusively for weed. \n\n•\t(5) Henry David Thoreau - Smoke away from civilization in nature. \n\n•\t(5) Hentai - get high then watch animated Japanese porn. \n\n•\t(5) Here Comes the Sun - Smoke outside when it's over 90 degrees. \n\n•\t(5) High As a Kite - Smoke pot and fly a kite. \n\n•\t(5) Hit and Run - Keep yourself fit by smoking on a treadmill. \n\n•\t(5) How do I Flank? - Play a game of Airsoft or Paintball blazed. \n\n•\t(5) How Romantic! - Smoke on a first date. \n\n•\t(5) Happy Camper - Light a joint from a burning marshmallow \n\n•\t(5) Humble Pie - Corner the bowl when offered greens. \n\n•\t(5) I Know Kung-Fu - Take a hit and do a backflip. \n\n•\t(5) Ice Age - Roll a joint/pack a bowl and smoke it outside while it's snowing. \n\n•\t(5) I'm on a Boat - Smoke on a yacht. \n\n•\t(5) In Soviet Russia - Burn or singe yourself while trying to light a bowl. \n\n•\t(5) Incog-weed-o - Convert one common household item into a piece of smoking apparatus. \n\n•\t(5) Incoming! - Have a seed explode in a lit joint or blunt. \n\n•\t(5) It's... Beautiful! - Take a macro picture of your weed. \n\n•\t(5) I Got Skills - Write a rap while high or freestyle. \n\n•\t(5) J Dilla - Produce a hip-hop beat while high. \n\n•\t(5) John Wayne - Smoke at a scenic spot and watch the sunset. \n\n•\t(5) Kick It Up a Notch - Cook something while baked. \n\n•\t(5) Kingpin - Smoke a fat blunt. \n\n•\t(5) Lil Wayne - Smoke a fat blunt dipped in cough syrup.* \n\n•\t(5) Linguist - Learn a new language high. \n\n•\t(5) Little Friend - Smoke with a little person. \n\n•\t(5) Lol Whut?! - Go to a drama/adventure/romance movie in theaters completely blazed. \n\n•\t(5) Lola - Smoke with a tranny/trap. \n\n•\t(5) Lord Of War - Rank top on the server of an online FPS while totally baked. \n\n•\t(5) Lost in Space - Smoke while watching MST3K. \n\n•\t(5) Lost Odyssey - beat an RPG game while high \n\n•\t(5) Lucky! - Find some bud you didn't know you (still) had and smoke it. \n\n•\t(5) MacGyver - Create a smoking device using only household materials. \n\n•\t(5) Malcolm in the Middle - Be the middle man between your dealer and a friend. \n\n•\t(5) Man of the Hour - Be the last person to come down. \n\n•\t(5) Manny Ramirez - Smoke before playing baseball. \n\n•\t(5) March Hare - Make weed tea that actually gets you high. \n\n•\t(5) Master Engineer - Make a bong out of things found only in your kitchen. \n\n•\t(5) Medic - Smoke out a sick friend/family member. \n\n•\t(5) Megaton Press - Press a tab of kief. \n\n•\t(5) Mellow Churchill - Roll a pure cannabis cigar (Using fan leaves, hemp papers, etc). \n\n•\t(5) Michael Phelps - Swim in a pool while high. \n\n•\t(5) Mike Mulligan - Dig up some greens in what was thought to be a finished bowl. \n\n•\t(5) Minute Man - Hold a bong hit in for an entire minute. \n\n•\t(5) MOVE THAT BUS! - Decorate a room while high. \n\n•\t(5) Musician at Heart - Smoke from a piece made using any part of any instrument. \n\n•\t(5) Natural Resources - Have a gravity or waterfall bong hit using a lake, stream, river etc. \n\n•\t(5) Nature Child - Smoke while nude. \n\n•\t(5) Necronomicon - See a horror movie in theaters while stoned. \n\n•\t(5) Need a Light? - Hold the flame over someone else's bowl for them. \n\n•\t(5) Newton's Law - Smoke from a Gravity bong. \n\n•\t(5) Niagara Falls - Smoke from a Waterfall. \n\n•\t(5) No worries, mate! - Smoke out an Australian (If you yourself are Australian just smoke out another aussie). \n\n•\t(5) Norman Rockwell - Smoke before eating with the family. \n\n•\t(5) Nostalgic - Re-discover a childhood joy while high. \n\n•\t(5) Now That's a Burger!- Succesfully finish a double pounder (Eight layers of meat and cheese) burger bought from McDonald's. \n\n•\t(5) Now THATS A Tip - Smoke out a delivery person who brought you food. \n\n•\t(5) Om Nom Nom - Spend over $50 on munchies. \n\n•\t(5) One Asian, One Indian, One Adventure - Smoke with some friends and find your way to a White Castle. You're pretty cool if you can match the races. \n\n•\t(5) One Mans Trash... - Get your weed from your dealer in something unconventional, like a garbage bag or discarded food wrapper. \n\n•\t(5) One Ring to Rule Them All - Blow a perfect smoke ring. \n\n•\t(5) Passing the Knowledge - Smoke before class. \n\n•\t(5) Peace Pipe - Settle a fight with a friend over a bowl. \n\n•\t(5) Pharaoh - Smoke out of an egyption hookah. \n\n•\t(5) Phi Kye Timetogethigh - Smoke in a frat house. \n\n•\t(5) PLUR - Get blazed at a rave. Bonus points if you aren't into techno. \n\n•\t(5) Pocahontas - Feed a wild animal while high. \n\n•\t(5) Pocky - Smoke weed while watching a genuine Japanese anime. \n\n•\t(5) Power Outage - Listen to acoustic music non-stop while high. \n\n•\t(5) Prometheus - Supply a lighter to a friend in need. \n\n•\t(5) Receding Hairline - Burn hair while taking a hit. \n\n•\t(5) Reefer Madness - Get high and exclusively listen to music from the 1930's. \n\n•\t(5) Roach Exterminator - Smoke a full bowl with the weed from roaches. \n\n•\t(5) Rope Adventure - Find a rope and climb out of a second-story window or higher, while high.* \n\n•\t(5) Rugged Smoker - Smoke during a hiking trip/camping trip/etc. \n\n•\t(5) S on my Chest - Superman a roach. \n\n•\t(5) SHAZAM! - Smoke in a lightning storm. \n\n•\t(5) Sk8r - Go skateboarding while high. \n\n•\t(5) Sly Dog - Get high less than 24 hours before a drug test, and pass.* \n\n•\t(5) Smart Shopping - Go impulse shopping while baked. \n\n•\t(5) Smoke N' Mate - Take a hit during sex \n\n•\t(5) Sneaky - Successfully get a Medical Marijuana card without having any real medical problem.* \n\n•\t(5) Soak and Toke - Smoke a bong while taking a bubble bath. \n\n•\t(5) Solar Power - Use a magnifying glass or something similar to take a solar hit. \n\n•\t(5) Some Minimal Illumination - Smoke in a power outage. \n\n•\t(5) Sploofin' off - Create and use a sploof \n\n•\t(5) Squeezing Water from a Stone - Smoke a bowl of resin. \n\n•\t(5) St. Nick - Smoke on top of your, or a friends rooftop. \n\n•\t(5) Straight to the floor - Fall asleep right after taking a hit. \n\n•\t(5) Summon Shenlong - Have a Green Dragon. \n\n•\t(5) Super Cool Story Bro - Tell a story while high and forget the ending. \n\n•\t(5) Super Smashed Bros. - Play a Super Smash Bros. tournament while stoned. \n\n•\t(5) Support our Troops - Get stoned with a member of the military. \n\n•\t(5) Surf 'N' Turf - Smoke on a beach. \n\n•\t(5) Survivorman - Hot-box a tent. \n\n•\t(5) Switch Hitter - Be so high that you accidentally hit the wrong side of the joint/blunt. \n\n•\t(5) Taste Buds - Take a mouth bong hit. \n\n•\t(5) The Bad Choice - Smoke right before a BBQ. \n\n•\t(5) The Breath Taker - Marathon a 1g joint by yourself in less than five minutes. \n\n•\t(5) The Cat's Meow - Smoke out a cat successfully.* \n\n•\t(5) The Guru - In a single hit, inhale a joint puff, a blunt puff, a bong hit and a gravity bong hit (May be substituted with reverse gravity). \n\n•\t(5) The Hat Trick - Jack 3 lighters in one session. \n\n•\t(5) The Joker - You and your friends laugh so hard you can't take a hit for more than a minute. \n\n•\t(5) The Joys of Parenting - Smoke herb you've grown yourself. \n\n•\t(5) The Mummy - Smoke a blunt without an outer leaf and use rolling papers instead. \n\n•\t(5) The Rick Moranis - Watch all three \"Honey I Shrunk the...\" movies, Space Balls, and both Ghost Busters in a row, smoking a new session for each movie, and adding an extra bowl to each session. \n\n•\t(5) The Shaman - Smoke up and enjoy the high in a cave, a Native American teepee, a forest, next to stone age rock paintings, you get the idea, etc. \n\n•\t(5) The Sloth - Wake up, wake and bake, and any time you sense that you are coming down, smoke more, and sit around and watch TV and eat things. It is not permitted to go outside unless it is only on your porch or into your backyard. \n\n•\t(5) The Stone(d) Age - Smoke a bowl using only matches and a stone piece. \n\n•\t(5) The Thing - Smoke in a walk-in freezer. \n\n•\t(5) Tin man - Use tin foil in a homemade piece.* \n\n•\t(5) Toy Story - Be high in a children's toy store. \n\n•\t(5) Triple OG - Smoke a blunt while sipping hard liquor. \n\n•\t(5) True Hotboxer - Hot-box in a sauna/steam-room (shower not allowed) then get out feeling the \"Ahhhhhhhhhhhhhhhh...\" sensation. \n\n•\t(5) Well, this is ironic and awkward - Take a hit from a mushroom shaped pipe/piece. \n\n•\t(5) What's This Safety Thing Do - Fire a gun while stoned, without hurting yourself in the process.* \n\n•\t(5) White Flag - Inhale a hit from your mouth to your nose. \n\n•\t(5) Woodstock - Smoke freely at an outdoor music festival. \n\n•\t(5) What's up doc? - Make and use a carrot to smoke up, then eat it. All of it. \n\n•\t(5) You Must First Invent The Universe - Bake a pie containing weed. \n\n•\t(5) Have \"The Talk\" with someone - Tell someone about how cool it is that we are just a tiny little planet in one solar system in one galaxy out of a zillion others. \n\n•\t(5) TAG... you're IT! - Play children's' games while high (1-2-3 Ninja, Duck-Duck-Goose, Flashlight tag, Ms. Mary Mack, Rock-Paper-Scissors, ect.) \n\n•\t(5) Orange = Blue? - Wonder weather different people see the same colors differently. \n\n*10 points*\n\n•\t(10) Honor thy Mother and Father - Get your mommy or daddy some better connections / sell to them. And don't skimp them too much \n\n•\t(10) Running Water, Hear my Cry - Smoke weed in the shower while your whole family is in the room next door. Bathroom door must be unlocked. \n\n•\t(10) 420 Challenge - Smoke 4.20 grams by yourself without leaving your seat. \n\n•\t(10) Twice a Year - Smoke weed on 4/20 at 4:20(A.M. and P.M.) \n\n•\t(10) 420/20 Vision - Toke up before going to the eye doctor.* \n\n•\t(10) A Friend with Weed - Smoke up five friends and get smoked up by five friends. \n\n•\t(10) Ace of Cakes - Bake a THC infused rainbow cake. \n\n•\t(10) Across The Universe - Go to a golf driving range while high and hit a ball over 200 yards. \n\n•\t(10) Ah Grasshopper - Smoke up a teacher/professor. \n\n•\t(10) All Along The Watchtower - Smoke from a 5+ foot bong. \n\n•\t(10) American Beauty - Smoke with a friend's parent. \n\n•\t(10) Appetizer - Smoke while in line at a drive-thru. \n\n•\t(10) Apprentice Engineer - Make a bong out of things you find in your shed. \n\n•\t(10) Bat - Smoke a complete joint while hanging upside down from a tree branch. \n\n•\t(10) Battle of Wills - Smoke somebody out until they can't keep smoking. \n\n•\t(10) Big Lebowski - Go bowling with friends when high. \n\n•\t(10) Better than a Kegstand - Do a bongstand. \n\n•\t(10) Blockade Runner - Make it through a security checkpoint/police search with your weed intact.* \n\n•\t(10) Boulder - Go to Boulder, Colorado for the Legendary 420 Celebration \n\n•\t(10) Boxed Out - Without smoking get high in a hot boxed area. \n\n•\t(10) Budder me up - Take a budder hit. \n\n•\t(10) Candy Man - Make THC Tincture or THC Lollipops \n\n•\t(10) Cashed - Work an entire shift of your job high. \n\n•\t(10) Clash of the Titans - Get two people who hate each other to smoke together. \n\n•\t(10) Coke Fiend - Drink an entire twenty pack of Coca-Cola. (Or Pepsi if you like it more) \n\n•\t(10) Collect the Dragonballs - Make a gallon of green dragon from old stems. \n\n•\t(10) Conquistador - Do something you normally would be too scared to do high. \n\n•\t(10) Cornucopia - Cook an entire thanksgiving dinner, including stuffing, while high. \n\n•\t(10) Crowd Pleaser - Out hit everyone you smoke with. \n\n•\t(10) Dick Bong, ace pilot - Buy a bong that is shaped like a fully erect cock. \n\n•\t(10) D-I-High - Successfully construct flat-pack furniture while high. \n\n•\t(10) Dissapearing Act- Smoke your whole bag while driving around. \n\n•\t(10) Doctor's Orders - Get a permit for medical marijuana. \n\n•\t(10) Doctors Without Borders - Sell weed and then move onto ADDITIONALLY providing other substances at the same time. \n\n•\t(10) Double-Jointed - Smoke a joint the size of two regular joints. \n\n•\t(10) Dude, Where's my Food - Successfully eat up all the food in your friends house while high.* \n\n•\t(10) Ebert and Roeper - Watch fifty movies while high with a friend. \n\n•\t(10) Elementary, my dear Watson - Solve a mystery while high using a sherlock bubbler to smoke with. \n\n•\t(10) Energizer Bunny - Listen, while high, to a fully-charged portable music player long enough that the batteries die but you do not fall asleep. \n\n•\t(10) Family Guy - Smoke weed with someone from your immediate family. \n\n•\t(10) Fat Sack - Buy an ounce. \n\n•\t(10) Feels Good Man - Have sex while high. \n\n•\t(10) Fuck Tech Support - Install an operating system into your computer while high, without fucking up once. \n\n•\t(10) Galileo - Smoke out of a telescope. \n\n•\t(10) Ganja Guru - Smoke an ounce in the span of a day. \n\n•\t(10) Garden Gnome - In broad daylight, sit in the middle of your front yard's garden and smoke a gram from a bong. \n\n•\t(10) Garden Of Eden - Smoke while nude, with a member of the opposite sex who is also nude. \n\n•\t(10) Getting Motivated - Smoke at your school, in between classes. \n\n•\t(10) Gipetto - Design and make a stuffed toy/puppet/robot/figurine while high. \n\n•\t(10) Good Saamaritan - Find weed in public area. \n\n•\t(10) Grandma's Boy - Turn a simple call for some weed into a party at your grandmother's house. \n\n•\t(10) Green Ranger - Call greens on ten bowls in a row. \n\n•\t(10) Hashshashin - Smoke hash on a rooftop while keeping vigilant watch. \n\n•\t(10) Health Conscious - Own a digital vaporizer. \n\n•\t(10) Heaven or Hell - Green out then get higher than you were when you got sick. Vomiting due to other drugs does not count towards this achievement. \n\n•\t(10) High'd in Plain Sight - Smoke in a public place. \n\n•\t(10) High Roller - Roll 15 blunts in one day. \n\n•\t(10) HIGH, FAMILY! - Go to a family reunion blazed. \n\n•\t(10) Higher Education - Take a class at Oaksterdam \n\n•\t(10) Higher Learning - Go to college lectures baked. \n\n•\t(10) Hitler's Favorite - Smoking all day on the 20th of April. \n\n•\t(10) Humanitarian - Smoke up someone with medical problems (i.e. cancer, m.s., cerebral palsy etc). \n\n•\t(10) Hungry Man - Eat something with weed/hash in it then smoke weed stronger than the weed/hash in the food you ate. \n\n•\t(10) I Don't Even... - Smoke from something made of at least six feet of tape. \n\n•\t(10) I'm Impressed... - Smoke weed while walking through a city. \n\n•\t(10) Intruder Alert - Smoke in someone's yard/house/shed that you do not know, without their permission.*\n \n•\t(10) Iron Chef - Cook a full meal for several people while baked. \n\n•\t(10) Iron Man - Smoke in a circle with blunts going around equal to at least half of the people. \n\n•\t(10) It's 4:20 Somewhere... - Smoke at 4:20 (AM or PM) in every time zone. \n\n•\t(10) Johnny Appleseed - Collect at least 4g of seeds and plant them. \n\n•\t(10) Juelz Santana - Smoke three fat blunts dipped in cough syrup.* \n\n•\t(10) Just Croisin', Man - Walk around your neighborhood smoking weed from a croissant. \n\n•\t(10) Justice League - Assemble a group of adult friends each with different types of pieces (bong, pipe, bubbler, etc) and get high \n\n•\t(10) Katamari - Roll a resin ball in grinder kief and smoke it. \n\n•\t(10) Keep it Tight - Roll a blunt that lasts 20+ minutes. \n\n•\t(10) Kottonmouth King - Smoke 5 bowls without anything to drink. \n\n•\t(10) Krakatoa - Smoke a volcano modified with a custom 5 foot bag. \n\n•\t(10) Like Father Like Son - Smoke out one of your parents (not a friends parent, we already have that). \n\n•\t(10) Lord of the Bongs - Own more than five different non-homemade pieces. Can be bongs, pipes, bubblers, etc. \n\n•\t(10) M80 - Successfully make Firecrakers \n\n•\t(10) MacGuyver's Kid - Make a piece out of a straw, a toothpick, a paperclip, and tinfoil. \n\n•\t(10) Major Tom - Get high while experiencing no gravity, while feeling that high. \n\n•\t(10) Medieval Times - Buy some weed with coins only. \n\n•\t(10) Native Waters - As an adult, return to and smoke in your childhood home. \n\n•\t(10) NEVAR FORGET - Smoke at a memorial site. \n\n•\t(10) Not so Green Now! - Buy weed from a dealer without ANY assistance from friends. \n\n•\t(10) Nug Ninja - Blaze atop a restricted building. \n\n•\t(10) Out of this world - Take ten gravity bong hits in less then a minute. \n\n•\t(10) Pay it Forward - Smoke out two people at the same time. \n\n•\t(10) Perseverance - Complete a tolerance break of a month or more. \n\n•\t(10) Problem Officer? - Talk to an officer of the law while high.* \n\n•\t(10) Promised Land - Smoke a joint while walking through Jerusalem.* \n\n•\t(10) Pwnerer - Beat all your friends at a video game while baked. \n\n•\t(10) Pyros Have Needs Too - Light up from a flame over 30 cm. More points the closer to 200 C the flame is.* \n\n•\t(10) Raise and Blaze Weekdays - Wake and bake every day for a week. \n\n•\t(10) Rehab - Successfully take 3 shots of vodka in between pipe hits without coughing. \n\n•\t(10) Respect for Thee - In honor of someone smoke an ounce with another person. \n\n•\t(10) Respect Your Elders - Smoke out someone older than you. \n\n•\t(10) RIP Jimi - Smoke a bowl at Jimi Hendrix's grave site. \n\n•\t(10) Romper Stomper - Get high and drunk simultaneously and then bare knuckle box with a friend.* \n\n•\t(10) Say Uncle - Smoke out your uncle. \n\n•\t(10) Sacred Ground - Smoke weed in Amsterdam. \n\n•\t(10) Scavenger - Get high on resin alone for a week. \n\n•\t(10) Seasons Bakings - Cook an entire Christmas dinner, including stuffing, while high. \n\n•\t(10) Shoot 'em up - Give a shotgun to more than 5 people in a row. \n\n•\t(10) Shoppin' With Carlin - Don't eat for two days, then smoke eight joints, take 500 dollars, and complete a purchase at a supermarket. \n\n•\t(10) Skywalker - Look for shapes in the clouds with a friend while high \n\n•\t(10) Smart Shopper - Go into a grocery store baked and don't buy anything \n\n•\t(10) Spielberg - Form an entire movie plot in your head while stoned. \n\n•\t(10) Starving Artist - Create a piece of art while blazed. \n\n•\t(10) Stoners Delight - Combine four canned foods in your pantry to make a superfood. Extra points go to the obscurity of the combination. \n\n•\t(10) Strike-out! - Take a hit, down a shot, chug a beer, then exhale. \n\n•\t(10) Super Blunt - Smoke a blunt with cigar tobacco in it. Super bonus points if you don't cough once. \n\n•\t(10) Super Pimp - Get someone so high that you instantly hook up. \n\n•\t(10) Supra Hasheesha - Distill your own hash, add honey and flavor to make it into a sheesha, then smoke it through a water pipe or hookah. \n\n•\t(10) Teen Titans - Assemble a group of teenage friends each with their own homemade pieces & cannabis, then get high. \n\n•\t(10) The Aristocrat - Smoke a wooden pipe while wearing two or all three of these items: waistcoat, monocle, and/or tophat. \n\n•\t(10) The Author - Write or post a worthy story while baked. \n\n•\t(10) The Camberwell Carrot - Roll a joint fully utilizing no less than 12 papers. \n\n•\t(10) The Chosen Few - Form a close clique of pot smoking friends. \n\n•\t(10) The Collector - Collect at least ten pieces. \n\n•\t(10) The Entertainer - Smoke before going out on stage. \n\n•\t(10) The Evil Knievel - Smoke on top of a car with a friend driving you around.* \n\n•\t(10) The Heartbreaker - Unintentionally break five glass pieces in your lifetime. \n\n•\t(10) The Italian Job - Eat an entire large pizza by yourself while high. \n\n•\t(10) The King of Irony - You and two or more friends pull into a rehab parking lot and hot-box the car. \n\n•\t(10) The Music Man - Have a smoking playlist of at least 250 songs. \n\n•\t(10) The Pugilist - Get in a fight while high, and win.* \n\n•\t(10) The Terri Schiavo - Smoke an 8th in eight minutes or less. \n\n•\t(10) The Viking - Smoke up on any manpowered watercraft. \n\n•\t(10) The Wizard - Convert any old nerd nostalgic item into a piece i.e.: Lightsaber, N64 Controller, EZ Bake Oven, Super Soaker, Nerf Gun, etc. \n\n•\t(10) They Can't Hear You, but They Can Smell ya - Smoke out a deaf person. \n\n•\t(10) This is Happy - Smoke till you can't feel feelings anymore. \n\n•\t(10) Tiger Weeds - Go golfing and play a full 18 holes while stoned. Bonus points if you get a good score. \n\n•\t(10) Time Traveler - Get so high that you sleep for more than 24 consecutive hours. \n\n•\t(10) Tip Top Toke - Get high on the top floor of a tall building. \n\n•\t(10) Travelin' Man - Smoke in at least three different states. \n\n•\t(10) Triple Six Club - Smoke three blunts and six joints in one session. \n\n•\t(10) Turning the Donkey Wheel - While driving around baked, teleport your car (get to where you're driving while you think you're not heading in the right direction). \n\n•\t(10) Dak Janiels - Smoke a bong using Jack Daniels as the bongwater.* \n\n•\t(10) Vesuvius - Use a volcano vaporizer. \n\n•\t(10) What are Those Goddamn Animals! - Go to the zoo stoned. \n\n•\t(10) When Life Gives You Lemons.... - Smoke every kind of weed substitute you can find. \n\n•\t(10) Where is My Mind - Go on a roller coaster high. \n\n•\t(10) White Collar Crime - Smoke while walking a dog, in a suburban neighborhood. \n\n•\t(10) Why Hello There - Meet your boyfriend's/girlfriend's parents high. \n\n•\t(10) Wiseau Serious? - Smoke a bowl during a screening of The Room in a crowded theater. Add five points if it's during the scene where Peter confronts Mark for smoking pot. \n\n•\t(10) Woodsmith - Smoke out of a pipe you whittled yourself. \n\n•\t(10) Zombie Jesus - Smoke a bible joint rolled from the page where Jesus is resurrected. \n\n•\t(10) Zombie - Become so baked that your motor skills are completely dismissed. \n\n•\t(10) Ratchet Time- Smoke with a nurse. \n\n•\t(10) Snoopy - Successfully fall asleep on a roof after getting stoned without falling off. Roof must have a slant.* \n\n•\t(10) Trip To The ER- Smoke with an EMT or Paramedic \n\n•\t(10) Eat THIS Smoke!- Smoke with a firefighter. \n\n•\t(10) Jack Bauer - Watch an entire season of \"24\" in one sitting, smoking in between each episode. \n\n•\t(10) Jacques Cousteau - take a hit from a diving bell \n\n•\t(10) Lord of the Leaf - Watch all of the Lord of the Rings movies, including the extras, smoking a bowl with each change of disk, in one sitting. \n\n•\t(10) Master of Science -Listen to a Carl Sagan lecture and comprehend something new while blazed \n\n•\t(10) Green IN -Avoid throwing up from too much weed by swallowing your own puke without any escapeing your mouth. \n\n•\t(10) Smoke and Dagger -Smoke in public using smoking paraphernalia that is disguised (i.e. Fake metal cigarette chillum) \n\n•\t(10) Dr. Walter Bishop -Solve or discover a solution to a problem/issue high. (preferably if sober individuals cannot or have not found a solution.) \n\n*15 points*\n\n•\t(15) A Walk in the Park - Smoke a joint in a heavily populated park without getting caught.* \n\n•\t(15) Big Plans - Buy more than a pound -- for youself. \n\n•\t(15) Boy Meets World - Successfully move out of your parents house without them ever catching you smoking. \n\n•\t(15) Coyote - Ship or bring weed over a national border.* \n\n•\t(15) Day Walker - Smoke outside in public during the day. \n\n•\t(15) Dedicated Few - Smoke with a group of few friends for 4 months straight every day. \n\n•\t(15) Diversify - Smoke in a circle with at least five people of different nationalities. \n\n•\t(15) Do You Want Fries With That? - Buy a QP. \n\n•\t(15) Engineering Doctorate - Make a bong only out of illegal substances. The more illegal, the better.* \n\n•\t(15) Fire at the Multiplex - Smoke in a theater. \n\n•\t(15) Doin the Flobot - Ride down the biggest hill in town, no handlebars, stoned out of your mind. \n\n•\t(15) Gene Splicer - Attempt to conceive a child while high. \n\n•\t(15) Grandpa Jack - Smoke a bong using Jack Daniels as the bongwater. After you've finished the bowl, do shots of the bongwater. \n\n•\t(15) Happy Birthday Dude - Bake someone a space cake for their birthday. \n\n•\t(15) Honor Student - Smoke in a school area while kids are playing.* \n\n•\t(15) Joints a Blazing - Get over 30 people in one house to smoke their own joint. \n\n•\t(15) Just Like Fort Lewis - Participate in the hot-boxing of a parachute in public.* \n\n•\t(15) Lucky Number 7 - Smoke seven packed bowls consecutively in one sitting, by yourself. \n\n•\t(15) Mile High Club - Smoke one mile off the ground. \n\n•\t(15) Mona Lisa Overdrive - Get blazed on the highway while driving.* \n\n•\t(15) Mr. America - Smoke in all 50 states. \n\n•\t(15) Otaku - Marathon a season of any given anime series with a blunt/joint/bowl for each disk. \n\n•\t(15) Quadriplegic - Smoke 4 joints at the same time and finish them all. \n\n•\t(15) Reefer Fiend - Smoke more than ten joints in a day. \n\n•\t(15) The Aristocrats - Convince your stupid friends to do \"The Aristocrat\" with you. \n\n•\t(15) The Early Bird - Wake and bake every day for a month. \n\n•\t(15) The Ounce Challenge - You and another person go against another team of two. Both teams are given an ounce. Whichever team finishes their ounce first wins another ounce. \n\n•\t(15) The Pro-Marijuana Lobby - Get high on the steps of a capital building.* \n\n•\t(15) The Snack that Smiles Back -Smoke from a bong with a live goldfish in the water. \n\n•\t(15) To the Dome - Create a device with which you can inhale smoke directly through your nostrils. \n\n•\t(15) Vacuum - Smoke a complete joint in one hit. \n\n•\t(15) Vintage - Smoke out of a piece at least 30 years old. \n\n•\t(15) Welcome to the Jungle - Grow ten four-foot tall plants.* \n\n•\t(15) Wheel and Deal - Sell at least an ounce of weed in a 24 hour period. \n\n•\t(15) When the Clock Strikes - Smoke weed when ever it is 4:20 anywhere in the world for a week. \n\n•\t(15) World of WeedCraft - Sell your World of Warcraft account and spend all of the earnings on weed. \n\n•\t(15) Wrecking Ball - Get a gigantic steam roller and get everyone around you wrecked off one bowl pack.\n \n•\t(15) GrimDank- Play a tabletop wargame stoned out of your gourd (bonus points if you win). \n\n•\t(15) Holy Smoke - Smoke in a church. Extra points if it's in a cathedral. \n\n•\t(15) The Body of Christ - Successfully roll and smoke a cross joint. \n\n•\t(15) Flower Power - Successfully roll and smoke a Tulip joint. \n\n•\t(15) The Very Best - Finish a Pokemon game blazed. \n\n•\t(15) Housekeeping - Clean your entire home while high. \n\n•\t(15) The Apollo - Entertain and make friends laugh to tears while high. \n\n•\t(15) The Great Outdoors - Hotbox a canoe. \n\n*20 points*\n\n•\t(20) All Day, Baby... All Day - Roll enough joints to continuously smoke marijuana for an entire day. You must never stop smoking during this period. \n\n•\t(20) Peacemaker - Break up a fight while high, and then smoke the belligerents out afterwards. \n\n•\t(20) Bloodshot - Get an ID photo taken while high. Bonus points if it's an official document: Passport, driver's license, government department employee ID etc.* \n\n•\t(20) Boom Shankar - Smoke with an actual Sadhu in India. \n\n•\t(20) Charm +1 - Get busted smoking weed by the cops, and talk your way out of it.* \n\n•\t(20) Dead Spaced - In one night, in complete darkness, play through Dead Space and Dead Space 2, taking hits while on elevators/cut-scenes/etc. \n\n•\t(20) Dope Slope - Roll a blunt and smoke it while snowboarding/skiing all the way down a peak. Add 5 points if the bottom is reached before the blunt is roached. \n\n•\t(20) Dudes. (aka Gentlemen) - Puff ten or more joints at the same time. \n\n•\t(20) Groundlings - Perform improv comedy in front of an audience after smoking a lot of weed. \n\n•\t(20) Groupie Status - Smoke up a musician backstage at a concert. \n\n•\t(20) Man of the People - Open a dispensary. \n\n•\t(20) Marathon Man - Spend 12 hours, awake on a single piece of furniture. Weed must be consumed, every hour, for all 12 hours. \n\n•\t(20) Members Only - Open a Cannabis Club. \n\n•\t(20) Metal Gear!?!?!?! - Beat the entire Metal Gear Solid series high. Bonus points if you manage to understand any of the story once you beat it (note: actually easier high than when sober). \n\n•\t(20) Mind Over Matter - Take a 12 gram blunt to the face. \n\n•\t(20) Parental Control - Get high and chill within 15 feet of 1 or more parents while high. \n\n•\t(20) Pearls Before Swine - Successfully conduct a sale or purchase of marijuana while a police officer is in the vicinity.* \n\n•\t(20) Innocent Brownie- Give a hash brownie to a Straight-Edger.* \n\n•\t(20) Pretty Sneaky - Smoke in the same room as an authority figure of any kind.* \n\n•\t(20) Shelob - Handle a tarantula while stoned without getting bitten. \n\n•\t(20) The Professor - Deliver a lecture while stoned. \n\n•\t(20) Weedeater2k - Consume 2,000 items of cannabinized food. \n\n•\t(20) Lieutenant Dan - Smoke during a hurricane. \n\n•\t(20) Capitalist Pig - Smoke a joint in a Walmart garden center. \n\n•\t(20) Santa Claus - During christmastime, light your smoking devices with a candle. \n\n•\t(20) Reclaimer - Play through and complete all Bungie made Halo games high. (Halo: Reach, Halo: Combat Evolved, Halo 2, Halo 3, Halo 3: ODST). Bonus points for increased difficulty (Heroic= 10, Legendary= 20). Chronological story order (5). Reduced points for each missing game (-5). \n\n*30 points*\n\n•\t(30 ) Counter Insurgency - Discover and harvest a guerrilla grow. \n\n•\t(30) Bless Me, Father - Smoke with a Catholic priest. Add an extra twenty-five points for each increase in church rank: monsignor, bishop, archbishop, cardinal, pope. \n\n•\t(30) Shomer Shabbos - Smoke with an Orthodox Rabbi. \n\n•\t(30) Citizen Kane - Become at least locally famous for your work in legalization politics. \n\n•\t(30) God Mode- Smoke with a member of law enforcement (not a narc).* \n\n•\t(30) IMDB - Watch 420 movies while high. \n\n•\t(30) Smooth Criminal - Smoke with a cop in the vicinity.* \n\n•\t(30) Runner's High - Smoke the night and the morning before you run a half marathon. Extra 10 points if its a full marathon. YOU HAVE TO RUN/ JOG IT, do not walk it. \n\n•\t(30) Don't Give a Fuck - Be a police officer yourself, and smoke every day. \n\n•\t(30) Agu-steal - Smoke enough weed to make 7 full joints in a night, pay for none of it. \n\n*50 points*\n\n•\t(50) Heavyweight Champion- Consume your birthweight in weed. \n\n•\t(50) Father, Son, and Holy Ghost - Smoke out your fundamentalist Christian father. \n\n•\t(50) Smoke Fest - Gather some friends, and have everyone buy a quarter and smoke it in one day.\n \n•\t(50) Joint Genocidist - Smoke 5,359 joints. \n\n•\t(50) SRS Business - Print a life-size poster of the Stoner Achievements list with check boxes next to each achievement. \n\n•\t(50) 21 Bowl Salute- You and 20 of your friends light up pipes, bongs, chillums, and/or steamrollers in memory of a lost mutual friend. \n\n•\t(50) Quiet in the Courtroom - Smoke in the bathroom during a court trial without getting caught. * \n\n•\t(50) Bonding Time - Do \"Parental Control\" for at least 30 minutes continuously. \n\n•\t(50) Fuck The Police - Run and escape from the police, then run and escape from the police again, with the police deploying canines all in the same night.* \n\n•\t(50) Iron Weed - smoke about a quarter of an ounce of weed the morning before you do an IRONMAN or a Triathalon \n\n•\t(50) Behind Enemy Lines - Smoke a joint in a police station parking lot. * \n\n•\t(50) Bein' the Boss - Receiving fellatio/cunnilingus while rolling a joint. \n\n•\t(50) Holy Smokes Batman! - Smoke in the original batcave set in the Hollywood Hills \n\n•\t(50) Freud - Smoke a joint while meeting with your drug councilor and not get caught \n\n*Strain Achievements*\n\n•\t(-5) Bobby Brown Blues - Smoke any strain of reggie out of tinfoil (includes glass pieces with tinfoil bowls).\n \n•\t(5) Arctic Fires - Smoking Northern Lights. \n\n•\t(5) Taste Of Africa - Make edibles with Durban Poison \n\n•\t(5) Bubbleyum - Smoke some Bubblegum strain. \n\n•\t(5) Chillin with Jimi - Smoke Purple Haze while listening to Hendrix. \n\n•\t(5) Eldorado - Smoking a Bowl of Acapulco Gold. \n\n•\t(5) Finishing Spidey's Work - Smoke Green Goblin. \n\n•\t(5) Jacking Off - Jack Herrer + Haze in a blunt. \n\n•\t(5) First Contact - Smoke some Alien Technology. \n\n•\t(10) Fruit of the Loom - Smoking Blueberry (any strain), Mango Kush, Strawberry (any strain), Pineapple (any strain) in a Hookah with at least one other stoner. \n\n•\t(10) Medicine Man - Selling 3 or more strains of Cali medical at once. \n\n•\t(10) The Variety Show - Smoke at least 3 different strains of weed in one sitting. \n\n•\t(10) Kush King - Smoke at least 3 different kush strains. \n\n•\t(10) Purple King - Smoke at least 3 different purple strains. \n\n•\t(15) Variety Hour - Smoke 6 different strains of bud within 1 hour. \n\n•\t(20) Homemade Hybrid - Smoke a joint or bowl with pure sativa and pure indica. \n\n*Stoner Olympics*\n\n•\t(15) Stoner Olympics - Start with a joint, move on to a pipe, then a bong, a knifer, and finish off with a massive gravity bong hit. Replace one item with vaporizer if available. \n\n•\t(20) Bronze Medalist - Complete the Stoner Olympics in less than 10 minutes. \n\n•\t(30) Silver Medalist - Complete the Stoner Olympics in less than 7 minutes. \n\n•\t(40) Gold Medalist - Complete the Stoner Olympics in less than 4 minutes. \n\n•\t(50) Platinum - Earn Gold Medalist. Now, beat your best time. \n\n•\t(60) Green Medalist - Complete the Stoner Olympics in under 2 and 1/2 minutes. \n",
  "mod_reports": [],
  "secure_media_embed": {},
  "edited": 1345842074.0,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Achievement list</strong></p>\n\n<p>FYI: I didnt make this. I think I found it on 420chan (I think) like 2 years ago. I have it as a Microsoft word document so PM me if you want it to share with friends or something. </p>\n\n<p><em>0 or fewer points</em></p>\n\n<p>• (-50) ARE YOU FOR REAL? - Blow into the bong while smoking and ruin the weed. (An additional -100 if the bong is connected to your vape and the water destroys it.) </p>\n\n<p>• (-50) Jesus Christ, It&#39;s a spider! Get in the car! - Get bitten by a tarantula while high. </p>\n\n<p>• (-25) DO A TRASHFACE! - Kick over a friends bong and break it. </p>\n\n<p>• (-15) Thou Shalt Not! - Spill weed upon the ground. (An additional -5 if the weed was ground up, and another -10 if it falls in something nasty or is otherwise unrecoverable.) </p>\n\n<p>• (-15) Green Out - Puke from smoking WAY too much weed by yourself. </p>\n\n<p>• (-10) Getting Shitty - Shit yourself while remembering something funny you did while stoned (-5 if people are around you when you shit yourself, but +20 if you shit yourself without anyone knowing about it). </p>\n\n<p>• (-10) JUST...CAN&#39;T...STOP - Break open a piece to extract resin. </p>\n\n<p>• (-10) Old Faithful - Blow weed out of a bowl while attempting to take a hit for any particular reason (Laughing in the middle of a hit) </p>\n\n<p>• (0) Pound Of Flesh - Cut/scrape/stab yourself accidentally while smoking. Blood must be drawn. </p>\n\n<p>• (0) AW SHIT NIG, YOU&#39;RE JUST DOING IT WRONG - Swallow a full hit of smoke. </p>\n\n<p>• (0) Sacrificial Virgin - Accidentally destroy a glass smoking piece before you have a chance to use it. </p>\n\n<p>• (0) The Cake is a Lie - Discover mold within your weed. </p>\n\n<p>• (0) You Will, DIE! - Smoke moldy weed. </p>\n\n<p><em>5 points</em></p>\n\n<p>• (5) One Way to Fight the Smell- Smoke in a portable toilet. </p>\n\n<p>• (5) &quot;Tell Me About The Fucking Golf Shoes&quot; - Go into a casino completely baked.* </p>\n\n<p>• (5) How Much for the Ape - Buy something you don&#39;t need because you&#39;re stoned. (See &quot;Shoppin&#39; With Carlin&quot; from &quot;On Location&quot;) </p>\n\n<p>• (5) Is This Not a Reasonable Place to Park? - Park on a sidewalk while blazed.* </p>\n\n<p>• (5) +10 Difficulty - Play an RPG while high. </p>\n\n<p>• (5) A Cannon! - Smoke from a Steam Roller. </p>\n\n<p>• (5) A Challenger Appears - Smoke out a stranger until one of you can&#39;t take it anymore. </p>\n\n<p>• (5) Against All Odds - Smoke while under probation.* </p>\n\n<p>• (5) Ahhhnold! - Go to the gym high. </p>\n\n<p>• (5) Always HI - Smoke weed from Hawaii. </p>\n\n<p>• (5) Apple of Eden - Smoke out of an apple. </p>\n\n<p>• (5) Bat Country - Smoke in the middle of the desert, completely away from human civilization. </p>\n\n<p>• (5) BRB, Mars - Smoke a full bowl of kief. </p>\n\n<p>• (5) BRB, Moon - Use a vaporizer. </p>\n\n<p>• (5) BRB, Milky Way - Use a vaporizer packed with kief. </p>\n\n<p>• (5) Butterfly - Smoke in a summer meadow. </p>\n\n<p>• (5) Carl Sagan - Stargaze while stoned out of your gourd. </p>\n\n<p>• (5) Cheap but effective - Smoke out of a pop can bowl. (WARNING SMOKING OUT OF A SODA CAN IS AN EXTREMELY BAD IDEA) </p>\n\n<p>• (5) Chemical Warfare - Smoke a bowl from a gas mask hooked up to a bong. </p>\n\n<p>• (5) Chong Would be Proud - Smoke from a bong. </p>\n\n<p>• (5) Christopher Columbus - Smoke at a campfire. </p>\n\n<p>• (5) Climb the Ladder - Meet your dealer&#39;s dealer. </p>\n\n<p>• (5) Collateral Damage - Give an innocent bystander a contact high. </p>\n\n<p>• (5) Commitment - Buy a $150 or more piece. </p>\n\n<p>• (5) Congratulations! You earned it - Smoke a blunt while driving around in a brand new car.* </p>\n\n<p>• (5) Cruelty Free - Make vegan edibles. </p>\n\n<p>• (5) Cupid&#39;s Green Arrow - Meet a future love interest through weed. </p>\n\n<p>• (5) Determined - Complete a tolerance break of at least two weeks. </p>\n\n<p>• (5) Dial C for Chronic - Call your boss high and tell him you&#39;re too sick to come in. </p>\n\n<p>• (5) The Ladies&#39; Man - Smoke out 2 or more girls at once without any other guys there. (Male achievement)</p>\n\n<p>• (5) DICKS EVERYWHERE - Smoke out two or more guys at once without any other girls there. (Female achievement) </p>\n\n<p>• (5) Dishonest Doobie - Smoking a joint wrapped in an outer leaf. </p>\n\n<p>• (5) Dolla Dolla Bills - Roll a joint replacing the papers with a dollar bill. * </p>\n\n<p>• (5) Don&#39;t You Get the Same High That I Do From Lawn Care? - Get High then mow your lawn. </p>\n\n<p>• (5) Don Quixote - Convince someone you are someone else while smoking. </p>\n\n<p>• (5) Down the Rabbit Hole - Watch Alice in Wonderland while stoned. </p>\n\n<p>• (5) Down, boy! - Get a pet cat, dog, or other mammal high using second-hand smoke. </p>\n\n<p>• (5) Dr. Giggles - Provide first aid to a fellow stoner while both of you are high. </p>\n\n<p>• (5) Drink It Like Water - Make a Jamaican Smoothie. </p>\n\n<p>• (5) Duped - Pass the bong, and someone else unknowingly clears your stale hit. </p>\n\n<p>• (5) Elephant in the Room - Smoke with someone who weighs more than 300 pounds. </p>\n\n<p>• (5) Employee of the Month - Smoking up while at work. </p>\n\n<p>• (5) Every Man for Himself - Everyone gets their own weed and they smoke together, each having their own individual joint, blunt, bong, piece, etc to smoke from. </p>\n\n<p>• (5) Executive Suite - Smoke in a swanky hotel room. </p>\n\n<p>• (5) Eyes Open Toked - Take a hit with your eyes open for the first time. </p>\n\n<p>• (5) EZ Baked - Make weed cookies/brownies. </p>\n\n<p>• (5) Factory Worker - Listen to Industrial music non-stop while high. </p>\n\n<p>• (5) Farmer in the Dell - Grow your own weed outside. </p>\n\n<p>• (5) Fear Factor - Eat five roaches. </p>\n\n<p>• (5) Fiendin&#39; - Scrape all your pieces for resin. </p>\n\n<p>• (5) Fight Fire with Fire - Smoke yourself sober. </p>\n\n<p>• (5) Filthy Beast - Smoke while using the toilet. </p>\n\n<p>• (5) Finish the Plate - Pack a bowl with all the available weed you have. </p>\n\n<p>• (5) Fire in the Hole! - Smoke from a bong without using ice or water. </p>\n\n<p>• (5) Firefly - Use up a fresh lighter in a day by yourself. </p>\n\n<p>• (5) Fire-pit - Saving the roaches from ten dank joints and putting them into one big joint sprinkled with hash. </p>\n\n<p>• (5) Flying Ninja - Smoke outside on a roof or awning at night. </p>\n\n<p>• (5) Frasier - Smoke weed while drinking wine. </p>\n\n<p>• (5) Friends with Benefits - Smoke with at least 6 people you know at the same time. </p>\n\n<p>• (5) Frosty - Using freshly fallen snow in a bong. </p>\n\n<p>• (5) Fruit Roll-Up - Buy every flavor of wraps, roll a joint for each kind, then smoke. </p>\n\n<p>• (5) Ghandi - Smoke at least two grams by yourself and consume no food during your trip. </p>\n\n<p>• (5) Ghostbuster - Hold a hit for so long, you blow out no smoke. </p>\n\n<p>• (5) Girl Scout - Sell homemade edibles. </p>\n\n<p>• (5) Giving Nature a Hand - Find a hole somewhere that some rodent or snake possibly lives in, bonus if you followed a rodent back there hole. Blow smoke into said hole. </p>\n\n<p>• (5) Glass Tax - Smoke from a glass pipe. </p>\n\n<p>• (5) Godhand - Roll a blunt (from a pre-rolled cigar) with only your left hand in the dark and then smoke it. </p>\n\n<p>• (5) Goldfish Award - Fish-bowl/clam-bake/hot-box your car till you can&#39;t see SHIT. </p>\n\n<p>• (5) Good to the Last Drop - Volunteer to take the last hit when offered. </p>\n\n<p>• (5) Got a Poké? - Roll a roach from one of your old Pokémon cards. 10 Points for a shiny card. This power can only be used once. </p>\n\n<p>• (5) Grasslete - Compete in a sport, stoned. </p>\n\n<p>• (5) Green is Green - Pay for a service or item with a nug. </p>\n\n<p>• (5) Groovy - Listen to only 60&#39;s music while blazing. </p>\n\n<p>• (5) Ground Control - Help out a friend who gets too blitzed. </p>\n\n<p>• (5) Han Solo - Enjoy a relaxed night smoking by yourself. </p>\n\n<p>• (5) Haters Gonna Hate - Smoke weed around people who think you&#39;re getting bad brain cells. </p>\n\n<p>• (5) Have Weed, Will Travel - Travel to another town exclusively for weed. </p>\n\n<p>• (5) Henry David Thoreau - Smoke away from civilization in nature. </p>\n\n<p>• (5) Hentai - get high then watch animated Japanese porn. </p>\n\n<p>• (5) Here Comes the Sun - Smoke outside when it&#39;s over 90 degrees. </p>\n\n<p>• (5) High As a Kite - Smoke pot and fly a kite. </p>\n\n<p>• (5) Hit and Run - Keep yourself fit by smoking on a treadmill. </p>\n\n<p>• (5) How do I Flank? - Play a game of Airsoft or Paintball blazed. </p>\n\n<p>• (5) How Romantic! - Smoke on a first date. </p>\n\n<p>• (5) Happy Camper - Light a joint from a burning marshmallow </p>\n\n<p>• (5) Humble Pie - Corner the bowl when offered greens. </p>\n\n<p>• (5) I Know Kung-Fu - Take a hit and do a backflip. </p>\n\n<p>• (5) Ice Age - Roll a joint/pack a bowl and smoke it outside while it&#39;s snowing. </p>\n\n<p>• (5) I&#39;m on a Boat - Smoke on a yacht. </p>\n\n<p>• (5) In Soviet Russia - Burn or singe yourself while trying to light a bowl. </p>\n\n<p>• (5) Incog-weed-o - Convert one common household item into a piece of smoking apparatus. </p>\n\n<p>• (5) Incoming! - Have a seed explode in a lit joint or blunt. </p>\n\n<p>• (5) It&#39;s... Beautiful! - Take a macro picture of your weed. </p>\n\n<p>• (5) I Got Skills - Write a rap while high or freestyle. </p>\n\n<p>• (5) J Dilla - Produce a hip-hop beat while high. </p>\n\n<p>• (5) John Wayne - Smoke at a scenic spot and watch the sunset. </p>\n\n<p>• (5) Kick It Up a Notch - Cook something while baked. </p>\n\n<p>• (5) Kingpin - Smoke a fat blunt. </p>\n\n<p>• (5) Lil Wayne - Smoke a fat blunt dipped in cough syrup.* </p>\n\n<p>• (5) Linguist - Learn a new language high. </p>\n\n<p>• (5) Little Friend - Smoke with a little person. </p>\n\n<p>• (5) Lol Whut?! - Go to a drama/adventure/romance movie in theaters completely blazed. </p>\n\n<p>• (5) Lola - Smoke with a tranny/trap. </p>\n\n<p>• (5) Lord Of War - Rank top on the server of an online FPS while totally baked. </p>\n\n<p>• (5) Lost in Space - Smoke while watching MST3K. </p>\n\n<p>• (5) Lost Odyssey - beat an RPG game while high </p>\n\n<p>• (5) Lucky! - Find some bud you didn&#39;t know you (still) had and smoke it. </p>\n\n<p>• (5) MacGyver - Create a smoking device using only household materials. </p>\n\n<p>• (5) Malcolm in the Middle - Be the middle man between your dealer and a friend. </p>\n\n<p>• (5) Man of the Hour - Be the last person to come down. </p>\n\n<p>• (5) Manny Ramirez - Smoke before playing baseball. </p>\n\n<p>• (5) March Hare - Make weed tea that actually gets you high. </p>\n\n<p>• (5) Master Engineer - Make a bong out of things found only in your kitchen. </p>\n\n<p>• (5) Medic - Smoke out a sick friend/family member. </p>\n\n<p>• (5) Megaton Press - Press a tab of kief. </p>\n\n<p>• (5) Mellow Churchill - Roll a pure cannabis cigar (Using fan leaves, hemp papers, etc). </p>\n\n<p>• (5) Michael Phelps - Swim in a pool while high. </p>\n\n<p>• (5) Mike Mulligan - Dig up some greens in what was thought to be a finished bowl. </p>\n\n<p>• (5) Minute Man - Hold a bong hit in for an entire minute. </p>\n\n<p>• (5) MOVE THAT BUS! - Decorate a room while high. </p>\n\n<p>• (5) Musician at Heart - Smoke from a piece made using any part of any instrument. </p>\n\n<p>• (5) Natural Resources - Have a gravity or waterfall bong hit using a lake, stream, river etc. </p>\n\n<p>• (5) Nature Child - Smoke while nude. </p>\n\n<p>• (5) Necronomicon - See a horror movie in theaters while stoned. </p>\n\n<p>• (5) Need a Light? - Hold the flame over someone else&#39;s bowl for them. </p>\n\n<p>• (5) Newton&#39;s Law - Smoke from a Gravity bong. </p>\n\n<p>• (5) Niagara Falls - Smoke from a Waterfall. </p>\n\n<p>• (5) No worries, mate! - Smoke out an Australian (If you yourself are Australian just smoke out another aussie). </p>\n\n<p>• (5) Norman Rockwell - Smoke before eating with the family. </p>\n\n<p>• (5) Nostalgic - Re-discover a childhood joy while high. </p>\n\n<p>• (5) Now That&#39;s a Burger!- Succesfully finish a double pounder (Eight layers of meat and cheese) burger bought from McDonald&#39;s. </p>\n\n<p>• (5) Now THATS A Tip - Smoke out a delivery person who brought you food. </p>\n\n<p>• (5) Om Nom Nom - Spend over $50 on munchies. </p>\n\n<p>• (5) One Asian, One Indian, One Adventure - Smoke with some friends and find your way to a White Castle. You&#39;re pretty cool if you can match the races. </p>\n\n<p>• (5) One Mans Trash... - Get your weed from your dealer in something unconventional, like a garbage bag or discarded food wrapper. </p>\n\n<p>• (5) One Ring to Rule Them All - Blow a perfect smoke ring. </p>\n\n<p>• (5) Passing the Knowledge - Smoke before class. </p>\n\n<p>• (5) Peace Pipe - Settle a fight with a friend over a bowl. </p>\n\n<p>• (5) Pharaoh - Smoke out of an egyption hookah. </p>\n\n<p>• (5) Phi Kye Timetogethigh - Smoke in a frat house. </p>\n\n<p>• (5) PLUR - Get blazed at a rave. Bonus points if you aren&#39;t into techno. </p>\n\n<p>• (5) Pocahontas - Feed a wild animal while high. </p>\n\n<p>• (5) Pocky - Smoke weed while watching a genuine Japanese anime. </p>\n\n<p>• (5) Power Outage - Listen to acoustic music non-stop while high. </p>\n\n<p>• (5) Prometheus - Supply a lighter to a friend in need. </p>\n\n<p>• (5) Receding Hairline - Burn hair while taking a hit. </p>\n\n<p>• (5) Reefer Madness - Get high and exclusively listen to music from the 1930&#39;s. </p>\n\n<p>• (5) Roach Exterminator - Smoke a full bowl with the weed from roaches. </p>\n\n<p>• (5) Rope Adventure - Find a rope and climb out of a second-story window or higher, while high.* </p>\n\n<p>• (5) Rugged Smoker - Smoke during a hiking trip/camping trip/etc. </p>\n\n<p>• (5) S on my Chest - Superman a roach. </p>\n\n<p>• (5) SHAZAM! - Smoke in a lightning storm. </p>\n\n<p>• (5) Sk8r - Go skateboarding while high. </p>\n\n<p>• (5) Sly Dog - Get high less than 24 hours before a drug test, and pass.* </p>\n\n<p>• (5) Smart Shopping - Go impulse shopping while baked. </p>\n\n<p>• (5) Smoke N&#39; Mate - Take a hit during sex </p>\n\n<p>• (5) Sneaky - Successfully get a Medical Marijuana card without having any real medical problem.* </p>\n\n<p>• (5) Soak and Toke - Smoke a bong while taking a bubble bath. </p>\n\n<p>• (5) Solar Power - Use a magnifying glass or something similar to take a solar hit. </p>\n\n<p>• (5) Some Minimal Illumination - Smoke in a power outage. </p>\n\n<p>• (5) Sploofin&#39; off - Create and use a sploof </p>\n\n<p>• (5) Squeezing Water from a Stone - Smoke a bowl of resin. </p>\n\n<p>• (5) St. Nick - Smoke on top of your, or a friends rooftop. </p>\n\n<p>• (5) Straight to the floor - Fall asleep right after taking a hit. </p>\n\n<p>• (5) Summon Shenlong - Have a Green Dragon. </p>\n\n<p>• (5) Super Cool Story Bro - Tell a story while high and forget the ending. </p>\n\n<p>• (5) Super Smashed Bros. - Play a Super Smash Bros. tournament while stoned. </p>\n\n<p>• (5) Support our Troops - Get stoned with a member of the military. </p>\n\n<p>• (5) Surf &#39;N&#39; Turf - Smoke on a beach. </p>\n\n<p>• (5) Survivorman - Hot-box a tent. </p>\n\n<p>• (5) Switch Hitter - Be so high that you accidentally hit the wrong side of the joint/blunt. </p>\n\n<p>• (5) Taste Buds - Take a mouth bong hit. </p>\n\n<p>• (5) The Bad Choice - Smoke right before a BBQ. </p>\n\n<p>• (5) The Breath Taker - Marathon a 1g joint by yourself in less than five minutes. </p>\n\n<p>• (5) The Cat&#39;s Meow - Smoke out a cat successfully.* </p>\n\n<p>• (5) The Guru - In a single hit, inhale a joint puff, a blunt puff, a bong hit and a gravity bong hit (May be substituted with reverse gravity). </p>\n\n<p>• (5) The Hat Trick - Jack 3 lighters in one session. </p>\n\n<p>• (5) The Joker - You and your friends laugh so hard you can&#39;t take a hit for more than a minute. </p>\n\n<p>• (5) The Joys of Parenting - Smoke herb you&#39;ve grown yourself. </p>\n\n<p>• (5) The Mummy - Smoke a blunt without an outer leaf and use rolling papers instead. </p>\n\n<p>• (5) The Rick Moranis - Watch all three &quot;Honey I Shrunk the...&quot; movies, Space Balls, and both Ghost Busters in a row, smoking a new session for each movie, and adding an extra bowl to each session. </p>\n\n<p>• (5) The Shaman - Smoke up and enjoy the high in a cave, a Native American teepee, a forest, next to stone age rock paintings, you get the idea, etc. </p>\n\n<p>• (5) The Sloth - Wake up, wake and bake, and any time you sense that you are coming down, smoke more, and sit around and watch TV and eat things. It is not permitted to go outside unless it is only on your porch or into your backyard. </p>\n\n<p>• (5) The Stone(d) Age - Smoke a bowl using only matches and a stone piece. </p>\n\n<p>• (5) The Thing - Smoke in a walk-in freezer. </p>\n\n<p>• (5) Tin man - Use tin foil in a homemade piece.* </p>\n\n<p>• (5) Toy Story - Be high in a children&#39;s toy store. </p>\n\n<p>• (5) Triple OG - Smoke a blunt while sipping hard liquor. </p>\n\n<p>• (5) True Hotboxer - Hot-box in a sauna/steam-room (shower not allowed) then get out feeling the &quot;Ahhhhhhhhhhhhhhhh...&quot; sensation. </p>\n\n<p>• (5) Well, this is ironic and awkward - Take a hit from a mushroom shaped pipe/piece. </p>\n\n<p>• (5) What&#39;s This Safety Thing Do - Fire a gun while stoned, without hurting yourself in the process.* </p>\n\n<p>• (5) White Flag - Inhale a hit from your mouth to your nose. </p>\n\n<p>• (5) Woodstock - Smoke freely at an outdoor music festival. </p>\n\n<p>• (5) What&#39;s up doc? - Make and use a carrot to smoke up, then eat it. All of it. </p>\n\n<p>• (5) You Must First Invent The Universe - Bake a pie containing weed. </p>\n\n<p>• (5) Have &quot;The Talk&quot; with someone - Tell someone about how cool it is that we are just a tiny little planet in one solar system in one galaxy out of a zillion others. </p>\n\n<p>• (5) TAG... you&#39;re IT! - Play children&#39;s&#39; games while high (1-2-3 Ninja, Duck-Duck-Goose, Flashlight tag, Ms. Mary Mack, Rock-Paper-Scissors, ect.) </p>\n\n<p>• (5) Orange = Blue? - Wonder weather different people see the same colors differently. </p>\n\n<p><em>10 points</em></p>\n\n<p>• (10) Honor thy Mother and Father - Get your mommy or daddy some better connections / sell to them. And don&#39;t skimp them too much </p>\n\n<p>• (10) Running Water, Hear my Cry - Smoke weed in the shower while your whole family is in the room next door. Bathroom door must be unlocked. </p>\n\n<p>• (10) 420 Challenge - Smoke 4.20 grams by yourself without leaving your seat. </p>\n\n<p>• (10) Twice a Year - Smoke weed on 4/20 at 4:20(A.M. and P.M.) </p>\n\n<p>• (10) 420/20 Vision - Toke up before going to the eye doctor.* </p>\n\n<p>• (10) A Friend with Weed - Smoke up five friends and get smoked up by five friends. </p>\n\n<p>• (10) Ace of Cakes - Bake a THC infused rainbow cake. </p>\n\n<p>• (10) Across The Universe - Go to a golf driving range while high and hit a ball over 200 yards. </p>\n\n<p>• (10) Ah Grasshopper - Smoke up a teacher/professor. </p>\n\n<p>• (10) All Along The Watchtower - Smoke from a 5+ foot bong. </p>\n\n<p>• (10) American Beauty - Smoke with a friend&#39;s parent. </p>\n\n<p>• (10) Appetizer - Smoke while in line at a drive-thru. </p>\n\n<p>• (10) Apprentice Engineer - Make a bong out of things you find in your shed. </p>\n\n<p>• (10) Bat - Smoke a complete joint while hanging upside down from a tree branch. </p>\n\n<p>• (10) Battle of Wills - Smoke somebody out until they can&#39;t keep smoking. </p>\n\n<p>• (10) Big Lebowski - Go bowling with friends when high. </p>\n\n<p>• (10) Better than a Kegstand - Do a bongstand. </p>\n\n<p>• (10) Blockade Runner - Make it through a security checkpoint/police search with your weed intact.* </p>\n\n<p>• (10) Boulder - Go to Boulder, Colorado for the Legendary 420 Celebration </p>\n\n<p>• (10) Boxed Out - Without smoking get high in a hot boxed area. </p>\n\n<p>• (10) Budder me up - Take a budder hit. </p>\n\n<p>• (10) Candy Man - Make THC Tincture or THC Lollipops </p>\n\n<p>• (10) Cashed - Work an entire shift of your job high. </p>\n\n<p>• (10) Clash of the Titans - Get two people who hate each other to smoke together. </p>\n\n<p>• (10) Coke Fiend - Drink an entire twenty pack of Coca-Cola. (Or Pepsi if you like it more) </p>\n\n<p>• (10) Collect the Dragonballs - Make a gallon of green dragon from old stems. </p>\n\n<p>• (10) Conquistador - Do something you normally would be too scared to do high. </p>\n\n<p>• (10) Cornucopia - Cook an entire thanksgiving dinner, including stuffing, while high. </p>\n\n<p>• (10) Crowd Pleaser - Out hit everyone you smoke with. </p>\n\n<p>• (10) Dick Bong, ace pilot - Buy a bong that is shaped like a fully erect cock. </p>\n\n<p>• (10) D-I-High - Successfully construct flat-pack furniture while high. </p>\n\n<p>• (10) Dissapearing Act- Smoke your whole bag while driving around. </p>\n\n<p>• (10) Doctor&#39;s Orders - Get a permit for medical marijuana. </p>\n\n<p>• (10) Doctors Without Borders - Sell weed and then move onto ADDITIONALLY providing other substances at the same time. </p>\n\n<p>• (10) Double-Jointed - Smoke a joint the size of two regular joints. </p>\n\n<p>• (10) Dude, Where&#39;s my Food - Successfully eat up all the food in your friends house while high.* </p>\n\n<p>• (10) Ebert and Roeper - Watch fifty movies while high with a friend. </p>\n\n<p>• (10) Elementary, my dear Watson - Solve a mystery while high using a sherlock bubbler to smoke with. </p>\n\n<p>• (10) Energizer Bunny - Listen, while high, to a fully-charged portable music player long enough that the batteries die but you do not fall asleep. </p>\n\n<p>• (10) Family Guy - Smoke weed with someone from your immediate family. </p>\n\n<p>• (10) Fat Sack - Buy an ounce. </p>\n\n<p>• (10) Feels Good Man - Have sex while high. </p>\n\n<p>• (10) Fuck Tech Support - Install an operating system into your computer while high, without fucking up once. </p>\n\n<p>• (10) Galileo - Smoke out of a telescope. </p>\n\n<p>• (10) Ganja Guru - Smoke an ounce in the span of a day. </p>\n\n<p>• (10) Garden Gnome - In broad daylight, sit in the middle of your front yard&#39;s garden and smoke a gram from a bong. </p>\n\n<p>• (10) Garden Of Eden - Smoke while nude, with a member of the opposite sex who is also nude. </p>\n\n<p>• (10) Getting Motivated - Smoke at your school, in between classes. </p>\n\n<p>• (10) Gipetto - Design and make a stuffed toy/puppet/robot/figurine while high. </p>\n\n<p>• (10) Good Saamaritan - Find weed in public area. </p>\n\n<p>• (10) Grandma&#39;s Boy - Turn a simple call for some weed into a party at your grandmother&#39;s house. </p>\n\n<p>• (10) Green Ranger - Call greens on ten bowls in a row. </p>\n\n<p>• (10) Hashshashin - Smoke hash on a rooftop while keeping vigilant watch. </p>\n\n<p>• (10) Health Conscious - Own a digital vaporizer. </p>\n\n<p>• (10) Heaven or Hell - Green out then get higher than you were when you got sick. Vomiting due to other drugs does not count towards this achievement. </p>\n\n<p>• (10) High&#39;d in Plain Sight - Smoke in a public place. </p>\n\n<p>• (10) High Roller - Roll 15 blunts in one day. </p>\n\n<p>• (10) HIGH, FAMILY! - Go to a family reunion blazed. </p>\n\n<p>• (10) Higher Education - Take a class at Oaksterdam </p>\n\n<p>• (10) Higher Learning - Go to college lectures baked. </p>\n\n<p>• (10) Hitler&#39;s Favorite - Smoking all day on the 20th of April. </p>\n\n<p>• (10) Humanitarian - Smoke up someone with medical problems (i.e. cancer, m.s., cerebral palsy etc). </p>\n\n<p>• (10) Hungry Man - Eat something with weed/hash in it then smoke weed stronger than the weed/hash in the food you ate. </p>\n\n<p>• (10) I Don&#39;t Even... - Smoke from something made of at least six feet of tape. </p>\n\n<p>• (10) I&#39;m Impressed... - Smoke weed while walking through a city. </p>\n\n<p>• (10) Intruder Alert - Smoke in someone&#39;s yard/house/shed that you do not know, without their permission.*</p>\n\n<p>• (10) Iron Chef - Cook a full meal for several people while baked. </p>\n\n<p>• (10) Iron Man - Smoke in a circle with blunts going around equal to at least half of the people. </p>\n\n<p>• (10) It&#39;s 4:20 Somewhere... - Smoke at 4:20 (AM or PM) in every time zone. </p>\n\n<p>• (10) Johnny Appleseed - Collect at least 4g of seeds and plant them. </p>\n\n<p>• (10) Juelz Santana - Smoke three fat blunts dipped in cough syrup.* </p>\n\n<p>• (10) Just Croisin&#39;, Man - Walk around your neighborhood smoking weed from a croissant. </p>\n\n<p>• (10) Justice League - Assemble a group of adult friends each with different types of pieces (bong, pipe, bubbler, etc) and get high </p>\n\n<p>• (10) Katamari - Roll a resin ball in grinder kief and smoke it. </p>\n\n<p>• (10) Keep it Tight - Roll a blunt that lasts 20+ minutes. </p>\n\n<p>• (10) Kottonmouth King - Smoke 5 bowls without anything to drink. </p>\n\n<p>• (10) Krakatoa - Smoke a volcano modified with a custom 5 foot bag. </p>\n\n<p>• (10) Like Father Like Son - Smoke out one of your parents (not a friends parent, we already have that). </p>\n\n<p>• (10) Lord of the Bongs - Own more than five different non-homemade pieces. Can be bongs, pipes, bubblers, etc. </p>\n\n<p>• (10) M80 - Successfully make Firecrakers </p>\n\n<p>• (10) MacGuyver&#39;s Kid - Make a piece out of a straw, a toothpick, a paperclip, and tinfoil. </p>\n\n<p>• (10) Major Tom - Get high while experiencing no gravity, while feeling that high. </p>\n\n<p>• (10) Medieval Times - Buy some weed with coins only. </p>\n\n<p>• (10) Native Waters - As an adult, return to and smoke in your childhood home. </p>\n\n<p>• (10) NEVAR FORGET - Smoke at a memorial site. </p>\n\n<p>• (10) Not so Green Now! - Buy weed from a dealer without ANY assistance from friends. </p>\n\n<p>• (10) Nug Ninja - Blaze atop a restricted building. </p>\n\n<p>• (10) Out of this world - Take ten gravity bong hits in less then a minute. </p>\n\n<p>• (10) Pay it Forward - Smoke out two people at the same time. </p>\n\n<p>• (10) Perseverance - Complete a tolerance break of a month or more. </p>\n\n<p>• (10) Problem Officer? - Talk to an officer of the law while high.* </p>\n\n<p>• (10) Promised Land - Smoke a joint while walking through Jerusalem.* </p>\n\n<p>• (10) Pwnerer - Beat all your friends at a video game while baked. </p>\n\n<p>• (10) Pyros Have Needs Too - Light up from a flame over 30 cm. More points the closer to 200 C the flame is.* </p>\n\n<p>• (10) Raise and Blaze Weekdays - Wake and bake every day for a week. </p>\n\n<p>• (10) Rehab - Successfully take 3 shots of vodka in between pipe hits without coughing. </p>\n\n<p>• (10) Respect for Thee - In honor of someone smoke an ounce with another person. </p>\n\n<p>• (10) Respect Your Elders - Smoke out someone older than you. </p>\n\n<p>• (10) RIP Jimi - Smoke a bowl at Jimi Hendrix&#39;s grave site. </p>\n\n<p>• (10) Romper Stomper - Get high and drunk simultaneously and then bare knuckle box with a friend.* </p>\n\n<p>• (10) Say Uncle - Smoke out your uncle. </p>\n\n<p>• (10) Sacred Ground - Smoke weed in Amsterdam. </p>\n\n<p>• (10) Scavenger - Get high on resin alone for a week. </p>\n\n<p>• (10) Seasons Bakings - Cook an entire Christmas dinner, including stuffing, while high. </p>\n\n<p>• (10) Shoot &#39;em up - Give a shotgun to more than 5 people in a row. </p>\n\n<p>• (10) Shoppin&#39; With Carlin - Don&#39;t eat for two days, then smoke eight joints, take 500 dollars, and complete a purchase at a supermarket. </p>\n\n<p>• (10) Skywalker - Look for shapes in the clouds with a friend while high </p>\n\n<p>• (10) Smart Shopper - Go into a grocery store baked and don&#39;t buy anything </p>\n\n<p>• (10) Spielberg - Form an entire movie plot in your head while stoned. </p>\n\n<p>• (10) Starving Artist - Create a piece of art while blazed. </p>\n\n<p>• (10) Stoners Delight - Combine four canned foods in your pantry to make a superfood. Extra points go to the obscurity of the combination. </p>\n\n<p>• (10) Strike-out! - Take a hit, down a shot, chug a beer, then exhale. </p>\n\n<p>• (10) Super Blunt - Smoke a blunt with cigar tobacco in it. Super bonus points if you don&#39;t cough once. </p>\n\n<p>• (10) Super Pimp - Get someone so high that you instantly hook up. </p>\n\n<p>• (10) Supra Hasheesha - Distill your own hash, add honey and flavor to make it into a sheesha, then smoke it through a water pipe or hookah. </p>\n\n<p>• (10) Teen Titans - Assemble a group of teenage friends each with their own homemade pieces &amp; cannabis, then get high. </p>\n\n<p>• (10) The Aristocrat - Smoke a wooden pipe while wearing two or all three of these items: waistcoat, monocle, and/or tophat. </p>\n\n<p>• (10) The Author - Write or post a worthy story while baked. </p>\n\n<p>• (10) The Camberwell Carrot - Roll a joint fully utilizing no less than 12 papers. </p>\n\n<p>• (10) The Chosen Few - Form a close clique of pot smoking friends. </p>\n\n<p>• (10) The Collector - Collect at least ten pieces. </p>\n\n<p>• (10) The Entertainer - Smoke before going out on stage. </p>\n\n<p>• (10) The Evil Knievel - Smoke on top of a car with a friend driving you around.* </p>\n\n<p>• (10) The Heartbreaker - Unintentionally break five glass pieces in your lifetime. </p>\n\n<p>• (10) The Italian Job - Eat an entire large pizza by yourself while high. </p>\n\n<p>• (10) The King of Irony - You and two or more friends pull into a rehab parking lot and hot-box the car. </p>\n\n<p>• (10) The Music Man - Have a smoking playlist of at least 250 songs. </p>\n\n<p>• (10) The Pugilist - Get in a fight while high, and win.* </p>\n\n<p>• (10) The Terri Schiavo - Smoke an 8th in eight minutes or less. </p>\n\n<p>• (10) The Viking - Smoke up on any manpowered watercraft. </p>\n\n<p>• (10) The Wizard - Convert any old nerd nostalgic item into a piece i.e.: Lightsaber, N64 Controller, EZ Bake Oven, Super Soaker, Nerf Gun, etc. </p>\n\n<p>• (10) They Can&#39;t Hear You, but They Can Smell ya - Smoke out a deaf person. </p>\n\n<p>• (10) This is Happy - Smoke till you can&#39;t feel feelings anymore. </p>\n\n<p>• (10) Tiger Weeds - Go golfing and play a full 18 holes while stoned. Bonus points if you get a good score. </p>\n\n<p>• (10) Time Traveler - Get so high that you sleep for more than 24 consecutive hours. </p>\n\n<p>• (10) Tip Top Toke - Get high on the top floor of a tall building. </p>\n\n<p>• (10) Travelin&#39; Man - Smoke in at least three different states. </p>\n\n<p>• (10) Triple Six Club - Smoke three blunts and six joints in one session. </p>\n\n<p>• (10) Turning the Donkey Wheel - While driving around baked, teleport your car (get to where you&#39;re driving while you think you&#39;re not heading in the right direction). </p>\n\n<p>• (10) Dak Janiels - Smoke a bong using Jack Daniels as the bongwater.* </p>\n\n<p>• (10) Vesuvius - Use a volcano vaporizer. </p>\n\n<p>• (10) What are Those Goddamn Animals! - Go to the zoo stoned. </p>\n\n<p>• (10) When Life Gives You Lemons.... - Smoke every kind of weed substitute you can find. </p>\n\n<p>• (10) Where is My Mind - Go on a roller coaster high. </p>\n\n<p>• (10) White Collar Crime - Smoke while walking a dog, in a suburban neighborhood. </p>\n\n<p>• (10) Why Hello There - Meet your boyfriend&#39;s/girlfriend&#39;s parents high. </p>\n\n<p>• (10) Wiseau Serious? - Smoke a bowl during a screening of The Room in a crowded theater. Add five points if it&#39;s during the scene where Peter confronts Mark for smoking pot. </p>\n\n<p>• (10) Woodsmith - Smoke out of a pipe you whittled yourself. </p>\n\n<p>• (10) Zombie Jesus - Smoke a bible joint rolled from the page where Jesus is resurrected. </p>\n\n<p>• (10) Zombie - Become so baked that your motor skills are completely dismissed. </p>\n\n<p>• (10) Ratchet Time- Smoke with a nurse. </p>\n\n<p>• (10) Snoopy - Successfully fall asleep on a roof after getting stoned without falling off. Roof must have a slant.* </p>\n\n<p>• (10) Trip To The ER- Smoke with an EMT or Paramedic </p>\n\n<p>• (10) Eat THIS Smoke!- Smoke with a firefighter. </p>\n\n<p>• (10) Jack Bauer - Watch an entire season of &quot;24&quot; in one sitting, smoking in between each episode. </p>\n\n<p>• (10) Jacques Cousteau - take a hit from a diving bell </p>\n\n<p>• (10) Lord of the Leaf - Watch all of the Lord of the Rings movies, including the extras, smoking a bowl with each change of disk, in one sitting. </p>\n\n<p>• (10) Master of Science -Listen to a Carl Sagan lecture and comprehend something new while blazed </p>\n\n<p>• (10) Green IN -Avoid throwing up from too much weed by swallowing your own puke without any escapeing your mouth. </p>\n\n<p>• (10) Smoke and Dagger -Smoke in public using smoking paraphernalia that is disguised (i.e. Fake metal cigarette chillum) </p>\n\n<p>• (10) Dr. Walter Bishop -Solve or discover a solution to a problem/issue high. (preferably if sober individuals cannot or have not found a solution.) </p>\n\n<p><em>15 points</em></p>\n\n<p>• (15) A Walk in the Park - Smoke a joint in a heavily populated park without getting caught.* </p>\n\n<p>• (15) Big Plans - Buy more than a pound -- for youself. </p>\n\n<p>• (15) Boy Meets World - Successfully move out of your parents house without them ever catching you smoking. </p>\n\n<p>• (15) Coyote - Ship or bring weed over a national border.* </p>\n\n<p>• (15) Day Walker - Smoke outside in public during the day. </p>\n\n<p>• (15) Dedicated Few - Smoke with a group of few friends for 4 months straight every day. </p>\n\n<p>• (15) Diversify - Smoke in a circle with at least five people of different nationalities. </p>\n\n<p>• (15) Do You Want Fries With That? - Buy a QP. </p>\n\n<p>• (15) Engineering Doctorate - Make a bong only out of illegal substances. The more illegal, the better.* </p>\n\n<p>• (15) Fire at the Multiplex - Smoke in a theater. </p>\n\n<p>• (15) Doin the Flobot - Ride down the biggest hill in town, no handlebars, stoned out of your mind. </p>\n\n<p>• (15) Gene Splicer - Attempt to conceive a child while high. </p>\n\n<p>• (15) Grandpa Jack - Smoke a bong using Jack Daniels as the bongwater. After you&#39;ve finished the bowl, do shots of the bongwater. </p>\n\n<p>• (15) Happy Birthday Dude - Bake someone a space cake for their birthday. </p>\n\n<p>• (15) Honor Student - Smoke in a school area while kids are playing.* </p>\n\n<p>• (15) Joints a Blazing - Get over 30 people in one house to smoke their own joint. </p>\n\n<p>• (15) Just Like Fort Lewis - Participate in the hot-boxing of a parachute in public.* </p>\n\n<p>• (15) Lucky Number 7 - Smoke seven packed bowls consecutively in one sitting, by yourself. </p>\n\n<p>• (15) Mile High Club - Smoke one mile off the ground. </p>\n\n<p>• (15) Mona Lisa Overdrive - Get blazed on the highway while driving.* </p>\n\n<p>• (15) Mr. America - Smoke in all 50 states. </p>\n\n<p>• (15) Otaku - Marathon a season of any given anime series with a blunt/joint/bowl for each disk. </p>\n\n<p>• (15) Quadriplegic - Smoke 4 joints at the same time and finish them all. </p>\n\n<p>• (15) Reefer Fiend - Smoke more than ten joints in a day. </p>\n\n<p>• (15) The Aristocrats - Convince your stupid friends to do &quot;The Aristocrat&quot; with you. </p>\n\n<p>• (15) The Early Bird - Wake and bake every day for a month. </p>\n\n<p>• (15) The Ounce Challenge - You and another person go against another team of two. Both teams are given an ounce. Whichever team finishes their ounce first wins another ounce. </p>\n\n<p>• (15) The Pro-Marijuana Lobby - Get high on the steps of a capital building.* </p>\n\n<p>• (15) The Snack that Smiles Back -Smoke from a bong with a live goldfish in the water. </p>\n\n<p>• (15) To the Dome - Create a device with which you can inhale smoke directly through your nostrils. </p>\n\n<p>• (15) Vacuum - Smoke a complete joint in one hit. </p>\n\n<p>• (15) Vintage - Smoke out of a piece at least 30 years old. </p>\n\n<p>• (15) Welcome to the Jungle - Grow ten four-foot tall plants.* </p>\n\n<p>• (15) Wheel and Deal - Sell at least an ounce of weed in a 24 hour period. </p>\n\n<p>• (15) When the Clock Strikes - Smoke weed when ever it is 4:20 anywhere in the world for a week. </p>\n\n<p>• (15) World of WeedCraft - Sell your World of Warcraft account and spend all of the earnings on weed. </p>\n\n<p>• (15) Wrecking Ball - Get a gigantic steam roller and get everyone around you wrecked off one bowl pack.</p>\n\n<p>• (15) GrimDank- Play a tabletop wargame stoned out of your gourd (bonus points if you win). </p>\n\n<p>• (15) Holy Smoke - Smoke in a church. Extra points if it&#39;s in a cathedral. </p>\n\n<p>• (15) The Body of Christ - Successfully roll and smoke a cross joint. </p>\n\n<p>• (15) Flower Power - Successfully roll and smoke a Tulip joint. </p>\n\n<p>• (15) The Very Best - Finish a Pokemon game blazed. </p>\n\n<p>• (15) Housekeeping - Clean your entire home while high. </p>\n\n<p>• (15) The Apollo - Entertain and make friends laugh to tears while high. </p>\n\n<p>• (15) The Great Outdoors - Hotbox a canoe. </p>\n\n<p><em>20 points</em></p>\n\n<p>• (20) All Day, Baby... All Day - Roll enough joints to continuously smoke marijuana for an entire day. You must never stop smoking during this period. </p>\n\n<p>• (20) Peacemaker - Break up a fight while high, and then smoke the belligerents out afterwards. </p>\n\n<p>• (20) Bloodshot - Get an ID photo taken while high. Bonus points if it&#39;s an official document: Passport, driver&#39;s license, government department employee ID etc.* </p>\n\n<p>• (20) Boom Shankar - Smoke with an actual Sadhu in India. </p>\n\n<p>• (20) Charm +1 - Get busted smoking weed by the cops, and talk your way out of it.* </p>\n\n<p>• (20) Dead Spaced - In one night, in complete darkness, play through Dead Space and Dead Space 2, taking hits while on elevators/cut-scenes/etc. </p>\n\n<p>• (20) Dope Slope - Roll a blunt and smoke it while snowboarding/skiing all the way down a peak. Add 5 points if the bottom is reached before the blunt is roached. </p>\n\n<p>• (20) Dudes. (aka Gentlemen) - Puff ten or more joints at the same time. </p>\n\n<p>• (20) Groundlings - Perform improv comedy in front of an audience after smoking a lot of weed. </p>\n\n<p>• (20) Groupie Status - Smoke up a musician backstage at a concert. </p>\n\n<p>• (20) Man of the People - Open a dispensary. </p>\n\n<p>• (20) Marathon Man - Spend 12 hours, awake on a single piece of furniture. Weed must be consumed, every hour, for all 12 hours. </p>\n\n<p>• (20) Members Only - Open a Cannabis Club. </p>\n\n<p>• (20) Metal Gear!?!?!?! - Beat the entire Metal Gear Solid series high. Bonus points if you manage to understand any of the story once you beat it (note: actually easier high than when sober). </p>\n\n<p>• (20) Mind Over Matter - Take a 12 gram blunt to the face. </p>\n\n<p>• (20) Parental Control - Get high and chill within 15 feet of 1 or more parents while high. </p>\n\n<p>• (20) Pearls Before Swine - Successfully conduct a sale or purchase of marijuana while a police officer is in the vicinity.* </p>\n\n<p>• (20) Innocent Brownie- Give a hash brownie to a Straight-Edger.* </p>\n\n<p>• (20) Pretty Sneaky - Smoke in the same room as an authority figure of any kind.* </p>\n\n<p>• (20) Shelob - Handle a tarantula while stoned without getting bitten. </p>\n\n<p>• (20) The Professor - Deliver a lecture while stoned. </p>\n\n<p>• (20) Weedeater2k - Consume 2,000 items of cannabinized food. </p>\n\n<p>• (20) Lieutenant Dan - Smoke during a hurricane. </p>\n\n<p>• (20) Capitalist Pig - Smoke a joint in a Walmart garden center. </p>\n\n<p>• (20) Santa Claus - During christmastime, light your smoking devices with a candle. </p>\n\n<p>• (20) Reclaimer - Play through and complete all Bungie made Halo games high. (Halo: Reach, Halo: Combat Evolved, Halo 2, Halo 3, Halo 3: ODST). Bonus points for increased difficulty (Heroic= 10, Legendary= 20). Chronological story order (5). Reduced points for each missing game (-5). </p>\n\n<p><em>30 points</em></p>\n\n<p>• (30 ) Counter Insurgency - Discover and harvest a guerrilla grow. </p>\n\n<p>• (30) Bless Me, Father - Smoke with a Catholic priest. Add an extra twenty-five points for each increase in church rank: monsignor, bishop, archbishop, cardinal, pope. </p>\n\n<p>• (30) Shomer Shabbos - Smoke with an Orthodox Rabbi. </p>\n\n<p>• (30) Citizen Kane - Become at least locally famous for your work in legalization politics. </p>\n\n<p>• (30) God Mode- Smoke with a member of law enforcement (not a narc).* </p>\n\n<p>• (30) IMDB - Watch 420 movies while high. </p>\n\n<p>• (30) Smooth Criminal - Smoke with a cop in the vicinity.* </p>\n\n<p>• (30) Runner&#39;s High - Smoke the night and the morning before you run a half marathon. Extra 10 points if its a full marathon. YOU HAVE TO RUN/ JOG IT, do not walk it. </p>\n\n<p>• (30) Don&#39;t Give a Fuck - Be a police officer yourself, and smoke every day. </p>\n\n<p>• (30) Agu-steal - Smoke enough weed to make 7 full joints in a night, pay for none of it. </p>\n\n<p><em>50 points</em></p>\n\n<p>• (50) Heavyweight Champion- Consume your birthweight in weed. </p>\n\n<p>• (50) Father, Son, and Holy Ghost - Smoke out your fundamentalist Christian father. </p>\n\n<p>• (50) Smoke Fest - Gather some friends, and have everyone buy a quarter and smoke it in one day.</p>\n\n<p>• (50) Joint Genocidist - Smoke 5,359 joints. </p>\n\n<p>• (50) SRS Business - Print a life-size poster of the Stoner Achievements list with check boxes next to each achievement. </p>\n\n<p>• (50) 21 Bowl Salute- You and 20 of your friends light up pipes, bongs, chillums, and/or steamrollers in memory of a lost mutual friend. </p>\n\n<p>• (50) Quiet in the Courtroom - Smoke in the bathroom during a court trial without getting caught. * </p>\n\n<p>• (50) Bonding Time - Do &quot;Parental Control&quot; for at least 30 minutes continuously. </p>\n\n<p>• (50) Fuck The Police - Run and escape from the police, then run and escape from the police again, with the police deploying canines all in the same night.* </p>\n\n<p>• (50) Iron Weed - smoke about a quarter of an ounce of weed the morning before you do an IRONMAN or a Triathalon </p>\n\n<p>• (50) Behind Enemy Lines - Smoke a joint in a police station parking lot. * </p>\n\n<p>• (50) Bein&#39; the Boss - Receiving fellatio/cunnilingus while rolling a joint. </p>\n\n<p>• (50) Holy Smokes Batman! - Smoke in the original batcave set in the Hollywood Hills </p>\n\n<p>• (50) Freud - Smoke a joint while meeting with your drug councilor and not get caught </p>\n\n<p><em>Strain Achievements</em></p>\n\n<p>• (-5) Bobby Brown Blues - Smoke any strain of reggie out of tinfoil (includes glass pieces with tinfoil bowls).</p>\n\n<p>• (5) Arctic Fires - Smoking Northern Lights. </p>\n\n<p>• (5) Taste Of Africa - Make edibles with Durban Poison </p>\n\n<p>• (5) Bubbleyum - Smoke some Bubblegum strain. </p>\n\n<p>• (5) Chillin with Jimi - Smoke Purple Haze while listening to Hendrix. </p>\n\n<p>• (5) Eldorado - Smoking a Bowl of Acapulco Gold. </p>\n\n<p>• (5) Finishing Spidey&#39;s Work - Smoke Green Goblin. </p>\n\n<p>• (5) Jacking Off - Jack Herrer + Haze in a blunt. </p>\n\n<p>• (5) First Contact - Smoke some Alien Technology. </p>\n\n<p>• (10) Fruit of the Loom - Smoking Blueberry (any strain), Mango Kush, Strawberry (any strain), Pineapple (any strain) in a Hookah with at least one other stoner. </p>\n\n<p>• (10) Medicine Man - Selling 3 or more strains of Cali medical at once. </p>\n\n<p>• (10) The Variety Show - Smoke at least 3 different strains of weed in one sitting. </p>\n\n<p>• (10) Kush King - Smoke at least 3 different kush strains. </p>\n\n<p>• (10) Purple King - Smoke at least 3 different purple strains. </p>\n\n<p>• (15) Variety Hour - Smoke 6 different strains of bud within 1 hour. </p>\n\n<p>• (20) Homemade Hybrid - Smoke a joint or bowl with pure sativa and pure indica. </p>\n\n<p><em>Stoner Olympics</em></p>\n\n<p>• (15) Stoner Olympics - Start with a joint, move on to a pipe, then a bong, a knifer, and finish off with a massive gravity bong hit. Replace one item with vaporizer if available. </p>\n\n<p>• (20) Bronze Medalist - Complete the Stoner Olympics in less than 10 minutes. </p>\n\n<p>• (30) Silver Medalist - Complete the Stoner Olympics in less than 7 minutes. </p>\n\n<p>• (40) Gold Medalist - Complete the Stoner Olympics in less than 4 minutes. </p>\n\n<p>• (50) Platinum - Earn Gold Medalist. Now, beat your best time. </p>\n\n<p>• (60) Green Medalist - Complete the Stoner Olympics in under 2 and 1/2 minutes. </p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "user_reports": [],
  "over_18": false,
  "score": 26,
  "stickied": false,
  "domain": "self.trees",
  "is_self": true,
  "hidden": false,
  "_orphaned": {},
  "_api_link": "https://api.reddit.com/r/trees/comments/yruxt/what_is_your_stoner_achievement_score/?ref=search_posts",
  "_comments_by_id": {},
  "visited": false,
  "thumbnail": "self",
  "_has_fetched": true,
  "gilded": 0,
  "hide_score": false,
  "_info_url": "https://api.reddit.com/api/info/",
  "created_utc": 1345844946.0,
  "subreddit_id": "t5_2r9vp",
  "id": "yruxt",
  "_params": {},
  "media_embed": {},
  "name": "t3_yruxt",
  "quarantine": false,
  "permalink": "https://www.reddit.com/r/trees/comments/yruxt/what_is_your_stoner_achievement_score/?ref=search_posts",
  "ups": 26,
  "url": "https://www.reddit.com/r/trees/comments/yruxt/what_is_your_stoner_achievement_score/",
  "title": "What is your Stoner Achievement score?"
}