{
  "selftext": "**Verified?** *(This bot cannot verify AMAs just yet)*\n\n**Date:** 2014-05-29\n\n**[Link to submission](http://www.reddit.com/r/IAmA/comments/26skxs/)** (*Has self-text*)\n\n\n\nQuestions|Answers\n:--|:--\n[In short, if your company has organized meetings trying to discourage you from forming a union...then you should form a fucking union. ](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu3i1m?context=5)|Exactly.\n[I read your story in ask reddit, and all I have to say is holy shit.  Have you considered testifying in front of congress?](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu1poe?context=5)|Yep.  I would if asked.  Maybe I should contact Al Franken.\n[If you're Minnesotan give em both a try.  If you're not Minnesotan there's a high chance your letter goes straight in the trash. It's a huge taboo in congress to deal with another member's constituents. ](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chua6f8?context=5)|Funny enough, I'd submitted something earlier this week notifying my Senators about Net Neutrality, and got [this\\] (\\[Link to i.imgur.com](http://i.imgur.com/rXgXB5j.png) about the same time this was posted.  Good times.\n[The shitshow you describe is only going to get worse (esp. if Comcast and TWC are allowed to merge\\).  Please seriously consider finding a political outlet to tell your story.](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/churxb0?context=5)|Will do.\n[How often did you have to lie to customers about their service/speed whatever?  ](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu1u9z?context=5)|I didn't have to outright lie about speed very much.  Most of the problems people called in for were with wireless connectivity, which we did not support.\n |It's a shady, shady game, though.  We'd just have them plug the modem direct into their computer and test it.  That way, it would have just gotten a reboot and any line condition issues wouldn't have enough time to start affecting the service.  I'd ask people to keep it plugged in to the modem for a day to test it because I knew they wouldn't be able to keep it plugged in.  The modem always connected and always resulted in speeds above what they were paying for.\n[Is there such thing as a \"normal call volume\"? Everytime I call they say it is \"higher than normal call volume\".](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu1xkz?context=5)|This is kind of like an ideal setting, where there would be enough reps to cover the volume of calls, provided all the calls are below a certain threshold and there haven't been any significant changes in channel line-ups, bi-annual bill increases, outages or full moons.\n |So never.\n[When I look at my Comcast bill, what's the place they are most likely trying to screw me?  What areas or services, and is there any way to tell?](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu225v?context=5)|You have to write the promotions down when you first arrange for them, then set calendar reminders a month before they expire.  Your bill will not include the timelines for your promotions.  The promotions will start and stop mid-cycle, so the charges may only go up 3.49 on one bill, but then a full 14.99 on the next.\n |Also, this is my favorite curveball to throw at them: The taxes and fees are never itemized, and the pro-rates for the taxes and fees calculations are never printed.  This is the highest potential for shady charges because it can't be scrutinized.  You can't verify their math.  So if you change your services three times in a month, all those charges and credits are hidden.  You only see one number per tax or fee, not three each totaling to a fourth total tax/fee column.  Ask them to break the fees down.  Nobody can do it.  \n[How did you respond when someone asked you to break the taxes or fees down?](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu3l5i?context=5)|Nobody did, thankfully.  Some people pushed about it a little bit, and I'd just tell them those fees are all calculated automatically, subject to change from day to day, etc.  \n[What is the easiest way to get what i want when calling in?](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu22z0?context=5)|Don't expect it to be easy.  It also depends on what you're calling in for.  If you don't want to upgrade or add a line of business, tell them that explicitly at the beginning of the call.\n |Don't yell or swear.  If you do, the resistance will be much, much higher and you probably won't get what you want.  You will get a longer call, longer hold times and complacency.\n[You say that like comcast reps are people and not directly responsible for my problems, thereby deserving of my ire.](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu3t2j?context=5)|It's *like* that, but not like *that*.\n[Do you have to put up with customers who swear? I work in a customer service center (for a much smaller company, mind you\\) but we have permission to hang up on a customer as soon as they swear. ](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chw8ueu?context=5)|Customers can swear all they want at Comcast reps and the reps are not to hang up on the customer under any circumstances.  They can say pretty much anything they want.  As a rep, you can only try and talk them down or sit there and take it.\n[What was the most difficult customer situation that you had to deal with and why?](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu2ryp?context=5)|I worked one Christmas, and received a call from a woman with Internet connectivity problems.  For whatever reason, her modem had taken a crap and wouldn't lock on to the signal.  Her neighborhood was fine, her apartment building was fine, and she only had a single coax jack.\n |She was upset because she was trying to get onto eHarmony to find a date for the night.  She admitted that she was lonely and everybody she knew was out of town, and just wanted somebody to talk to. I knew exactly where the conversation was going, but I let it run its course.  She kept asking if there was anybody in the neighborhood, if there was anything else we could try or test and did not want to let me off the phone.\n |Eventually, she asked what I was doing later that day, and if I'd like to keep her company on the lonely holiday.  I tried to let her down easy, and she took it pretty well, but was still audibly let down.  I don't know why, but that one hit me pretty hard, imagining this woman sitting alone in her apartment with nobody to call and nothing to do.\n |Not my most difficult, necessarily, but definitely one of the most memorable.\n[Jesus...that is terrible.](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chub52e?context=5)|Yeah.  I felt like I should help her out, but what the hell was I supposed to do?  \n[Did she sound hot?](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chub0cq?context=5)|She did not.  She sounded frumpy and sad.\n[Sell her a Triple Play bundle?  S.](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chul7uh?context=5)|Zing!\n[When you rub your nipples, do you use lotion, or petroleum jelly?](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu2uva?context=5)|I don't have a lot of feeling in my nipples, so I don't feel much pleasure in rubbing them.\n |That being said, I imagine I'd probably just use the same silicon lube I use for...other purposes.  \n[Well you don't work for Comcast anymore, so you don't fuck as many people in the ass as before.  ](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu3aae?context=5)|Nor do I take it in the ass nearly as much as I used to.  So it works out.\n[Strallweat's dad misses you.](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chuarbl?context=5)|I'm sure he's fine.  I'm sure there was somebody in my chair before it ever got warm.  \n[I have been on the line for 20 minutes and you haven't answer my question.  My question is, when are you going to take my call?  No, seriously, thank your for doing IAMA and fuck comcast.](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu2plc?context=5)|Please hold.  Angry Birds: Star Wars just got an update and I'm working my way through the new levels.  \n[Gotta do cwazy cupcakes, too. ](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chugg3a?context=5)|Simpsons: Tapped Out, anything by NimbleBit, Fruit Ninja...\n[Sudoku? Flappy birds?](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chuhtuu?context=5)|Yes, and crosswords.  No Flappy Birds. Haven't worked there in over a year now.\n[Do you currently have comcast? are there perks to working for them (free cable/internet\\)?](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu1wks?context=5)|I still begrudgingly subscribe to their Internet service.  And yes, they have great benefits, including complimentary services.\n |Internet was free.  Started out at 6/1 Mbps, by the time I left I was getting 50/10 Mbps for free.\n |Got all the channels in the Digital Premium tier for free, which included all regular channels plus all the premiums (Cinemax, Showtime, HBO, Starz, the Movie Channel (I think?)) which was normally about $129/mo if you paid for it.\n |Phone service was $14.99/mo if you wanted it.\n[Are you getting free services for free even after you left.](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu2kmu?context=5)|Nope.  I pay for service now.  I had free service for the month after I left, but that was it.\n |I did work the, \"I'd like to disconnect my service because it's too expensive\" angle, though, so I'm not paying full price.\n[Daaamn that would be sweet. Did you still have regular plebian comcast problems as well? like did they ever fuck you over while you were in their employ?](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu2gx6?context=5)|I never had an issue beyond the first month when I was missing a single channel.  Tech was out next day, then everything worked great.\n[Also, what do you do now and ow does it compare?](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu2gx6?context=5)|Still have them for Internet, because there's not a viable option that is much cheaper and definitely not nearly fast enough.\n[Did most other billing center employee's follow your managers \"encouragement\"?](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu24zp?context=5)|You know, I was convinced that her role was to weed out the people they didn't want working there any more, but couldn't find a reason to fire.\n |Two of my favorite coworkers quit within a couple months of being on her team because she'd pick one person to rag on, and rag on and rag on until they went away.  They'd just up and \"fuck it\" one day after hearing too much of her shit.\n |That being said, there were quite a few decent people in management roles as well.  \n[Link to www.youtube.com.](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chub104?context=5)|Nailed it.\n[Having worked in call centers, there are many signs that things are going downhill very fast. Did you see any red flags, and why did you stay?](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu29mj?context=5)|When you go through a day and you don't have a single interaction without a canned response.  When autopilot stays on for the full eight or ten hours, that means something is very wrong.\n |I stayed because it was impossible to find another job, and I was trying to go to school so I could get a better job.  Comcast reimbursed you for school expenses, up to $3500 but my schedule changed every 6 months so I couldn't be sure if I was ever going to be able to finish a class when I started.  Also had to work a year after being reimbursed otherwise you have to pay that sum back.  \n[\"When you go through a day and you don't have a single interaction without a canned response.\" Interaction with who? Canned response to what? If you're talking about interacting with customers, what does this have to do with things going downhill?](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chus4v1?context=5)|I guess I took the question as things going downhill with me and the work I'm doing, interacting with customers.\n |Signs that a call center may not be headed in a great direction: lowering or cutting benefits, workloads or responsibilities being shifted to other call centers, group firings/layoffs, focus only on the bottom line and not with customer satisfaction...\n[Yup. I felt dirty asking stuff like that... and the higher ups would act like that was just good business. Creeping on people and asking them personal questions isn't good sales technique IMO.](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chuauso?context=5)|I ran into nothing but problems whenever I tried to use that line on browsing habits.\n |\"What? That's none of your goddamned business!\" (click)\n[How did you end up at the call center? were there any special requirements that had to be met before you could be hired?](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu2j5s?context=5)|You had to kill a puppy in front of it's mother.\n |There weren't a lot of tests or anything before getting hired.  I got an interview because I knew somebody who worked there.  I was almost exclusively self-taught in the tech world, so knowing somebody helped get past the resume/experience hurdle.\n |The interview was by far the strangest I've experienced so far and since.  It was a mass interview, probably 40 or so applicants sitting in a room, and at the head were three people from Comcast.  Then they called us up, one by one and asked three questions.  I remember two of them, \"Tell us about a time you went above and beyond to help a customer,\" and, \"Why should we hire you?\"\n |These were the wrong people to be putting in front of a room.  These were quiet nerds applying for a job taking phone calls, not public speaking.  Almost everybody had shaky knees, stuttered or said, \"Umm\" a lot.  There were some really bad answers, which helped me out a lot.  Once everybody got their chance to stand up front and be judged, the three panelists up and left without a word.  After about ten minutes, they came back in and thanked us all for our time, then told us to hand over our resumes on our way out.  \"We'll call you.\"\n |They started calling people up, shook their hand and took their resumes until about ten or so people had left, then they shut the door, leaving us there to wonder what the fuck was going on.  About fifteen minutes after *that*, they come back in and tell us we just made it to the next level of the interview process, like we'd won a prize on a gameshow.\n |Then came the tests, which they'd boasted were very good at \"weeding people out\" who couldn't handle the math of retail.  It was 45 minutes of basic addition and subtraction.  That's it.  I had to wait 45 more minutes because there weren't enough computers.  We were all given the option to come back later and take the tests if we didn't have time to wait.  At this point it'd been about three hours.  I later learned that anybody who didn't wait around was not called back.\n |A scant four hours later, I left, exhausted and confused.  There was another, more traditional in-person interview followed by one more phone interview with a higher-up.  Two months after I applied, I was hired.\n |I also learned that this process was only used for about six months and was basically a big HR experiment.  Just weird.\n[What percentage of your calls are normal/standard \"how to\" or \"how can I find this\" or \"what is this\"? And what percentage is pissed off people that their service got disconnected/is too expensive/can't figure out how to work the TV?](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu2aim?context=5)|Most people are in completely over their heads when it comes to technology.  People want the new devices with all the bells and whistles, but they don't understand how it works, even on the most basic level.\n |A great example is older/elderly people and HDTV's.  These giant, high-def TV's are great for them because they can see the picture better and actually follow what's going on, but the remotes for these things are ridiculous and require a two week course to figure out how to operate them.  The TV's buttons are all hidden as well, either behind the side or on the bottom of the display.  They may as well be trying to fly the Enterprise.\n |Even with routers, people don't really get it.  They think they can just plug things in and their computer will just figure it all out.  Nevermind that you have to set up a network, configure it, then go to each of your devices and connect to it individually.  You can't just bring it home, leave it in the box and have it magically make your house wireless.  Yes, this happens fairly often.\n[\"Well, what browser are you using?\"](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu3bhb?context=5)|\"Are you using a Windows computer or a Mac?\"\n[\"The internet\"](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu3bhb?context=5)|\"Laptop!\"  Face, meet palm.  This is going to be a long call.\n[I worked in a call center for 4 years, asked that question (\"What browser are you using?\"\\) many times, and the top two responses were: \"I don't know\" and \"Yahoo\"](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chupaq2?context=5)|A lot of the time it came down to, \"DO YOU CLICK ON THE BIG, BLUE E TO GET TO INTERNET?\" Like speaking in cave-man to somebody very far away.\n[Often times when they responded with \"I don't know\" they would some times follow it with \"the one that came with the computer\". Now, chances are it's Internet Explorer, but after all it was an iFruit phone call center so I would ask \"are you on a PC or a Mac?\" and the fuckers would respond with \"I don't know\" they would some times follow it with \"whats the difference?\" FUCK MY LIFE! ](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chupaq2?context=5)|The other thing that always baffled me was our customers' lack of what I call \"lateral movement\" on the Internet.  They would sit down at their computer, click the big blue E, page opens to comcast.net, then they click email to check their email.  Once they're done, they close IE, then click the big blue E again and read the news and weather on comcast.net.  Then they close it and that's it.  That's the extent of their Internet usage.  The page had a Google search bar at the top, beckoning them to any other site in the world, but they were content to stay within the realm of Comcast, a la the early days of AOL and Prodigy.\n[Were you actively trained to avoid fixing or dodge  any kind of particular problem/complaint?](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu2b8n?context=5)|When I was working in technical support, absolutely.  I blamed the wireless connection most.  My mantra was \"Bypass the Router.\"  It worked most of the time, and got most people off the phone more quickly.\n |However, if the diagnostics software showed a bad signal or intermittent connection, then I was directed to deal with that.  I didn't try to blame that on the router or the material in their walls blocking the wireless signal.  Then I had them bypass splitters, try different jacks, etc.  When we could see it was a signal issue or our equipment, we were to fix our side of it.\n[Coming from a tech support rep; it's not shady.  If you have no/intermittent wireless connection because of the $15 Dlink router you bought from the bargain bin at Best buy, there isn't much you can do about it.](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chuant1?context=5)|*$15 Belkin router you bought at that garage sale last weekend.\n[I work for a different provider. Had some call in recently who had wifi (not ours\\) connection issues...not even getting signal a foot away. She'd been calling for six months and was on her sixth router at this point. We changed the wifi broadcast channel and presto she can connect anywhere. Turns out it was interference from baby monitors. Not a problem with wifi or the internet but because router support does not exist in any meaningful way for consumers its up to the rare competent tech at an ISP that will go above and beyond what their company is responsible for.  Tldr; if your microwave breaks do you call the electric company? ](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chv33w8?context=5)|If your car breaks down do you take it to the last station you filled your tires at?\n[My experience with customer service is that there's always that one common question that made you roll your eyes. What was that one question that you hated getting? ](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu2fjh?context=5)|People asking about what caused an outage.  People with no technical background, nor understanding, nor frame of reference.\n |I tried telling people the truth, tried getting overly technical, tried in layman's terms and it all seemed to only piss them off.  Eventually I just settled on telling them that some drunk guy ran into one of our utility poles.  That seemed to make people happy.  It was something they could relate to, somebody they couldn't direct their ire at.\n |\"It says click next to continue.  Do I click next?\"\n[Would you say that working tech support increases coffee or alcohol consumption more?](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu3ac5?context=5)|Um, yes.  All substance intake and abuse increased exponentially the longer I worked there.\n[Well, I know that Chad Vader is a day shift manager at a grocery store.  Link to www.youtube.com.](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu4si5?context=5)|I met Mike Nelson a while ago at my job before Comcast, got to thank him for MST3K and noted I'd seen Chad Vader on Riff Trax and found it funny.  He was much more excited that I'd seen Chad Vader than his previous, more prominent show.\n[Can someone explain to me why people still use Comcast services? I'm not from the US but it seems all everybody does is complain about how shitty they are, why do you keep going back? ](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu3c0h?context=5)|The same reason people shop at Walmart and buy from other shady, shitty companies.  It's money.  People have their beliefs but aren't willing to pay a little more or sacrifice a little service to support a better company.\n |I still have Comcast and my phone provider is Verizon, so I'm right there with them.  It's a tough habit to break.\n[In the most recent years as things turned for the worse, what was the ratio of horrible money-grubbing managers like in your story to decent managers that cared about the customer?](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu251r?context=5)|Most cared quite a bit, and wanted to do right by the customer as much as they could.  Some of them should not have been in management roles.\n |I had some supervisors who I respected very much, who would go above and beyond in assisting people to make sure they got what they were promised.  However, as time went on, I did see less and less of this.\n[What happens on your end when you have to deal with a customer who has install problems and what about the 2hour install guarante?or is the we screwed up thing just a joke?](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu6ml4?context=5)|I responded to a bunch of these while waiting for the post to come back up and it looks like none of the comments saved.  Dammit.\n[Do you, the reps laugh at people calling in who have serious legit problems or do reps feel bad because you can't help the customers?](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu6ml4?context=5)|The tech is supposed to apply the code, but they usually don't because that counts against their total credited dollars per month, and they get a ding for being late.  Sometimes they note it, but most of the time they put all the responsibility on the customer to call in, because they more than likely will not call in.\n[What happens when an install tech tries to get money on site for an install?](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu6ml4?context=5)|Most people will apply the credit, even though they don't want to.\n[Thank you, sounds like my local comcast are jerks,i'm still missing like a hundred dollars in credit and I have called multiple times to get it fixed and still nothing on the install tech that wanted cash in hand to do the install. ](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chugvqx?context=5)|May have written this on my other post in AskReddit, but document as much as you can every time you call.  Date, time, name of the person you deal with, where their call center is located, and if you're speaking with somebody overseas, don't even bother.  They can't transfer you to a domestic center.  You'll just have to call back.  All calls are recorded, so the more information you have, the easier it will be for them to look it up and review it.  Most of the time, depending on the amount, they won't even look it up if you have it documented well enough.  \n[How can I get free stuff and/or discounted rates?](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu38l6?context=5)|Get a job at Comcast and you'll get free Internet and TV service.  Except that you have to sacrifice your soul.\n |As for discounts, just call every once in a while and say you're going to switch to another company because they're cheaper.  Should work most of the time.  \n[Is it true that you guys rub your nipples when you rip someone off like that South Park episode?](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chugo3i?context=5)|Not at my level, but I'm sure the higher ups may have some kind of similar ritual.\n[As a rep did you hate the customers as much as they hated you?](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chuctik?context=5)|Not as a rule, no.  There were quite a few people I liked talking to.\n |One guy, after I helped fixed his Internet connection, thanked me profusely for fixing his \"porn box.\"  There were a lot of understanding, decent people I spoke with.  \n[Do you have an experience with a rude customer that you remember?](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chuht7k?context=5)|There were plenty of rude customers, but most of them kind of fade into one, big gelatinous blob of rage after a while.\n |One that stood out was a guy who called in with issues with his DVR.  He said he'd just gotten it home after swapping it out at a service center.  The last rep told him that the signal he'd just sent to activate could take up to two hours, which was insane.  I figured it was reasonable for him to be upset, then I looked through the previous notes where he was noted as being very angry, short-temptered, insulting and uncooperative.  All things that were not supposed to be noted, but were noted all the same.\n |Every question I asked him, he either dismissed and insisted he didn't have to answer that because he's already told us before, or he would answer with a question. He wouldn't tell me what the display on the DVR read, he wouldn't tell me what lights are on, and when I asked him not to turn the box on because it needs time to boot up and load everything, he'd turn it on anyway and start going through the channels and telling me, one by one, that it didn't work.  2!  Off.  3!  Off.  4! Off. 5! Off...etc.\n |Just like the notes said, he became increasingly aggravated and starting swearing a lot, talking about how they hire idiots and that's why nothing ever works, and what the hell is wrong with me that I can't activate a simple box.  I did what I always did when people started swearing, \"Sir, I understand that you're frustrated and I'm sorry that the box isn't working, but I would appreciate it if you could stop cursing so we can get this working.\"  I hear a pause, gears grinding, then he responds,\n |\"Fuck.  You.\"  I want to crawl through the phone and kick him in the throat, but I can't, so I start to respond, \"Is that how you really talk to people-\" and he hangs up.\n |So, for the next, oh, three or four months I would log in to his account on our diagnostics system and send random signals to reset it and clear any custom settings.  Every night.  I also did some online research and found that he operated a liquor store near where I lived, where mice poop had been reported by several customers and they received similar treatment to what I'd endured.  So I made sure that found it's way to the inspection folks at the city, Yelp, Foursquare, Google Places, anywhere I could post it.  \n[*\"Fuck. You.\" I want to crawl through the phone and kick him in the throat, but I can't, so I start to respond, \"Is that how you really talk to people-\" and he hangs up.*](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chumn8t?context=5)|It was.  He was also the third in a stream of absolute dickheads, so the feelings were augmented. Even so, I didn't feel bad about it, not even one time. I don't need you to respond to this, but when we started to support other areas, like Seattle, Portland, Bay Area, Denver, Houston, etc, I kinda figured the most difficult people would be in California and/or Houston. I was wrong.  All the douche-nozzles were in Colorado.  Consistently the most self-entitled, ignorant assholes I've ever spoken with.  Some nice people, sure, but mostly just terrible human beings.\n[That's a bit... extreme. The most I've done was for 2 days to a woman in TX, BOTs to SAs.](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chumn8t?context=5)| \n[Why is it cheaper to get a bundle package of WiFi and cable instead of just WiFi? Are cable boxes and DVRs taking up too much real estate in the warehouses? What gives?](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chuh8tk?context=5)|It's an incentive to drive sales.  You're more likely to bundle the two services together if they offer a discount.  They want you to have as many services as possible, so they offer the largest discount on the bundles with the most products.\n[I hear all these bad things about comcast, why do people still stay with it? I understand that in some areas that they might be the only choice, but if everyone in that area quits comcast, that could give rise to a new company..](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu62jy?context=5)|There are usually other options, but nothing really viable.  I think there are more options coming to certain areas, but the larger teleco's seem to respect each other's boundaries because it's easier that way.\n[With Internet Support -- the common fault as I read in the comments is usually related to the persons wireless router, which as you said you don't give support for, and neither does my ISP.](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chufuuv?context=5)|Yes.  It's called a Gateway, and that's what Comcast is pushing out to a lot of people.  One of the main weaknesses of the device is that it's expensive, and if one part of it stops working, say the wireless part or the modem part, you have to replace the whole thing.\n[Is there a push in the industry to make modems and routers one device to give to customers?](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chufuuv?context=5)|Something I'm REALLY surprised people aren't making a bigger stink out of is that on all of the newer Gateways (appx starting at the end of 2012) they broadcast two networks.  One is hidden and the other is your home network.  Eventually, the plan is to activate all the dormant secondary networks to form a mesh network for their mobile wireless product, Xfinity Wifi.  So your gateway will be used by people outside your house and without your knowledge.  This might be the most fucked up move in recent memory.\n[4 and a half years!!! really how or what is it that made you endure that much on such a stressful environment...? perks?](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chudvy8?context=5)|No idea.  Pretty sure I'm a glutton for punishment.  \n[Wut.](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chuu9a2?context=5)|Depending on the model, you can log in remotely if you know the IP address.\n[How much do they control it? As in they simply have access to do it, or they have absolute control over it?](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chuu9a2?context=5)|Well, you can log in on all of them, but some models' login information changes from day to day and is comprised of 16-digit hexadecimal usernames and passwords.\n[I guess I don't understand why idreaminmeme didn't just turn their own wifi on?](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chuu9a2?context=5)|Once logged in, you can see everything about the network.  SSID, encryption key, all the information about the second network, what devices are attached, usage...\n[Have you ever considered the declining conditions of the workers there to be tied into the value of Comcast stock, and the more harshly they treated you (and by extension the customers\\), the more the cost of the stock goes up because of projected 'cost savings'?](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chun4r5?context=5)|There's a correlation, sure, but I don't think that's the sole reason for their financial success.\n |I saw a lot of benefits either slashed or shrink in my time working there.  For the first few years, they supplied us with free bus passes.  Upon learning that this wasn't how things were run in other regions, they decided to stop supplying us with bus passes in order to 'align with corporate goals' and work towards \"One Comcast.\"  They used that shitty excuse to lop off any benefit or expense that they could.\n |Employee discounts also shrunk for things like PPV's,On Demand movies and DVR's went from half off to 20% off last I checked.  Wouldn't want to lose out on that income and give it to employees at cost.  \n[What percentage would you say really needed your help and how much were simply user error?](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chusfu6?context=5)|Tough call.  I would say that if people were to simply read the instructions they were given, or write down what they had to do to fix their problem the last time it happened (power cycle your modem & router) or by just reading what's on their computer, that would probably cut down on 40-50% of calls.  Not even kidding.  That I would call user error.\n |The rest are either legit issues with signal/equipment or people who just aren't educated when it comes to modern computers and technology.\n[Have you found daily life on the outside to be different now that you no longer are in posession of your soul?](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chusn6w?context=5)|I get lost in thought a lot.  I have very little empathy.  But I drink less and I'm not abusing myself as much.\n |I do experience happiness from time to time, but it's ever fleeting.  Maybe that's just life, though.  \n[How much shit am I going to be in when Comcast finds out I haven't seen a bill since signing up 8 months ago?  And I check the website every month and no bill. And it has me listed as having the wrong service, that is in awaiting activation.](http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chuhysp?context=5)|You might be very sad come audit time.  \n\n\n*Last updated: 2014-06-02 14:06 UTC*\n\n*This post was generated by a robot! Send all complaints to [epsy](/message/compose/?to=epsy).*\n\n",
  "gilded": 0,
  "score": 0,
  "removal_reason": null,
  "approved_by": null,
  "created_utc": 1401392249.0,
  "is_self": true,
  "stickied": false,
  "edited": 1401718213.0,
  "distinguished": null,
  "permalink": "https://www.reddit.com/r/tabled/comments/26t92w/table_iama_former_comcast_call_center_rep_for_4/?ref=search_posts",
  "banned_by": null,
  "from_id": null,
  "likes": null,
  "_underscore_names": null,
  "num_reports": null,
  "link_flair_css_class": null,
  "_info_url": "https://api.reddit.com/api/info/",
  "id": "26t92w",
  "archived": true,
  "secure_media": null,
  "from_kind": null,
  "saved": false,
  "domain": "self.tabled",
  "ups": 0,
  "suggested_sort": null,
  "quarantine": false,
  "over_18": false,
  "hide_score": false,
  "url": "https://www.reddit.com/r/tabled/comments/26t92w/table_iama_former_comcast_call_center_rep_for_4/",
  "subreddit_id": "t5_2tkmw",
  "_params": {},
  "_comments": null,
  "_replaced_more": false,
  "_comments_by_id": {},
  "user_reports": [],
  "media_embed": {},
  "created": 1401395849.0,
  "author_flair_text": "",
  "visited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Verified?</strong> <em>(This bot cannot verify AMAs just yet)</em></p>\n\n<p><strong>Date:</strong> 2014-05-29</p>\n\n<p><strong><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/\">Link to submission</a></strong> (<em>Has self-text</em>)</p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Questions</th>\n<th align=\"left\">Answers</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu3i1m?context=5\">In short, if your company has organized meetings trying to discourage you from forming a union...then you should form a fucking union. </a></td>\n<td align=\"left\">Exactly.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu1poe?context=5\">I read your story in ask reddit, and all I have to say is holy shit.  Have you considered testifying in front of congress?</a></td>\n<td align=\"left\">Yep.  I would if asked.  Maybe I should contact Al Franken.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chua6f8?context=5\">If you&#39;re Minnesotan give em both a try.  If you&#39;re not Minnesotan there&#39;s a high chance your letter goes straight in the trash. It&#39;s a huge taboo in congress to deal with another member&#39;s constituents. </a></td>\n<td align=\"left\">Funny enough, I&#39;d submitted something earlier this week notifying my Senators about Net Neutrality, and got <a href=\"http://i.imgur.com/rXgXB5j.png\">this] ([Link to i.imgur.com</a> about the same time this was posted.  Good times.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/churxb0?context=5\">The shitshow you describe is only going to get worse (esp. if Comcast and TWC are allowed to merge).  Please seriously consider finding a political outlet to tell your story.</a></td>\n<td align=\"left\">Will do.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu1u9z?context=5\">How often did you have to lie to customers about their service/speed whatever?  </a></td>\n<td align=\"left\">I didn&#39;t have to outright lie about speed very much.  Most of the problems people called in for were with wireless connectivity, which we did not support.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">It&#39;s a shady, shady game, though.  We&#39;d just have them plug the modem direct into their computer and test it.  That way, it would have just gotten a reboot and any line condition issues wouldn&#39;t have enough time to start affecting the service.  I&#39;d ask people to keep it plugged in to the modem for a day to test it because I knew they wouldn&#39;t be able to keep it plugged in.  The modem always connected and always resulted in speeds above what they were paying for.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu1xkz?context=5\">Is there such thing as a &quot;normal call volume&quot;? Everytime I call they say it is &quot;higher than normal call volume&quot;.</a></td>\n<td align=\"left\">This is kind of like an ideal setting, where there would be enough reps to cover the volume of calls, provided all the calls are below a certain threshold and there haven&#39;t been any significant changes in channel line-ups, bi-annual bill increases, outages or full moons.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">So never.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu225v?context=5\">When I look at my Comcast bill, what&#39;s the place they are most likely trying to screw me?  What areas or services, and is there any way to tell?</a></td>\n<td align=\"left\">You have to write the promotions down when you first arrange for them, then set calendar reminders a month before they expire.  Your bill will not include the timelines for your promotions.  The promotions will start and stop mid-cycle, so the charges may only go up 3.49 on one bill, but then a full 14.99 on the next.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Also, this is my favorite curveball to throw at them: The taxes and fees are never itemized, and the pro-rates for the taxes and fees calculations are never printed.  This is the highest potential for shady charges because it can&#39;t be scrutinized.  You can&#39;t verify their math.  So if you change your services three times in a month, all those charges and credits are hidden.  You only see one number per tax or fee, not three each totaling to a fourth total tax/fee column.  Ask them to break the fees down.  Nobody can do it.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu3l5i?context=5\">How did you respond when someone asked you to break the taxes or fees down?</a></td>\n<td align=\"left\">Nobody did, thankfully.  Some people pushed about it a little bit, and I&#39;d just tell them those fees are all calculated automatically, subject to change from day to day, etc.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu22z0?context=5\">What is the easiest way to get what i want when calling in?</a></td>\n<td align=\"left\">Don&#39;t expect it to be easy.  It also depends on what you&#39;re calling in for.  If you don&#39;t want to upgrade or add a line of business, tell them that explicitly at the beginning of the call.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Don&#39;t yell or swear.  If you do, the resistance will be much, much higher and you probably won&#39;t get what you want.  You will get a longer call, longer hold times and complacency.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu3t2j?context=5\">You say that like comcast reps are people and not directly responsible for my problems, thereby deserving of my ire.</a></td>\n<td align=\"left\">It&#39;s <em>like</em> that, but not like <em>that</em>.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chw8ueu?context=5\">Do you have to put up with customers who swear? I work in a customer service center (for a much smaller company, mind you) but we have permission to hang up on a customer as soon as they swear. </a></td>\n<td align=\"left\">Customers can swear all they want at Comcast reps and the reps are not to hang up on the customer under any circumstances.  They can say pretty much anything they want.  As a rep, you can only try and talk them down or sit there and take it.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu2ryp?context=5\">What was the most difficult customer situation that you had to deal with and why?</a></td>\n<td align=\"left\">I worked one Christmas, and received a call from a woman with Internet connectivity problems.  For whatever reason, her modem had taken a crap and wouldn&#39;t lock on to the signal.  Her neighborhood was fine, her apartment building was fine, and she only had a single coax jack.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">She was upset because she was trying to get onto eHarmony to find a date for the night.  She admitted that she was lonely and everybody she knew was out of town, and just wanted somebody to talk to. I knew exactly where the conversation was going, but I let it run its course.  She kept asking if there was anybody in the neighborhood, if there was anything else we could try or test and did not want to let me off the phone.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Eventually, she asked what I was doing later that day, and if I&#39;d like to keep her company on the lonely holiday.  I tried to let her down easy, and she took it pretty well, but was still audibly let down.  I don&#39;t know why, but that one hit me pretty hard, imagining this woman sitting alone in her apartment with nobody to call and nothing to do.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Not my most difficult, necessarily, but definitely one of the most memorable.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chub52e?context=5\">Jesus...that is terrible.</a></td>\n<td align=\"left\">Yeah.  I felt like I should help her out, but what the hell was I supposed to do?</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chub0cq?context=5\">Did she sound hot?</a></td>\n<td align=\"left\">She did not.  She sounded frumpy and sad.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chul7uh?context=5\">Sell her a Triple Play bundle?  S.</a></td>\n<td align=\"left\">Zing!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu2uva?context=5\">When you rub your nipples, do you use lotion, or petroleum jelly?</a></td>\n<td align=\"left\">I don&#39;t have a lot of feeling in my nipples, so I don&#39;t feel much pleasure in rubbing them.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">That being said, I imagine I&#39;d probably just use the same silicon lube I use for...other purposes.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu3aae?context=5\">Well you don&#39;t work for Comcast anymore, so you don&#39;t fuck as many people in the ass as before.  </a></td>\n<td align=\"left\">Nor do I take it in the ass nearly as much as I used to.  So it works out.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chuarbl?context=5\">Strallweat&#39;s dad misses you.</a></td>\n<td align=\"left\">I&#39;m sure he&#39;s fine.  I&#39;m sure there was somebody in my chair before it ever got warm.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu2plc?context=5\">I have been on the line for 20 minutes and you haven&#39;t answer my question.  My question is, when are you going to take my call?  No, seriously, thank your for doing IAMA and fuck comcast.</a></td>\n<td align=\"left\">Please hold.  Angry Birds: Star Wars just got an update and I&#39;m working my way through the new levels.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chugg3a?context=5\">Gotta do cwazy cupcakes, too. </a></td>\n<td align=\"left\">Simpsons: Tapped Out, anything by NimbleBit, Fruit Ninja...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chuhtuu?context=5\">Sudoku? Flappy birds?</a></td>\n<td align=\"left\">Yes, and crosswords.  No Flappy Birds. Haven&#39;t worked there in over a year now.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu1wks?context=5\">Do you currently have comcast? are there perks to working for them (free cable/internet)?</a></td>\n<td align=\"left\">I still begrudgingly subscribe to their Internet service.  And yes, they have great benefits, including complimentary services.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Internet was free.  Started out at 6/1 Mbps, by the time I left I was getting 50/10 Mbps for free.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Got all the channels in the Digital Premium tier for free, which included all regular channels plus all the premiums (Cinemax, Showtime, HBO, Starz, the Movie Channel (I think?)) which was normally about $129/mo if you paid for it.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Phone service was $14.99/mo if you wanted it.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu2kmu?context=5\">Are you getting free services for free even after you left.</a></td>\n<td align=\"left\">Nope.  I pay for service now.  I had free service for the month after I left, but that was it.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I did work the, &quot;I&#39;d like to disconnect my service because it&#39;s too expensive&quot; angle, though, so I&#39;m not paying full price.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu2gx6?context=5\">Daaamn that would be sweet. Did you still have regular plebian comcast problems as well? like did they ever fuck you over while you were in their employ?</a></td>\n<td align=\"left\">I never had an issue beyond the first month when I was missing a single channel.  Tech was out next day, then everything worked great.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu2gx6?context=5\">Also, what do you do now and ow does it compare?</a></td>\n<td align=\"left\">Still have them for Internet, because there&#39;s not a viable option that is much cheaper and definitely not nearly fast enough.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu24zp?context=5\">Did most other billing center employee&#39;s follow your managers &quot;encouragement&quot;?</a></td>\n<td align=\"left\">You know, I was convinced that her role was to weed out the people they didn&#39;t want working there any more, but couldn&#39;t find a reason to fire.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Two of my favorite coworkers quit within a couple months of being on her team because she&#39;d pick one person to rag on, and rag on and rag on until they went away.  They&#39;d just up and &quot;fuck it&quot; one day after hearing too much of her shit.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">That being said, there were quite a few decent people in management roles as well.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chub104?context=5\">Link to www.youtube.com.</a></td>\n<td align=\"left\">Nailed it.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu29mj?context=5\">Having worked in call centers, there are many signs that things are going downhill very fast. Did you see any red flags, and why did you stay?</a></td>\n<td align=\"left\">When you go through a day and you don&#39;t have a single interaction without a canned response.  When autopilot stays on for the full eight or ten hours, that means something is very wrong.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I stayed because it was impossible to find another job, and I was trying to go to school so I could get a better job.  Comcast reimbursed you for school expenses, up to $3500 but my schedule changed every 6 months so I couldn&#39;t be sure if I was ever going to be able to finish a class when I started.  Also had to work a year after being reimbursed otherwise you have to pay that sum back.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chus4v1?context=5\">&quot;When you go through a day and you don&#39;t have a single interaction without a canned response.&quot; Interaction with who? Canned response to what? If you&#39;re talking about interacting with customers, what does this have to do with things going downhill?</a></td>\n<td align=\"left\">I guess I took the question as things going downhill with me and the work I&#39;m doing, interacting with customers.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Signs that a call center may not be headed in a great direction: lowering or cutting benefits, workloads or responsibilities being shifted to other call centers, group firings/layoffs, focus only on the bottom line and not with customer satisfaction...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chuauso?context=5\">Yup. I felt dirty asking stuff like that... and the higher ups would act like that was just good business. Creeping on people and asking them personal questions isn&#39;t good sales technique IMO.</a></td>\n<td align=\"left\">I ran into nothing but problems whenever I tried to use that line on browsing habits.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">&quot;What? That&#39;s none of your goddamned business!&quot; (click)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu2j5s?context=5\">How did you end up at the call center? were there any special requirements that had to be met before you could be hired?</a></td>\n<td align=\"left\">You had to kill a puppy in front of it&#39;s mother.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">There weren&#39;t a lot of tests or anything before getting hired.  I got an interview because I knew somebody who worked there.  I was almost exclusively self-taught in the tech world, so knowing somebody helped get past the resume/experience hurdle.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">The interview was by far the strangest I&#39;ve experienced so far and since.  It was a mass interview, probably 40 or so applicants sitting in a room, and at the head were three people from Comcast.  Then they called us up, one by one and asked three questions.  I remember two of them, &quot;Tell us about a time you went above and beyond to help a customer,&quot; and, &quot;Why should we hire you?&quot;</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">These were the wrong people to be putting in front of a room.  These were quiet nerds applying for a job taking phone calls, not public speaking.  Almost everybody had shaky knees, stuttered or said, &quot;Umm&quot; a lot.  There were some really bad answers, which helped me out a lot.  Once everybody got their chance to stand up front and be judged, the three panelists up and left without a word.  After about ten minutes, they came back in and thanked us all for our time, then told us to hand over our resumes on our way out.  &quot;We&#39;ll call you.&quot;</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">They started calling people up, shook their hand and took their resumes until about ten or so people had left, then they shut the door, leaving us there to wonder what the fuck was going on.  About fifteen minutes after <em>that</em>, they come back in and tell us we just made it to the next level of the interview process, like we&#39;d won a prize on a gameshow.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Then came the tests, which they&#39;d boasted were very good at &quot;weeding people out&quot; who couldn&#39;t handle the math of retail.  It was 45 minutes of basic addition and subtraction.  That&#39;s it.  I had to wait 45 more minutes because there weren&#39;t enough computers.  We were all given the option to come back later and take the tests if we didn&#39;t have time to wait.  At this point it&#39;d been about three hours.  I later learned that anybody who didn&#39;t wait around was not called back.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">A scant four hours later, I left, exhausted and confused.  There was another, more traditional in-person interview followed by one more phone interview with a higher-up.  Two months after I applied, I was hired.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I also learned that this process was only used for about six months and was basically a big HR experiment.  Just weird.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu2aim?context=5\">What percentage of your calls are normal/standard &quot;how to&quot; or &quot;how can I find this&quot; or &quot;what is this&quot;? And what percentage is pissed off people that their service got disconnected/is too expensive/can&#39;t figure out how to work the TV?</a></td>\n<td align=\"left\">Most people are in completely over their heads when it comes to technology.  People want the new devices with all the bells and whistles, but they don&#39;t understand how it works, even on the most basic level.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">A great example is older/elderly people and HDTV&#39;s.  These giant, high-def TV&#39;s are great for them because they can see the picture better and actually follow what&#39;s going on, but the remotes for these things are ridiculous and require a two week course to figure out how to operate them.  The TV&#39;s buttons are all hidden as well, either behind the side or on the bottom of the display.  They may as well be trying to fly the Enterprise.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Even with routers, people don&#39;t really get it.  They think they can just plug things in and their computer will just figure it all out.  Nevermind that you have to set up a network, configure it, then go to each of your devices and connect to it individually.  You can&#39;t just bring it home, leave it in the box and have it magically make your house wireless.  Yes, this happens fairly often.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu3bhb?context=5\">&quot;Well, what browser are you using?&quot;</a></td>\n<td align=\"left\">&quot;Are you using a Windows computer or a Mac?&quot;</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu3bhb?context=5\">&quot;The internet&quot;</a></td>\n<td align=\"left\">&quot;Laptop!&quot;  Face, meet palm.  This is going to be a long call.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chupaq2?context=5\">I worked in a call center for 4 years, asked that question (&quot;What browser are you using?&quot;) many times, and the top two responses were: &quot;I don&#39;t know&quot; and &quot;Yahoo&quot;</a></td>\n<td align=\"left\">A lot of the time it came down to, &quot;DO YOU CLICK ON THE BIG, BLUE E TO GET TO INTERNET?&quot; Like speaking in cave-man to somebody very far away.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chupaq2?context=5\">Often times when they responded with &quot;I don&#39;t know&quot; they would some times follow it with &quot;the one that came with the computer&quot;. Now, chances are it&#39;s Internet Explorer, but after all it was an iFruit phone call center so I would ask &quot;are you on a PC or a Mac?&quot; and the fuckers would respond with &quot;I don&#39;t know&quot; they would some times follow it with &quot;whats the difference?&quot; FUCK MY LIFE! </a></td>\n<td align=\"left\">The other thing that always baffled me was our customers&#39; lack of what I call &quot;lateral movement&quot; on the Internet.  They would sit down at their computer, click the big blue E, page opens to comcast.net, then they click email to check their email.  Once they&#39;re done, they close IE, then click the big blue E again and read the news and weather on comcast.net.  Then they close it and that&#39;s it.  That&#39;s the extent of their Internet usage.  The page had a Google search bar at the top, beckoning them to any other site in the world, but they were content to stay within the realm of Comcast, a la the early days of AOL and Prodigy.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu2b8n?context=5\">Were you actively trained to avoid fixing or dodge  any kind of particular problem/complaint?</a></td>\n<td align=\"left\">When I was working in technical support, absolutely.  I blamed the wireless connection most.  My mantra was &quot;Bypass the Router.&quot;  It worked most of the time, and got most people off the phone more quickly.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">However, if the diagnostics software showed a bad signal or intermittent connection, then I was directed to deal with that.  I didn&#39;t try to blame that on the router or the material in their walls blocking the wireless signal.  Then I had them bypass splitters, try different jacks, etc.  When we could see it was a signal issue or our equipment, we were to fix our side of it.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chuant1?context=5\">Coming from a tech support rep; it&#39;s not shady.  If you have no/intermittent wireless connection because of the $15 Dlink router you bought from the bargain bin at Best buy, there isn&#39;t much you can do about it.</a></td>\n<td align=\"left\">*$15 Belkin router you bought at that garage sale last weekend.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chv33w8?context=5\">I work for a different provider. Had some call in recently who had wifi (not ours) connection issues...not even getting signal a foot away. She&#39;d been calling for six months and was on her sixth router at this point. We changed the wifi broadcast channel and presto she can connect anywhere. Turns out it was interference from baby monitors. Not a problem with wifi or the internet but because router support does not exist in any meaningful way for consumers its up to the rare competent tech at an ISP that will go above and beyond what their company is responsible for.  Tldr; if your microwave breaks do you call the electric company? </a></td>\n<td align=\"left\">If your car breaks down do you take it to the last station you filled your tires at?</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu2fjh?context=5\">My experience with customer service is that there&#39;s always that one common question that made you roll your eyes. What was that one question that you hated getting? </a></td>\n<td align=\"left\">People asking about what caused an outage.  People with no technical background, nor understanding, nor frame of reference.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I tried telling people the truth, tried getting overly technical, tried in layman&#39;s terms and it all seemed to only piss them off.  Eventually I just settled on telling them that some drunk guy ran into one of our utility poles.  That seemed to make people happy.  It was something they could relate to, somebody they couldn&#39;t direct their ire at.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">&quot;It says click next to continue.  Do I click next?&quot;</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu3ac5?context=5\">Would you say that working tech support increases coffee or alcohol consumption more?</a></td>\n<td align=\"left\">Um, yes.  All substance intake and abuse increased exponentially the longer I worked there.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu4si5?context=5\">Well, I know that Chad Vader is a day shift manager at a grocery store.  Link to www.youtube.com.</a></td>\n<td align=\"left\">I met Mike Nelson a while ago at my job before Comcast, got to thank him for MST3K and noted I&#39;d seen Chad Vader on Riff Trax and found it funny.  He was much more excited that I&#39;d seen Chad Vader than his previous, more prominent show.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu3c0h?context=5\">Can someone explain to me why people still use Comcast services? I&#39;m not from the US but it seems all everybody does is complain about how shitty they are, why do you keep going back? </a></td>\n<td align=\"left\">The same reason people shop at Walmart and buy from other shady, shitty companies.  It&#39;s money.  People have their beliefs but aren&#39;t willing to pay a little more or sacrifice a little service to support a better company.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I still have Comcast and my phone provider is Verizon, so I&#39;m right there with them.  It&#39;s a tough habit to break.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu251r?context=5\">In the most recent years as things turned for the worse, what was the ratio of horrible money-grubbing managers like in your story to decent managers that cared about the customer?</a></td>\n<td align=\"left\">Most cared quite a bit, and wanted to do right by the customer as much as they could.  Some of them should not have been in management roles.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I had some supervisors who I respected very much, who would go above and beyond in assisting people to make sure they got what they were promised.  However, as time went on, I did see less and less of this.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu6ml4?context=5\">What happens on your end when you have to deal with a customer who has install problems and what about the 2hour install guarante?or is the we screwed up thing just a joke?</a></td>\n<td align=\"left\">I responded to a bunch of these while waiting for the post to come back up and it looks like none of the comments saved.  Dammit.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu6ml4?context=5\">Do you, the reps laugh at people calling in who have serious legit problems or do reps feel bad because you can&#39;t help the customers?</a></td>\n<td align=\"left\">The tech is supposed to apply the code, but they usually don&#39;t because that counts against their total credited dollars per month, and they get a ding for being late.  Sometimes they note it, but most of the time they put all the responsibility on the customer to call in, because they more than likely will not call in.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu6ml4?context=5\">What happens when an install tech tries to get money on site for an install?</a></td>\n<td align=\"left\">Most people will apply the credit, even though they don&#39;t want to.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chugvqx?context=5\">Thank you, sounds like my local comcast are jerks,i&#39;m still missing like a hundred dollars in credit and I have called multiple times to get it fixed and still nothing on the install tech that wanted cash in hand to do the install. </a></td>\n<td align=\"left\">May have written this on my other post in AskReddit, but document as much as you can every time you call.  Date, time, name of the person you deal with, where their call center is located, and if you&#39;re speaking with somebody overseas, don&#39;t even bother.  They can&#39;t transfer you to a domestic center.  You&#39;ll just have to call back.  All calls are recorded, so the more information you have, the easier it will be for them to look it up and review it.  Most of the time, depending on the amount, they won&#39;t even look it up if you have it documented well enough.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu38l6?context=5\">How can I get free stuff and/or discounted rates?</a></td>\n<td align=\"left\">Get a job at Comcast and you&#39;ll get free Internet and TV service.  Except that you have to sacrifice your soul.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">As for discounts, just call every once in a while and say you&#39;re going to switch to another company because they&#39;re cheaper.  Should work most of the time.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chugo3i?context=5\">Is it true that you guys rub your nipples when you rip someone off like that South Park episode?</a></td>\n<td align=\"left\">Not at my level, but I&#39;m sure the higher ups may have some kind of similar ritual.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chuctik?context=5\">As a rep did you hate the customers as much as they hated you?</a></td>\n<td align=\"left\">Not as a rule, no.  There were quite a few people I liked talking to.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">One guy, after I helped fixed his Internet connection, thanked me profusely for fixing his &quot;porn box.&quot;  There were a lot of understanding, decent people I spoke with.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chuht7k?context=5\">Do you have an experience with a rude customer that you remember?</a></td>\n<td align=\"left\">There were plenty of rude customers, but most of them kind of fade into one, big gelatinous blob of rage after a while.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">One that stood out was a guy who called in with issues with his DVR.  He said he&#39;d just gotten it home after swapping it out at a service center.  The last rep told him that the signal he&#39;d just sent to activate could take up to two hours, which was insane.  I figured it was reasonable for him to be upset, then I looked through the previous notes where he was noted as being very angry, short-temptered, insulting and uncooperative.  All things that were not supposed to be noted, but were noted all the same.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Every question I asked him, he either dismissed and insisted he didn&#39;t have to answer that because he&#39;s already told us before, or he would answer with a question. He wouldn&#39;t tell me what the display on the DVR read, he wouldn&#39;t tell me what lights are on, and when I asked him not to turn the box on because it needs time to boot up and load everything, he&#39;d turn it on anyway and start going through the channels and telling me, one by one, that it didn&#39;t work.  2!  Off.  3!  Off.  4! Off. 5! Off...etc.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Just like the notes said, he became increasingly aggravated and starting swearing a lot, talking about how they hire idiots and that&#39;s why nothing ever works, and what the hell is wrong with me that I can&#39;t activate a simple box.  I did what I always did when people started swearing, &quot;Sir, I understand that you&#39;re frustrated and I&#39;m sorry that the box isn&#39;t working, but I would appreciate it if you could stop cursing so we can get this working.&quot;  I hear a pause, gears grinding, then he responds,</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">&quot;Fuck.  You.&quot;  I want to crawl through the phone and kick him in the throat, but I can&#39;t, so I start to respond, &quot;Is that how you really talk to people-&quot; and he hangs up.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">So, for the next, oh, three or four months I would log in to his account on our diagnostics system and send random signals to reset it and clear any custom settings.  Every night.  I also did some online research and found that he operated a liquor store near where I lived, where mice poop had been reported by several customers and they received similar treatment to what I&#39;d endured.  So I made sure that found it&#39;s way to the inspection folks at the city, Yelp, Foursquare, Google Places, anywhere I could post it.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chumn8t?context=5\"><em>&quot;Fuck. You.&quot; I want to crawl through the phone and kick him in the throat, but I can&#39;t, so I start to respond, &quot;Is that how you really talk to people-&quot; and he hangs up.</em></a></td>\n<td align=\"left\">It was.  He was also the third in a stream of absolute dickheads, so the feelings were augmented. Even so, I didn&#39;t feel bad about it, not even one time. I don&#39;t need you to respond to this, but when we started to support other areas, like Seattle, Portland, Bay Area, Denver, Houston, etc, I kinda figured the most difficult people would be in California and/or Houston. I was wrong.  All the douche-nozzles were in Colorado.  Consistently the most self-entitled, ignorant assholes I&#39;ve ever spoken with.  Some nice people, sure, but mostly just terrible human beings.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chumn8t?context=5\">That&#39;s a bit... extreme. The most I&#39;ve done was for 2 days to a woman in TX, BOTs to SAs.</a></td>\n<td align=\"left\"></td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chuh8tk?context=5\">Why is it cheaper to get a bundle package of WiFi and cable instead of just WiFi? Are cable boxes and DVRs taking up too much real estate in the warehouses? What gives?</a></td>\n<td align=\"left\">It&#39;s an incentive to drive sales.  You&#39;re more likely to bundle the two services together if they offer a discount.  They want you to have as many services as possible, so they offer the largest discount on the bundles with the most products.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chu62jy?context=5\">I hear all these bad things about comcast, why do people still stay with it? I understand that in some areas that they might be the only choice, but if everyone in that area quits comcast, that could give rise to a new company..</a></td>\n<td align=\"left\">There are usually other options, but nothing really viable.  I think there are more options coming to certain areas, but the larger teleco&#39;s seem to respect each other&#39;s boundaries because it&#39;s easier that way.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chufuuv?context=5\">With Internet Support -- the common fault as I read in the comments is usually related to the persons wireless router, which as you said you don&#39;t give support for, and neither does my ISP.</a></td>\n<td align=\"left\">Yes.  It&#39;s called a Gateway, and that&#39;s what Comcast is pushing out to a lot of people.  One of the main weaknesses of the device is that it&#39;s expensive, and if one part of it stops working, say the wireless part or the modem part, you have to replace the whole thing.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chufuuv?context=5\">Is there a push in the industry to make modems and routers one device to give to customers?</a></td>\n<td align=\"left\">Something I&#39;m REALLY surprised people aren&#39;t making a bigger stink out of is that on all of the newer Gateways (appx starting at the end of 2012) they broadcast two networks.  One is hidden and the other is your home network.  Eventually, the plan is to activate all the dormant secondary networks to form a mesh network for their mobile wireless product, Xfinity Wifi.  So your gateway will be used by people outside your house and without your knowledge.  This might be the most fucked up move in recent memory.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chudvy8?context=5\">4 and a half years!!! really how or what is it that made you endure that much on such a stressful environment...? perks?</a></td>\n<td align=\"left\">No idea.  Pretty sure I&#39;m a glutton for punishment.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chuu9a2?context=5\">Wut.</a></td>\n<td align=\"left\">Depending on the model, you can log in remotely if you know the IP address.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chuu9a2?context=5\">How much do they control it? As in they simply have access to do it, or they have absolute control over it?</a></td>\n<td align=\"left\">Well, you can log in on all of them, but some models&#39; login information changes from day to day and is comprised of 16-digit hexadecimal usernames and passwords.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chuu9a2?context=5\">I guess I don&#39;t understand why idreaminmeme didn&#39;t just turn their own wifi on?</a></td>\n<td align=\"left\">Once logged in, you can see everything about the network.  SSID, encryption key, all the information about the second network, what devices are attached, usage...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chun4r5?context=5\">Have you ever considered the declining conditions of the workers there to be tied into the value of Comcast stock, and the more harshly they treated you (and by extension the customers), the more the cost of the stock goes up because of projected &#39;cost savings&#39;?</a></td>\n<td align=\"left\">There&#39;s a correlation, sure, but I don&#39;t think that&#39;s the sole reason for their financial success.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I saw a lot of benefits either slashed or shrink in my time working there.  For the first few years, they supplied us with free bus passes.  Upon learning that this wasn&#39;t how things were run in other regions, they decided to stop supplying us with bus passes in order to &#39;align with corporate goals&#39; and work towards &quot;One Comcast.&quot;  They used that shitty excuse to lop off any benefit or expense that they could.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Employee discounts also shrunk for things like PPV&#39;s,On Demand movies and DVR&#39;s went from half off to 20% off last I checked.  Wouldn&#39;t want to lose out on that income and give it to employees at cost.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chusfu6?context=5\">What percentage would you say really needed your help and how much were simply user error?</a></td>\n<td align=\"left\">Tough call.  I would say that if people were to simply read the instructions they were given, or write down what they had to do to fix their problem the last time it happened (power cycle your modem &amp; router) or by just reading what&#39;s on their computer, that would probably cut down on 40-50% of calls.  Not even kidding.  That I would call user error.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">The rest are either legit issues with signal/equipment or people who just aren&#39;t educated when it comes to modern computers and technology.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chusn6w?context=5\">Have you found daily life on the outside to be different now that you no longer are in posession of your soul?</a></td>\n<td align=\"left\">I get lost in thought a lot.  I have very little empathy.  But I drink less and I&#39;m not abusing myself as much.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I do experience happiness from time to time, but it&#39;s ever fleeting.  Maybe that&#39;s just life, though.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/26skxs/iama_former_comcast_call_center_rep_for_4_12/chuhysp?context=5\">How much shit am I going to be in when Comcast finds out I haven&#39;t seen a bill since signing up 8 months ago?  And I check the website every month and no bill. And it has me listed as having the wrong service, that is in awaiting activation.</a></td>\n<td align=\"left\">You might be very sad come audit time.</td>\n</tr>\n</tbody></table>\n\n<p><em>Last updated: 2014-06-02 14:06 UTC</em></p>\n\n<p><em>This post was generated by a robot! Send all complaints to <a href=\"/message/compose/?to=epsy\">epsy</a>.</em></p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "_comment_sort": null,
  "report_reasons": null,
  "name": "t3_26t92w",
  "from": null,
  "hidden": false,
  "clicked": false,
  "media": null,
  "json_dict": null,
  "_api_link": "https://api.reddit.com/r/tabled/comments/26t92w/table_iama_former_comcast_call_center_rep_for_4/?ref=search_posts",
  "secure_media_embed": {},
  "mod_reports": [],
  "_orphaned": {},
  "_uniq": null,
  "num_comments": 0,
  "link_flair_text": null,
  "title": "[Table] IamA former Comcast Call Center Rep for 4 1/2 years. AMA!",
  "_has_fetched": true,
  "author_flair_css_class": "tabler",
  "thumbnail": ""
}