{
  "selftext": "Here was the post:\n\nKyle Mile: Every morning there is a murder in ____________.\nOne murder every morning.\nAre the murderers taking turns or something?\nWhy not five on Monday and none for the rest of the week?\nEither coincidence or maybe the media picks out the \"best \" murder and the rest don't deserve air time. Happy to be OTP.\n\nComments that scare the shit out of me and that I was responding to:\n\nJoe Blow: And it seems they are always in one of about three general areas.. should we discuss similarities of the individuals them selves.....???\n\nJane Gain: We were in _________ this past weekend I will honestly say I was not comfortable.\n\nKyle Mile:  Do they have categories? B on B, B on W, b on H, etc. ? I wonder how they pick which murder to air? Lottery maybe? Folks in Atlanta love the lottery!\n\nMary Hairy: d you hear about the black sit ins in _________ eateries at Sunday brunch trying to intimidate the white customers. They we promoting black lives matter. Neil Boertz split out the __________ statistics 90 something % b on b only 2% involve whites. I thought they should take their message to the schools.\n\nTom Com: Black democrats running (ruining) ______. *MLB Team* even want out. I work in South West_________ once a month and it's scary down there. Third most dangerous neighborhood in America.\n\nCat Picture Lady: What I would like to ask these pesky black protesters is this, \"If 'black lives matter' so much, then why have more black babies have been sucked into a sink in the US than have been born?\"\n\nJake Flake:  I loved living up near Lake ________ , but after 22 years, it got old also. the 4 mile, 6 minute commute to work turned into a 15 to 20 minute ride. Every time I watched the news, it wasn't a matter if there was a murder, but how many? I now live down in central _____ and hang at Lake _________ when I'm not here, working my business. Life is much easier and way less stressful. My fear, while living up there was if the $#!t were to ever hit the fan, how would I get back down here to my family...\n\n\n**First Comment; posted** \n\nOn that subject, NYC went 12 days w/o a single murder case this year!\n\t\n\n**Second comment; not posted**\n\n  I hate being the devil's advocate, but not taking into consideration all the variables when analyzing and forming opinions of the black community is very dangerous, in a fascist way. I will agree with anyone that says that they have the ability--just like every other person--to better their community. I will also agree with anyone that says many blacks have racist beliefs for whites. I will also agree it is time for black communities to stop using events such as slavery, Jim Crow, and Ferguson/Zimmerman to justify inhumane ideology, actions, and distancing themselves from other Americans. But, seeing theft, murder, rape, and illegal profit-industries (prostitution/drugs) not as an effect of poverty but rather as an effect of being black is extremely dangerous; in a fascist way; for these were the same reasons Arianism bred and the Jews were exterminated.\n\n  I learned on my own (through my stupid actions) that dependency breeds a form of ignorance in people that does not promote an industrious and virtuous mindset and the only way most people will pursue anything is through having their face dragged across the ground while educated enough to pursue better company and opportunity. The black-community is, from the day they are born, seemingly forced into a life where they depend on the federal government: Lyndon Johnson, the Great Society. They are also extremely uneducated, which explains why they have multiple children they can't support and greatly expands their desire for dependency, to commit inhumane actions, and anger towards society due to the inability to comprehend even their own situation. There is also the inability for most to leave their volatile communities due to hatred/fear/anger they can't let go of for whites, and the hatred by their communities for those that do leave and they fear if they fail when they leave they can't come back. \n\n  There are many reasons for these things: The conversion of unions (especially teacher unions) from human right's advocate agencies to political tools by liberal politicians; continued segregation after the Federal mandates; white communities establishing segregation academies to avoid integration; the hip-hop industry deifying the crack-cocaine industry and absolute ignorance; George Bush's \"No Child Left Behind\" keeping these children in schools where teachers preach about their unions yet cutting their federal funding due to low test scores; education systems adopting corporate policies to maximize profit and paying administration outrageous amounts more while slashing the salary of educators leading to educator positions to be filled by those that see it as a last resort; the lack of oversight, regulation, and financial support for the CIA during the Nicaragua revolution leading to them turning a blind eye to massive cocaine exports causing the crack-epidemic (I will agree with anyone that says Communism is an evil ideology that needed to be defeated. I also do not believe the CIA was trying to destroy the black community, but we must address the effects of our actions. Simply put, there was no way to know what would happen when we were fighting (eventually victorious, 'Merica!) the expansion of Communism, but bad things happened which has led to many of our national issues today); and the ability for publicly elected local, state, and federal Representatives to manage school redistricting which allows an 'unofficial' segregation of schools to be used for political purposes. \n\n  The white population, being more educated, are aware and well informed on the political system and make up a vast majority of those who elect public officials. Creating a higher-standard-of-living by unofficial segregation of schools, placing the already educated white students in the same schools leading to more federal funding, and creating economic-racial 'invisible societal lines' so they don't have to deal with the effects of having poverty in their community gains votes and guarantees political careers. Unions support this system by not allowing students to leave their district schools under governance legislation they lobbied for to ensure the educators within their union don't lose their job simply so they can continue extracting funds from their salary to fund their own; not for the benefit of the children in these schools. The lavish benefits of being a career politician or having a high-level administration position within a union coupled with ignorance within communities and hatred between different sects of the population makes it far too easy for those that claim responsibility to manage our country to fall under the weight of greed, gluttony, and the benefits of insinuating wrath within their constituents. \n\n  On average, 96% of Congressional, state, and local incumbents of the 21st century are reelected while only 16% of likely U.S. voters think the current Congress is doing a good or excellent job. A majority of Congressmen and women have held their office since the 80's and 90's, and their salary of $129,500 in 1992 has increased to $174,000 in 2009. After 20 years (might be slightly off feel free to fact check) of holding office a Congressman receives 25% of his salary under CSRS and an additional 18% of his salary under FERS plus social security; there are also annual percent increases that are far too intricate for me to understand.\n\n  Following an example from an Senate study which I will source below, a Congressman who has held office for 32 years will receive $89,610 in annual pensions if they decide to retire. This can of course increase the longer they hold office. I would love to provide the annual salary of union administrators but unfortunately that is much harder to find and study and with school I don't have all the time I wish I had to research it. It must also be taken into account that individuals in both positions are receiving funds from multiple interest groups to fund campaigns, personal lives, public projects in representative's districts, and projects/programs within different unions. This leads to their actions to be influenced by the interests of these interest groups; or rather the people who have high amounts of influence within them. \n\n  Back to the subject at hand, the black-community has had 20 to 60 years (depending on what factors you want to consider as provisions for equal opportunity) to have the same level of education as whites while our community has had the opportunity for almost 150 years, due to the increased demand for educated labor during the industrial revolution. The lack of education leads to the inability to compete in our economy, leading to living in poverty due to unemployment, leading to government dependency, inhumane acts to earn money, and overall extreme levels of anger, hostility, and violence. Politicians fall into greed and give to us direct satisfaction to gain votes instead of risking their seat by pushing for complex operations that attempt to address issues which are far too intricate for most to comprehend. They also can not take the actions that they may seem fit due to answer issues because to receive the funds to fuel their campaigns which come from interest groups who contribute they must computed into their actions those groups' interests. \n\n  Because I love some Conservative ideals I want to take a moment to bash the Liberals since this could be seen as a conservo-roast by sensitive red-ties. Liberals are doing extreme damage by increasing welfare program funding, selling them not as welfare programs set up to help those who truly need them for part of their life but as entitlement programs for everyone to live off forever, supporting unions that are obviously corrupt, promoting the ideology that all of society is determined to eradicate racial minorities, and ignoring root causes so that they can continue exploiting the ignorance that comes from the lack of education so that they can get reelected by their votes. Unions are equally corrupt, yet are much harder to find information on due to privacy rights for corporate/(semi)private entities, but I do now have an interest to uncover more about them. From what I have observed I would say they are a breeding ground for greed, and the lack of transparency within their operations provides the ideal environment for those that lack any sense of virtue to expose and exploit those that they say they are their to empower to push their own interests and that of others in the guise of a sheep to receive a portion of the union members' salaries and the funds that interest groups give them. \n\n  The black culture industries (music, television, etc) promote inhumane activity instead of using their position to provide educational information simply because they know that they can generate more profit from an ignorant audience rather than an educated audience. It is much easier to take advantage of through contracts and to find people like Gucci Mane, Waka Flocka, Juicy J, and Young Thug than it is to do the same with people like Jimi Hendrix, Tupac, and Led Zeppelin. They promote the volatile lifestyles because they can pump out their product--at levels never seen before in the entertainment/culture industry--to people whose lack of education allows for their outlook on life to be molded into an extreme, sadistic and ignorant vision which allows for them to be easily influenced to truly believe they can reach unobtainable goals through immoral action, experience happiness only through unlimited consumption, or that greatness is achieved purely through obtaining high levels of wealth. OK, that might be like a lot of the world's issue, but black entertainment is the largest promoter of this culture. Speaking of black entertainment, the executive board of BET is completely white, but that is an entirely different issue I don't want to get into right now. Racism and bigotry and thriving today just as they were 60 years ago; our physical actions may be restricted, but the minds of many are just as dark as they were in the Jim Crow days.\n\n  The majority of the black population is at fault for the way that they live, and I say this because it is also dangerous to turn a blind eye to issues because \"they can't help it\"... because they can. They have the same amount of brain in their skull as anyone else, but for those that aren't black to remain ignorant of the variables puts them equally at fault and can lead to fascist ideals to breed within communities. Even though right now it is just the occasional racially motivated acts of violence, political actions to gain votes by distancing and exploiting blacks, and ignorant music promoting violence and greed there is the ever-growing opportunity for chains of events that resemble historical events of genocide, race wars insinuated by BOTH sides, mass-banishment, and military and/or labor exploitative use of a specific identifiable sect of civilization to occur. \n\n  Politicians, racial ideology (Arianism, Nordicism, etc), the temptation of greed, evil individuals hijacking unions, and the entertainment industry--intentionally or not-- dragged society into the situation that we are in now. The further the divide is drawn between every identifier of people within the country, the easier it is to play at our emotions and to gain control by distracting us with the hatred of one another. Black or White, Straight or Gay, Liberal or Conservative, Christian or Atheist, Union or Laizze Faire, Fraternity or GDI, Middle-Class or Poor, American or Canadian, English or Spanish, Christian or Islam, Extrovert or Introvert, Office Job or Field Job, Homeless or Not, Citizen or Law Enforcement, Army or Navy, Medium-Rare or Well-Done. \nRegardless of what one is we as humans all share the same capacity of intellectual power; the need to eat, sleep, and drink; the desire to experience freedom, to be loved, and to do well for others; and the dreams of a world where war, murder, rape, and abuse are no longer experienced. I mean, unless you are a sadistic and cynical individual, which I greatly hope you are not, and I actually don't believe anyone is 'genetically' or 'naturally' that way, even if they are or were for a time of their life, I believe they have the ability to change. \n\n  Its time to say enough is enough, to research subjects and form our own well-informed opinions, to take Lincoln's advice and ensure that we remain an indivisible country not only territory wise but also culturally wise, to promote the practice of empathy within all people, and to exploit corrupt operations and those who take advantage of others for their benefit. Stalin happened is Russia, Hitler happened in Germany, Moses and his people were enslaved, Cartels are in control of the countries South of our border, people strap bombs to themselves and detonate in city squares, and others fly planes into Naval stations and civilian infrastructure. \n\n  How do people like Stalin, Hitler, and Ramses of Egypt put into action their atrocities? They promoted ignorance, placed industry above human life, fed their people propaganda, and antagonized the population to hate one another to the point where they desired to kill the other. Why was there Kamikazes are there now suicide bombers? Because they are so entrenched in their ideology and beliefs that they not only see what they are doing as the righteous thing to do, but as the only option because they not simply Believe but KNOW that this is how reality operates and their is no other solution. Those who control portions of their lands deify those who do this and label them Martyrs, they make them celebrities and encourage them through the entire process to do so. \n\n  Watch \"The Culture of Suicide Bombers\" on the subject, it brings to light a much deeper rabbit-hole of what suicide bombing is in the Middle East than we are aware of. I will also say that while watching please take into consideration that Pro-Israel agendas may be involved due to the documentary being hosted by an ex-CIA agent, and how the CIA and Mossad (Israel intel agency) are virtually a single agency. The same as one should take into consideration the involvement of GMO corporations and Liberal agendas to shame actions to promote a welfare/dependency society when watching documentaries slamming animal cruelty within the food industry. The inhumane cruelity is an issue and we should find ways to confront it, but the ideals used to expose it should not become dogma and something that should not be questioned or examined for ulterior motives. Suicide bombers and Islamic Wahhabi ideology is an extreme issue, but the ideals used to expose it in \"The Culture of Suicide Bombers\" should also be analyzed for ulterior motives such as the procurement of greater international authority and religious ideology of radical Christians, Jews, and even Hindus. \n\n  Or maybe there is something completely different that you can back with facts, recordings, testimonies, etc. If it can be then bring it to light, I encourage EVERYONE to do their own research and to apply the scientific method when doing so, ensuring the development of logical, honest, and comprehensible opinions. The sign of lies, deceit, and corruption within any system is generally a vast, incomprehensible web of information and much of it unable to access. Either that or it is within covert operations, intelligence agencies, and other things that should not be revealed to protect individuals and their operations. But even then, immoral actions and corruption should be brought to light and there should be multiple layers of oversight conducted by those that we can truly trust due to how they conduct themselves in other situations.\n\n**Sources**\n\n* *Statistic Map of United States Showing Segregation by Race Apparent in Schools Based on Student Racial-Identity Percentages:*\n                                 \n http://www.usatoday.com/story/news/nation-now/2014/05/15/school-segregation-civil-rights-project/9115823/\n\n* *Congressman Retirement:*\n                                                                    \nhttp://www.senate.gov/CRSReports/crs-publish.cfm?pid=%270E%2C*PLC8%22%40%20%20%0A \n\n* *Congressman Salary:*    \n                                                                                                                                                                                                                         http://www.senate.gov/CRSReports/crs-publish.cfm?pid=%27*2%404P%5C%5B%3A%22%40%20%20%0A\n\n* *Congressional Performance:* \n\nhttp://www.rasmussenreports.com/public_content/politics/mood_of_america/congressional_performance \n\n* *CIA, Contra, Cocaine:*      \n                                       \nhttp://nsarchive.gwu.edu/NSAEBB/NSAEBB2/nsaebb2.htm \n\n\n* *Why Finland's schools are successful (hint, no Unions or educator exploitation):* \n\nhttp://www.smithsonianmag.com/innovation/why-are-finlands-schools-successful-49859555/?no-ist\n\n* *New York City Goes 12 Days Without Murder.* **(Also, I tried to find a Fox News article on the subject but for some reason they did not report on it. There was, of course, articles on 'African-American' homicide rates and on cops being murdered.)** \n\nhttp://www.cnn.com/2015/02/16/us/nyc-homicide-free-streak/ \n\n* *76% of Professors, over 1 million, teach part-time while earning $17,000-$21,000 annually. Justification for Universities doing so is to bring real-world experience to the classroom, but they require extensive curriculum and high volumes of essays, tests, and quizzes requiring extensive time to be devoted to their educator job that makes working other jobs nearly impossible for those that can sleep, eat, or have a live such as children.*\n\nhttp://www.npr.org/2014/02/03/268427156/part-time-professors-demand-higher-pay-will-colleges-listen",
  "gilded": 0,
  "score": 3,
  "removal_reason": null,
  "approved_by": null,
  "created_utc": 1427349523.0,
  "is_self": true,
  "stickied": false,
  "edited": 1427350507.0,
  "distinguished": null,
  "permalink": "https://www.reddit.com/r/rant/comments/30cfvt/i_dont_get_on_fb_much_but_when_i_do_i_see/?ref=search_posts",
  "banned_by": null,
  "from_id": null,
  "likes": null,
  "_underscore_names": null,
  "num_reports": null,
  "link_flair_css_class": null,
  "_info_url": "https://api.reddit.com/api/info/",
  "id": "30cfvt",
  "archived": true,
  "secure_media": null,
  "from_kind": null,
  "saved": false,
  "domain": "self.rant",
  "ups": 3,
  "suggested_sort": null,
  "quarantine": false,
  "over_18": false,
  "hide_score": false,
  "url": "https://www.reddit.com/r/rant/comments/30cfvt/i_dont_get_on_fb_much_but_when_i_do_i_see/",
  "subreddit_id": "t5_2qn2b",
  "_params": {},
  "_comments": null,
  "_replaced_more": false,
  "_comments_by_id": {},
  "user_reports": [],
  "media_embed": {},
  "created": 1427353123.0,
  "author_flair_text": null,
  "visited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Here was the post:</p>\n\n<p>Kyle Mile: Every morning there is a murder in ____________.\nOne murder every morning.\nAre the murderers taking turns or something?\nWhy not five on Monday and none for the rest of the week?\nEither coincidence or maybe the media picks out the &quot;best &quot; murder and the rest don&#39;t deserve air time. Happy to be OTP.</p>\n\n<p>Comments that scare the shit out of me and that I was responding to:</p>\n\n<p>Joe Blow: And it seems they are always in one of about three general areas.. should we discuss similarities of the individuals them selves.....???</p>\n\n<p>Jane Gain: We were in _________ this past weekend I will honestly say I was not comfortable.</p>\n\n<p>Kyle Mile:  Do they have categories? B on B, B on W, b on H, etc. ? I wonder how they pick which murder to air? Lottery maybe? Folks in Atlanta love the lottery!</p>\n\n<p>Mary Hairy: d you hear about the black sit ins in _________ eateries at Sunday brunch trying to intimidate the white customers. They we promoting black lives matter. Neil Boertz split out the __________ statistics 90 something % b on b only 2% involve whites. I thought they should take their message to the schools.</p>\n\n<p>Tom Com: Black democrats running (ruining) ___<strong><em>. <em>MLB Team</em> even want out. I work in South West</em></strong>______ once a month and it&#39;s scary down there. Third most dangerous neighborhood in America.</p>\n\n<p>Cat Picture Lady: What I would like to ask these pesky black protesters is this, &quot;If &#39;black lives matter&#39; so much, then why have more black babies have been sucked into a sink in the US than have been born?&quot;</p>\n\n<p>Jake Flake:  I loved living up near Lake ________ , but after 22 years, it got old also. the 4 mile, 6 minute commute to work turned into a 15 to 20 minute ride. Every time I watched the news, it wasn&#39;t a matter if there was a murder, but how many? I now live down in central _____ and hang at Lake _________ when I&#39;m not here, working my business. Life is much easier and way less stressful. My fear, while living up there was if the $#!t were to ever hit the fan, how would I get back down here to my family...</p>\n\n<p><strong>First Comment; posted</strong> </p>\n\n<p>On that subject, NYC went 12 days w/o a single murder case this year!</p>\n\n<p><strong>Second comment; not posted</strong></p>\n\n<p>I hate being the devil&#39;s advocate, but not taking into consideration all the variables when analyzing and forming opinions of the black community is very dangerous, in a fascist way. I will agree with anyone that says that they have the ability--just like every other person--to better their community. I will also agree with anyone that says many blacks have racist beliefs for whites. I will also agree it is time for black communities to stop using events such as slavery, Jim Crow, and Ferguson/Zimmerman to justify inhumane ideology, actions, and distancing themselves from other Americans. But, seeing theft, murder, rape, and illegal profit-industries (prostitution/drugs) not as an effect of poverty but rather as an effect of being black is extremely dangerous; in a fascist way; for these were the same reasons Arianism bred and the Jews were exterminated.</p>\n\n<p>I learned on my own (through my stupid actions) that dependency breeds a form of ignorance in people that does not promote an industrious and virtuous mindset and the only way most people will pursue anything is through having their face dragged across the ground while educated enough to pursue better company and opportunity. The black-community is, from the day they are born, seemingly forced into a life where they depend on the federal government: Lyndon Johnson, the Great Society. They are also extremely uneducated, which explains why they have multiple children they can&#39;t support and greatly expands their desire for dependency, to commit inhumane actions, and anger towards society due to the inability to comprehend even their own situation. There is also the inability for most to leave their volatile communities due to hatred/fear/anger they can&#39;t let go of for whites, and the hatred by their communities for those that do leave and they fear if they fail when they leave they can&#39;t come back. </p>\n\n<p>There are many reasons for these things: The conversion of unions (especially teacher unions) from human right&#39;s advocate agencies to political tools by liberal politicians; continued segregation after the Federal mandates; white communities establishing segregation academies to avoid integration; the hip-hop industry deifying the crack-cocaine industry and absolute ignorance; George Bush&#39;s &quot;No Child Left Behind&quot; keeping these children in schools where teachers preach about their unions yet cutting their federal funding due to low test scores; education systems adopting corporate policies to maximize profit and paying administration outrageous amounts more while slashing the salary of educators leading to educator positions to be filled by those that see it as a last resort; the lack of oversight, regulation, and financial support for the CIA during the Nicaragua revolution leading to them turning a blind eye to massive cocaine exports causing the crack-epidemic (I will agree with anyone that says Communism is an evil ideology that needed to be defeated. I also do not believe the CIA was trying to destroy the black community, but we must address the effects of our actions. Simply put, there was no way to know what would happen when we were fighting (eventually victorious, &#39;Merica!) the expansion of Communism, but bad things happened which has led to many of our national issues today); and the ability for publicly elected local, state, and federal Representatives to manage school redistricting which allows an &#39;unofficial&#39; segregation of schools to be used for political purposes. </p>\n\n<p>The white population, being more educated, are aware and well informed on the political system and make up a vast majority of those who elect public officials. Creating a higher-standard-of-living by unofficial segregation of schools, placing the already educated white students in the same schools leading to more federal funding, and creating economic-racial &#39;invisible societal lines&#39; so they don&#39;t have to deal with the effects of having poverty in their community gains votes and guarantees political careers. Unions support this system by not allowing students to leave their district schools under governance legislation they lobbied for to ensure the educators within their union don&#39;t lose their job simply so they can continue extracting funds from their salary to fund their own; not for the benefit of the children in these schools. The lavish benefits of being a career politician or having a high-level administration position within a union coupled with ignorance within communities and hatred between different sects of the population makes it far too easy for those that claim responsibility to manage our country to fall under the weight of greed, gluttony, and the benefits of insinuating wrath within their constituents. </p>\n\n<p>On average, 96% of Congressional, state, and local incumbents of the 21st century are reelected while only 16% of likely U.S. voters think the current Congress is doing a good or excellent job. A majority of Congressmen and women have held their office since the 80&#39;s and 90&#39;s, and their salary of $129,500 in 1992 has increased to $174,000 in 2009. After 20 years (might be slightly off feel free to fact check) of holding office a Congressman receives 25% of his salary under CSRS and an additional 18% of his salary under FERS plus social security; there are also annual percent increases that are far too intricate for me to understand.</p>\n\n<p>Following an example from an Senate study which I will source below, a Congressman who has held office for 32 years will receive $89,610 in annual pensions if they decide to retire. This can of course increase the longer they hold office. I would love to provide the annual salary of union administrators but unfortunately that is much harder to find and study and with school I don&#39;t have all the time I wish I had to research it. It must also be taken into account that individuals in both positions are receiving funds from multiple interest groups to fund campaigns, personal lives, public projects in representative&#39;s districts, and projects/programs within different unions. This leads to their actions to be influenced by the interests of these interest groups; or rather the people who have high amounts of influence within them. </p>\n\n<p>Back to the subject at hand, the black-community has had 20 to 60 years (depending on what factors you want to consider as provisions for equal opportunity) to have the same level of education as whites while our community has had the opportunity for almost 150 years, due to the increased demand for educated labor during the industrial revolution. The lack of education leads to the inability to compete in our economy, leading to living in poverty due to unemployment, leading to government dependency, inhumane acts to earn money, and overall extreme levels of anger, hostility, and violence. Politicians fall into greed and give to us direct satisfaction to gain votes instead of risking their seat by pushing for complex operations that attempt to address issues which are far too intricate for most to comprehend. They also can not take the actions that they may seem fit due to answer issues because to receive the funds to fuel their campaigns which come from interest groups who contribute they must computed into their actions those groups&#39; interests. </p>\n\n<p>Because I love some Conservative ideals I want to take a moment to bash the Liberals since this could be seen as a conservo-roast by sensitive red-ties. Liberals are doing extreme damage by increasing welfare program funding, selling them not as welfare programs set up to help those who truly need them for part of their life but as entitlement programs for everyone to live off forever, supporting unions that are obviously corrupt, promoting the ideology that all of society is determined to eradicate racial minorities, and ignoring root causes so that they can continue exploiting the ignorance that comes from the lack of education so that they can get reelected by their votes. Unions are equally corrupt, yet are much harder to find information on due to privacy rights for corporate/(semi)private entities, but I do now have an interest to uncover more about them. From what I have observed I would say they are a breeding ground for greed, and the lack of transparency within their operations provides the ideal environment for those that lack any sense of virtue to expose and exploit those that they say they are their to empower to push their own interests and that of others in the guise of a sheep to receive a portion of the union members&#39; salaries and the funds that interest groups give them. </p>\n\n<p>The black culture industries (music, television, etc) promote inhumane activity instead of using their position to provide educational information simply because they know that they can generate more profit from an ignorant audience rather than an educated audience. It is much easier to take advantage of through contracts and to find people like Gucci Mane, Waka Flocka, Juicy J, and Young Thug than it is to do the same with people like Jimi Hendrix, Tupac, and Led Zeppelin. They promote the volatile lifestyles because they can pump out their product--at levels never seen before in the entertainment/culture industry--to people whose lack of education allows for their outlook on life to be molded into an extreme, sadistic and ignorant vision which allows for them to be easily influenced to truly believe they can reach unobtainable goals through immoral action, experience happiness only through unlimited consumption, or that greatness is achieved purely through obtaining high levels of wealth. OK, that might be like a lot of the world&#39;s issue, but black entertainment is the largest promoter of this culture. Speaking of black entertainment, the executive board of BET is completely white, but that is an entirely different issue I don&#39;t want to get into right now. Racism and bigotry and thriving today just as they were 60 years ago; our physical actions may be restricted, but the minds of many are just as dark as they were in the Jim Crow days.</p>\n\n<p>The majority of the black population is at fault for the way that they live, and I say this because it is also dangerous to turn a blind eye to issues because &quot;they can&#39;t help it&quot;... because they can. They have the same amount of brain in their skull as anyone else, but for those that aren&#39;t black to remain ignorant of the variables puts them equally at fault and can lead to fascist ideals to breed within communities. Even though right now it is just the occasional racially motivated acts of violence, political actions to gain votes by distancing and exploiting blacks, and ignorant music promoting violence and greed there is the ever-growing opportunity for chains of events that resemble historical events of genocide, race wars insinuated by BOTH sides, mass-banishment, and military and/or labor exploitative use of a specific identifiable sect of civilization to occur. </p>\n\n<p>Politicians, racial ideology (Arianism, Nordicism, etc), the temptation of greed, evil individuals hijacking unions, and the entertainment industry--intentionally or not-- dragged society into the situation that we are in now. The further the divide is drawn between every identifier of people within the country, the easier it is to play at our emotions and to gain control by distracting us with the hatred of one another. Black or White, Straight or Gay, Liberal or Conservative, Christian or Atheist, Union or Laizze Faire, Fraternity or GDI, Middle-Class or Poor, American or Canadian, English or Spanish, Christian or Islam, Extrovert or Introvert, Office Job or Field Job, Homeless or Not, Citizen or Law Enforcement, Army or Navy, Medium-Rare or Well-Done. \nRegardless of what one is we as humans all share the same capacity of intellectual power; the need to eat, sleep, and drink; the desire to experience freedom, to be loved, and to do well for others; and the dreams of a world where war, murder, rape, and abuse are no longer experienced. I mean, unless you are a sadistic and cynical individual, which I greatly hope you are not, and I actually don&#39;t believe anyone is &#39;genetically&#39; or &#39;naturally&#39; that way, even if they are or were for a time of their life, I believe they have the ability to change. </p>\n\n<p>Its time to say enough is enough, to research subjects and form our own well-informed opinions, to take Lincoln&#39;s advice and ensure that we remain an indivisible country not only territory wise but also culturally wise, to promote the practice of empathy within all people, and to exploit corrupt operations and those who take advantage of others for their benefit. Stalin happened is Russia, Hitler happened in Germany, Moses and his people were enslaved, Cartels are in control of the countries South of our border, people strap bombs to themselves and detonate in city squares, and others fly planes into Naval stations and civilian infrastructure. </p>\n\n<p>How do people like Stalin, Hitler, and Ramses of Egypt put into action their atrocities? They promoted ignorance, placed industry above human life, fed their people propaganda, and antagonized the population to hate one another to the point where they desired to kill the other. Why was there Kamikazes are there now suicide bombers? Because they are so entrenched in their ideology and beliefs that they not only see what they are doing as the righteous thing to do, but as the only option because they not simply Believe but KNOW that this is how reality operates and their is no other solution. Those who control portions of their lands deify those who do this and label them Martyrs, they make them celebrities and encourage them through the entire process to do so. </p>\n\n<p>Watch &quot;The Culture of Suicide Bombers&quot; on the subject, it brings to light a much deeper rabbit-hole of what suicide bombing is in the Middle East than we are aware of. I will also say that while watching please take into consideration that Pro-Israel agendas may be involved due to the documentary being hosted by an ex-CIA agent, and how the CIA and Mossad (Israel intel agency) are virtually a single agency. The same as one should take into consideration the involvement of GMO corporations and Liberal agendas to shame actions to promote a welfare/dependency society when watching documentaries slamming animal cruelty within the food industry. The inhumane cruelity is an issue and we should find ways to confront it, but the ideals used to expose it should not become dogma and something that should not be questioned or examined for ulterior motives. Suicide bombers and Islamic Wahhabi ideology is an extreme issue, but the ideals used to expose it in &quot;The Culture of Suicide Bombers&quot; should also be analyzed for ulterior motives such as the procurement of greater international authority and religious ideology of radical Christians, Jews, and even Hindus. </p>\n\n<p>Or maybe there is something completely different that you can back with facts, recordings, testimonies, etc. If it can be then bring it to light, I encourage EVERYONE to do their own research and to apply the scientific method when doing so, ensuring the development of logical, honest, and comprehensible opinions. The sign of lies, deceit, and corruption within any system is generally a vast, incomprehensible web of information and much of it unable to access. Either that or it is within covert operations, intelligence agencies, and other things that should not be revealed to protect individuals and their operations. But even then, immoral actions and corruption should be brought to light and there should be multiple layers of oversight conducted by those that we can truly trust due to how they conduct themselves in other situations.</p>\n\n<p><strong>Sources</strong></p>\n\n<ul>\n<li><p><em>Statistic Map of United States Showing Segregation by Race Apparent in Schools Based on Student Racial-Identity Percentages:</em></p>\n\n<p><a href=\"http://www.usatoday.com/story/news/nation-now/2014/05/15/school-segregation-civil-rights-project/9115823/\">http://www.usatoday.com/story/news/nation-now/2014/05/15/school-segregation-civil-rights-project/9115823/</a></p></li>\n<li><p><em>Congressman Retirement:</em></p></li>\n</ul>\n\n<p><a href=\"http://www.senate.gov/CRSReports/crs-publish.cfm?pid=%270E%2C*PLC8%22%40%20%20%0A\">http://www.senate.gov/CRSReports/crs-publish.cfm?pid=%270E%2C*PLC8%22%40%20%20%0A</a> </p>\n\n<ul>\n<li><p><em>Congressman Salary:</em><br/>\n                                                                                                                                                                                                                     <a href=\"http://www.senate.gov/CRSReports/crs-publish.cfm?pid=%27*2%404P%5C%5B%3A%22%40%20%20%0A\">http://www.senate.gov/CRSReports/crs-publish.cfm?pid=%27*2%404P%5C%5B%3A%22%40%20%20%0A</a></p></li>\n<li><p><em>Congressional Performance:</em> </p></li>\n</ul>\n\n<p><a href=\"http://www.rasmussenreports.com/public_content/politics/mood_of_america/congressional_performance\">http://www.rasmussenreports.com/public_content/politics/mood_of_america/congressional_performance</a> </p>\n\n<ul>\n<li><em>CIA, Contra, Cocaine:</em><br/></li>\n</ul>\n\n<p><a href=\"http://nsarchive.gwu.edu/NSAEBB/NSAEBB2/nsaebb2.htm\">http://nsarchive.gwu.edu/NSAEBB/NSAEBB2/nsaebb2.htm</a> </p>\n\n<ul>\n<li><em>Why Finland&#39;s schools are successful (hint, no Unions or educator exploitation):</em> </li>\n</ul>\n\n<p><a href=\"http://www.smithsonianmag.com/innovation/why-are-finlands-schools-successful-49859555/?no-ist\">http://www.smithsonianmag.com/innovation/why-are-finlands-schools-successful-49859555/?no-ist</a></p>\n\n<ul>\n<li><em>New York City Goes 12 Days Without Murder.</em> <strong>(Also, I tried to find a Fox News article on the subject but for some reason they did not report on it. There was, of course, articles on &#39;African-American&#39; homicide rates and on cops being murdered.)</strong> </li>\n</ul>\n\n<p><a href=\"http://www.cnn.com/2015/02/16/us/nyc-homicide-free-streak/\">http://www.cnn.com/2015/02/16/us/nyc-homicide-free-streak/</a> </p>\n\n<ul>\n<li><em>76% of Professors, over 1 million, teach part-time while earning $17,000-$21,000 annually. Justification for Universities doing so is to bring real-world experience to the classroom, but they require extensive curriculum and high volumes of essays, tests, and quizzes requiring extensive time to be devoted to their educator job that makes working other jobs nearly impossible for those that can sleep, eat, or have a live such as children.</em></li>\n</ul>\n\n<p><a href=\"http://www.npr.org/2014/02/03/268427156/part-time-professors-demand-higher-pay-will-colleges-listen\">http://www.npr.org/2014/02/03/268427156/part-time-professors-demand-higher-pay-will-colleges-listen</a></p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "_comment_sort": null,
  "report_reasons": null,
  "name": "t3_30cfvt",
  "from": null,
  "hidden": false,
  "clicked": false,
  "media": null,
  "json_dict": null,
  "_api_link": "https://api.reddit.com/r/rant/comments/30cfvt/i_dont_get_on_fb_much_but_when_i_do_i_see/?ref=search_posts",
  "secure_media_embed": {},
  "mod_reports": [],
  "_orphaned": {},
  "_uniq": null,
  "num_comments": 6,
  "link_flair_text": null,
  "title": "I don't get on FB much, but when I do I see ignorance and bigotry so I type extremely long replies then say fuck it, save it to a word document and never post. If you give educated, sourced opinions people go nuts. The Subject of this post: Racism",
  "_has_fetched": true,
  "author_flair_css_class": null,
  "thumbnail": ""
}