{
  "selftext": "**Verified?** *(This bot cannot verify AMAs just yet)*\n\n**Date:** 2012-05-18\n\n**[Link to submission](http://www.reddit.com/r/IAmA/comments/tsj4y/)** (*Has self-text*)\n\n**[Link to my post](http://www.reddit.com/r/IAmA/comments/tsj4y/tabledresser/c4ply7c)**\n\n\n\nQuestions|Answers\n:--|:--\n[Look at the blizzard vs glider case. i'd say it's more that the fps companies aren't sufficiently motivated to go after you.](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pdzae?context=5)|Glider lost because they utilized \"copyrighted\" data. No one has yet copyrighted the use of coordinates. ;)\n[How much technical expertise did you need, and in what topics (e.g. networking, low-level/systems-level programming\\)?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pd2vb?context=5)|Decent math skills. Trig and some calc. Low level programming skills are definitely important seeing as most of the work is with memory. Assembly is a must. Any CS graduate that paid attention can get by.\n[What languages/tools do you use?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pd2vb?context=5)| \n[Sorry for the deluge of questions, but I'm really curious lol.](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pd2vb?context=5)|Clasdis, bastard, iftop, iptraf and ollydbg (when under win32) are the only software programs that I typically use for work. C is the only cross-compatible language that provide the efficiency we demand. C++ is a compromise when something is needed that would be exceedingly difficult in C.\n |Curiosity is a very good thing. :)\n[Info on the case.](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4phmg9?context=5)|>As with most software, the client software of WoW is copied during the program's operation from the computer's hard drive to the computer's random access memory (RAM)\n[I don't see how you could make an aimbot without doing exactly the kind of things glider did with wow.](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4phmg9?context=5)|They access and utilized what is verifiably copyrighted material. The coordinates of a player are generated during runtime.\n[*edit*](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4phmg9?context=5)|L252,106     r593,281     q291,503     z203,588     c942,102.\n[I've been wanting to get around to learning basic programming, but, this post made me change my mind.](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pedmy?context=5)|In favor of?\n[Have you ever been affected by someone else cheating in a game before yourself? Has it annoyed you?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pjppr?context=5)|It doesn't annoy me. I just switch servers.\n[If not, why not?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pjppr?context=5)|It's not very difficult to switch servers.\n[But as much as it's not hard to change servers... do you not feel it irritating that it's down to you to make that effort and that you're making it simple for *one* person to affect everyone else on that server?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pjs8v?context=5)|>do you not feel it irritating that it's down to you to make that effort and that you're making it simple for one person to affect everyone else on that server.\n[I realise I'm probably sounding quite guilt-trippy here... but having been on the recieving end, it is irritating to have to quit out when just one person joins who's intent on doing this to everyone. ](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pjs8v?context=5)|I honestly don't understand why some people take video games so seriously. I just switch servers, it's not a big deal.\n[What happens when one aimbot is figured out by the anti cheating system?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pd345?context=5)|We have a login system. It goes into maintenance mode.\n[How do you guys go about finding a new method for your aimbot?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pd345?context=5)|Depends on how it's blocked. Sometimes it's a matter of changing a memory address or simply modifying something in assembly, sometimes it requires rewriting the entire aimbot.\n[Will you ever run out of ideas?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pd345?context=5)|Not really. :)\n[Aimbots are getting harder to spot, people turn it on at random times they almost never have it on the whole game.](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pgvbn?context=5)|This feature has always existed.\n[Do you play fps? If you're getting beat bad do you ever think of using your aimbots?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pismc?context=5)|No. That ruins the challenge and thrill of legitimately defeating someone.\n[Easiest game for you to hack?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pismc?context=5)|Modern Warfare 2 & Black Ops.\n[Do you ever find a similar flaw in the code in any games you've hacked?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pismc?context=5)|Black Ops consisted of so much copy & paste code that some of the errors still said \"Modern Warfare 2\"\n[Why do people use aimbots? What is the point? Just so they can kid themselves they are good at the game or to troll?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pdz0k?context=5)|I can't tell you what I don't know.\n[How does it feel to be hated by everyone? ](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pgujc?context=5)|It's almost like I don't care...\n[Do you think your aimbots ruin the game play for the majority of players?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pcjit?context=5)|The majority of players will never be in a game with someone using our aimbot.\n[Do you fell that aimbots ruin the enjoyment of online FPS?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pcmbb?context=5)|It's not hard to find a server without cheaters.\n[You said it was an AMA. Answer the question.](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pmdj6?context=5)|I did.\n[Then how do you make a decent salary?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pk8mq?context=5)|Where a mainstream title will have millions of sales we have a customer base of a few thousand.\n[Since the ones who are paying for cheats will most likely be in the upper 50% of player activity, it's not quite that easy of a calculation. If you have numbers (I know some cheat coders keep extensive statistics of their user base\\), can you share some?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4plj9y?context=5)|I can't give specifics but we have between 3000-6000 subscribers.\n[Also to all the haters/downvoters: Don't downvote him for saying something that might annoy you. He does this AMA and you shit on him? Shame on you guys. You don't have to support cheating or him or anything, but right now in this AMA he's just sharing.](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4plj9y?context=5)|Don't worry about the people downvoting. We're here to educate, not collect comment karma.\n[A few thousand players pays enough for you and presumably other people to have a comfortable salary?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4plbt8?context=5)|The company makes ~52K/month.\n[Does your expertise/knowledge extend outside of FPS games? Could you, for instance, code a bot that would interrupt spells in MMOs, or maphacks in RTS games, without much extra learning involved?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pio2k?context=5)|There is a big difference between learning how a game interfaces with D3D and understanding how D3D works, what the game's objectives are and how the accomplish them in terms of the initial language, how that translates into assembly, how variable that is due to the differences between architectures, etc.\n |[Here's a nice article on it](http://www.hanselman.com/blog/PleaseLearnToThinkAboutAbstractions.aspx)\n[What's an aimbot?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pcmhh?context=5)|All player positions are constantly broadcasted to every connected client. Your game uses this data to position players correctly in 3d. This data can be accessed for malicious purposes, such as finding the correct aim vector relative to an enemy's position. Most of it is math.\n |Bypassing anticheats can be as easy as using virtuallock to induce a page guard exception, to IAT/VMT hooks etc.\n[Why snoop around in memory vs. grabbing the data as it comes in over the network? Wouldn't the latter be harder for the game to detect?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pglcs?context=5)|Reverse engineering their protocol would take far too much work.\n[How do you actually retrieve the player's positional data from memory?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pepha?context=5)|[Link to msdn.microsoft.com](http://msdn.microsoft.com/en-us/library/windows/desktop/ms680553(v=vs.85).aspx)\n |Kernel32.\n[What games do you code aimbots for?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pcn2w?context=5)|Mainstream titles, punctuated by more popular indie titles. Battlefield, COD, APB, Tribes Ascend, etc.\n[As a person who has come to hate APB because of the assholes using aimbots, sincerely, fuck you. Fuck you.](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pin0p?context=5)|We are responsible for ~600 of those people. Sorry.\n[It's hilarious that your defense for ~600 aimbotters](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pj8n1?context=5)|That's for APB alone. We have several thousand subscribers.\n |I sympathize, I liked APB too. I don't need a defense because I don't care.\n[Wow, you really know how to earn goodwill. Kudos for social skills.](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pm4yh?context=5)|We are answering honestly, not trying to win favor.\n[I take it you don't play competitive FPS games. ](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pj9dh?context=5)|Define competitive.\n[Are there many people who are willing to pay for an aimbot? Can't you get many of them for free? What is the difference between your aimbot and one for free?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pgyab?context=5)|We have around 4500 subscribers. You can get one for free, but the fact that it is freely available makes it easy for anti-cheat developers to analyze them.\n |Ours has never been detected, while a free one will get you banned after a few days.\n[Is there a lot of competition in the Aimbot world?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pii1b?context=5)|Yes. We have four to six main competitors.\n[Do you need to work quickly when a new game comes out to avoid losing business](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pii1b?context=5)|Our customers are loyal, but being the first to roll an aimbot off the assembly line for a new game will definitely net you some new ones.\n[Also, is there any potential for console aimbots](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pii1b?context=5)|Not many people have modified consoles to make it profitable.\n[Who would you say your main competitors? CodeHook, Organner, x22?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pj6l7?context=5)|Can't answer that, sorry.\n[but why release it?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pgg55?context=5)|Money. It's a simple motivator.\n[You should be out there doing what you like](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pm5s0?context=5)|Consider that I have 1/3rd a bookcase of puzzle books. I solve problems for a living. It's what I love doing.\n[*Money.*  Hey, I understand.  How much would you say you make on average, per cheat?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4phuom?context=5)|It depends on what the subscriber wants.\n[That justifies it, I guess.  One last thing, why does the title say \"we\"? Is the whole team using one account to answer questions or something along the lines of that?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pm7zi?context=5)|Yes. We're all logged in. That's the only reason almost every question has been answered in this AMA... I think I've answered 5, and it's my account.\n[How did you get into the aimbot business?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pfokc?context=5)|If you want to get into the aimbot business figure out how games work, learn C and C++ on top of assembly. Knowledge of networking is required. After you have these things, look around for people that are hiring. If you can't find any, create your own business.\n[That's why, not how. ](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pmnjn?context=5)|Is that better?\n[you can just \"tell\" the server you hit the other player](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pg3dx?context=5)|You answered your own question there. :P.\n[What age group would be your main clientele?  Any really bad customers?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pem4k?context=5)|18-22 is the average. Our software hasn't suffered a ban wave yet, but I suspect that if it did we would have a lot of \"bad\" customers.\n[I would like to say that the fact all your comments have been downvoted by 1 or 2 idiots proves that they really don't know the whole point of an AMA, so I would like to thank you for doing this!](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pjugr?context=5)|It's just a bunch of people who take video games way too seriously. We even got a death threat which was legitimately hilarious.\n[Have you ever been contacted by a developer asking you to stop or anything similar?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pjugr?context=5)|We get legal threats here and there but they don't amount to anything.\n[Can you provide proof somehow? And also: Have you always wanted to code things such as this, or just got randomly caught up in it?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pf6gt?context=5)|[Link to github.com](https://github.com/Eyeris-Labs)\n |Snapdata is the only one with a public repo, check out some of his code.\n |I enjoy solving problems and this provides more than enough to satisfy me.\n[Say your aimbot is one day detected by a new version of cheat detection.  How do you go about diagnosing?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4peekn?context=5)|The ability for our customers to log into the aimbot is disabled. If the anti-cheat isn't being disabled it's a few banned accounts to figure out what exactly is going on, if it was targeted specifically at our aimbot, etc. If the anti-cheat is only being bypassed it's usually a matter of rearranging the order in which something is done or being more careful when modifying data.\n |We keep up with anti-cheat updates though, usually when a VAC update goes live we get the aimbot disabled within a few hours to check everything.\n[How would one go about getting in to programming for an aimbot?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4phwsb?context=5)|Bare minimum: Learn enough assembly to write and optimize your own code. Understand the nuances with various architectures (x86, IA-32, etc. Blast from the past: quadrants in PA-RISC)\n |Learn enough about networking and cryptography to find and exploit protocol weaknesses.\n |Trigonometry. A lot of trigonometry.\n |Balance trees, algorithms, hash tables, etc.\n |You should have a complete understanding of memory and machine code.\n |To start, pick up K&R.\n[K&R](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pi2y6?context=5)|Yes, C.\n[How often do you use more advanced mathematics (calculus\\)?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pi2y6?context=5)|Calculus is only needed when designing an AI, eg. collapsing into one state or another based on probabilities.\n[Do you use anything with player predictions? I play TF2 and do quite well, not because of my aim but because I can predict where an enemy is going to go next. Paths, firing lines, etc. Would accurate predictions be difficult to generate?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pi2y6?context=5)|Pathfinding for NPCs is simple because you can examine their algorithms. Considering the amount of processing power that would be required to make 'simple' predictions about their movement, that would usually be wrong, it's much easier to use their position stored in memory to \"draw\" a box over their location and write it to the d3d frame before it's referenced & cached by the game.\n[I would assume you can always make a better bot. Do you have to dumb-down your bot to make it believeable as a player, or do you just go all-out as an obvious bot?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pi2y6?context=5)|It's more work to make it believable. The bare minimum code would have you snap to everyone's head as soon as they enter your line of sight. Most aimbots have a settings console to set things like simulated mouse movement speed.\n[I bought one of these paid aimbots for CSS. Once I got to the install page though, I got scared.  Part of the install wanted me to disable PatchGuard, then disable my firewall and anti virus. Should I be worried about disabling PatchGuard? I feel like disabling it would leave me open to vulnerabilities.  Do all aimbots leave the client open to security threats?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pjib2?context=5)|EnhancedAim eh? Don't worry about it. A good antivirus will detect an aimbot as potentially malicious because of what it does. PatchGuard is merely a way for Microsoft to force licensing get more money out of developers. The claim is that it secures your computer... by forcing developers to pay Microsoft thousands of dollars for a \"license.\" The irony burns when you find out most of the Russian companies that survive on adware are licensed devs.\n[Fuck you guys.  But, on another note, how much money do you make a year.](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pgtx1?context=5)|I'm pretty sure snap is the only one that has public repos, so you can check out some of his code.\n[Someone doesn't like XUPPERNAMEX...](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4plhib?context=5)|Naw, we love regex dummies. They make my life easier.\n[What made you get into it?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pdijc?context=5)|The money isn't bad.\n[How good is the money? I've always wondered if it's worth the time coding. I mainly do RPG bots. A lot less math than 3D FPS shooters for sure :P.](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4phj7v?context=5)|I make ~$140K/year after taxes.\n[Wow, I shall look into this business seriously. I know c and cpp and some asm due to background with memory editing. I assume you're a graduate from a cs program? Where did you go to college?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4phvw2?context=5)|Some of us have degrees. I'm self taught.\n[I'm self-taught too but I'm getting a degree to say I have one. A big worry for me is always the company going after you. How do you avoid the legal repercussions?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4phywo?context=5)|Above anonymity we're careful about staying on the right side of copyright law.\n[Why be anonymous if you have no moral reservations about your product? If you're proud of what you do, stand up and tell people. ](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pmnvp?context=5)|That would involve corporate interests which would require we be dishonest in favor of our customers.\n[What about terms of use or terms of service?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pi0ws?context=5)|It has been ruled by the U.S. supreme court that a EULA/ToS is not legally a binding contract. They only exist to protect the company from lawsuits.\n[Proof?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pf3gy?context=5)|[Link to github.com](https://github.com/Eyeris-Labs)\n |Snapdata is the only one with a public repo, check out some of his code.\n[This doesn't really prove anything. ](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pks72?context=5)|What does it lack in proof that something else can provide?\n[All I can think of is proving you have control of the front-end website where the products are sold. If you don't want to advertise it you could send this to the mods but I'm not sure if they would want to deal with this. ](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4plc7d?context=5)|The trouble with advertising the AMA is that we then have corporate interests involved and our opinions have to gravitate dishonestly in favor of our customers.\n[Not advertising the AMA, just like a text file on the main website that you can link to that proves you have control over it. ](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pm5qk?context=5)|That still involves our customers. We would much rather have this AMA deleted for lack of proof than put our business at risk. What we've provided demonstrates that we have the know-how and skill to get it done.\n |I think it would equate to an architect demonstrating his ability to design nice buildings but not doing it professionally for no apparent reason.\n[You say it's your income, but I don't really understand how.  How are you making money off it and can you give an estimate?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pfxde?context=5)|You will not find aimbots high in quality that are free.\n[ not once have I heard of anyone paying for an aimbot.](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4plqaw?context=5)|A quick Google search will turn up dozens of sites, one of them probably being ours.\n[I also have not heard of pro's using them on the scene..](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4plqaw?context=5)|Because they would be disqualified.\n[Who exactly is your target audience?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4plqaw?context=5)|Anyone with a credit card.\n[If it is amateurs, why are they paying for aimbots...?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4plqaw?context=5)|I wouldn't know. I don't understand it myself. I'm just a programmer, not a psychologist. :P.\n[You don't do it out of necessity](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pmmgu?context=5)|The person that posted that doesn't. I have two girls and a wife. If it weren't for this job they would be living out of my car. I do what I have to, and honestly my family is more important to me than some kids enjoyment of a game. A serious comparison of the two is comical.\n[What about your \"professional\" history. Did you start with trainers, keygenning or similar?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pk3xp?context=5)|The world is full of interesting problems that are waiting to be solved.\n[Ask Me Anything, Get Cryptic Non-Specific Answers.](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4plmcf?context=5)|The point is not what you can code to become better. If you don't enjoy solving problems you're going to hit a wall before you start.\n[Could you give any tips for an up and coming programmer?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pkdhu?context=5)|Never listen to people who try to make beginners feel like losers.\n[What did you focus on in your studies?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pkdhu?context=5)|Math & low level programming.\n[How did you go about learning what you now know?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pkdhu?context=5)|Many teenage days were spent in bed studying POSIX standards instead of going out to parties.\n[As of right now I'm trying to code by myself in my free time, but everything seems so overwhelming.](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pkdhu?context=5)|Don't give up. It can be a little overwhelming at first but that passes. Even if you find out it's not for you, the problem solving skill you gain from programming will stick with you for the rest of your life.\n[Among the anti-cheats, which one is hardest to bypass? (VAC, PB, etc\\)](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pkedc?context=5)|VAC, if not for it's clever implementation of multithreading then the ban waves. The ban waves hinder development much more than PB could hope to accomplish with it's background services.\n[Why do you hack into memory and not just fake mouse movement? ](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pf2u5?context=5)|You need to access memory to obtain player positions. The cursor's position is changed after the appropriate aim vector is located.\n[Then why not sniff the data from network traffic?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pjtu8?context=5)|Protocol encryption.\n[Why not decrypt it? The game is able to do it so why can't you make a program that can as well? Seems this would be harder to detect that you were doing.](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pkosr?context=5)|A company like Blizzard will hire a PhD cryptographer for that reason alone. In some circumstances it is easier, but under no circumstance is it less time consuming. It's an issue of priorities.\n[ they don't do the same thing for the program memory? Seems like if it can't be detected (an extra level of that with this\\) you would have a selling point there.](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4playb?context=5)|The problem is that it can be detected. Much more easily, unfortunately.\n[How exactly can it be detected? Like would you not be able to hide that something like winpcap was running? I'm thinking in terms of making the aimbot act as much like a real user would as possible.](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pm5i9?context=5)|Punkbuster amounts to obfuscated network traffic. It sends and receives packets. If it doesn't send the correct packets you are booted from the game. This is easy to defeat. Our software is essentially undetectable.\n |Conversely, you are suggesting that we go out of our way to design a piece of software that not only acts as an intermediary between the game and server but decrypts data before it reaches the client, where this software can just as easily be detected by Punkbuster.\n |I don't know what snap was talking about when he said it is beneficial under some circumstances. I can't think of any.\n |With Punkbuster disabled it is much easier to check the game's memory.\n |Are you technically skilled? It's easier to answer questions if I don't have to \"translate.\"\n[How much money do you make? Is it comparable to a job as, say, a programmer/software developer?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pk72l?context=5)|140K/yr. Most jobs in IT will start you at 50K and bump up to around 60-80 after 5 years.\n[ they actively tried to make it worse](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pltcf?context=5)|Ultimately my intent is not malicious. I do recognize that the software I produce is then in turn used for malicious purposes.\n[Conversely, imagine someone taking whatever you do love, your car, your favorite programming forum, a daily iced cappucino, and they actively tried to make it worse all the time, for money.](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pltcf?context=5)|Real life analogies are dangerous because you wind up straw manning the situation. Here, let me respond with a question. A person is using a piece of software that someone else doesn't like. How do you equate that to someone purposely making your coffee taste like shit?\n |You may argue that the use of the software is just as purposeful, but I would put forth our inability to understand the psychological state of those who use the software. I doubt they pay for the express purpose of ruining someone elses fun.\n[It is amusing and telling that you don't consider this to be \"real life](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pm90g?context=5)|I consider real life analogies to be detrimental to the expression of both sides' opinions because you start mixing up situations in which people are legally liable or have committed a crime.\n[Game hacking software, on the other hand, is one step above a virus.](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pm90g?context=5)|The pedant in me wants to correct that. :P.\n[Its sole purpose is to lessen the experience of many for the benefit of one.](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pm90g?context=5)|Its sole purpose is to automate aim. How people feel about that is separate from the reason for it's existence.\n |It's not a biological imperative to care about things that are so external to yourself. I find it very difficult to care the slightest bit about whether or not I'm ruining someone's day because they take a video game too seriously. It's very abstract.\n[I wanted to offer an alternative point of view.](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pncpa?context=5)|I appreciate it, and although I'm usually happy to change my mind on things like this I remain unconvinced due to the aforementioned reason.\n | Different person here.\n |Your input is thought provoking. I'm going to be honest with you. I don't have this job because I want to make other people angry. I have this job because I, too, enjoy solving problems. More importantly, I don't care. I don't say that in a backhanded way. I simply don't care. I don't think I'm right, I don't think I'm wrong; I just don't care.\n |I am not the best at what I do. There are many, many people who could do it better than me, and I'm sure if they wanted to they could find someone more talented to take my place in a day. I know that's a bit disappointing, if not anticlimactic. Sorry.\n[This is such disingenuous whitewashing, it's embarrassing.](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pmxsk?context=5)|Your hatred for something does not halt it's existence or discontinue it's manufacturing. Don't be self entitled.\n[Where did I say this was the case?  Where did I ask for anything other than a correction of the blaisé attitude?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pnh4r?context=5)|I apologize on behalf of whoever posted that. I haven't been following this but what he/she said doesn't make any sense. I think you were the victim of a fast reading -- I will reply as soon as I finish up this program.\n[Can you explain anything about the methods you currently use?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pkffv?context=5)|No, for what I believe to be obvious reasons.\n |Every engine implements DirectX differently. The same way that the steam overlay finds it's way into your game is the same way an aimbot does, although you have to be a bit more clever about it given VAC.\n |No, it looks like a good book for a layman though.\n[Do you feel any kind of remorse for ruining most honest players gameplay](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pl2uz?context=5)|If I'm honest, no.\n[I really wish you guys wouldn't do this.](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pl2uz?context=5)|If I didn't have to I wouldn't.\n[This is very informative. Thank you. As for my question, what would be an example of some of the math involved (without revealing any actual math from your program\\)?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4plahd?context=5)|Void vecang(const vector &vcc, const vector &xv1, qangle &ang)      {  \t    ang[2] = 0.0f; \t    double art = sqrt(dvc[0]*dvc[0] + dvc[1]*dvc[1]);  \t    double dvc[3] = { \t    (vcc[0]-xv1[0]), (vcc[1]-xv1[1]), (vcc[2]-xv1[2])  \t    };  \t    ang[0] = (float) (atan(dvc[2]/art) * radpi);  \t    ang[1] = (float) (atan(dvc[1]/dvc[0]) * radpi);  \t    if(dvc[0] >= 0.0f) ang[1] += 180.0f; \t    ang[0] = Clamp(ang[0], -89, 89);  \t    ang[1] = Clamp(ang[1], -180, 180);      }  \n[Wow... As a beginning programmer in highschool taking geometry, I understood maybe 3 words in that. Thank you for the response. ](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4plrxo?context=5)|I'll issue you a challenge: write it down. (hint: radian) vcc and xv1 are the input coordinates. Space it out and you'll get an idea of what's going on.\n |Keep programming and don't be discouraged by what you don't understand. Embrace it, and then figure it out! :)\n[What did you think of the popularity of XQZ2 hack and OGC made for Counter-Strike and other HL1 games? I remember that era as being quite exciting.](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4plwtn?context=5)|I have that code laying around here somewhere... one sec.\n |Edit: [delivered](https://github.com/snapdata/bitboom/commit/a275b01691f1da668c833cafb748efe3efb61017)\n[do you know how recoil/spread and their reductions are calculated in the game](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pmv3x?context=5)|Recoil and spread are calculated server side in any prudent game design. Only a naive studio would make such a mistake. DICE are not naive.\n[\"Our business helped to ruin someone else's business and the livelihoods of 200+ families, eh, whatever! My kids are fat and happy, who cares if a few hundred other kids are on the street?\"  Source for that 200: Link to en.wikipedia.org.](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pmxxx?context=5)|I was not employed as a programmer when RTW fell. Their inability to listen to customers is what destroyed them.\n[How many PMs have you gotten from people wanting your service from doing this AMA?](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pmafl?context=5)|A few. Having any customers aware of who we are in relation to this AMA is a threat to our corporate interests.\n[*Having any customers aware of who we are in relation to this AMA is a threat to our corporate interests.*  How? ](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pmyy5?context=5)|If you were to ask me right now whether or not I think our customers are douchebags I would reply honestly. I can't do that if our customers are the ones asking the questions. I get to play AMA with them every day, we have a forum for that. It isn't fun.\n[would you consider this to be a feasible technique](http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pm31c?context=5)|A strange idea, but definitely feasible as long as you're using neon colors that won't exist anywhere else in the game. How are you planning to design it?\n\n\n*Last updated: 2012-05-18 22:05 UTC* | *Next update: 2012-05-18 23:05 UTC*\n\n*This post was generated by a robot! Send all complaints to [epsy](/message/compose/?to=epsy).*\n\n",
  "gilded": 0,
  "score": 6,
  "removal_reason": null,
  "approved_by": null,
  "created_utc": 1337366487.0,
  "is_self": true,
  "stickied": false,
  "edited": 1337378894.0,
  "distinguished": null,
  "permalink": "https://www.reddit.com/r/tabled/comments/ttmig/table_iama_we_are_aimbot_coders_ask_us_anything/?ref=search_posts",
  "banned_by": null,
  "from_id": null,
  "likes": null,
  "_underscore_names": null,
  "num_reports": null,
  "link_flair_css_class": null,
  "_info_url": "https://api.reddit.com/api/info/",
  "id": "ttmig",
  "archived": true,
  "secure_media": null,
  "from_kind": null,
  "saved": false,
  "domain": "self.tabled",
  "ups": 6,
  "suggested_sort": null,
  "quarantine": false,
  "over_18": false,
  "hide_score": false,
  "url": "https://www.reddit.com/r/tabled/comments/ttmig/table_iama_we_are_aimbot_coders_ask_us_anything/",
  "subreddit_id": "t5_2tkmw",
  "_params": {},
  "_comments": null,
  "_replaced_more": false,
  "_comments_by_id": {},
  "user_reports": [],
  "media_embed": {},
  "created": 1337370087.0,
  "author_flair_text": "",
  "visited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Verified?</strong> <em>(This bot cannot verify AMAs just yet)</em></p>\n\n<p><strong>Date:</strong> 2012-05-18</p>\n\n<p><strong><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/\">Link to submission</a></strong> (<em>Has self-text</em>)</p>\n\n<p><strong><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/tabledresser/c4ply7c\">Link to my post</a></strong></p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Questions</th>\n<th align=\"left\">Answers</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pdzae?context=5\">Look at the blizzard vs glider case. i&#39;d say it&#39;s more that the fps companies aren&#39;t sufficiently motivated to go after you.</a></td>\n<td align=\"left\">Glider lost because they utilized &quot;copyrighted&quot; data. No one has yet copyrighted the use of coordinates. ;)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pd2vb?context=5\">How much technical expertise did you need, and in what topics (e.g. networking, low-level/systems-level programming)?</a></td>\n<td align=\"left\">Decent math skills. Trig and some calc. Low level programming skills are definitely important seeing as most of the work is with memory. Assembly is a must. Any CS graduate that paid attention can get by.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pd2vb?context=5\">What languages/tools do you use?</a></td>\n<td align=\"left\"></td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pd2vb?context=5\">Sorry for the deluge of questions, but I&#39;m really curious lol.</a></td>\n<td align=\"left\">Clasdis, bastard, iftop, iptraf and ollydbg (when under win32) are the only software programs that I typically use for work. C is the only cross-compatible language that provide the efficiency we demand. C++ is a compromise when something is needed that would be exceedingly difficult in C.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Curiosity is a very good thing. :)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4phmg9?context=5\">Info on the case.</a></td>\n<td align=\"left\">&gt;As with most software, the client software of WoW is copied during the program&#39;s operation from the computer&#39;s hard drive to the computer&#39;s random access memory (RAM)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4phmg9?context=5\">I don&#39;t see how you could make an aimbot without doing exactly the kind of things glider did with wow.</a></td>\n<td align=\"left\">They access and utilized what is verifiably copyrighted material. The coordinates of a player are generated during runtime.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4phmg9?context=5\"><em>edit</em></a></td>\n<td align=\"left\">L252,106     r593,281     q291,503     z203,588     c942,102.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pedmy?context=5\">I&#39;ve been wanting to get around to learning basic programming, but, this post made me change my mind.</a></td>\n<td align=\"left\">In favor of?</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pjppr?context=5\">Have you ever been affected by someone else cheating in a game before yourself? Has it annoyed you?</a></td>\n<td align=\"left\">It doesn&#39;t annoy me. I just switch servers.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pjppr?context=5\">If not, why not?</a></td>\n<td align=\"left\">It&#39;s not very difficult to switch servers.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pjs8v?context=5\">But as much as it&#39;s not hard to change servers... do you not feel it irritating that it&#39;s down to you to make that effort and that you&#39;re making it simple for <em>one</em> person to affect everyone else on that server?</a></td>\n<td align=\"left\">&gt;do you not feel it irritating that it&#39;s down to you to make that effort and that you&#39;re making it simple for one person to affect everyone else on that server.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pjs8v?context=5\">I realise I&#39;m probably sounding quite guilt-trippy here... but having been on the recieving end, it is irritating to have to quit out when just one person joins who&#39;s intent on doing this to everyone. </a></td>\n<td align=\"left\">I honestly don&#39;t understand why some people take video games so seriously. I just switch servers, it&#39;s not a big deal.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pd345?context=5\">What happens when one aimbot is figured out by the anti cheating system?</a></td>\n<td align=\"left\">We have a login system. It goes into maintenance mode.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pd345?context=5\">How do you guys go about finding a new method for your aimbot?</a></td>\n<td align=\"left\">Depends on how it&#39;s blocked. Sometimes it&#39;s a matter of changing a memory address or simply modifying something in assembly, sometimes it requires rewriting the entire aimbot.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pd345?context=5\">Will you ever run out of ideas?</a></td>\n<td align=\"left\">Not really. :)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pgvbn?context=5\">Aimbots are getting harder to spot, people turn it on at random times they almost never have it on the whole game.</a></td>\n<td align=\"left\">This feature has always existed.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pismc?context=5\">Do you play fps? If you&#39;re getting beat bad do you ever think of using your aimbots?</a></td>\n<td align=\"left\">No. That ruins the challenge and thrill of legitimately defeating someone.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pismc?context=5\">Easiest game for you to hack?</a></td>\n<td align=\"left\">Modern Warfare 2 &amp; Black Ops.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pismc?context=5\">Do you ever find a similar flaw in the code in any games you&#39;ve hacked?</a></td>\n<td align=\"left\">Black Ops consisted of so much copy &amp; paste code that some of the errors still said &quot;Modern Warfare 2&quot;</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pdz0k?context=5\">Why do people use aimbots? What is the point? Just so they can kid themselves they are good at the game or to troll?</a></td>\n<td align=\"left\">I can&#39;t tell you what I don&#39;t know.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pgujc?context=5\">How does it feel to be hated by everyone? </a></td>\n<td align=\"left\">It&#39;s almost like I don&#39;t care...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pcjit?context=5\">Do you think your aimbots ruin the game play for the majority of players?</a></td>\n<td align=\"left\">The majority of players will never be in a game with someone using our aimbot.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pcmbb?context=5\">Do you fell that aimbots ruin the enjoyment of online FPS?</a></td>\n<td align=\"left\">It&#39;s not hard to find a server without cheaters.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pmdj6?context=5\">You said it was an AMA. Answer the question.</a></td>\n<td align=\"left\">I did.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pk8mq?context=5\">Then how do you make a decent salary?</a></td>\n<td align=\"left\">Where a mainstream title will have millions of sales we have a customer base of a few thousand.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4plj9y?context=5\">Since the ones who are paying for cheats will most likely be in the upper 50% of player activity, it&#39;s not quite that easy of a calculation. If you have numbers (I know some cheat coders keep extensive statistics of their user base), can you share some?</a></td>\n<td align=\"left\">I can&#39;t give specifics but we have between 3000-6000 subscribers.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4plj9y?context=5\">Also to all the haters/downvoters: Don&#39;t downvote him for saying something that might annoy you. He does this AMA and you shit on him? Shame on you guys. You don&#39;t have to support cheating or him or anything, but right now in this AMA he&#39;s just sharing.</a></td>\n<td align=\"left\">Don&#39;t worry about the people downvoting. We&#39;re here to educate, not collect comment karma.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4plbt8?context=5\">A few thousand players pays enough for you and presumably other people to have a comfortable salary?</a></td>\n<td align=\"left\">The company makes ~52K/month.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pio2k?context=5\">Does your expertise/knowledge extend outside of FPS games? Could you, for instance, code a bot that would interrupt spells in MMOs, or maphacks in RTS games, without much extra learning involved?</a></td>\n<td align=\"left\">There is a big difference between learning how a game interfaces with D3D and understanding how D3D works, what the game&#39;s objectives are and how the accomplish them in terms of the initial language, how that translates into assembly, how variable that is due to the differences between architectures, etc.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\"><a href=\"http://www.hanselman.com/blog/PleaseLearnToThinkAboutAbstractions.aspx\">Here&#39;s a nice article on it</a></td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pcmhh?context=5\">What&#39;s an aimbot?</a></td>\n<td align=\"left\">All player positions are constantly broadcasted to every connected client. Your game uses this data to position players correctly in 3d. This data can be accessed for malicious purposes, such as finding the correct aim vector relative to an enemy&#39;s position. Most of it is math.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Bypassing anticheats can be as easy as using virtuallock to induce a page guard exception, to IAT/VMT hooks etc.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pglcs?context=5\">Why snoop around in memory vs. grabbing the data as it comes in over the network? Wouldn&#39;t the latter be harder for the game to detect?</a></td>\n<td align=\"left\">Reverse engineering their protocol would take far too much work.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pepha?context=5\">How do you actually retrieve the player&#39;s positional data from memory?</a></td>\n<td align=\"left\"><a href=\"http://msdn.microsoft.com/en-us/library/windows/desktop/ms680553(v=vs.85\">Link to msdn.microsoft.com</a>.aspx)</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Kernel32.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pcn2w?context=5\">What games do you code aimbots for?</a></td>\n<td align=\"left\">Mainstream titles, punctuated by more popular indie titles. Battlefield, COD, APB, Tribes Ascend, etc.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pin0p?context=5\">As a person who has come to hate APB because of the assholes using aimbots, sincerely, fuck you. Fuck you.</a></td>\n<td align=\"left\">We are responsible for ~600 of those people. Sorry.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pj8n1?context=5\">It&#39;s hilarious that your defense for ~600 aimbotters</a></td>\n<td align=\"left\">That&#39;s for APB alone. We have several thousand subscribers.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I sympathize, I liked APB too. I don&#39;t need a defense because I don&#39;t care.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pm4yh?context=5\">Wow, you really know how to earn goodwill. Kudos for social skills.</a></td>\n<td align=\"left\">We are answering honestly, not trying to win favor.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pj9dh?context=5\">I take it you don&#39;t play competitive FPS games. </a></td>\n<td align=\"left\">Define competitive.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pgyab?context=5\">Are there many people who are willing to pay for an aimbot? Can&#39;t you get many of them for free? What is the difference between your aimbot and one for free?</a></td>\n<td align=\"left\">We have around 4500 subscribers. You can get one for free, but the fact that it is freely available makes it easy for anti-cheat developers to analyze them.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Ours has never been detected, while a free one will get you banned after a few days.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pii1b?context=5\">Is there a lot of competition in the Aimbot world?</a></td>\n<td align=\"left\">Yes. We have four to six main competitors.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pii1b?context=5\">Do you need to work quickly when a new game comes out to avoid losing business</a></td>\n<td align=\"left\">Our customers are loyal, but being the first to roll an aimbot off the assembly line for a new game will definitely net you some new ones.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pii1b?context=5\">Also, is there any potential for console aimbots</a></td>\n<td align=\"left\">Not many people have modified consoles to make it profitable.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pj6l7?context=5\">Who would you say your main competitors? CodeHook, Organner, x22?</a></td>\n<td align=\"left\">Can&#39;t answer that, sorry.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pgg55?context=5\">but why release it?</a></td>\n<td align=\"left\">Money. It&#39;s a simple motivator.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pm5s0?context=5\">You should be out there doing what you like</a></td>\n<td align=\"left\">Consider that I have 1/3rd a bookcase of puzzle books. I solve problems for a living. It&#39;s what I love doing.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4phuom?context=5\"><em>Money.</em>  Hey, I understand.  How much would you say you make on average, per cheat?</a></td>\n<td align=\"left\">It depends on what the subscriber wants.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pm7zi?context=5\">That justifies it, I guess.  One last thing, why does the title say &quot;we&quot;? Is the whole team using one account to answer questions or something along the lines of that?</a></td>\n<td align=\"left\">Yes. We&#39;re all logged in. That&#39;s the only reason almost every question has been answered in this AMA... I think I&#39;ve answered 5, and it&#39;s my account.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pfokc?context=5\">How did you get into the aimbot business?</a></td>\n<td align=\"left\">If you want to get into the aimbot business figure out how games work, learn C and C++ on top of assembly. Knowledge of networking is required. After you have these things, look around for people that are hiring. If you can&#39;t find any, create your own business.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pmnjn?context=5\">That&#39;s why, not how. </a></td>\n<td align=\"left\">Is that better?</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pg3dx?context=5\">you can just &quot;tell&quot; the server you hit the other player</a></td>\n<td align=\"left\">You answered your own question there. :P.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pem4k?context=5\">What age group would be your main clientele?  Any really bad customers?</a></td>\n<td align=\"left\">18-22 is the average. Our software hasn&#39;t suffered a ban wave yet, but I suspect that if it did we would have a lot of &quot;bad&quot; customers.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pjugr?context=5\">I would like to say that the fact all your comments have been downvoted by 1 or 2 idiots proves that they really don&#39;t know the whole point of an AMA, so I would like to thank you for doing this!</a></td>\n<td align=\"left\">It&#39;s just a bunch of people who take video games way too seriously. We even got a death threat which was legitimately hilarious.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pjugr?context=5\">Have you ever been contacted by a developer asking you to stop or anything similar?</a></td>\n<td align=\"left\">We get legal threats here and there but they don&#39;t amount to anything.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pf6gt?context=5\">Can you provide proof somehow? And also: Have you always wanted to code things such as this, or just got randomly caught up in it?</a></td>\n<td align=\"left\"><a href=\"https://github.com/Eyeris-Labs\">Link to github.com</a></td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Snapdata is the only one with a public repo, check out some of his code.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I enjoy solving problems and this provides more than enough to satisfy me.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4peekn?context=5\">Say your aimbot is one day detected by a new version of cheat detection.  How do you go about diagnosing?</a></td>\n<td align=\"left\">The ability for our customers to log into the aimbot is disabled. If the anti-cheat isn&#39;t being disabled it&#39;s a few banned accounts to figure out what exactly is going on, if it was targeted specifically at our aimbot, etc. If the anti-cheat is only being bypassed it&#39;s usually a matter of rearranging the order in which something is done or being more careful when modifying data.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">We keep up with anti-cheat updates though, usually when a VAC update goes live we get the aimbot disabled within a few hours to check everything.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4phwsb?context=5\">How would one go about getting in to programming for an aimbot?</a></td>\n<td align=\"left\">Bare minimum: Learn enough assembly to write and optimize your own code. Understand the nuances with various architectures (x86, IA-32, etc. Blast from the past: quadrants in PA-RISC)</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Learn enough about networking and cryptography to find and exploit protocol weaknesses.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Trigonometry. A lot of trigonometry.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Balance trees, algorithms, hash tables, etc.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">You should have a complete understanding of memory and machine code.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">To start, pick up K&amp;R.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pi2y6?context=5\">K&amp;R</a></td>\n<td align=\"left\">Yes, C.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pi2y6?context=5\">How often do you use more advanced mathematics (calculus)?</a></td>\n<td align=\"left\">Calculus is only needed when designing an AI, eg. collapsing into one state or another based on probabilities.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pi2y6?context=5\">Do you use anything with player predictions? I play TF2 and do quite well, not because of my aim but because I can predict where an enemy is going to go next. Paths, firing lines, etc. Would accurate predictions be difficult to generate?</a></td>\n<td align=\"left\">Pathfinding for NPCs is simple because you can examine their algorithms. Considering the amount of processing power that would be required to make &#39;simple&#39; predictions about their movement, that would usually be wrong, it&#39;s much easier to use their position stored in memory to &quot;draw&quot; a box over their location and write it to the d3d frame before it&#39;s referenced &amp; cached by the game.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pi2y6?context=5\">I would assume you can always make a better bot. Do you have to dumb-down your bot to make it believeable as a player, or do you just go all-out as an obvious bot?</a></td>\n<td align=\"left\">It&#39;s more work to make it believable. The bare minimum code would have you snap to everyone&#39;s head as soon as they enter your line of sight. Most aimbots have a settings console to set things like simulated mouse movement speed.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pjib2?context=5\">I bought one of these paid aimbots for CSS. Once I got to the install page though, I got scared.  Part of the install wanted me to disable PatchGuard, then disable my firewall and anti virus. Should I be worried about disabling PatchGuard? I feel like disabling it would leave me open to vulnerabilities.  Do all aimbots leave the client open to security threats?</a></td>\n<td align=\"left\">EnhancedAim eh? Don&#39;t worry about it. A good antivirus will detect an aimbot as potentially malicious because of what it does. PatchGuard is merely a way for Microsoft to force licensing get more money out of developers. The claim is that it secures your computer... by forcing developers to pay Microsoft thousands of dollars for a &quot;license.&quot; The irony burns when you find out most of the Russian companies that survive on adware are licensed devs.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pgtx1?context=5\">Fuck you guys.  But, on another note, how much money do you make a year.</a></td>\n<td align=\"left\">I&#39;m pretty sure snap is the only one that has public repos, so you can check out some of his code.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4plhib?context=5\">Someone doesn&#39;t like XUPPERNAMEX...</a></td>\n<td align=\"left\">Naw, we love regex dummies. They make my life easier.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pdijc?context=5\">What made you get into it?</a></td>\n<td align=\"left\">The money isn&#39;t bad.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4phj7v?context=5\">How good is the money? I&#39;ve always wondered if it&#39;s worth the time coding. I mainly do RPG bots. A lot less math than 3D FPS shooters for sure :P.</a></td>\n<td align=\"left\">I make ~$140K/year after taxes.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4phvw2?context=5\">Wow, I shall look into this business seriously. I know c and cpp and some asm due to background with memory editing. I assume you&#39;re a graduate from a cs program? Where did you go to college?</a></td>\n<td align=\"left\">Some of us have degrees. I&#39;m self taught.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4phywo?context=5\">I&#39;m self-taught too but I&#39;m getting a degree to say I have one. A big worry for me is always the company going after you. How do you avoid the legal repercussions?</a></td>\n<td align=\"left\">Above anonymity we&#39;re careful about staying on the right side of copyright law.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pmnvp?context=5\">Why be anonymous if you have no moral reservations about your product? If you&#39;re proud of what you do, stand up and tell people. </a></td>\n<td align=\"left\">That would involve corporate interests which would require we be dishonest in favor of our customers.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pi0ws?context=5\">What about terms of use or terms of service?</a></td>\n<td align=\"left\">It has been ruled by the U.S. supreme court that a EULA/ToS is not legally a binding contract. They only exist to protect the company from lawsuits.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pf3gy?context=5\">Proof?</a></td>\n<td align=\"left\"><a href=\"https://github.com/Eyeris-Labs\">Link to github.com</a></td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Snapdata is the only one with a public repo, check out some of his code.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pks72?context=5\">This doesn&#39;t really prove anything. </a></td>\n<td align=\"left\">What does it lack in proof that something else can provide?</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4plc7d?context=5\">All I can think of is proving you have control of the front-end website where the products are sold. If you don&#39;t want to advertise it you could send this to the mods but I&#39;m not sure if they would want to deal with this. </a></td>\n<td align=\"left\">The trouble with advertising the AMA is that we then have corporate interests involved and our opinions have to gravitate dishonestly in favor of our customers.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pm5qk?context=5\">Not advertising the AMA, just like a text file on the main website that you can link to that proves you have control over it. </a></td>\n<td align=\"left\">That still involves our customers. We would much rather have this AMA deleted for lack of proof than put our business at risk. What we&#39;ve provided demonstrates that we have the know-how and skill to get it done.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I think it would equate to an architect demonstrating his ability to design nice buildings but not doing it professionally for no apparent reason.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pfxde?context=5\">You say it&#39;s your income, but I don&#39;t really understand how.  How are you making money off it and can you give an estimate?</a></td>\n<td align=\"left\">You will not find aimbots high in quality that are free.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4plqaw?context=5\"> not once have I heard of anyone paying for an aimbot.</a></td>\n<td align=\"left\">A quick Google search will turn up dozens of sites, one of them probably being ours.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4plqaw?context=5\">I also have not heard of pro&#39;s using them on the scene..</a></td>\n<td align=\"left\">Because they would be disqualified.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4plqaw?context=5\">Who exactly is your target audience?</a></td>\n<td align=\"left\">Anyone with a credit card.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4plqaw?context=5\">If it is amateurs, why are they paying for aimbots...?</a></td>\n<td align=\"left\">I wouldn&#39;t know. I don&#39;t understand it myself. I&#39;m just a programmer, not a psychologist. :P.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pmmgu?context=5\">You don&#39;t do it out of necessity</a></td>\n<td align=\"left\">The person that posted that doesn&#39;t. I have two girls and a wife. If it weren&#39;t for this job they would be living out of my car. I do what I have to, and honestly my family is more important to me than some kids enjoyment of a game. A serious comparison of the two is comical.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pk3xp?context=5\">What about your &quot;professional&quot; history. Did you start with trainers, keygenning or similar?</a></td>\n<td align=\"left\">The world is full of interesting problems that are waiting to be solved.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4plmcf?context=5\">Ask Me Anything, Get Cryptic Non-Specific Answers.</a></td>\n<td align=\"left\">The point is not what you can code to become better. If you don&#39;t enjoy solving problems you&#39;re going to hit a wall before you start.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pkdhu?context=5\">Could you give any tips for an up and coming programmer?</a></td>\n<td align=\"left\">Never listen to people who try to make beginners feel like losers.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pkdhu?context=5\">What did you focus on in your studies?</a></td>\n<td align=\"left\">Math &amp; low level programming.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pkdhu?context=5\">How did you go about learning what you now know?</a></td>\n<td align=\"left\">Many teenage days were spent in bed studying POSIX standards instead of going out to parties.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pkdhu?context=5\">As of right now I&#39;m trying to code by myself in my free time, but everything seems so overwhelming.</a></td>\n<td align=\"left\">Don&#39;t give up. It can be a little overwhelming at first but that passes. Even if you find out it&#39;s not for you, the problem solving skill you gain from programming will stick with you for the rest of your life.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pkedc?context=5\">Among the anti-cheats, which one is hardest to bypass? (VAC, PB, etc)</a></td>\n<td align=\"left\">VAC, if not for it&#39;s clever implementation of multithreading then the ban waves. The ban waves hinder development much more than PB could hope to accomplish with it&#39;s background services.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pf2u5?context=5\">Why do you hack into memory and not just fake mouse movement? </a></td>\n<td align=\"left\">You need to access memory to obtain player positions. The cursor&#39;s position is changed after the appropriate aim vector is located.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pjtu8?context=5\">Then why not sniff the data from network traffic?</a></td>\n<td align=\"left\">Protocol encryption.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pkosr?context=5\">Why not decrypt it? The game is able to do it so why can&#39;t you make a program that can as well? Seems this would be harder to detect that you were doing.</a></td>\n<td align=\"left\">A company like Blizzard will hire a PhD cryptographer for that reason alone. In some circumstances it is easier, but under no circumstance is it less time consuming. It&#39;s an issue of priorities.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4playb?context=5\"> they don&#39;t do the same thing for the program memory? Seems like if it can&#39;t be detected (an extra level of that with this) you would have a selling point there.</a></td>\n<td align=\"left\">The problem is that it can be detected. Much more easily, unfortunately.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pm5i9?context=5\">How exactly can it be detected? Like would you not be able to hide that something like winpcap was running? I&#39;m thinking in terms of making the aimbot act as much like a real user would as possible.</a></td>\n<td align=\"left\">Punkbuster amounts to obfuscated network traffic. It sends and receives packets. If it doesn&#39;t send the correct packets you are booted from the game. This is easy to defeat. Our software is essentially undetectable.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Conversely, you are suggesting that we go out of our way to design a piece of software that not only acts as an intermediary between the game and server but decrypts data before it reaches the client, where this software can just as easily be detected by Punkbuster.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I don&#39;t know what snap was talking about when he said it is beneficial under some circumstances. I can&#39;t think of any.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">With Punkbuster disabled it is much easier to check the game&#39;s memory.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Are you technically skilled? It&#39;s easier to answer questions if I don&#39;t have to &quot;translate.&quot;</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pk72l?context=5\">How much money do you make? Is it comparable to a job as, say, a programmer/software developer?</a></td>\n<td align=\"left\">140K/yr. Most jobs in IT will start you at 50K and bump up to around 60-80 after 5 years.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pltcf?context=5\"> they actively tried to make it worse</a></td>\n<td align=\"left\">Ultimately my intent is not malicious. I do recognize that the software I produce is then in turn used for malicious purposes.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pltcf?context=5\">Conversely, imagine someone taking whatever you do love, your car, your favorite programming forum, a daily iced cappucino, and they actively tried to make it worse all the time, for money.</a></td>\n<td align=\"left\">Real life analogies are dangerous because you wind up straw manning the situation. Here, let me respond with a question. A person is using a piece of software that someone else doesn&#39;t like. How do you equate that to someone purposely making your coffee taste like shit?</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">You may argue that the use of the software is just as purposeful, but I would put forth our inability to understand the psychological state of those who use the software. I doubt they pay for the express purpose of ruining someone elses fun.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pm90g?context=5\">It is amusing and telling that you don&#39;t consider this to be &quot;real life</a></td>\n<td align=\"left\">I consider real life analogies to be detrimental to the expression of both sides&#39; opinions because you start mixing up situations in which people are legally liable or have committed a crime.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pm90g?context=5\">Game hacking software, on the other hand, is one step above a virus.</a></td>\n<td align=\"left\">The pedant in me wants to correct that. :P.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pm90g?context=5\">Its sole purpose is to lessen the experience of many for the benefit of one.</a></td>\n<td align=\"left\">Its sole purpose is to automate aim. How people feel about that is separate from the reason for it&#39;s existence.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">It&#39;s not a biological imperative to care about things that are so external to yourself. I find it very difficult to care the slightest bit about whether or not I&#39;m ruining someone&#39;s day because they take a video game too seriously. It&#39;s very abstract.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pncpa?context=5\">I wanted to offer an alternative point of view.</a></td>\n<td align=\"left\">I appreciate it, and although I&#39;m usually happy to change my mind on things like this I remain unconvinced due to the aforementioned reason.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Different person here.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Your input is thought provoking. I&#39;m going to be honest with you. I don&#39;t have this job because I want to make other people angry. I have this job because I, too, enjoy solving problems. More importantly, I don&#39;t care. I don&#39;t say that in a backhanded way. I simply don&#39;t care. I don&#39;t think I&#39;m right, I don&#39;t think I&#39;m wrong; I just don&#39;t care.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I am not the best at what I do. There are many, many people who could do it better than me, and I&#39;m sure if they wanted to they could find someone more talented to take my place in a day. I know that&#39;s a bit disappointing, if not anticlimactic. Sorry.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pmxsk?context=5\">This is such disingenuous whitewashing, it&#39;s embarrassing.</a></td>\n<td align=\"left\">Your hatred for something does not halt it&#39;s existence or discontinue it&#39;s manufacturing. Don&#39;t be self entitled.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pnh4r?context=5\">Where did I say this was the case?  Where did I ask for anything other than a correction of the blaisé attitude?</a></td>\n<td align=\"left\">I apologize on behalf of whoever posted that. I haven&#39;t been following this but what he/she said doesn&#39;t make any sense. I think you were the victim of a fast reading -- I will reply as soon as I finish up this program.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pkffv?context=5\">Can you explain anything about the methods you currently use?</a></td>\n<td align=\"left\">No, for what I believe to be obvious reasons.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Every engine implements DirectX differently. The same way that the steam overlay finds it&#39;s way into your game is the same way an aimbot does, although you have to be a bit more clever about it given VAC.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">No, it looks like a good book for a layman though.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pl2uz?context=5\">Do you feel any kind of remorse for ruining most honest players gameplay</a></td>\n<td align=\"left\">If I&#39;m honest, no.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pl2uz?context=5\">I really wish you guys wouldn&#39;t do this.</a></td>\n<td align=\"left\">If I didn&#39;t have to I wouldn&#39;t.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4plahd?context=5\">This is very informative. Thank you. As for my question, what would be an example of some of the math involved (without revealing any actual math from your program)?</a></td>\n<td align=\"left\">Void vecang(const vector &amp;vcc, const vector &amp;xv1, qangle &amp;ang)      {          ang[2] = 0.0f;      double art = sqrt(dvc[0]<em>dvc[0] + dvc[1]</em>dvc[1]);       double dvc[3] = {       (vcc[0]-xv1[0]), (vcc[1]-xv1[1]), (vcc[2]-xv1[2])       };          ang[0] = (float) (atan(dvc[2]/art) * radpi);        ang[1] = (float) (atan(dvc[1]/dvc[0]) * radpi);         if(dvc[0] &gt;= 0.0f) ang[1] += 180.0f;        ang[0] = Clamp(ang[0], -89, 89);        ang[1] = Clamp(ang[1], -180, 180);      }</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4plrxo?context=5\">Wow... As a beginning programmer in highschool taking geometry, I understood maybe 3 words in that. Thank you for the response. </a></td>\n<td align=\"left\">I&#39;ll issue you a challenge: write it down. (hint: radian) vcc and xv1 are the input coordinates. Space it out and you&#39;ll get an idea of what&#39;s going on.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Keep programming and don&#39;t be discouraged by what you don&#39;t understand. Embrace it, and then figure it out! :)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4plwtn?context=5\">What did you think of the popularity of XQZ2 hack and OGC made for Counter-Strike and other HL1 games? I remember that era as being quite exciting.</a></td>\n<td align=\"left\">I have that code laying around here somewhere... one sec.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Edit: <a href=\"https://github.com/snapdata/bitboom/commit/a275b01691f1da668c833cafb748efe3efb61017\">delivered</a></td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pmv3x?context=5\">do you know how recoil/spread and their reductions are calculated in the game</a></td>\n<td align=\"left\">Recoil and spread are calculated server side in any prudent game design. Only a naive studio would make such a mistake. DICE are not naive.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pmxxx?context=5\">&quot;Our business helped to ruin someone else&#39;s business and the livelihoods of 200+ families, eh, whatever! My kids are fat and happy, who cares if a few hundred other kids are on the street?&quot;  Source for that 200: Link to en.wikipedia.org.</a></td>\n<td align=\"left\">I was not employed as a programmer when RTW fell. Their inability to listen to customers is what destroyed them.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pmafl?context=5\">How many PMs have you gotten from people wanting your service from doing this AMA?</a></td>\n<td align=\"left\">A few. Having any customers aware of who we are in relation to this AMA is a threat to our corporate interests.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pmyy5?context=5\"><em>Having any customers aware of who we are in relation to this AMA is a threat to our corporate interests.</em>  How? </a></td>\n<td align=\"left\">If you were to ask me right now whether or not I think our customers are douchebags I would reply honestly. I can&#39;t do that if our customers are the ones asking the questions. I get to play AMA with them every day, we have a forum for that. It isn&#39;t fun.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/tsj4y/we_are_aimbot_coders_ask_us_anything/c4pm31c?context=5\">would you consider this to be a feasible technique</a></td>\n<td align=\"left\">A strange idea, but definitely feasible as long as you&#39;re using neon colors that won&#39;t exist anywhere else in the game. How are you planning to design it?</td>\n</tr>\n</tbody></table>\n\n<p><em>Last updated: 2012-05-18 22:05 UTC</em> | <em>Next update: 2012-05-18 23:05 UTC</em></p>\n\n<p><em>This post was generated by a robot! Send all complaints to <a href=\"/message/compose/?to=epsy\">epsy</a>.</em></p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "_comment_sort": null,
  "report_reasons": null,
  "name": "t3_ttmig",
  "from": null,
  "hidden": false,
  "clicked": false,
  "media": null,
  "json_dict": null,
  "_api_link": "https://api.reddit.com/r/tabled/comments/ttmig/table_iama_we_are_aimbot_coders_ask_us_anything/?ref=search_posts",
  "secure_media_embed": {},
  "mod_reports": [],
  "_orphaned": {},
  "_uniq": null,
  "num_comments": 1,
  "link_flair_text": null,
  "title": "[Table] IAmA: We are aimbot coders, ask us anything",
  "_has_fetched": true,
  "author_flair_css_class": "tabler",
  "thumbnail": ""
}