{
  "selftext": "For those of us who frequent /r/entrepreneur,  I'm sure that we have all noticed that with relative frequency someone asks \"who can process payments for my website\" and \"whats the best payment processor?\" \n\nI figured since I have some experience with online payment processors, I wanted to share my thoughts and opinions on payment processors, and hopefully provide information for fellow readers to make their own decisions, and to share their experiences. \n\n***Disclaimer: I am focusing on payment solutions geared towards smaller merchants that process &amp;lt;$10,000 per month. Volume sellers can get special rates negotiated through the platforms. These will vary from business to business. This is also mostly USA focused. Sorry international readers. Also, none of the links are referral links. \n\ntl;dr to save you time: \n\nStripe: 2.9% + $.30 for a successful charge. No monthly fees. Perfect for customized look, new biz friendly. Personal fave.\n\nPayPal: 2.9% + $.30 per transaction for online sales, 2.7% when swiping a card in-person through PayPal Here, 3.5% + $.15 per manually entered card (you type the card number in). No monthly fees. Fantastic brand recognition. Some horror stories. \n\nSquare: 2.75% per swipe or online sale, 3.5% + $.15 per manually entered card. Focused on in-person sales. \n\nBraintree: 2.9% + $.30 per transaction. No monthly fees. Stripe alternative. Would recommend Stripe. \n\nChargify: Free test account (really nice), $65-$459 per month for standard biz plans (Enterprise starts at $1,299). Focused on subscription based biz. Feature rich. Full solution. \n\nRecurly: $99/month for credit card only subscriptions and $299/month for CC, checks, and international currencies. Credit card billing is $.10 + 1.25% of revenue per transaction, plus $1 per invoice for $299 plan. Great beginner solution for MVP. Gateway only. Fees are in addition to processor fees. \n\n\nThe big guys: Stripe and Paypal\n\nStripe \n\nI currently use Stripe, both as an e-commerce payment processor, and for invoicing through Freshbooks (fantastic service, highly recommended). For my needs, Stripe works perfectly. I get integration with exactly what I need, and have no monthly fees. I can use them as much or as little as I need, and still have a fantastic experience. Sign-up was super simple, and was up and running in no time at all. I linked my Stripe account to my Freshbooks for invoicing, and was able to go. I did get an email a few days after signup from their support team just asking what the nature of the business was. I responded, offering to provide documentation, but simply explaining what my business was seemed to suffice for them, and there have been no further actions taken by Stripe. \n\nI like Stripe for several reasons. \n\n1) Backend reporting is SUPER easy, and very user friendly. That's what a dashboard is supposed to look like. Developers are able to easily find the information that they need for integrations, and they have a well organized API, along with instructions. \n\n2) They are perfect for those looking for a more \"professional\" look. Securing your site with SSL and integrating Stripe will give you the look and feel of the \"big boy e-commerce\" sites without spending a ton on customer payment server solutions. Yes, you do have to do a little work with the SSL certificates, but for user trust you should do that anyway. \n\n3) Fees are as follows: 2.9% + $.30 for a successful charge. No monthly fees. \n\n4) Works with your existing bank account, no need to \"transfer money.\" This is more along the lines of a traditional merchant account, with direct deposits. The slight downside to this is that they hold the charge amount for 7 days. While this may seem like an inconvenience (and it is to a certain extent), I see this as a necessary evil. Because it is easy to set-up and charge, that 7 day hold does help prevent some fraud, which is always a good thing. Is Stripe taking advantage of a \"float\" Probably, but again, I'm okay with that for the ease of dealing with them. \n\n5) Recurring payments… Love this feature. Built right in, and depending on how your front-end is set-up for managing recurring payments, this could make your life very easy. For instance, with my current integration with Freshbooks, I just need to create a recurring invoice, and my clients are billed on a monthly basis. Invoiced, charged, and sent a receipt all in one swoop, with money coming directly to me. \n\n6) I have not had a chance to experience what their support is like because I have been able to figure everything out from their documentation, and I have yet to have a chargeback, so I can't comment beyond what was previously mentioned. \n\n7) They do not currently have a way for you to take payments in a physical form. No card reader means that you are limited to online sales. I am currently not aware of plans for a physical reader. \n\nhttp://stripe.com\n\n\nPaypal\n\nThis has been the web standard if you will for payments. They have name recognition, and do offer some piece of mind when shopping online. From my experience with them, they are decent, but not fantastic. They work in a pinch, but I would migrate away from them when feasible. A few of my smaller clients (such as a mom who does baking) want to use PayPal just to get something set up and have the lowest cost possible associated with their business. Even SSL's run ~$60 a year from GoDaddy, and that's a lot of cookies to sell. Plus, there is the trust factor of going with some \"newfangled\" payment processor they have never heard of. \n\nPro and con list: \n\n1) They are trusted. As a consumer, if you see PayPal, you have a reasonable assumption that your money and data are going to be safe. The branding and consumer experience they have built is second-to-none, as well as other features like purchase insurance, etc. Buying on eBay and using this service is quite nice knowing if you buy something, there are several means of recourse. \n\n2) Scouring the web for reviews of PayPal will inevitably lead to horror stories of PayPal freezing merchant accounts for little to no reason, and then holding funds for a significant amount of time. Keeping a completely neutral approach to this, I see both PayPals need to combat fraud, and the merchants need for payment ASAP. I think that they could do much better job of communication at the very least. There have even been stories on Reddit of experienced and long-term sellers having accounts frozen. \n\n3) They have PayPal Here, allowing for in-person transactions. This is nice for in-person sellers, such as those who sell at farmers markets, flea markets, and craft fairs. \n\n4) PayPal has a feature that allows you to keep customers on your own site through the Direct Payments API, but I do not have experience with this. (Requires PayPal Pro @ $30 per month)\n\n5) You get a debit card. This is great for merchants who want to be able to immediately use funds in PayPal without waiting for an ACH transfer. More than a few times when I was starting out I would run a clients card, and then go to the ATM to take money out. Nice feature if you need immediate access to the money. \n\n6) Fees: 2.9% + $.30 per transaction for online sales, 2.7% when swiping a card in-person through PayPal Here, 3.5% + $.15 per manually entered card (you type the card number in). No monthly fees. \n\nhttp://paypal.com\n\n\nOthers\n\nWorth mentioning are a few other payment processors, as well as our good buddies at Square. \n\nSquare\n\nSquare is the brainchild of Twitter co-founder Jack Dorsey, and I think possibly one of the most disruptive payment technologies out there. They were the first to bring to market the headphone jack reader, and really were able to set the pace. Since then you have seen the majority of online merchant providers follow suit with a similar technology, such as PayPal Here, and Intuit GoPayments. \n\n1) I still haven't found a major horror story of Square customers. They are straight forward, and really make the payment process as simple as possible. Never had to interact with customer service, so I can't speak of a first hand account with them. I did have a food truck client that processed a $12k corporate catering event through them, and rightly so, they did freeze the transaction, but reached out with an immediate phone call and email. After submitting corporate documentation and also a signed invoice, they released the money and was only held for deposit an extra 24 hours. I'm glad red flags went up when a merchant who was processing transactions sub-$10 suddenly charged $12,000, but I must commend support for how they handled it, and made it as painless as possible while covering themselves. \n\n2) Square 2.0 is a thinner, sleeker version of the first dongle, and I like it much more than the old version. Fantastic for in person sellers. Now we just need people to understand the learning curve of signing a signature with their fingers. \n\n3) Fantastic tip integration. This makes it super simpler to tip a service provider. My stylist uses Square to process payments for her haircuts instead of the main salon credit card machine, and the 20% tip button makes it easy and transparent for me to leave a tip. \n\n4) There a TON of features of Square that would just make this post super long, but I love the Square Stand. They are really making strides in bringing affordable payments to smaller merchants, and giving them the proper technology to make it look like a seamless experience, not something hacked together. \n\n5) Next day deposits. This is fantastic, except when you process a credit card on Thursday after 5 pm. If you are accustomed to next day deposits, then it's worth noting that you won't get your money until Monday AM. Just a heads up. This beats Stripes 7 day rolling deposits, but would prevent you from using money collected on a Friday to pay bills with on Saturday. \n\n6) The only real downside is the lack of online store integration. In a perfect world, Square would have Stripe-like integrations and make it super simple for accept credit cards in-person and online through a webstore, and have it deposit next day. They are trying with the online store, but if I were taking a deposit for something, then I would have to create a product, and that's not exactly convenient. \n\n7) Fees: 2.75% per swipe or online sale, 3.5% + $.15 per manually entered card \n\nhttp://squareup.com\n\n\nBraintree (Have not personally used them, but they do tout some big names like GitHub, AirBnb, living social, and Uber as customers) \n\n1) Compatible with existing merchant accounts and lets you use them as a processor. Gatweway fee is $49 per month and $.10 per transaction. Reasonable. \n\n2) Able to handle foreign currency transactions\n\n3) 2 business day deposit schedule, 4 days for American Express transactions\n\n4) Immediate sign-up, but some industries are not allowed to use their platform, and reading through the terms, my favorite is tied between (27) fortune tellers, (31) mail-order brides, and (42) substances designed to mimic illegal drugs. I can only imagine the legal team putting this together. \n\n5) They have the option for recurring payments and the ability to integrate web hooks from a developer standpoint\n\n6) Fees: 2.9% + $.30 per transaction. No monthly fees\n\nOverall, Braintree is a decent platform, and if it is suggested by a developer, should be considered, but if your going to go with Braintree, my personal thoughts would be to use Stripe. Just my $.02. \n\nhttp://braintreepayments.com\n\n\nChargify (Have not used them, clients include News Corp Australia, StockTwits, and Get Satisfaction)\n\n\n1) Main focus is on subscription / recurring billing. Website touts an iPhone app dashboard allowing you to see sales and subscribers. \n\n2) Allows you to create multiple businesses, would be perfect for a subscription service providing news across multiple sites, or a web design firm looking to integrate subscription payments into multiple clients accounts. \n\n3) Serious set of integrations, such as Quickbooks, Salesforce, Shopify, Xero accounting, and Zapier. From the feature set and integrations, these guys are the top end of the subscription management / billing platforms. But you'll pay for it. \n\n4) Fees: Free test account (really nice), $65-$459 per month for standard biz plans (Enterprise starts at $1,299) \n\nThis would be the \"premium\" subscription service I would use to manage a large, subscription focused business. Yes, you could start out with something like a Stripe recurring billing, Freshbooks, or a Stripe / WooCommerce / Subscription model, but these guys seem to have it figured out, and they seem to justify their higher price. \n\nhttp://chargify.com\n\n\nRecurly (Have not used them, customers include Groupon, Adobe, dropcam, and BarkBox)\n\n1) Subscription gateway only. Customer will still need to have a merchant account. Looking on their site, you can use quite a few of them, including Authorize.net, Braintree, PayPal Payments Pro, and Stripe (in Beta). \n\n2) Allows clients to create subscriptions with trials and set-up fees, as well as integrate coupons and discounts. \n\n3) One-time transactions are allowed, such as \"offer items for purchase which lead to a subscription for premium services at a later date.\" \n\n4) Metered billing is allowed and supported through this platform. (For instance, if you had a video site where people paid per minute to watch videos, etc.) Variable metered billing is also available (in pervious example, Gold Members could be charged $.10 per minute to watch, while Silver Members are charged $.20 per minute). \n\n5) They provide hosted payment pages, eliminating the need for PCI compliance. \n\n6) Fees: $99/month for credit card only subscriptions and $299/month for CC, checks, and international currencies. Credit card billing is $.10 + 1.25% of revenue per transaction, plus $1 per invoice for $299 plan. \n\nThis would be a great solution for someone just starting out with subscriptions, and wants to dip their feet into the water and test an idea.\n\nhttp://recurly.com \n\n\nI hope /r/entrepreneur finds this guide useful, and if I missed anything, feel free to mention it in a comment! \n\nEdit: Changed 2.9% + 30% to 2.9% + $.30 for Stripe. \n\nEdit 2: Changed another 30% to $.30 for Stripe... Wow... Really wanted to have them charge 30% ",
  "gilded": 0,
  "score": 229,
  "removal_reason": null,
  "approved_by": null,
  "created_utc": 1390446616.0,
  "is_self": true,
  "stickied": false,
  "edited": 1390503918.0,
  "distinguished": null,
  "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1vwtct/how_to_take_money_from_your_customers/?ref=search_posts",
  "banned_by": null,
  "from_id": null,
  "likes": null,
  "_underscore_names": null,
  "num_reports": null,
  "link_flair_css_class": null,
  "_info_url": "https://api.reddit.com/api/info/",
  "id": "1vwtct",
  "archived": true,
  "secure_media": null,
  "from_kind": null,
  "saved": false,
  "domain": "self.Entrepreneur",
  "ups": 229,
  "suggested_sort": null,
  "quarantine": false,
  "over_18": false,
  "hide_score": false,
  "url": "https://www.reddit.com/r/Entrepreneur/comments/1vwtct/how_to_take_money_from_your_customers/",
  "subreddit_id": "t5_2qldo",
  "_params": {},
  "_comments": null,
  "_replaced_more": false,
  "_comments_by_id": {},
  "user_reports": [],
  "media_embed": {},
  "created": 1390446616.0,
  "author_flair_text": null,
  "visited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For those of us who frequent <a href=\"/r/entrepreneur\">/r/entrepreneur</a>,  I&#39;m sure that we have all noticed that with relative frequency someone asks &quot;who can process payments for my website&quot; and &quot;whats the best payment processor?&quot; </p>\n\n<p>I figured since I have some experience with online payment processors, I wanted to share my thoughts and opinions on payment processors, and hopefully provide information for fellow readers to make their own decisions, and to share their experiences. </p>\n\n<p>***Disclaimer: I am focusing on payment solutions geared towards smaller merchants that process &amp;lt;$10,000 per month. Volume sellers can get special rates negotiated through the platforms. These will vary from business to business. This is also mostly USA focused. Sorry international readers. Also, none of the links are referral links. </p>\n\n<p>tl;dr to save you time: </p>\n\n<p>Stripe: 2.9% + $.30 for a successful charge. No monthly fees. Perfect for customized look, new biz friendly. Personal fave.</p>\n\n<p>PayPal: 2.9% + $.30 per transaction for online sales, 2.7% when swiping a card in-person through PayPal Here, 3.5% + $.15 per manually entered card (you type the card number in). No monthly fees. Fantastic brand recognition. Some horror stories. </p>\n\n<p>Square: 2.75% per swipe or online sale, 3.5% + $.15 per manually entered card. Focused on in-person sales. </p>\n\n<p>Braintree: 2.9% + $.30 per transaction. No monthly fees. Stripe alternative. Would recommend Stripe. </p>\n\n<p>Chargify: Free test account (really nice), $65-$459 per month for standard biz plans (Enterprise starts at $1,299). Focused on subscription based biz. Feature rich. Full solution. </p>\n\n<p>Recurly: $99/month for credit card only subscriptions and $299/month for CC, checks, and international currencies. Credit card billing is $.10 + 1.25% of revenue per transaction, plus $1 per invoice for $299 plan. Great beginner solution for MVP. Gateway only. Fees are in addition to processor fees. </p>\n\n<p>The big guys: Stripe and Paypal</p>\n\n<p>Stripe </p>\n\n<p>I currently use Stripe, both as an e-commerce payment processor, and for invoicing through Freshbooks (fantastic service, highly recommended). For my needs, Stripe works perfectly. I get integration with exactly what I need, and have no monthly fees. I can use them as much or as little as I need, and still have a fantastic experience. Sign-up was super simple, and was up and running in no time at all. I linked my Stripe account to my Freshbooks for invoicing, and was able to go. I did get an email a few days after signup from their support team just asking what the nature of the business was. I responded, offering to provide documentation, but simply explaining what my business was seemed to suffice for them, and there have been no further actions taken by Stripe. </p>\n\n<p>I like Stripe for several reasons. </p>\n\n<p>1) Backend reporting is SUPER easy, and very user friendly. That&#39;s what a dashboard is supposed to look like. Developers are able to easily find the information that they need for integrations, and they have a well organized API, along with instructions. </p>\n\n<p>2) They are perfect for those looking for a more &quot;professional&quot; look. Securing your site with SSL and integrating Stripe will give you the look and feel of the &quot;big boy e-commerce&quot; sites without spending a ton on customer payment server solutions. Yes, you do have to do a little work with the SSL certificates, but for user trust you should do that anyway. </p>\n\n<p>3) Fees are as follows: 2.9% + $.30 for a successful charge. No monthly fees. </p>\n\n<p>4) Works with your existing bank account, no need to &quot;transfer money.&quot; This is more along the lines of a traditional merchant account, with direct deposits. The slight downside to this is that they hold the charge amount for 7 days. While this may seem like an inconvenience (and it is to a certain extent), I see this as a necessary evil. Because it is easy to set-up and charge, that 7 day hold does help prevent some fraud, which is always a good thing. Is Stripe taking advantage of a &quot;float&quot; Probably, but again, I&#39;m okay with that for the ease of dealing with them. </p>\n\n<p>5) Recurring payments… Love this feature. Built right in, and depending on how your front-end is set-up for managing recurring payments, this could make your life very easy. For instance, with my current integration with Freshbooks, I just need to create a recurring invoice, and my clients are billed on a monthly basis. Invoiced, charged, and sent a receipt all in one swoop, with money coming directly to me. </p>\n\n<p>6) I have not had a chance to experience what their support is like because I have been able to figure everything out from their documentation, and I have yet to have a chargeback, so I can&#39;t comment beyond what was previously mentioned. </p>\n\n<p>7) They do not currently have a way for you to take payments in a physical form. No card reader means that you are limited to online sales. I am currently not aware of plans for a physical reader. </p>\n\n<p><a href=\"http://stripe.com\">http://stripe.com</a></p>\n\n<p>Paypal</p>\n\n<p>This has been the web standard if you will for payments. They have name recognition, and do offer some piece of mind when shopping online. From my experience with them, they are decent, but not fantastic. They work in a pinch, but I would migrate away from them when feasible. A few of my smaller clients (such as a mom who does baking) want to use PayPal just to get something set up and have the lowest cost possible associated with their business. Even SSL&#39;s run ~$60 a year from GoDaddy, and that&#39;s a lot of cookies to sell. Plus, there is the trust factor of going with some &quot;newfangled&quot; payment processor they have never heard of. </p>\n\n<p>Pro and con list: </p>\n\n<p>1) They are trusted. As a consumer, if you see PayPal, you have a reasonable assumption that your money and data are going to be safe. The branding and consumer experience they have built is second-to-none, as well as other features like purchase insurance, etc. Buying on eBay and using this service is quite nice knowing if you buy something, there are several means of recourse. </p>\n\n<p>2) Scouring the web for reviews of PayPal will inevitably lead to horror stories of PayPal freezing merchant accounts for little to no reason, and then holding funds for a significant amount of time. Keeping a completely neutral approach to this, I see both PayPals need to combat fraud, and the merchants need for payment ASAP. I think that they could do much better job of communication at the very least. There have even been stories on Reddit of experienced and long-term sellers having accounts frozen. </p>\n\n<p>3) They have PayPal Here, allowing for in-person transactions. This is nice for in-person sellers, such as those who sell at farmers markets, flea markets, and craft fairs. </p>\n\n<p>4) PayPal has a feature that allows you to keep customers on your own site through the Direct Payments API, but I do not have experience with this. (Requires PayPal Pro @ $30 per month)</p>\n\n<p>5) You get a debit card. This is great for merchants who want to be able to immediately use funds in PayPal without waiting for an ACH transfer. More than a few times when I was starting out I would run a clients card, and then go to the ATM to take money out. Nice feature if you need immediate access to the money. </p>\n\n<p>6) Fees: 2.9% + $.30 per transaction for online sales, 2.7% when swiping a card in-person through PayPal Here, 3.5% + $.15 per manually entered card (you type the card number in). No monthly fees. </p>\n\n<p><a href=\"http://paypal.com\">http://paypal.com</a></p>\n\n<p>Others</p>\n\n<p>Worth mentioning are a few other payment processors, as well as our good buddies at Square. </p>\n\n<p>Square</p>\n\n<p>Square is the brainchild of Twitter co-founder Jack Dorsey, and I think possibly one of the most disruptive payment technologies out there. They were the first to bring to market the headphone jack reader, and really were able to set the pace. Since then you have seen the majority of online merchant providers follow suit with a similar technology, such as PayPal Here, and Intuit GoPayments. </p>\n\n<p>1) I still haven&#39;t found a major horror story of Square customers. They are straight forward, and really make the payment process as simple as possible. Never had to interact with customer service, so I can&#39;t speak of a first hand account with them. I did have a food truck client that processed a $12k corporate catering event through them, and rightly so, they did freeze the transaction, but reached out with an immediate phone call and email. After submitting corporate documentation and also a signed invoice, they released the money and was only held for deposit an extra 24 hours. I&#39;m glad red flags went up when a merchant who was processing transactions sub-$10 suddenly charged $12,000, but I must commend support for how they handled it, and made it as painless as possible while covering themselves. </p>\n\n<p>2) Square 2.0 is a thinner, sleeker version of the first dongle, and I like it much more than the old version. Fantastic for in person sellers. Now we just need people to understand the learning curve of signing a signature with their fingers. </p>\n\n<p>3) Fantastic tip integration. This makes it super simpler to tip a service provider. My stylist uses Square to process payments for her haircuts instead of the main salon credit card machine, and the 20% tip button makes it easy and transparent for me to leave a tip. </p>\n\n<p>4) There a TON of features of Square that would just make this post super long, but I love the Square Stand. They are really making strides in bringing affordable payments to smaller merchants, and giving them the proper technology to make it look like a seamless experience, not something hacked together. </p>\n\n<p>5) Next day deposits. This is fantastic, except when you process a credit card on Thursday after 5 pm. If you are accustomed to next day deposits, then it&#39;s worth noting that you won&#39;t get your money until Monday AM. Just a heads up. This beats Stripes 7 day rolling deposits, but would prevent you from using money collected on a Friday to pay bills with on Saturday. </p>\n\n<p>6) The only real downside is the lack of online store integration. In a perfect world, Square would have Stripe-like integrations and make it super simple for accept credit cards in-person and online through a webstore, and have it deposit next day. They are trying with the online store, but if I were taking a deposit for something, then I would have to create a product, and that&#39;s not exactly convenient. </p>\n\n<p>7) Fees: 2.75% per swipe or online sale, 3.5% + $.15 per manually entered card </p>\n\n<p><a href=\"http://squareup.com\">http://squareup.com</a></p>\n\n<p>Braintree (Have not personally used them, but they do tout some big names like GitHub, AirBnb, living social, and Uber as customers) </p>\n\n<p>1) Compatible with existing merchant accounts and lets you use them as a processor. Gatweway fee is $49 per month and $.10 per transaction. Reasonable. </p>\n\n<p>2) Able to handle foreign currency transactions</p>\n\n<p>3) 2 business day deposit schedule, 4 days for American Express transactions</p>\n\n<p>4) Immediate sign-up, but some industries are not allowed to use their platform, and reading through the terms, my favorite is tied between (27) fortune tellers, (31) mail-order brides, and (42) substances designed to mimic illegal drugs. I can only imagine the legal team putting this together. </p>\n\n<p>5) They have the option for recurring payments and the ability to integrate web hooks from a developer standpoint</p>\n\n<p>6) Fees: 2.9% + $.30 per transaction. No monthly fees</p>\n\n<p>Overall, Braintree is a decent platform, and if it is suggested by a developer, should be considered, but if your going to go with Braintree, my personal thoughts would be to use Stripe. Just my $.02. </p>\n\n<p><a href=\"http://braintreepayments.com\">http://braintreepayments.com</a></p>\n\n<p>Chargify (Have not used them, clients include News Corp Australia, StockTwits, and Get Satisfaction)</p>\n\n<p>1) Main focus is on subscription / recurring billing. Website touts an iPhone app dashboard allowing you to see sales and subscribers. </p>\n\n<p>2) Allows you to create multiple businesses, would be perfect for a subscription service providing news across multiple sites, or a web design firm looking to integrate subscription payments into multiple clients accounts. </p>\n\n<p>3) Serious set of integrations, such as Quickbooks, Salesforce, Shopify, Xero accounting, and Zapier. From the feature set and integrations, these guys are the top end of the subscription management / billing platforms. But you&#39;ll pay for it. </p>\n\n<p>4) Fees: Free test account (really nice), $65-$459 per month for standard biz plans (Enterprise starts at $1,299) </p>\n\n<p>This would be the &quot;premium&quot; subscription service I would use to manage a large, subscription focused business. Yes, you could start out with something like a Stripe recurring billing, Freshbooks, or a Stripe / WooCommerce / Subscription model, but these guys seem to have it figured out, and they seem to justify their higher price. </p>\n\n<p><a href=\"http://chargify.com\">http://chargify.com</a></p>\n\n<p>Recurly (Have not used them, customers include Groupon, Adobe, dropcam, and BarkBox)</p>\n\n<p>1) Subscription gateway only. Customer will still need to have a merchant account. Looking on their site, you can use quite a few of them, including Authorize.net, Braintree, PayPal Payments Pro, and Stripe (in Beta). </p>\n\n<p>2) Allows clients to create subscriptions with trials and set-up fees, as well as integrate coupons and discounts. </p>\n\n<p>3) One-time transactions are allowed, such as &quot;offer items for purchase which lead to a subscription for premium services at a later date.&quot; </p>\n\n<p>4) Metered billing is allowed and supported through this platform. (For instance, if you had a video site where people paid per minute to watch videos, etc.) Variable metered billing is also available (in pervious example, Gold Members could be charged $.10 per minute to watch, while Silver Members are charged $.20 per minute). </p>\n\n<p>5) They provide hosted payment pages, eliminating the need for PCI compliance. </p>\n\n<p>6) Fees: $99/month for credit card only subscriptions and $299/month for CC, checks, and international currencies. Credit card billing is $.10 + 1.25% of revenue per transaction, plus $1 per invoice for $299 plan. </p>\n\n<p>This would be a great solution for someone just starting out with subscriptions, and wants to dip their feet into the water and test an idea.</p>\n\n<p><a href=\"http://recurly.com\">http://recurly.com</a> </p>\n\n<p>I hope <a href=\"/r/entrepreneur\">/r/entrepreneur</a> finds this guide useful, and if I missed anything, feel free to mention it in a comment! </p>\n\n<p>Edit: Changed 2.9% + 30% to 2.9% + $.30 for Stripe. </p>\n\n<p>Edit 2: Changed another 30% to $.30 for Stripe... Wow... Really wanted to have them charge 30% </p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "_comment_sort": null,
  "report_reasons": null,
  "name": "t3_1vwtct",
  "from": null,
  "hidden": false,
  "clicked": false,
  "media": null,
  "json_dict": null,
  "_api_link": "https://api.reddit.com/r/Entrepreneur/comments/1vwtct/how_to_take_money_from_your_customers/?ref=search_posts",
  "secure_media_embed": {},
  "mod_reports": [],
  "_orphaned": {},
  "_uniq": null,
  "num_comments": 95,
  "link_flair_text": null,
  "title": "How to take money from your customers.",
  "_has_fetched": true,
  "author_flair_css_class": null,
  "thumbnail": ""
}