{
  "selftext": "EDIT #7 TLDR\nEarly 2000s, RZA meets Cilvaringz, a dude out of Morocco who ran a Wu-tang fan forum, and is impressed with him.  Makes Cilvaringz forum the official website, and makes him 'extended wu-fam'.  Cilvaringz began working on his own solo rap album, and a Wu-tang album.  The solo album eventually came out.  During the development of the Wu-tang album, Cilvaringz regularly updated the fans on the progress, played samples, etc etc. over many years (~8-10).  He was able to get the entire Wu-tang clan on the album multiple times, because unlike RZA, he was more than willing to pay all of their asking rates.  Unfortunately,  the return of investment for Wu-Tang albums definitely plummeted, along with most acts from that era.  Cilvaringz tried to get record labels to put the album out traditionally, but was unable to due to how expensive it was to make.  He also wasn't getting too much help from RZA.  He thought of a way to get RZA's cosign, and hopefully make his money back, by increasing the value of his exclusive wu-tang album by making it 1 copy only, and it would be toured in museums.  RZA was about this idea, because he was making his own album \"A Better Tomorrow\", and why not generate buzz for the clan?  So RZA, attached himself to this idea.  They have scrapped the museum tour, added an 88 year copywrite (preventing any investor from buying the album and making more than they invested), and essentially selling the copy to the richest bidder.  The lies started happening when they began re-writing history that this was a grand RZA scheme, because it is the only way to sell a Cilvaringz Wu-tang album(for 5 million+), by replacing Cilvaringz major involvement with RZA.  The evidence is a lot of common sense, the fact that Cilvaringz has now gone back and deleted everything he ever said about the album to match up with their current lies, a blogpost from years ago from someone who heard the album, and **also the fact that RZA was publicly trashing Raekwon and other members for not getting on his Wu-tang album, but secretly working on another Wu-tang album that features all of them multiple times?**\n\n___\nOkay.  Many years ago (~10), a Wu-Tang superfan named [Cilvaringz](http://cdn.hiphop.gr/pages/archive/cilvaringz.method.man.jpg), from Morocco, connected with RZA at a show in Amsterdam. Through this RZA was impressed with this guys spirituality and business sense, that he made him extended 'wu-fam', whatever that means, and made Cilvaringz website, Wu-Tang Corp, the official Wu-tang site / forum, and also help in hooking them up with international connections.  Cilvaringz considered himself a rapper and producer, and began working on two albums, his solo album and a Wu-Tang album.  The solo album came out a long time ago, and has various verses from some of the members.  The other album, he basically worked on over a few years.\n\nNow, Cilvaringz either funded this album himself OR he had a partner to basically pay for verses from various members of the clan.  So Cilvaringz channeled his inner 90's RZA with the beats and the feel, and over time(multiple years), paid the members of the clan either outright, or linked up business for them and traded verses.  If you have paid attention to many of the gripes from the 7 members besides RZA&GZA, it is almost always over money, and more recently over the direction of the albums.  Because RZA was the producer on most of the Wu-albums, he always made more money than the rappers on a track.  This is why you don't see many rap super groups because the pie can get split so many ways.  The problem is, as Wu-tang has become a smaller and smaller money draw for record labels, the funding got smaller and smaller for albums.  So people like Raekwon who typically get paid X amount for a verse, are now being asked by RZA, who owns the brand and always has made more money than anyone else, to do albums for less for the Wu-Legacy.  You can argue either side to be honest, but Cilvaringz was able to get all these verses over the years by meeting these guys rates.  So although the newest official RZA Wu-tang album only had a few verses from Rae, the Cilvaringz album has 7+.  The Cilvaringz produced Wu-Album has all members (even ODB), sketches, extended wu-fam, cher, etc.  **The album and verses was paid for out of pocket, with RZA's direction and production, being replaced by Cilvaringz.**\n\n\nNow RZA wasn't really following the Cilvaringz development of the album, as it was something he agreed to YEARS ago.  I mean, the writing is on the wall, this guy helped Wu-Tang years ago by running an internet forum for them, being a super fan, and hooking them up with European connections to increase their international work and help with touring etc etc.  As things winded down, and RZA stepped into other ventures besides rap, this guy Cilvaringz is plugging away at the album.  When it was finally ready (years ago), he had trouble selling the album to any record labels.  This is because nobody knows who Cilvaringz is, and Wu-Tang albums have always been what they are because of RZA's heavy involvement.  So at this point, RZA could have thrown his full support behind this guy somehow, but the problem is that RZA has tried and failed for YEARS to do what Cilvaringz successfully did.  RZA wants to push the envelope and be an 'artist' and use Obo's and all sorts of weird instruments, which has never gone well with Raekwon and the clan (google it, Rae shit all over 8 Diagrams before it came out).  So it would take RZA, who has some history of being a control freak, to step aside and let someone else, who nobody knows of, come in and do a better job than him?  He let that shit hang out to dry, while Cilvaringz tried and failed to get a record label to buy this album for its cost.  Because the album has been made over many years, the cost to make back what it took to make is way over what rap albums get a budget for in 2015.  Especially Wu-tang albums.  Especially Cilvaringz Wu-tang Albums.\n\nSo.  **HERE IS WHERE WE ARE NOW.**  Cilvaringz, not wanting his 'lifes work', the most important thing hes been working on for possibly 10 years, become a footnote on 2dopeboyz, and basically be an album everyone forgets about if they put it out digitally, he decides as a last ditch effort to do the whole museum thing.  RZA signed on because A Better Tomorrow (the shitty Wu-tang album RZA was working on) was going to come out, and what better publicity for Wu-Tang than to one day declare their work as 'high art'.  So RZA glommed to Cilvaringz idea, but out of necessity it seems because if you look at all the interviews now, you barely see any mention on how the entire album is produced by Cilvaringz.  This isn't a RZA album.  But while they talk about 88 years, and auction this album off, they realize that AGAIN, its impossible to sell a Cilvaringz produced Wu-tang album for 5 Million.  \n\nSo now we get some bullshit story about them thinking of the entire idea while climbing mountains and shit.  It is all a lie.  And i'm not surprised the members (like Method Man) are furious about all of this.  They were already paid for their verses.  They should be furious as it hurts their image.  How is that cool to the fans that there is a Wu-Tang album that everyone reading this forum post will be dead by the time it drops?  I'd be surprised if anyone besides RZA and Cilvaringz makes any money off of this.  Instead of Cilvaringz finding a way to release this album and maintain his credits and majority role in this albums creation, he is going for a cash grab and downplaying his role in this album.  They HAVE to, as the only way this album is auctioned for millions is if RZA was the main player in it.\n\nThe bottom line is, by everyone that has heard the Cilvaringz Wu-Tang Album, **they say it is the best Wu album since Wu-tang Forever.**  Because of this behind the scenes shady RZA / Cilvaringz politics, **we may never hear the album.**  They aren't even touring the album first, as a requirement, as they want to just sell this and move on.  I find it funny that RZA is tweeting that the 88 years is so that the album is protected from corporations and commercialization.  I forgot about all the Lincoln and Toyota commercials I've seen that use Wu-Tang clan songs, so I'm glad RZA is protecting the brand.  I find it laughable.\n\nI can't even begin to start citing my sources.  I made this throw-away because I think its a shame that people like Raekwon, Method Man, Ghostface etc are getting bad publicity because of RZA and Cilvaringz taking a giant dump on Wu-tang fans and the legacy.  Believe me or don't believe me, but I've been following the group since the 90's, I followed Cilvaringz development of his albums through Wu-Tang Corp, and the spin is in. **Please, direct your anger at RZA and Cilvaringz for this album, as the clan members that actually have been rapping and putting out dope albums the past 20 years, have nothing to do with how this stupid Cilvaringz Wu-tang album is being handled.**\n\nEDIT - MY REPLY TO A COMMENT.  **Someone hooked me up with some evidence to substantiate what I'm talking about.**\n\nAll anyone needs to do is ask RZA specific details on the overall creation of the album(the wheres and the whens).  Also this dude Andrew Kelley, who was involved with Chamber Music, Legendary Weapons, 12 Reasons to Die, and 36 Seasons,  actually heard the Cilvaringz album when Cilva was bringing it to various labels and previewing it, and he highly reviewed the album.  The post is 2+ years old, and there is no mention of RZA in this until the very end, where he says : \"The next time I sit down with RZA I will definitely be speaking with him about this album. Finish it up Ringz, all Wu-Tang fans deserve that “time machine” moment.\"\n\nhttp://andrewkelley47.tumblr.com/post/52815181151/cilvaringz-wu-tang-album-coming-soon\n\n\nEDIT 2 : \n\n**Cilvaringz has gone through and deleted tons of old posts in regards to the development of this.  I am now combing through the wayback machine to find old posts of his.  Just look pre-2014 for posts by Cilvaringz that pretty much expose what I'm saying.  All mentions of the Andrew Kelley blog post talking about the album were retroactively deleted by Cilvaringz, who runs the forum.**\n\n** **Sneak Edit 4 - YOU CANT EVEN DO THIS BECAUSE THE WAYBACK MACHINE DIDN'T SAVE THE FORUM POSTS.  SO CILVARINGZ CAN RE-WRITE HISTORY BY DELETING EVERY POST THAT MENTIONS THE ALBUMs DEVELOPMENT AND PRETEND LIKE HE DIDN'T EXCLUSIVELY MAKE THIS ALBUM THAT THEY ARE LYING TO PEOPLE ABOUT.**\n\nEDIT 3 :\n\nHere is a post talking about the listening session: http://www.wutang-corp.com/forum/showthread.php?t=131390\n\nWhat I'd like to point to is here:\nhttp://www.wutang-corp.com/forum/showpost.php?p=2488043&postcount=5\n\n\"**It drives me nuts though how much Rza is basking in the glory of this project and seems to get a lot of the production credit in the media. At one point this year, Ringz said on here that he let Rza listen to the finished product for the first time from start to finish, so Rza couldn't change anything. Then in this interview, he makes it out like Rza made him change snares and drums on tracks and that Rza was on board for the last 3 years.** \n\nLOL @[12:06](https://www.youtube.com/watch?v=7cAqT6dSBh8&t=12m06s) that he says he's doing this for the fans. Refresh my memory on how the fans benefit from this work of art? @[13:02](https://www.youtube.com/watch?v=7cAqT6dSBh8&t=13m2s) \"Closure sonically for the fans\". @[9:47](https://www.youtube.com/watch?v=7cAqT6dSBh8&t=9m47s) Rza ducking the question and talking about dinosaur bones. Complete bullshit rambling.\"\n\n**Edit 5**\n**Cilvaringz responds to repeatedly being called a liar:** (just check the pages)\nhttp://www.wutang-corp.com/forum/showthread.php?t=131359&page=12\n\nhttp://www.wutang-corp.com/forum/showpost.php?p=2488137&postcount=168\n\"But why refer to changing ideas as lying?\"\n\nhttp://www.wutang-corp.com/forum/showpost.php?p=2488164&postcount=179\n\"There's no use discussing this any further because things really aren't going to change and its no use explaining it every time to every member on this forum. So the best thing to do is to continue to use this forum and other forums to vent out all the anger, disappointment and whatever other emotions are coming out. Call it whatever you want, use your freedom of speech and wild out. When things calm down, lets not ever bring it up again! Peace!\"\n\n**RZA RESPONDS (AND LIES)**\nhttps://twitter.com/RZA/status/573391180416733184\n\n\"A lot of you are not listening to what is already in front of you. This has always been a Single album concept. No surprises. #new idea\"\n\nCilvarings was actively trying to get record labels to buy this album, and he finally got RZA to cosign the album when he pitched a museum idea, which has now evolved into sell the album to 1 person and hope he leaks it for the rest of the world.\n\n**EDIT #6**\n\nI am having trouble responding to everyone's questions, and didn't want new explanations to be burried.\n\nOne question that keeps getting asked is what is up with the vilification of RZA?\n\nIt is vilification because honestly the dude has a history of being a snake.  Google how many members have [complained](http://www.hotnewhiphop.com/raekwon-discusses-beef-within-wu-tang-clan-news.4213.html) about him or [outright](http://metallungies.com/2008/07/the-rza-speaks-on-conflict-within-the-wu-tang/) had to [sue](http://www.vulture.com/2009/10/rza_explains_why_he_keeps_gett.html) [him](http://www.tmz.com/2012/12/15/rza-wu-tang-clan-royalites-dutch-lawsuit/).  I can get better links but I just googled \"RZA Sue\" and tried to weed through the articles that weren't him suing The Game.\n\n[Also, remember when he was complaining publicly that Raekwon wasn't recording verses for \"A Better Tomorrow?\"](http://www.billboard.com/articles/columns/the-juice/6062825/the-beef-rza-raekwon-bicker-over-wu-tang-clans-a-better-tomorrow)  **So you mean to tell me that RZA was publicly complaining about Raekwon getting on one album, while secretly making another Wu-tang album that has Raekwon on it a lot? Come the fuck on.**\n\nRZA didn't cosign this project until the very end.  [RZA has a history of being an egomaniac when it comes to Wu-Tang album control.](http://www.rollingstone.com/music/news/q-a-raekwon-on-strike-from-wu-tang-blasts-rza-for-mediocre-music-20140417).  Cilvaringz devised a plan to get RZA's involvement by spinning the album to be a piece of art that belongs in museums.  In order to sell that plan, they need to rewrite history that RZA was a part of this project all along.\n\n**Edit 8**\n\nhttp://www.reddit.com/r/hiphopheads/comments/2y0mwl/the_truth_behind_the_new_wutang_album/cp5ziiw\n\n**edit 9** 3/6/15\nhttp://www.reddit.com/r/hiphopheads/comments/2y0mwl/the_truth_behind_the_new_wutang_album/cp6qirj\n",
  "gilded": 2,
  "score": 2276,
  "removal_reason": null,
  "approved_by": null,
  "created_utc": 1425560574.0,
  "is_self": true,
  "stickied": false,
  "edited": 1425685504.0,
  "distinguished": null,
  "permalink": "https://www.reddit.com/r/hiphopheads/comments/2y0mwl/the_truth_behind_the_new_wutang_album/?ref=search_posts",
  "banned_by": null,
  "from_id": null,
  "likes": null,
  "_underscore_names": null,
  "num_reports": null,
  "link_flair_css_class": null,
  "_info_url": "https://api.reddit.com/api/info/",
  "id": "2y0mwl",
  "archived": true,
  "secure_media": null,
  "from_kind": null,
  "saved": false,
  "domain": "self.hiphopheads",
  "ups": 2276,
  "suggested_sort": null,
  "quarantine": false,
  "over_18": false,
  "hide_score": false,
  "url": "https://www.reddit.com/r/hiphopheads/comments/2y0mwl/the_truth_behind_the_new_wutang_album/",
  "subreddit_id": "t5_2rh4c",
  "_params": {},
  "_comments": null,
  "_replaced_more": false,
  "_comments_by_id": {},
  "user_reports": [],
  "media_embed": {},
  "created": 1425560574.0,
  "author_flair_text": "",
  "visited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>EDIT #7 TLDR\nEarly 2000s, RZA meets Cilvaringz, a dude out of Morocco who ran a Wu-tang fan forum, and is impressed with him.  Makes Cilvaringz forum the official website, and makes him &#39;extended wu-fam&#39;.  Cilvaringz began working on his own solo rap album, and a Wu-tang album.  The solo album eventually came out.  During the development of the Wu-tang album, Cilvaringz regularly updated the fans on the progress, played samples, etc etc. over many years (~8-10).  He was able to get the entire Wu-tang clan on the album multiple times, because unlike RZA, he was more than willing to pay all of their asking rates.  Unfortunately,  the return of investment for Wu-Tang albums definitely plummeted, along with most acts from that era.  Cilvaringz tried to get record labels to put the album out traditionally, but was unable to due to how expensive it was to make.  He also wasn&#39;t getting too much help from RZA.  He thought of a way to get RZA&#39;s cosign, and hopefully make his money back, by increasing the value of his exclusive wu-tang album by making it 1 copy only, and it would be toured in museums.  RZA was about this idea, because he was making his own album &quot;A Better Tomorrow&quot;, and why not generate buzz for the clan?  So RZA, attached himself to this idea.  They have scrapped the museum tour, added an 88 year copywrite (preventing any investor from buying the album and making more than they invested), and essentially selling the copy to the richest bidder.  The lies started happening when they began re-writing history that this was a grand RZA scheme, because it is the only way to sell a Cilvaringz Wu-tang album(for 5 million+), by replacing Cilvaringz major involvement with RZA.  The evidence is a lot of common sense, the fact that Cilvaringz has now gone back and deleted everything he ever said about the album to match up with their current lies, a blogpost from years ago from someone who heard the album, and <strong>also the fact that RZA was publicly trashing Raekwon and other members for not getting on his Wu-tang album, but secretly working on another Wu-tang album that features all of them multiple times?</strong></p>\n\n<hr/>\n\n<p>Okay.  Many years ago (~10), a Wu-Tang superfan named <a href=\"http://cdn.hiphop.gr/pages/archive/cilvaringz.method.man.jpg\">Cilvaringz</a>, from Morocco, connected with RZA at a show in Amsterdam. Through this RZA was impressed with this guys spirituality and business sense, that he made him extended &#39;wu-fam&#39;, whatever that means, and made Cilvaringz website, Wu-Tang Corp, the official Wu-tang site / forum, and also help in hooking them up with international connections.  Cilvaringz considered himself a rapper and producer, and began working on two albums, his solo album and a Wu-Tang album.  The solo album came out a long time ago, and has various verses from some of the members.  The other album, he basically worked on over a few years.</p>\n\n<p>Now, Cilvaringz either funded this album himself OR he had a partner to basically pay for verses from various members of the clan.  So Cilvaringz channeled his inner 90&#39;s RZA with the beats and the feel, and over time(multiple years), paid the members of the clan either outright, or linked up business for them and traded verses.  If you have paid attention to many of the gripes from the 7 members besides RZA&amp;GZA, it is almost always over money, and more recently over the direction of the albums.  Because RZA was the producer on most of the Wu-albums, he always made more money than the rappers on a track.  This is why you don&#39;t see many rap super groups because the pie can get split so many ways.  The problem is, as Wu-tang has become a smaller and smaller money draw for record labels, the funding got smaller and smaller for albums.  So people like Raekwon who typically get paid X amount for a verse, are now being asked by RZA, who owns the brand and always has made more money than anyone else, to do albums for less for the Wu-Legacy.  You can argue either side to be honest, but Cilvaringz was able to get all these verses over the years by meeting these guys rates.  So although the newest official RZA Wu-tang album only had a few verses from Rae, the Cilvaringz album has 7+.  The Cilvaringz produced Wu-Album has all members (even ODB), sketches, extended wu-fam, cher, etc.  <strong>The album and verses was paid for out of pocket, with RZA&#39;s direction and production, being replaced by Cilvaringz.</strong></p>\n\n<p>Now RZA wasn&#39;t really following the Cilvaringz development of the album, as it was something he agreed to YEARS ago.  I mean, the writing is on the wall, this guy helped Wu-Tang years ago by running an internet forum for them, being a super fan, and hooking them up with European connections to increase their international work and help with touring etc etc.  As things winded down, and RZA stepped into other ventures besides rap, this guy Cilvaringz is plugging away at the album.  When it was finally ready (years ago), he had trouble selling the album to any record labels.  This is because nobody knows who Cilvaringz is, and Wu-Tang albums have always been what they are because of RZA&#39;s heavy involvement.  So at this point, RZA could have thrown his full support behind this guy somehow, but the problem is that RZA has tried and failed for YEARS to do what Cilvaringz successfully did.  RZA wants to push the envelope and be an &#39;artist&#39; and use Obo&#39;s and all sorts of weird instruments, which has never gone well with Raekwon and the clan (google it, Rae shit all over 8 Diagrams before it came out).  So it would take RZA, who has some history of being a control freak, to step aside and let someone else, who nobody knows of, come in and do a better job than him?  He let that shit hang out to dry, while Cilvaringz tried and failed to get a record label to buy this album for its cost.  Because the album has been made over many years, the cost to make back what it took to make is way over what rap albums get a budget for in 2015.  Especially Wu-tang albums.  Especially Cilvaringz Wu-tang Albums.</p>\n\n<p>So.  <strong>HERE IS WHERE WE ARE NOW.</strong>  Cilvaringz, not wanting his &#39;lifes work&#39;, the most important thing hes been working on for possibly 10 years, become a footnote on 2dopeboyz, and basically be an album everyone forgets about if they put it out digitally, he decides as a last ditch effort to do the whole museum thing.  RZA signed on because A Better Tomorrow (the shitty Wu-tang album RZA was working on) was going to come out, and what better publicity for Wu-Tang than to one day declare their work as &#39;high art&#39;.  So RZA glommed to Cilvaringz idea, but out of necessity it seems because if you look at all the interviews now, you barely see any mention on how the entire album is produced by Cilvaringz.  This isn&#39;t a RZA album.  But while they talk about 88 years, and auction this album off, they realize that AGAIN, its impossible to sell a Cilvaringz produced Wu-tang album for 5 Million.  </p>\n\n<p>So now we get some bullshit story about them thinking of the entire idea while climbing mountains and shit.  It is all a lie.  And i&#39;m not surprised the members (like Method Man) are furious about all of this.  They were already paid for their verses.  They should be furious as it hurts their image.  How is that cool to the fans that there is a Wu-Tang album that everyone reading this forum post will be dead by the time it drops?  I&#39;d be surprised if anyone besides RZA and Cilvaringz makes any money off of this.  Instead of Cilvaringz finding a way to release this album and maintain his credits and majority role in this albums creation, he is going for a cash grab and downplaying his role in this album.  They HAVE to, as the only way this album is auctioned for millions is if RZA was the main player in it.</p>\n\n<p>The bottom line is, by everyone that has heard the Cilvaringz Wu-Tang Album, <strong>they say it is the best Wu album since Wu-tang Forever.</strong>  Because of this behind the scenes shady RZA / Cilvaringz politics, <strong>we may never hear the album.</strong>  They aren&#39;t even touring the album first, as a requirement, as they want to just sell this and move on.  I find it funny that RZA is tweeting that the 88 years is so that the album is protected from corporations and commercialization.  I forgot about all the Lincoln and Toyota commercials I&#39;ve seen that use Wu-Tang clan songs, so I&#39;m glad RZA is protecting the brand.  I find it laughable.</p>\n\n<p>I can&#39;t even begin to start citing my sources.  I made this throw-away because I think its a shame that people like Raekwon, Method Man, Ghostface etc are getting bad publicity because of RZA and Cilvaringz taking a giant dump on Wu-tang fans and the legacy.  Believe me or don&#39;t believe me, but I&#39;ve been following the group since the 90&#39;s, I followed Cilvaringz development of his albums through Wu-Tang Corp, and the spin is in. <strong>Please, direct your anger at RZA and Cilvaringz for this album, as the clan members that actually have been rapping and putting out dope albums the past 20 years, have nothing to do with how this stupid Cilvaringz Wu-tang album is being handled.</strong></p>\n\n<p>EDIT - MY REPLY TO A COMMENT.  <strong>Someone hooked me up with some evidence to substantiate what I&#39;m talking about.</strong></p>\n\n<p>All anyone needs to do is ask RZA specific details on the overall creation of the album(the wheres and the whens).  Also this dude Andrew Kelley, who was involved with Chamber Music, Legendary Weapons, 12 Reasons to Die, and 36 Seasons,  actually heard the Cilvaringz album when Cilva was bringing it to various labels and previewing it, and he highly reviewed the album.  The post is 2+ years old, and there is no mention of RZA in this until the very end, where he says : &quot;The next time I sit down with RZA I will definitely be speaking with him about this album. Finish it up Ringz, all Wu-Tang fans deserve that “time machine” moment.&quot;</p>\n\n<p><a href=\"http://andrewkelley47.tumblr.com/post/52815181151/cilvaringz-wu-tang-album-coming-soon\">http://andrewkelley47.tumblr.com/post/52815181151/cilvaringz-wu-tang-album-coming-soon</a></p>\n\n<p>EDIT 2 : </p>\n\n<p><strong>Cilvaringz has gone through and deleted tons of old posts in regards to the development of this.  I am now combing through the wayback machine to find old posts of his.  Just look pre-2014 for posts by Cilvaringz that pretty much expose what I&#39;m saying.  All mentions of the Andrew Kelley blog post talking about the album were retroactively deleted by Cilvaringz, who runs the forum.</strong></p>\n\n<p>** <strong>Sneak Edit 4 - YOU CANT EVEN DO THIS BECAUSE THE WAYBACK MACHINE DIDN&#39;T SAVE THE FORUM POSTS.  SO CILVARINGZ CAN RE-WRITE HISTORY BY DELETING EVERY POST THAT MENTIONS THE ALBUMs DEVELOPMENT AND PRETEND LIKE HE DIDN&#39;T EXCLUSIVELY MAKE THIS ALBUM THAT THEY ARE LYING TO PEOPLE ABOUT.</strong></p>\n\n<p>EDIT 3 :</p>\n\n<p>Here is a post talking about the listening session: <a href=\"http://www.wutang-corp.com/forum/showthread.php?t=131390\">http://www.wutang-corp.com/forum/showthread.php?t=131390</a></p>\n\n<p>What I&#39;d like to point to is here:\n<a href=\"http://www.wutang-corp.com/forum/showpost.php?p=2488043&amp;postcount=5\">http://www.wutang-corp.com/forum/showpost.php?p=2488043&amp;postcount=5</a></p>\n\n<p>&quot;<strong>It drives me nuts though how much Rza is basking in the glory of this project and seems to get a lot of the production credit in the media. At one point this year, Ringz said on here that he let Rza listen to the finished product for the first time from start to finish, so Rza couldn&#39;t change anything. Then in this interview, he makes it out like Rza made him change snares and drums on tracks and that Rza was on board for the last 3 years.</strong> </p>\n\n<p>LOL @<a href=\"https://www.youtube.com/watch?v=7cAqT6dSBh8&amp;t=12m06s\">12:06</a> that he says he&#39;s doing this for the fans. Refresh my memory on how the fans benefit from this work of art? @<a href=\"https://www.youtube.com/watch?v=7cAqT6dSBh8&amp;t=13m2s\">13:02</a> &quot;Closure sonically for the fans&quot;. @<a href=\"https://www.youtube.com/watch?v=7cAqT6dSBh8&amp;t=9m47s\">9:47</a> Rza ducking the question and talking about dinosaur bones. Complete bullshit rambling.&quot;</p>\n\n<p><strong>Edit 5</strong>\n<strong>Cilvaringz responds to repeatedly being called a liar:</strong> (just check the pages)\n<a href=\"http://www.wutang-corp.com/forum/showthread.php?t=131359&amp;page=12\">http://www.wutang-corp.com/forum/showthread.php?t=131359&amp;page=12</a></p>\n\n<p><a href=\"http://www.wutang-corp.com/forum/showpost.php?p=2488137&amp;postcount=168\">http://www.wutang-corp.com/forum/showpost.php?p=2488137&amp;postcount=168</a>\n&quot;But why refer to changing ideas as lying?&quot;</p>\n\n<p><a href=\"http://www.wutang-corp.com/forum/showpost.php?p=2488164&amp;postcount=179\">http://www.wutang-corp.com/forum/showpost.php?p=2488164&amp;postcount=179</a>\n&quot;There&#39;s no use discussing this any further because things really aren&#39;t going to change and its no use explaining it every time to every member on this forum. So the best thing to do is to continue to use this forum and other forums to vent out all the anger, disappointment and whatever other emotions are coming out. Call it whatever you want, use your freedom of speech and wild out. When things calm down, lets not ever bring it up again! Peace!&quot;</p>\n\n<p><strong>RZA RESPONDS (AND LIES)</strong>\n<a href=\"https://twitter.com/RZA/status/573391180416733184\">https://twitter.com/RZA/status/573391180416733184</a></p>\n\n<p>&quot;A lot of you are not listening to what is already in front of you. This has always been a Single album concept. No surprises. #new idea&quot;</p>\n\n<p>Cilvarings was actively trying to get record labels to buy this album, and he finally got RZA to cosign the album when he pitched a museum idea, which has now evolved into sell the album to 1 person and hope he leaks it for the rest of the world.</p>\n\n<p><strong>EDIT #6</strong></p>\n\n<p>I am having trouble responding to everyone&#39;s questions, and didn&#39;t want new explanations to be burried.</p>\n\n<p>One question that keeps getting asked is what is up with the vilification of RZA?</p>\n\n<p>It is vilification because honestly the dude has a history of being a snake.  Google how many members have <a href=\"http://www.hotnewhiphop.com/raekwon-discusses-beef-within-wu-tang-clan-news.4213.html\">complained</a> about him or <a href=\"http://metallungies.com/2008/07/the-rza-speaks-on-conflict-within-the-wu-tang/\">outright</a> had to <a href=\"http://www.vulture.com/2009/10/rza_explains_why_he_keeps_gett.html\">sue</a> <a href=\"http://www.tmz.com/2012/12/15/rza-wu-tang-clan-royalites-dutch-lawsuit/\">him</a>.  I can get better links but I just googled &quot;RZA Sue&quot; and tried to weed through the articles that weren&#39;t him suing The Game.</p>\n\n<p><a href=\"http://www.billboard.com/articles/columns/the-juice/6062825/the-beef-rza-raekwon-bicker-over-wu-tang-clans-a-better-tomorrow\">Also, remember when he was complaining publicly that Raekwon wasn&#39;t recording verses for &quot;A Better Tomorrow?&quot;</a>  <strong>So you mean to tell me that RZA was publicly complaining about Raekwon getting on one album, while secretly making another Wu-tang album that has Raekwon on it a lot? Come the fuck on.</strong></p>\n\n<p>RZA didn&#39;t cosign this project until the very end.  <a href=\"http://www.rollingstone.com/music/news/q-a-raekwon-on-strike-from-wu-tang-blasts-rza-for-mediocre-music-20140417\">RZA has a history of being an egomaniac when it comes to Wu-Tang album control.</a>.  Cilvaringz devised a plan to get RZA&#39;s involvement by spinning the album to be a piece of art that belongs in museums.  In order to sell that plan, they need to rewrite history that RZA was a part of this project all along.</p>\n\n<p><strong>Edit 8</strong></p>\n\n<p><a href=\"http://www.reddit.com/r/hiphopheads/comments/2y0mwl/the_truth_behind_the_new_wutang_album/cp5ziiw\">http://www.reddit.com/r/hiphopheads/comments/2y0mwl/the_truth_behind_the_new_wutang_album/cp5ziiw</a></p>\n\n<p><strong>edit 9</strong> 3/6/15\n<a href=\"http://www.reddit.com/r/hiphopheads/comments/2y0mwl/the_truth_behind_the_new_wutang_album/cp6qirj\">http://www.reddit.com/r/hiphopheads/comments/2y0mwl/the_truth_behind_the_new_wutang_album/cp6qirj</a></p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "_comment_sort": null,
  "report_reasons": null,
  "name": "t3_2y0mwl",
  "from": null,
  "hidden": false,
  "clicked": false,
  "media": null,
  "json_dict": null,
  "_api_link": "https://api.reddit.com/r/hiphopheads/comments/2y0mwl/the_truth_behind_the_new_wutang_album/?ref=search_posts",
  "secure_media_embed": {},
  "mod_reports": [],
  "_orphaned": {},
  "_uniq": null,
  "num_comments": 338,
  "link_flair_text": null,
  "title": "The Truth Behind The \"New Wu-Tang\" Album",
  "_has_fetched": true,
  "author_flair_css_class": "wutang",
  "thumbnail": ""
}