{
  "selftext": "**TL;DR** Pandering to the female imperative makes the most bucks and thus drives the political, commercial, and legal climate\n\nnote: Some of these points add up with others to form one single phenomenon\n\n/u/Cyralea and /u/AynRandFor200, you wanted to see this become a post, here it is...\n\n----------------------------------------------------------------------------------------\n\n**Body**\n\n**1)** **Women by their very nature, are mass consumers**\n\n\"Women like shopping\" is not a social construct, it is merely a manifestation of their instincts developed in a pre-agricultural society (the majority of our existence) transformed into civilization, then to a consumerist culture as said in [The Century of the Self (Part 1: Happiness Machines)](http://www.informationclearinghouse.info/article12642.htm). The idea of convincing people to buy based on want, not need.\n\n-\n\nWomen take, not produce in the grand scheme of things. They feel entitled to resources they haven't earned. It makes a lot more sense when you frame it in a pre-agriculutral society. These women were pregnant much of their lives since they started bleeding (~12,13). What seems illogical at the individual level, makes sense in the big picture. Some man, somewhere, will cave and provide for her. Remember, nature only cares about results. They need all the resources they can get to survive pregnancy (completely helpless in the wild), to have their fetus' survive until birth, and for the infant to survive until it can somewhat take care of itself (No such thing as 'jobs'). She is so preoccupied for so many years focusing on her children that she isn't able to acquire things for herself. The proper specialization and division of labor (based on opportunity cost) demands that men go out to build shelter, protect, and hunt for food for them. To ensure her survival and that of her children, she will do whatever it takes: deception, whoring, cuckolding a man, swing branches, shaming, screaming... nothing is off the table. This instinct has worked and should be encouraged. However, when this instinct is not balanced, shit hits the fan, but that's not the purpose of this post.\n\n-\n\n**2)** **Women are short term thinkers, [they see the world as a persisting state](https://archive.is/9eQdO)**\n\n *\"The lack of logic also means a lack of long-term thinking. Emotions are in the moment, logic persists. You can't make plans based on emotions. Women don't plan for the future because they don't know how they'll feel in the future.*\" ----- /u/TomDemian. \n\nThey never had to be long term thinkers, men did all the 'complex' work for them. They live in the moment and only care to duplicate their 'good feelz', shots of [dopamine](https://archive.is/SIHrk) (by EC /u/OmLaLa). To make this concept more clear, we need to discuss the economic term, [Moral Hazard](https://en.m.wikipedia.org/wiki/Moral_hazard). Below is an example to paint the picture of why women are short term thinkers with money. \n\n-\n\n  * Example: How Colleges Choose Textbooks and Why They Cost So Much\n\n      * The textbook required for your college course is there because a company pitched it to the professor with [PYT](https://www.youtube.com/watch?v=VYXqwbtkkeM) sales women trotting around in suggestive clothing. **The professor chooses which book you have to use for class but they don't have to pay for it. They don't incur the cost of their decisions.** This is why your textbooks cost $3 to make, but the school sells it for $200. \n\n-\n\nSo how is the previous example relevant to women's short term thinking or support the thesis? **Answer: Most women's wealth is acquired through marriage, not labor or effort.** Upon signing the document, she is legally entitled to much or half of every asset acquired during this legal union. In other words, the money she spends is not hers. When she purchases a man's hard earned money at the office, she's spending *his* time, not hers. There is no cost to herself. For more information: [Why Get Married? (Part 7: Divorce, Assets, Alimony, and Child Support)](https://archive.is/2ZfzU) by EC /u/dr_warlock.\n\n-\n\n**3)** **Women are obsessed with status**\n\nWhen women gossip about people, they're really discussing the social hierarchy. They constantly want to know people's position in society relative to themselves as to know where and how to place themselves. They want to know who to attach themselves to. Higher status = more power (ability to influence events to your benefit) = more provisioning. Women will attempt to feign status : wear stylish clothing to assert herself in the pecking order (claiming she has spare resources for luxury), she will falsely claim rape as to show she is so desirable as to make men unable to contain their urges, and she will brag about how she can exploit men, to show she's a good parasite. Women also mistakenly believe that an increase in socioeconomic status or attaching themselves to a higher class male also increases their SMV (read: [The Female Value Acquisition Theory](https://archive.is/AzfPC) by EC /u/dr_warlock). There's a reason why women's magazines all contain a bunch of celebrity gossip garbage. Women thrive on it.\n\n-\n\n**4)** **Gender Roles Made Women in Charge of Finances and Placed them in Front of Ads During Consumerism Era**\n\nCombine points 1,2,and 3.\nWe all know the traditional gender roles of the household: Dad is in charge and works to provide the money, mom does maintenance for the household, children, and manages much of the finances (buy things that help her manage household using the father's money). The absence of the father for most of the day is crucial. As said in point #1, Edward Bernays helped start a 'market revolution', the creation of Consumerism, to buy based on want, not need. It has made businesses mass produce products solely for the purpose of style, status, and dopamine. This was around the same time television was invented. Eventually media companies began to realize advertisements were necessary to fund their ventures. **What do you get when the father is absent from the household all day, and the mother is at home in front of the television? Answer: The mother is exposed to all the advertisements.** This is why businesses and media companies around the world pander to women. They are the ones being exposed to most of the advertisements, they are the ones who manage most of the finances, they are the biggest purchasers. If you pander to them, if you frame everything within their female imperative, you will make more bucks.\n\n-\n\nMandatory [Business Insider Inforgraphic](http://www.businessinsider.com/infographic-women-control-the-money-in-america-2012-2) on how woman control finances in society due to marriage and other factors.\n\n-\n\nside note: this is also the probable reason kitchens went from a separate room closed off from the others, to an open entrance. This style looks better in real-estate catalogs, which are mostly read by women.\n\n-\n\n**5)** **Men's instincts to provide for women and win their approval in the SMP can be channeled**\n\nAdvertisement companies began to conflate buying things for women, with love and masculinity. They even invented the [idealistic concept of love with products](https://www.youtube.com/watch?v=fjg5TuXV09U) (Mad Men). One of the greatest examples is jewelry, especially engagement and wedding rings. It was not the norm to buy jewelry for women before the Century of the Self. A great video to explain this: [\"Why Engagement Rings are a Scam\"](https://www.youtube.com/watch?v=N5kWu1ifBGU). *If you truly love your woman, buy her diamonds. It should be at least 3 month's salary! Is there a girl you like? Buy her chocolates, flowers, and jewelry on Valentines Day! Dont you looooove her? Consume, consume, [consume](https://www.youtube.com/watch?v=vfbbF3oxf-E)!*\n\n-\n\nNot to mention the mass indoctrination in the media regarding the proper way for men to navigate the sexual market place. You will never see movies and shows displaying Chad getting the girls the way it actually happens, especially in cartoons. Or if he does, he eventually rides off into the sunset with a post-wall, post-CC rider (view: [Don Jon](http://www.movie2kto.ws/watch-movies/Don_Jon__2013/10641)) or the nice guy gets the hot girl at the end (view: [Chuck](http://watchseries.lt/serie/chuck)). When the media gets a hold of PUA and TRP tactics, they make a terrible caricature of it using betas as the practicioners (view: [Mixology](http://watchseries.lt/serie/Mixology)). Under no circumstances are 'misogynists' and 'playas' allowed to be seen to succeed with women using PUA and TRP. In most media, the guy is always nervous around girls, making sure not to displease a woman. He is the dumdum that needs a women's guidance (read: [Misandry Bubble](http://www.singularity2050.com/2010/01/the-misandry-bubble.html)). In most cases, he brings flowers and buys dinners at expensive restaurants for every date. Every 'special' occasion like Christmas and her birthday, he spends an enormous amount of money. When an average damsel is in distress, he goes to the ends of the Earth to save her and wants to marry her. All roads lead to spending money and placing eternal financial burdens on men's shoulders to provide for women. \n\n-\n\nThe average cost of a wedding is $31,213 [(Source)](http://money.cnn.com/2015/03/12/pf/planning-for-wedding-costs/). This is a time when a couple is too blinded by love to pay attention to finances, or extended family subsidizes the purchases. The average honeymoon costs $4000-$5000 [(Source)](http://experience.usatoday.com/beach/story/caribbean/2014/06/04/caribbean-value-honeymoon/9970857/). Assuming this marriage is the stereotypical family of four, the average cost of raising two kids through college is 2.2 million dollars, that's not including the wife, the father himself and thousands of dollars of debt incurred by student loans for useless degrees (view: [College Conspiracy](https://www.youtube.com/watch?v=ImhhLGQwIEI)) [(Source)](http://business.time.com/2009/09/18/1-1-million-cost-to-raise-a-child-from-birth-through-college/). If the spouses do divorce, the annual multi-billion dollar divorce court industry (of the US) starts taking money (watch: [Divorce Corp](http://putlocker.ms/watch-divorce-corp-online-free-putlocker-2014.html)), or [Argentina takes the kids away as financial hostages](https://www.youtube.com/watch?v=9hspIL13p1Q), or if the divorce is peaceful, [there are many businesses made to accommodate divorcing spouses](http://www.vice.com/en_ca/video/heartbreak-hustle-923). \n\n-\n\nWhether or not your marriage succeeds, someone makes money, as long as the marriage took place. Encouraging and indoctrinating men into becoming beta providers and whiteknights, raising girls to believe they're goddesses on a pedestal deserving of men who should give them everything is very profitable and motivates men to willingly become corporate drones to provide 'stability' for the family (view: [Office Space](http://www.movie2kto.ws/watch-movies/Office_Space__1999/5580)) (read: [Don't be a slave](https://archive.is/dGLpE) by Vanguard /u/Archwinger). *\"Man up dude, put a ring on her finger and make it official!\"*.\n\n-\n\n**6)** **Women make up 50% of votes and both genders support the female imperative**\n\nThe consumerist culture and invention of the television happened around the same time women earned the right to vote after the [Industrial Revolution](https://archive.is/UnT9A) (EC /u/dr_warlock). As said before, both men and women support the female imperative. During the [sexual revolution in 1960](https://archive.is/OkZKW) (EC /u/dr_warlock) when the FDA approved of the birth control pill, female nature was unleashed. Women now had direct control of pregnancy outside the male's control (condoms). She can choose when, where, and with whom to get pregnant with. It was the birth of the casual sex market. Operation AF/BB was initiated and men began to compete casual bareback sex. This was the catalyst of 3rd wave feminism. The problem is that women only want to have sex with men they perceive to be above them as said in [Hypergamy 102](https://archive.is/Wh5nz) by EC /u/dr_warlock. Only the top 20% will do. So what does the bottom 80% do to acquire such sex? They can't. [Sluts don't fuck down](https://archive.is/KYD0D) (EC /u/CisWhiteMaelStrom). So the only way they can get any sex (duty sex) is to play the beta provider role. They'll do anything to please what women proclaim to want (Shit test failed => more complaining => betas double down beta strategy => shit test failed => more females complaining and disgusted). By definition, betas make the majority of the male population. **Women + betas + SJW's + Whiteknights + Manginas = at least 80% of the population**. And I believe that's being conservative. That's 80% of the population voting in favor of the female imperative. \n\n-\n\nWomen are easy to sway with emotional arguments that create the good feeelz (fickle and often clash with other desires). Female nature necessitates restriction on the environment to feel comfortable in the form of tone policing, constant hysteria (next paragraph), resource siphoning (through taxes and child support), maximum control over sexual marketplace (read: [The Political is Personal](https://www.google.com/search?q=the+political+is+personal&rlz=1C1FLDB_enUS512US512&oq=the+political+is+personal&aqs=chrome..69i57.3531j0j4&sourceid=chrome&es_sm=122&ie=UTF-8#q=the+political+is+personal+rational+male) by /u/Rollo-Tomassi), being released from all responsibility, aversion to conflict (read: tone policing), and [infiltrating/fragmenting male spaces](https://archive.is/iHiDu) (EC /u/dr_warlock). It requires men to emasculate themselves, foot the bill, and [whiteknight for women](https://pbs.twimg.com/media/CIZPUS2WoAAt2ot.jpg:large) [Mandatory Image]. [This is an agenda the government loves to back...](https://archive.is/7yNJG)\n\n>The government is using human's emotional appeal to woman's suffering as a means to convince the populace of stripping away their own rights little by little. As each generation passes, they believe the current state of affairs as 'normal' and don't question the status quo.\n\n>-\n\n>Combine that with the academic indoctrination and 'ritalinization' starting from grade school, the intentional emasculation of males of all ages, the incentivized and forced siphoning of a man's assets from family court, the forced inclusion of females in schools and work via affirmative action, the inmate quotas of privatized prisons, and the restriction on firearms, and the result is the only people naturally capable of putting up any kind of resistance, men, haven't the money, mindset, or tools to put up a fight and are in a constant state of fear from unfounded persecution of the state and women's fickle nature.\n\n-\n\nThis is why politicians will pander to women at any cost. They spout out nonsense narratives in support of the female imperative to ascend in political power. However, economic elites control the state to a large extent. **With all the TV channels on your DVR and radio, from all the magazines and news papers in the stands, from all the internet companies online, you are given an illusion of diversity, but 90% of all American News Media (Television, Radio, Movies, and Newspapers) are owned by 6 multinational, multi-billion dollar corporations: General Electric, Time Warner, Walt Disney, News Corporation, CBS, and Viacom [(Source)](http://www.neatorama.com/2008/07/07/who-owns-what-on-television/)**. They control almost everything that is seen, heard, and read by the populace. They also own all the important land, capital, and contribute to campaign financing that politicians need for reelection and to maintain their image with the implied reciprocation of taking political action that supports the endeavors of their elite financiers. Business and politics are inextricable from one another.\n\n-\n\nIt is not 'alphas' that control the political and commercial market place as said  by /u/NidStyles.\n\n>[...] You are missing the simple fact that alphas are not the true leader of any one given society. They are merely the pack leaders of a particular tribe or social group within that society. The true leaders of the society are the DT's [(economic and political elite)] and the people that direct the alphas in the proper direction to achieve their ends. It's like being a dog breeder, the alphas get to bone and reproduce, but they are not the final determinant of what that society does. Alphas only lead the women and children.\n\n-\n\nWomen and betas unfortunately have a lot of power. They spend the money. They are cheap to satisfy. They are dependent. They are easy to mislead...\n\n----------------------------------\n\n**In Closing**\n\nI would like to emphasize the extreme control those 6 companies have over television and how important TV has been to society, to narratives regarding intergender dynamics from the preface of the book, *[\"One Nation Under Television: The Rise and Decline of Network TV\"](http://jfredmacdonald.com/onutv/index.htm)*...\n\n>This is a study of the most important social and cultural force in the United States during the past four decades. Since it emerged in the late 1940s as a nationally available medium of mass entertainment and information, **commercial television has been the principal window through which Americans have viewed their world**. What was new or popular or influential in American life came now through TV. The medium made nationwide events out of local happenings; and it transformed national, even international, events into neighborhood concerns. It made celebrities and toppled leaders. And as it described and interpreted the recent movements of humankind, it revealed the strengths and foibles of ourselves and others. It has shown us to be neither fully moral nor invincible: through TV we have realized our limitations.\n\n>-\n\n>The medium has also forever linked us to the capitalist ethic, by which it has been controlled from the outset. **TV has operated as a commercial billboard, rudely invading the privacy of every American with its pitches for dog food, clothing, Buicks, fast food chains, and even candidates for the presidency of the United States**. Still, the audience has never ceased to remain fascinated with the splashy spectacle. Indeed, its commercial announcements have become enduring cultural artifacts viewed de­votedly for their nostalgic and artistic qualities.\n\n-\n\nRead more of the book, [here](http://jfredmacdonald.com/onutv/index.htm) [free 'ebook']\n\n----------------------------------\n\nSide Note:\n\nThere have been some additions to the Red Pill Video Compilation Nuke, check the edits at the bottom for the listings. \n\n**The End**",
  "gilded": 0,
  "score": 362,
  "removal_reason": null,
  "approved_by": null,
  "created_utc": 1438948549.0,
  "is_self": true,
  "stickied": false,
  "edited": 1439055567.0,
  "distinguished": null,
  "permalink": "https://www.reddit.com/r/TheRedPill/comments/3g47lg/why_businesses_and_the_government_pander_to_women/?ref=search_posts",
  "banned_by": null,
  "from_id": null,
  "likes": null,
  "_underscore_names": null,
  "num_reports": null,
  "link_flair_css_class": "theory",
  "_info_url": "https://api.reddit.com/api/info/",
  "id": "3g47lg",
  "archived": false,
  "secure_media": null,
  "from_kind": null,
  "saved": false,
  "domain": "self.TheRedPill",
  "ups": 362,
  "suggested_sort": null,
  "quarantine": false,
  "over_18": false,
  "hide_score": false,
  "url": "https://www.reddit.com/r/TheRedPill/comments/3g47lg/why_businesses_and_the_government_pander_to_women/",
  "subreddit_id": "t5_2ve1u",
  "_params": {},
  "_comments": null,
  "_replaced_more": false,
  "_comments_by_id": {},
  "user_reports": [],
  "media_embed": {},
  "created": 1438948549.0,
  "author_flair_text": "Senior Contributor",
  "visited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>TL;DR</strong> Pandering to the female imperative makes the most bucks and thus drives the political, commercial, and legal climate</p>\n\n<p>note: Some of these points add up with others to form one single phenomenon</p>\n\n<p><a href=\"/u/Cyralea\">/u/Cyralea</a> and <a href=\"/u/AynRandFor200\">/u/AynRandFor200</a>, you wanted to see this become a post, here it is...</p>\n\n<hr/>\n\n<p><strong>Body</strong></p>\n\n<p><strong>1)</strong> <strong>Women by their very nature, are mass consumers</strong></p>\n\n<p>&quot;Women like shopping&quot; is not a social construct, it is merely a manifestation of their instincts developed in a pre-agricultural society (the majority of our existence) transformed into civilization, then to a consumerist culture as said in <a href=\"http://www.informationclearinghouse.info/article12642.htm\">The Century of the Self (Part 1: Happiness Machines)</a>. The idea of convincing people to buy based on want, not need.</p>\n\n<h2></h2>\n\n<p>Women take, not produce in the grand scheme of things. They feel entitled to resources they haven&#39;t earned. It makes a lot more sense when you frame it in a pre-agriculutral society. These women were pregnant much of their lives since they started bleeding (~12,13). What seems illogical at the individual level, makes sense in the big picture. Some man, somewhere, will cave and provide for her. Remember, nature only cares about results. They need all the resources they can get to survive pregnancy (completely helpless in the wild), to have their fetus&#39; survive until birth, and for the infant to survive until it can somewhat take care of itself (No such thing as &#39;jobs&#39;). She is so preoccupied for so many years focusing on her children that she isn&#39;t able to acquire things for herself. The proper specialization and division of labor (based on opportunity cost) demands that men go out to build shelter, protect, and hunt for food for them. To ensure her survival and that of her children, she will do whatever it takes: deception, whoring, cuckolding a man, swing branches, shaming, screaming... nothing is off the table. This instinct has worked and should be encouraged. However, when this instinct is not balanced, shit hits the fan, but that&#39;s not the purpose of this post.</p>\n\n<h2></h2>\n\n<p><strong>2)</strong> <strong>Women are short term thinkers, <a href=\"https://archive.is/9eQdO\">they see the world as a persisting state</a></strong></p>\n\n<p><em>&quot;The lack of logic also means a lack of long-term thinking. Emotions are in the moment, logic persists. You can&#39;t make plans based on emotions. Women don&#39;t plan for the future because they don&#39;t know how they&#39;ll feel in the future.</em>&quot; ----- <a href=\"/u/TomDemian\">/u/TomDemian</a>. </p>\n\n<p>They never had to be long term thinkers, men did all the &#39;complex&#39; work for them. They live in the moment and only care to duplicate their &#39;good feelz&#39;, shots of <a href=\"https://archive.is/SIHrk\">dopamine</a> (by EC <a href=\"/u/OmLaLa\">/u/OmLaLa</a>). To make this concept more clear, we need to discuss the economic term, <a href=\"https://en.m.wikipedia.org/wiki/Moral_hazard\">Moral Hazard</a>. Below is an example to paint the picture of why women are short term thinkers with money. </p>\n\n<h2></h2>\n\n<ul>\n<li><p>Example: How Colleges Choose Textbooks and Why They Cost So Much</p>\n\n<ul>\n<li>The textbook required for your college course is there because a company pitched it to the professor with <a href=\"https://www.youtube.com/watch?v=VYXqwbtkkeM\">PYT</a> sales women trotting around in suggestive clothing. <strong>The professor chooses which book you have to use for class but they don&#39;t have to pay for it. They don&#39;t incur the cost of their decisions.</strong> This is why your textbooks cost $3 to make, but the school sells it for $200. </li>\n</ul></li>\n</ul>\n\n<h2></h2>\n\n<p>So how is the previous example relevant to women&#39;s short term thinking or support the thesis? <strong>Answer: Most women&#39;s wealth is acquired through marriage, not labor or effort.</strong> Upon signing the document, she is legally entitled to much or half of every asset acquired during this legal union. In other words, the money she spends is not hers. When she purchases a man&#39;s hard earned money at the office, she&#39;s spending <em>his</em> time, not hers. There is no cost to herself. For more information: <a href=\"https://archive.is/2ZfzU\">Why Get Married? (Part 7: Divorce, Assets, Alimony, and Child Support)</a> by EC <a href=\"/u/dr_warlock\">/u/dr_warlock</a>.</p>\n\n<h2></h2>\n\n<p><strong>3)</strong> <strong>Women are obsessed with status</strong></p>\n\n<p>When women gossip about people, they&#39;re really discussing the social hierarchy. They constantly want to know people&#39;s position in society relative to themselves as to know where and how to place themselves. They want to know who to attach themselves to. Higher status = more power (ability to influence events to your benefit) = more provisioning. Women will attempt to feign status : wear stylish clothing to assert herself in the pecking order (claiming she has spare resources for luxury), she will falsely claim rape as to show she is so desirable as to make men unable to contain their urges, and she will brag about how she can exploit men, to show she&#39;s a good parasite. Women also mistakenly believe that an increase in socioeconomic status or attaching themselves to a higher class male also increases their SMV (read: <a href=\"https://archive.is/AzfPC\">The Female Value Acquisition Theory</a> by EC <a href=\"/u/dr_warlock\">/u/dr_warlock</a>). There&#39;s a reason why women&#39;s magazines all contain a bunch of celebrity gossip garbage. Women thrive on it.</p>\n\n<h2></h2>\n\n<p><strong>4)</strong> <strong>Gender Roles Made Women in Charge of Finances and Placed them in Front of Ads During Consumerism Era</strong></p>\n\n<p>Combine points 1,2,and 3.\nWe all know the traditional gender roles of the household: Dad is in charge and works to provide the money, mom does maintenance for the household, children, and manages much of the finances (buy things that help her manage household using the father&#39;s money). The absence of the father for most of the day is crucial. As said in point #1, Edward Bernays helped start a &#39;market revolution&#39;, the creation of Consumerism, to buy based on want, not need. It has made businesses mass produce products solely for the purpose of style, status, and dopamine. This was around the same time television was invented. Eventually media companies began to realize advertisements were necessary to fund their ventures. <strong>What do you get when the father is absent from the household all day, and the mother is at home in front of the television? Answer: The mother is exposed to all the advertisements.</strong> This is why businesses and media companies around the world pander to women. They are the ones being exposed to most of the advertisements, they are the ones who manage most of the finances, they are the biggest purchasers. If you pander to them, if you frame everything within their female imperative, you will make more bucks.</p>\n\n<h2></h2>\n\n<p>Mandatory <a href=\"http://www.businessinsider.com/infographic-women-control-the-money-in-america-2012-2\">Business Insider Inforgraphic</a> on how woman control finances in society due to marriage and other factors.</p>\n\n<h2></h2>\n\n<p>side note: this is also the probable reason kitchens went from a separate room closed off from the others, to an open entrance. This style looks better in real-estate catalogs, which are mostly read by women.</p>\n\n<h2></h2>\n\n<p><strong>5)</strong> <strong>Men&#39;s instincts to provide for women and win their approval in the SMP can be channeled</strong></p>\n\n<p>Advertisement companies began to conflate buying things for women, with love and masculinity. They even invented the <a href=\"https://www.youtube.com/watch?v=fjg5TuXV09U\">idealistic concept of love with products</a> (Mad Men). One of the greatest examples is jewelry, especially engagement and wedding rings. It was not the norm to buy jewelry for women before the Century of the Self. A great video to explain this: <a href=\"https://www.youtube.com/watch?v=N5kWu1ifBGU\">&quot;Why Engagement Rings are a Scam&quot;</a>. <em>If you truly love your woman, buy her diamonds. It should be at least 3 month&#39;s salary! Is there a girl you like? Buy her chocolates, flowers, and jewelry on Valentines Day! Dont you looooove her? Consume, consume, <a href=\"https://www.youtube.com/watch?v=vfbbF3oxf-E\">consume</a>!</em></p>\n\n<h2></h2>\n\n<p>Not to mention the mass indoctrination in the media regarding the proper way for men to navigate the sexual market place. You will never see movies and shows displaying Chad getting the girls the way it actually happens, especially in cartoons. Or if he does, he eventually rides off into the sunset with a post-wall, post-CC rider (view: <a href=\"http://www.movie2kto.ws/watch-movies/Don_Jon__2013/10641\">Don Jon</a>) or the nice guy gets the hot girl at the end (view: <a href=\"http://watchseries.lt/serie/chuck\">Chuck</a>). When the media gets a hold of PUA and TRP tactics, they make a terrible caricature of it using betas as the practicioners (view: <a href=\"http://watchseries.lt/serie/Mixology\">Mixology</a>). Under no circumstances are &#39;misogynists&#39; and &#39;playas&#39; allowed to be seen to succeed with women using PUA and TRP. In most media, the guy is always nervous around girls, making sure not to displease a woman. He is the dumdum that needs a women&#39;s guidance (read: <a href=\"http://www.singularity2050.com/2010/01/the-misandry-bubble.html\">Misandry Bubble</a>). In most cases, he brings flowers and buys dinners at expensive restaurants for every date. Every &#39;special&#39; occasion like Christmas and her birthday, he spends an enormous amount of money. When an average damsel is in distress, he goes to the ends of the Earth to save her and wants to marry her. All roads lead to spending money and placing eternal financial burdens on men&#39;s shoulders to provide for women. </p>\n\n<h2></h2>\n\n<p>The average cost of a wedding is $31,213 <a href=\"http://money.cnn.com/2015/03/12/pf/planning-for-wedding-costs/\">(Source)</a>. This is a time when a couple is too blinded by love to pay attention to finances, or extended family subsidizes the purchases. The average honeymoon costs $4000-$5000 <a href=\"http://experience.usatoday.com/beach/story/caribbean/2014/06/04/caribbean-value-honeymoon/9970857/\">(Source)</a>. Assuming this marriage is the stereotypical family of four, the average cost of raising two kids through college is 2.2 million dollars, that&#39;s not including the wife, the father himself and thousands of dollars of debt incurred by student loans for useless degrees (view: <a href=\"https://www.youtube.com/watch?v=ImhhLGQwIEI\">College Conspiracy</a>) <a href=\"http://business.time.com/2009/09/18/1-1-million-cost-to-raise-a-child-from-birth-through-college/\">(Source)</a>. If the spouses do divorce, the annual multi-billion dollar divorce court industry (of the US) starts taking money (watch: <a href=\"http://putlocker.ms/watch-divorce-corp-online-free-putlocker-2014.html\">Divorce Corp</a>), or <a href=\"https://www.youtube.com/watch?v=9hspIL13p1Q\">Argentina takes the kids away as financial hostages</a>, or if the divorce is peaceful, <a href=\"http://www.vice.com/en_ca/video/heartbreak-hustle-923\">there are many businesses made to accommodate divorcing spouses</a>. </p>\n\n<h2></h2>\n\n<p>Whether or not your marriage succeeds, someone makes money, as long as the marriage took place. Encouraging and indoctrinating men into becoming beta providers and whiteknights, raising girls to believe they&#39;re goddesses on a pedestal deserving of men who should give them everything is very profitable and motivates men to willingly become corporate drones to provide &#39;stability&#39; for the family (view: <a href=\"http://www.movie2kto.ws/watch-movies/Office_Space__1999/5580\">Office Space</a>) (read: <a href=\"https://archive.is/dGLpE\">Don&#39;t be a slave</a> by Vanguard <a href=\"/u/Archwinger\">/u/Archwinger</a>). <em>&quot;Man up dude, put a ring on her finger and make it official!&quot;</em>.</p>\n\n<h2></h2>\n\n<p><strong>6)</strong> <strong>Women make up 50% of votes and both genders support the female imperative</strong></p>\n\n<p>The consumerist culture and invention of the television happened around the same time women earned the right to vote after the <a href=\"https://archive.is/UnT9A\">Industrial Revolution</a> (EC <a href=\"/u/dr_warlock\">/u/dr_warlock</a>). As said before, both men and women support the female imperative. During the <a href=\"https://archive.is/OkZKW\">sexual revolution in 1960</a> (EC <a href=\"/u/dr_warlock\">/u/dr_warlock</a>) when the FDA approved of the birth control pill, female nature was unleashed. Women now had direct control of pregnancy outside the male&#39;s control (condoms). She can choose when, where, and with whom to get pregnant with. It was the birth of the casual sex market. Operation AF/BB was initiated and men began to compete casual bareback sex. This was the catalyst of 3rd wave feminism. The problem is that women only want to have sex with men they perceive to be above them as said in <a href=\"https://archive.is/Wh5nz\">Hypergamy 102</a> by EC <a href=\"/u/dr_warlock\">/u/dr_warlock</a>. Only the top 20% will do. So what does the bottom 80% do to acquire such sex? They can&#39;t. <a href=\"https://archive.is/KYD0D\">Sluts don&#39;t fuck down</a> (EC <a href=\"/u/CisWhiteMaelStrom\">/u/CisWhiteMaelStrom</a>). So the only way they can get any sex (duty sex) is to play the beta provider role. They&#39;ll do anything to please what women proclaim to want (Shit test failed =&gt; more complaining =&gt; betas double down beta strategy =&gt; shit test failed =&gt; more females complaining and disgusted). By definition, betas make the majority of the male population. <strong>Women + betas + SJW&#39;s + Whiteknights + Manginas = at least 80% of the population</strong>. And I believe that&#39;s being conservative. That&#39;s 80% of the population voting in favor of the female imperative. </p>\n\n<h2></h2>\n\n<p>Women are easy to sway with emotional arguments that create the good feeelz (fickle and often clash with other desires). Female nature necessitates restriction on the environment to feel comfortable in the form of tone policing, constant hysteria (next paragraph), resource siphoning (through taxes and child support), maximum control over sexual marketplace (read: <a href=\"https://www.google.com/search?q=the+political+is+personal&amp;rlz=1C1FLDB_enUS512US512&amp;oq=the+political+is+personal&amp;aqs=chrome..69i57.3531j0j4&amp;sourceid=chrome&amp;es_sm=122&amp;ie=UTF-8#q=the+political+is+personal+rational+male\">The Political is Personal</a> by <a href=\"/u/Rollo-Tomassi\">/u/Rollo-Tomassi</a>), being released from all responsibility, aversion to conflict (read: tone policing), and <a href=\"https://archive.is/iHiDu\">infiltrating/fragmenting male spaces</a> (EC <a href=\"/u/dr_warlock\">/u/dr_warlock</a>). It requires men to emasculate themselves, foot the bill, and <a href=\"https://pbs.twimg.com/media/CIZPUS2WoAAt2ot.jpg:large\">whiteknight for women</a> [Mandatory Image]. <a href=\"https://archive.is/7yNJG\">This is an agenda the government loves to back...</a></p>\n\n<blockquote>\n<p>The government is using human&#39;s emotional appeal to woman&#39;s suffering as a means to convince the populace of stripping away their own rights little by little. As each generation passes, they believe the current state of affairs as &#39;normal&#39; and don&#39;t question the status quo.</p>\n\n<h2></h2>\n\n<p>Combine that with the academic indoctrination and &#39;ritalinization&#39; starting from grade school, the intentional emasculation of males of all ages, the incentivized and forced siphoning of a man&#39;s assets from family court, the forced inclusion of females in schools and work via affirmative action, the inmate quotas of privatized prisons, and the restriction on firearms, and the result is the only people naturally capable of putting up any kind of resistance, men, haven&#39;t the money, mindset, or tools to put up a fight and are in a constant state of fear from unfounded persecution of the state and women&#39;s fickle nature.</p>\n</blockquote>\n\n<h2></h2>\n\n<p>This is why politicians will pander to women at any cost. They spout out nonsense narratives in support of the female imperative to ascend in political power. However, economic elites control the state to a large extent. <strong>With all the TV channels on your DVR and radio, from all the magazines and news papers in the stands, from all the internet companies online, you are given an illusion of diversity, but 90% of all American News Media (Television, Radio, Movies, and Newspapers) are owned by 6 multinational, multi-billion dollar corporations: General Electric, Time Warner, Walt Disney, News Corporation, CBS, and Viacom <a href=\"http://www.neatorama.com/2008/07/07/who-owns-what-on-television/\">(Source)</a></strong>. They control almost everything that is seen, heard, and read by the populace. They also own all the important land, capital, and contribute to campaign financing that politicians need for reelection and to maintain their image with the implied reciprocation of taking political action that supports the endeavors of their elite financiers. Business and politics are inextricable from one another.</p>\n\n<h2></h2>\n\n<p>It is not &#39;alphas&#39; that control the political and commercial market place as said  by <a href=\"/u/NidStyles\">/u/NidStyles</a>.</p>\n\n<blockquote>\n<p>[...] You are missing the simple fact that alphas are not the true leader of any one given society. They are merely the pack leaders of a particular tribe or social group within that society. The true leaders of the society are the DT&#39;s [(economic and political elite)] and the people that direct the alphas in the proper direction to achieve their ends. It&#39;s like being a dog breeder, the alphas get to bone and reproduce, but they are not the final determinant of what that society does. Alphas only lead the women and children.</p>\n</blockquote>\n\n<h2></h2>\n\n<p>Women and betas unfortunately have a lot of power. They spend the money. They are cheap to satisfy. They are dependent. They are easy to mislead...</p>\n\n<hr/>\n\n<p><strong>In Closing</strong></p>\n\n<p>I would like to emphasize the extreme control those 6 companies have over television and how important TV has been to society, to narratives regarding intergender dynamics from the preface of the book, <em><a href=\"http://jfredmacdonald.com/onutv/index.htm\">&quot;One Nation Under Television: The Rise and Decline of Network TV&quot;</a></em>...</p>\n\n<blockquote>\n<p>This is a study of the most important social and cultural force in the United States during the past four decades. Since it emerged in the late 1940s as a nationally available medium of mass entertainment and information, <strong>commercial television has been the principal window through which Americans have viewed their world</strong>. What was new or popular or influential in American life came now through TV. The medium made nationwide events out of local happenings; and it transformed national, even international, events into neighborhood concerns. It made celebrities and toppled leaders. And as it described and interpreted the recent movements of humankind, it revealed the strengths and foibles of ourselves and others. It has shown us to be neither fully moral nor invincible: through TV we have realized our limitations.</p>\n\n<h2></h2>\n\n<p>The medium has also forever linked us to the capitalist ethic, by which it has been controlled from the outset. <strong>TV has operated as a commercial billboard, rudely invading the privacy of every American with its pitches for dog food, clothing, Buicks, fast food chains, and even candidates for the presidency of the United States</strong>. Still, the audience has never ceased to remain fascinated with the splashy spectacle. Indeed, its commercial announcements have become enduring cultural artifacts viewed de­votedly for their nostalgic and artistic qualities.</p>\n</blockquote>\n\n<h2></h2>\n\n<p>Read more of the book, <a href=\"http://jfredmacdonald.com/onutv/index.htm\">here</a> [free &#39;ebook&#39;]</p>\n\n<hr/>\n\n<p>Side Note:</p>\n\n<p>There have been some additions to the Red Pill Video Compilation Nuke, check the edits at the bottom for the listings. </p>\n\n<p><strong>The End</strong></p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "_comment_sort": null,
  "report_reasons": null,
  "name": "t3_3g47lg",
  "from": null,
  "hidden": false,
  "clicked": false,
  "media": null,
  "json_dict": null,
  "_api_link": "https://api.reddit.com/r/TheRedPill/comments/3g47lg/why_businesses_and_the_government_pander_to_women/?ref=search_posts",
  "secure_media_embed": {},
  "mod_reports": [],
  "_orphaned": {},
  "_uniq": null,
  "num_comments": 190,
  "link_flair_text": "Red Pill Theory",
  "title": "Why Businesses and the Government Pander to Women",
  "_has_fetched": true,
  "author_flair_css_class": "endorsementsenior",
  "thumbnail": ""
}