{
  "clicked": false,
  "_replaced_more": false,
  "archived": false,
  "post_hint": "self",
  "num_comments": 0,
  "created": 1438273693.0,
  "saved": false,
  "selftext": "[Source](http://www.activistpost.com/2015/07/alec-behind-recent-push-for-mandatory.html)\n\n>Over the last several months, Americans have witnessed an increase in media propaganda regarding the “dangers” of “anti-vaxxers,” the “proven science of vaccines,” and the “tragedies” that ensue from the failure to vaccinate. That propaganda blitz has resulted in massive hysteria stemming from similar levels of ignorance.\n\n>Also resulting from the push by Big Pharma-funded corporate media outlets is the emotional and panicked campaign of pro-vaxxers, vaccine pushers, and adherents to the relatively recent new religion of “scientism” – the religious belief in anything labeled as science or scientific, regardless of whether or not that concept directly contradicts observable reality and experience or even regardless of whether or not it is actually scientific.\n\n>The so-called vaccine debate – which is not truly a debate since a debate requires the participation of two opposing sides – is generally nothing more than a shouting and shaming campaign against parents who have come to the conclusion that vaccines are not safe, effective, or neither.\n\n>Indeed, it is the unbridled emotion of the pro-vaccine camp that has been provoked and subsequently harnessed into a powerhouse of vitriol and social pressure that is then presented as a public health crisis. \n\n>The howling of the trendy masses, glued to their televisions, sitcoms, and NPR, is then presented as an organic public outcry in the media, resulting in the conveniently timed response of politicians and lawmakers.\n\n>Of course, with the creation of the false debate, there is also the political polarization of the issue – the left must be pitted against the right – in a typical but tried and true method of divide and conquer strategy.\n\n>Originally, holding questions regarding the safety or effectiveness of vaccinations was something that bridged political boundaries. Granted, the individuals who held these views were a minority. However, those numbers were growing and could be found in the midst of liberals and conservatives, libertarians and socialists, and even those completely unaligned to any ideology.\n\n>Now, however, that is beginning to change. The Big Pharma companies that fund the mainstream media and the political parasites infecting the federal and state capitols have managed to turn this debate into a partisan issue.\n\n>The propaganda campaign has been successful among members of all political denominations, but particularly so among the left. This is because the left is made up of a population that is well-trained to believe anything presented to them under the guise of science in much the same way as the right who are designed to believe anything presented in a religious context.\n\n>The result of this massive absorption of indoctrination is that we have the passage of bills mandating that children be vaccinated by force of law in California and even the attempt to force adults to be vaccinated as well.\n\n>With mandates coming out of California, North Carolina, and Vermont, clearly there is a nationwide agenda at foot.\n\n>But while those on the left continue to attack Koch Industries and ALEC for funding a number of horrific economic policies and divisive domestic campaigns, painting any idea they oppose coming from the Republican camps as a “Koch-funded” program (it often is), the reality is that the leftists are the biggest dupes in the vaccine game.\n\n>This is because, while leftists hawk vaccines and pride themselves on their obedience to doctors and “scientists,” they are doing nothing more than falling into line with a massive Koch-funded and ALEC-facilitated propaganda campaign.\n\n##American Legislative Exchange Council (ALEC) \n\n>For those who may not be familiar with the American Legislative Exchange Council (ALEC), the council is considered a “non-profit organization” made up of Conservative state legislators and corporate private sector “partners.” \n\n>This mixture of government officials and corporate agents then meet regularly, replete with funding from major corporations all across the world to discuss, plan, write, and submit legislation that is beneficial to the corporations.\n\n>In one sense, ALEC is a massive corporate lobbying firm. In another, however, ALEC is much more, since much of the legislation submitted by the attentive congressman is actually written for the Senator or Representative by the agents of the organization. It is an organization that provides funding and direction (marching orders) for Congressmen, particularly those at the state level.\n\n>While slimy billionaires like [George Soros act as the guiding force behind much of the American left](http://www.activistpost.com/2015/04/baltimore-riots-product-of-soros-machine.html), ALEC and KOCH Industries tend to fill the same void for the right; although, in truth, most of the corporations that make up ALEC are those who also fund Democratic candidates. Presentation, however, in a carefully crafted political theatre like the United States, is paramount.\n\n>As Alan Greenblatt [describes the organization](http://www.governing.com/topics/politics/ALEC-enjoys-new-wave-influence-criticism.html) in his article for Governing,\n\n\"For decades, the American Legislative Exchange Council has been a force in shaping conservative policies at the state level. Today, its impact is even more pervasive. Its legislative ideas are resonating in practically every area of state government, from education and health to energy, environment and tax policy. The group, which brings together legislators with representatives from corporations, think tanks and foundations to craft model bills, has rung up an impressive score. Roughly 1,000 bills based on ALEC language are introduced in an average year, with about 20 percent getting enacted.\" \n\n>Brendan Greeley of Bloomberg Business [describes ALEC](http://www.bloomberg.com/bw/articles/2012-05-03/alecs-secrets-revealed-corporations-flee) in a similar fashion. He writes,\n\n\"For three decades, the American Legislative Exchange Council, the meeting’s host, has brought together corporations (including Pfizer (PFE), AT&T (T), and ExxonMobil (XOM)) and state legislators to write what it calls model bills—pieces of legislation the industries would like to become law. Often this means protecting favored tax treatment or keeping regulations at bay. ALEC has also approved model bills on social issues, including gun control and voter registration. The bills then get passed around among the 1,800 mostly Republican legislators who are ALEC members. They introduce the model bills about 1,000 times a year in state capitols around the country, the group says. About 200 become law. \n\n\"ALEC pays for the meetings through membership fees (called donations) that corporations pay. The legislators receive travel stipends (called scholarships) to attend the meetings. ALEC is registered with the IRS as a nonprofit that provides a public service, not as a lobbyist that seeks to influence.\n\n\"This offers two benefits: Corporate members can deduct yearly dues, which run up to $25,000—more if they want to sponsor meetings; and ALEC doesn’t have to disclose the names of legislators and executives who attend. That’s important, because if ALEC operated with complete openness it would have difficulty operating at all. ALEC has attracted a wide and wealthy range of supporters in part because it’s done its work behind closed doors. Membership lists were secret. The origins of the model bills were secret. Part of ALEC’s mission is to present industry-backed legislation as grass-roots work. If this were to become clear to everyone, there’d be no reason for corporations to use it.\"\n\n>While ALEC has pushed a number of bills regarding divisive wedge issues (it has to keep up its conservative veneer), it focuses mostly on economic issues promoting free market, Austrian school, deregulation, free trade, and other policies supported by major banks and corporations.\n\n>But ALEC is also a major pusher of laws regarding medical issues – not merely in the context of the American healthcare system, but also in the context of personal choice.\n\n>Despite all the rhetoric of ALEC and its puppets in Congress, the position of the organization and its puppets is not necessarily in favor of personal choice. This much has been made clear in the form of mandates and force of law, particularly in the area of vaccination.\n\n>This should not be surprising considering ALEC’s many [Big Pharma members](https://web.archive.org/web/200012021600/http:/wyl.ewg.org/FoxProCGI.acgi$run_module?data_code=CLEAR&extra_code=group_code=ORG197&the_type=Group&). While the organization is made up of a plethora of major corporations Big Pharma [makes up a sizable portion](http://www.sourcewatch.org/index.php/ALEC_Corporations) of its ranks.\n\n>Below are a very small few of pharmaceutical companies that are part of ALEC’s operations.\n\n* Astellas Pharma Inc.\n\n* Bayer\n\n* Dupont (Dupont Merck Pharmaceuticals)\n\n* Eli Lilly\n\n* Endo Pharmaceuticals\n    \n* Express Scripts\n    \n* GlaxoSmithKline\n    \n* Hoechst- Roussell Pharmaceutical Corporation\n    \n* Hoffman La-Roche\n    \n* Imperial Chemical Industries Pharmaceuticals\n    \n* Johnson & Johnson\n    \n* Mylan Pharmaceuticals\n    \n* Novo Nordisk\n    \n* Pharmacia and UpJohn\n    \n* Purdue Pharma\n    \n* Pfizer\n    \n* Solvay Pharmaceutical\n    \n* Takeda Pharmaceutical\n    \n* TEVA Pharmaceuticals\n    \n* TogetherRX Access (made up of ABBVIE, GSK, Janssen, Lifescan, Pfizer, Stiefel, Viiv Healthcare, Vistakon Pharmaceuticals)\n    \n* The UpJohn Co.\n\n>These names are only a small few of the myriad of pharmaceutical companies, vaccine manufacturers, and other interested parties who are listed as members of ALEC. Many of these companies are concealed even further by a veil of umbrella “organizations” acting as front operations.\n\n## ALEC And Vaccines\n\n>With such a massive list of major pharmaceutical companies amidst ALEC’s ranks, it should come as no real surprise that ALEC would be one of the driving forces behind the recent spate of “mandatory vaccine bills” popping up all across the country. Indeed, its motto should be “Personal Choice For Corporations. Government Enforced Mandates For People.”\n\n>Remember, it was ALEC that crafted the “model” legislation “[Immunization of Minors On TANF](https://www.heartland.org/sites/all/modules/custom/heartland_migration/files/pdfs/6364.pdf),” legislation that would have required parents on TANF assistance to require proof that their children were fully vaccinated according to the “recommended” levels. If those families did not show proof of their child’s vaccination, those families would lose their TANF benefits.\n\n>While exemptions were left intact in this “model” legislation, ALEC has stepped up its attack on parental rights by going after the exemption status in later bills.\n\n>For instance, consider the attempt to remove Vermont citizens’ rights to a philosophical exemption to vaccination known as SB 199, a bill that caught many in Vermont by complete surprise. Of course, when one takes a look at the key players and possible motivations, it becomes more obvious as to how this bill came to be and why.\n\n>SB 199 was submitted in the Senate by ALEC’s Vermont Chair Senator, Kevin Mullin, and in the House by a notorious vaccine pusher and vaccine damage denier. As [Barbara Loe Fisher writes for National Vaccine Information Center](http://www.nvic.org/NVIC-Vaccine-News/May-2012/americans-fight-for-vaccine-choices.aspx),\n\n\"S199 was introduced in the state Senate by Kevin Mullin, who is [VT chair of the Pharma-funded American Legislative Exchange Council](http://vtdigger.org/2012/04/19/kentish-alecs-ugly-duckling/) (ALEC), and was introduced in the state House by Representative George Till, M.D., at the request of Harry Chen, M.D., Vermont’s Health Commissioner. Dr. Chen, who was a Vermont state representative and former chair of the Vermont House Health Care Committee for four years, has [publicly downplayed vaccine risks](http://www.sevendaysvt.com/vermont/flu-shot-or-not-state-health-officials-warn-against-alarmist-reaction-to-young-girls-death/Content?oid=2183309).\n\n\"S199 was supported by the VT Dept. of Health and state government supported institutions, such as the University of Vermont, as well as medical trade associations that receive money from pharmaceutical corporations selling vaccines in the U.S., including the American Academy of Pediatrics (AAP), March of Dimes, Every Child by Two and the American Legislative Exchange Council (ALEC). Other organizations endorsing elimination of the philosophical exemption included the Vermont Academy of Family Physicians, Fletcher Allen, Vermont Association of Hospitals and Health Systems, Voices for VT Children, Vermont Pharmacists Association, Rutland Medical Center, and Vermont Medical Society.\" \n\n>Edward Kentish seconded Fisher’s criticism in his [op-ed for VTDigger.com](http://vtdigger.org/2012/04/19/kentish-alecs-ugly-duckling/) when he wrote,\n\n\"Here ALEC’s Vermont chairman, Republican Sen. Kevin Mullin, introduced S.199, a bill seeking to end the “philosophical exemption” in the childhood vaccine laws. A Republican introducing a health care bill, one that removes a parent’s rights, one that obliges all children to participate in a health care plan. … An ugly duckling if ever there was one! Just doesn’t look like all the rest.\n\n\"The duckling looks even uglier in the light of Vermont’s exemplary health statistics. We rank right up there on general health, low incidence of infectious diseases, and low child mortality. What’s the problem, what motivates such a bill? Well, several corporations have recently publicly cut their ties with ALEC over ALEC’s Stand Your Ground gun laws, underscoring the reality that ALEC is funded by corporations, and we may guess has their interests at heart more than your child’s well-being.\"\n\n>One might be tempted to argue that the vaccine bill submitted in Vermont was merely an anomaly. That is, one would be tempted to make this argument if the Vermont bill was the only such bill submitted and supported by ALEC and its members.\n\n>In California, the infamous and fascist SB 277 which unfortunately became law was introduced by another vaccine fanatic and high priest of the religion of scientism, Richard Pan. Ben Allen, however, the second State Senator to introduce the legislation into the California state Senate is himself connected to ALEC. As [Maureen Cruise of LA Progressive wrote](https://www.laprogressive.com/ben-allen-sandra-fluke/) in regards to Allen’s funding,\n\n\"Among other wealthy conservative donors are William E. Oberndorf, a California billionaire investor who funds conservative causes such as the privatization of education which he promotes via the American Legislative Exchange Council (ALEC). He has contributed to the Karl Rove PAC and to Jeb Bush and the GW Bush Foundation. The Fisher Family of Gap and a dozen other corporations are fans of privatization of the public sector and charter schools.\"\n\n>Oberndorf, the ALEC big wig, is a major donor of Allen.\n\n>Cruise also points out that a sizable portion of Allen’s campaign contributions come directly from pharmaceutical interests.\n\n>A similar story is discovered in North Carolina, where notoriously arrogant and corrupt Senator Jeff Tarte – in between fits of whining and rage – introduced a bill that would have removed all vaccine exemption rights (except for medical exemptions) from parents and children, including homeschool children.\n\n>As if his last name did not accurately describe his disposition, Senator Tarte was one of the [main sponsors of the NC bill SB 346](http://www.ncleg.net/gascripts/BillLookUp/BillLookUp.pl?Session=2015&BillID=s346), a bill that would have eliminated the “religious exemption” clause in the recommended vaccine schedule for children entering NC public schools. He was also a main contender for the title of [worst public relations interaction](http://www.naturalblaze.com/2015/05/senator-explodes-when-questioned-about.html) with a constituent in the state of North Carolina in the last several years.\n\n>In keeping with the trend of recent events, however, Tarte is also a member of the ALEC organization, a feather in his cap that he was not shy in advertising in his weekly newsletter. Tarte not only is a member, but an active participant taking part in speaking events and even a seat on the ALEC Education Council.\n  \n## Conclusion\n\n>The goal of forced vaccination has been in existence for quite some time, going back to a number of elite think tanks decades ago and the halls of pharmaceutical companies. Major pharmaceutical companies, for many obvious (or should be obvious ) reasons would also like to mandate vaccination. Increased profits from the vaccine sales and the treatment of resulting disease, as well as the cover-up of vaccine risks by a population free of a control group are but a few of the reasons such corporations are supporting the vaccine mandates.\n\n>After all, as Bertrand Russell stated as far back as 1953,\n\n\"Diet, injections, and injunctions will combine, from a very early age, to produce the sort of character and the sort of beliefs that the authorities consider desirable, and any serious criticism of the powers that be will become psychologically impossible.\"\n\n>But, while the push to mandate vaccines for children and adults is by no means an ALEC-centric conspiracy, this recent push for such laws was indeed formulated in ALEC councils.\n\n>For this reason, it is highly ironic that the political left should be the half of the paradigm that takes up the charge for mandatory vaccination laws. After all, it is the left (at the lower levels) who seems to live by the motto “If ALEC supports it, we oppose it.” This time, all it took was some clever propaganda, trendy nudging, and social shaming and the left was marching right behind ALEC as militantly as if they were Republicans all along.\n\n>The entire vaccine debate can scarcely even be labeled a debate. It is an exercise in social shaming, shouting down opposing views, and religious devotion to television and anyone wearing a lab coat or claiming to be an expert.\n\n>With the culprit behind the recent mandatory vaccine/eliminate exemption push now revealed, it is time to begin working toward repealing these laws and making sure that no similar bill is ever politically viable.",
  "mod_reports": [],
  "secure_media_embed": {},
  "author_flair_css_class": "AXO",
  "edited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"http://www.activistpost.com/2015/07/alec-behind-recent-push-for-mandatory.html\">Source</a></p>\n\n<blockquote>\n<p>Over the last several months, Americans have witnessed an increase in media propaganda regarding the “dangers” of “anti-vaxxers,” the “proven science of vaccines,” and the “tragedies” that ensue from the failure to vaccinate. That propaganda blitz has resulted in massive hysteria stemming from similar levels of ignorance.</p>\n\n<p>Also resulting from the push by Big Pharma-funded corporate media outlets is the emotional and panicked campaign of pro-vaxxers, vaccine pushers, and adherents to the relatively recent new religion of “scientism” – the religious belief in anything labeled as science or scientific, regardless of whether or not that concept directly contradicts observable reality and experience or even regardless of whether or not it is actually scientific.</p>\n\n<p>The so-called vaccine debate – which is not truly a debate since a debate requires the participation of two opposing sides – is generally nothing more than a shouting and shaming campaign against parents who have come to the conclusion that vaccines are not safe, effective, or neither.</p>\n\n<p>Indeed, it is the unbridled emotion of the pro-vaccine camp that has been provoked and subsequently harnessed into a powerhouse of vitriol and social pressure that is then presented as a public health crisis. </p>\n\n<p>The howling of the trendy masses, glued to their televisions, sitcoms, and NPR, is then presented as an organic public outcry in the media, resulting in the conveniently timed response of politicians and lawmakers.</p>\n\n<p>Of course, with the creation of the false debate, there is also the political polarization of the issue – the left must be pitted against the right – in a typical but tried and true method of divide and conquer strategy.</p>\n\n<p>Originally, holding questions regarding the safety or effectiveness of vaccinations was something that bridged political boundaries. Granted, the individuals who held these views were a minority. However, those numbers were growing and could be found in the midst of liberals and conservatives, libertarians and socialists, and even those completely unaligned to any ideology.</p>\n\n<p>Now, however, that is beginning to change. The Big Pharma companies that fund the mainstream media and the political parasites infecting the federal and state capitols have managed to turn this debate into a partisan issue.</p>\n\n<p>The propaganda campaign has been successful among members of all political denominations, but particularly so among the left. This is because the left is made up of a population that is well-trained to believe anything presented to them under the guise of science in much the same way as the right who are designed to believe anything presented in a religious context.</p>\n\n<p>The result of this massive absorption of indoctrination is that we have the passage of bills mandating that children be vaccinated by force of law in California and even the attempt to force adults to be vaccinated as well.</p>\n\n<p>With mandates coming out of California, North Carolina, and Vermont, clearly there is a nationwide agenda at foot.</p>\n\n<p>But while those on the left continue to attack Koch Industries and ALEC for funding a number of horrific economic policies and divisive domestic campaigns, painting any idea they oppose coming from the Republican camps as a “Koch-funded” program (it often is), the reality is that the leftists are the biggest dupes in the vaccine game.</p>\n\n<p>This is because, while leftists hawk vaccines and pride themselves on their obedience to doctors and “scientists,” they are doing nothing more than falling into line with a massive Koch-funded and ALEC-facilitated propaganda campaign.</p>\n</blockquote>\n\n<h2>American Legislative Exchange Council (ALEC)</h2>\n\n<blockquote>\n<p>For those who may not be familiar with the American Legislative Exchange Council (ALEC), the council is considered a “non-profit organization” made up of Conservative state legislators and corporate private sector “partners.” </p>\n\n<p>This mixture of government officials and corporate agents then meet regularly, replete with funding from major corporations all across the world to discuss, plan, write, and submit legislation that is beneficial to the corporations.</p>\n\n<p>In one sense, ALEC is a massive corporate lobbying firm. In another, however, ALEC is much more, since much of the legislation submitted by the attentive congressman is actually written for the Senator or Representative by the agents of the organization. It is an organization that provides funding and direction (marching orders) for Congressmen, particularly those at the state level.</p>\n\n<p>While slimy billionaires like <a href=\"http://www.activistpost.com/2015/04/baltimore-riots-product-of-soros-machine.html\">George Soros act as the guiding force behind much of the American left</a>, ALEC and KOCH Industries tend to fill the same void for the right; although, in truth, most of the corporations that make up ALEC are those who also fund Democratic candidates. Presentation, however, in a carefully crafted political theatre like the United States, is paramount.</p>\n\n<p>As Alan Greenblatt <a href=\"http://www.governing.com/topics/politics/ALEC-enjoys-new-wave-influence-criticism.html\">describes the organization</a> in his article for Governing,</p>\n</blockquote>\n\n<p>&quot;For decades, the American Legislative Exchange Council has been a force in shaping conservative policies at the state level. Today, its impact is even more pervasive. Its legislative ideas are resonating in practically every area of state government, from education and health to energy, environment and tax policy. The group, which brings together legislators with representatives from corporations, think tanks and foundations to craft model bills, has rung up an impressive score. Roughly 1,000 bills based on ALEC language are introduced in an average year, with about 20 percent getting enacted.&quot; </p>\n\n<blockquote>\n<p>Brendan Greeley of Bloomberg Business <a href=\"http://www.bloomberg.com/bw/articles/2012-05-03/alecs-secrets-revealed-corporations-flee\">describes ALEC</a> in a similar fashion. He writes,</p>\n</blockquote>\n\n<p>&quot;For three decades, the American Legislative Exchange Council, the meeting’s host, has brought together corporations (including Pfizer (PFE), AT&amp;T (T), and ExxonMobil (XOM)) and state legislators to write what it calls model bills—pieces of legislation the industries would like to become law. Often this means protecting favored tax treatment or keeping regulations at bay. ALEC has also approved model bills on social issues, including gun control and voter registration. The bills then get passed around among the 1,800 mostly Republican legislators who are ALEC members. They introduce the model bills about 1,000 times a year in state capitols around the country, the group says. About 200 become law. </p>\n\n<p>&quot;ALEC pays for the meetings through membership fees (called donations) that corporations pay. The legislators receive travel stipends (called scholarships) to attend the meetings. ALEC is registered with the IRS as a nonprofit that provides a public service, not as a lobbyist that seeks to influence.</p>\n\n<p>&quot;This offers two benefits: Corporate members can deduct yearly dues, which run up to $25,000—more if they want to sponsor meetings; and ALEC doesn’t have to disclose the names of legislators and executives who attend. That’s important, because if ALEC operated with complete openness it would have difficulty operating at all. ALEC has attracted a wide and wealthy range of supporters in part because it’s done its work behind closed doors. Membership lists were secret. The origins of the model bills were secret. Part of ALEC’s mission is to present industry-backed legislation as grass-roots work. If this were to become clear to everyone, there’d be no reason for corporations to use it.&quot;</p>\n\n<blockquote>\n<p>While ALEC has pushed a number of bills regarding divisive wedge issues (it has to keep up its conservative veneer), it focuses mostly on economic issues promoting free market, Austrian school, deregulation, free trade, and other policies supported by major banks and corporations.</p>\n\n<p>But ALEC is also a major pusher of laws regarding medical issues – not merely in the context of the American healthcare system, but also in the context of personal choice.</p>\n\n<p>Despite all the rhetoric of ALEC and its puppets in Congress, the position of the organization and its puppets is not necessarily in favor of personal choice. This much has been made clear in the form of mandates and force of law, particularly in the area of vaccination.</p>\n\n<p>This should not be surprising considering ALEC’s many <a href=\"https://web.archive.org/web/200012021600/http:/wyl.ewg.org/FoxProCGI.acgi$run_module?data_code=CLEAR&amp;extra_code=group_code=ORG197&amp;the_type=Group&amp;\">Big Pharma members</a>. While the organization is made up of a plethora of major corporations Big Pharma <a href=\"http://www.sourcewatch.org/index.php/ALEC_Corporations\">makes up a sizable portion</a> of its ranks.</p>\n\n<p>Below are a very small few of pharmaceutical companies that are part of ALEC’s operations.</p>\n</blockquote>\n\n<ul>\n<li><p>Astellas Pharma Inc.</p></li>\n<li><p>Bayer</p></li>\n<li><p>Dupont (Dupont Merck Pharmaceuticals)</p></li>\n<li><p>Eli Lilly</p></li>\n<li><p>Endo Pharmaceuticals</p></li>\n<li><p>Express Scripts</p></li>\n<li><p>GlaxoSmithKline</p></li>\n<li><p>Hoechst- Roussell Pharmaceutical Corporation</p></li>\n<li><p>Hoffman La-Roche</p></li>\n<li><p>Imperial Chemical Industries Pharmaceuticals</p></li>\n<li><p>Johnson &amp; Johnson</p></li>\n<li><p>Mylan Pharmaceuticals</p></li>\n<li><p>Novo Nordisk</p></li>\n<li><p>Pharmacia and UpJohn</p></li>\n<li><p>Purdue Pharma</p></li>\n<li><p>Pfizer</p></li>\n<li><p>Solvay Pharmaceutical</p></li>\n<li><p>Takeda Pharmaceutical</p></li>\n<li><p>TEVA Pharmaceuticals</p></li>\n<li><p>TogetherRX Access (made up of ABBVIE, GSK, Janssen, Lifescan, Pfizer, Stiefel, Viiv Healthcare, Vistakon Pharmaceuticals)</p></li>\n<li><p>The UpJohn Co.</p></li>\n</ul>\n\n<blockquote>\n<p>These names are only a small few of the myriad of pharmaceutical companies, vaccine manufacturers, and other interested parties who are listed as members of ALEC. Many of these companies are concealed even further by a veil of umbrella “organizations” acting as front operations.</p>\n</blockquote>\n\n<h2>ALEC And Vaccines</h2>\n\n<blockquote>\n<p>With such a massive list of major pharmaceutical companies amidst ALEC’s ranks, it should come as no real surprise that ALEC would be one of the driving forces behind the recent spate of “mandatory vaccine bills” popping up all across the country. Indeed, its motto should be “Personal Choice For Corporations. Government Enforced Mandates For People.”</p>\n\n<p>Remember, it was ALEC that crafted the “model” legislation “<a href=\"https://www.heartland.org/sites/all/modules/custom/heartland_migration/files/pdfs/6364.pdf\">Immunization of Minors On TANF</a>,” legislation that would have required parents on TANF assistance to require proof that their children were fully vaccinated according to the “recommended” levels. If those families did not show proof of their child’s vaccination, those families would lose their TANF benefits.</p>\n\n<p>While exemptions were left intact in this “model” legislation, ALEC has stepped up its attack on parental rights by going after the exemption status in later bills.</p>\n\n<p>For instance, consider the attempt to remove Vermont citizens’ rights to a philosophical exemption to vaccination known as SB 199, a bill that caught many in Vermont by complete surprise. Of course, when one takes a look at the key players and possible motivations, it becomes more obvious as to how this bill came to be and why.</p>\n\n<p>SB 199 was submitted in the Senate by ALEC’s Vermont Chair Senator, Kevin Mullin, and in the House by a notorious vaccine pusher and vaccine damage denier. As <a href=\"http://www.nvic.org/NVIC-Vaccine-News/May-2012/americans-fight-for-vaccine-choices.aspx\">Barbara Loe Fisher writes for National Vaccine Information Center</a>,</p>\n</blockquote>\n\n<p>&quot;S199 was introduced in the state Senate by Kevin Mullin, who is <a href=\"http://vtdigger.org/2012/04/19/kentish-alecs-ugly-duckling/\">VT chair of the Pharma-funded American Legislative Exchange Council</a> (ALEC), and was introduced in the state House by Representative George Till, M.D., at the request of Harry Chen, M.D., Vermont’s Health Commissioner. Dr. Chen, who was a Vermont state representative and former chair of the Vermont House Health Care Committee for four years, has <a href=\"http://www.sevendaysvt.com/vermont/flu-shot-or-not-state-health-officials-warn-against-alarmist-reaction-to-young-girls-death/Content?oid=2183309\">publicly downplayed vaccine risks</a>.</p>\n\n<p>&quot;S199 was supported by the VT Dept. of Health and state government supported institutions, such as the University of Vermont, as well as medical trade associations that receive money from pharmaceutical corporations selling vaccines in the U.S., including the American Academy of Pediatrics (AAP), March of Dimes, Every Child by Two and the American Legislative Exchange Council (ALEC). Other organizations endorsing elimination of the philosophical exemption included the Vermont Academy of Family Physicians, Fletcher Allen, Vermont Association of Hospitals and Health Systems, Voices for VT Children, Vermont Pharmacists Association, Rutland Medical Center, and Vermont Medical Society.&quot; </p>\n\n<blockquote>\n<p>Edward Kentish seconded Fisher’s criticism in his <a href=\"http://vtdigger.org/2012/04/19/kentish-alecs-ugly-duckling/\">op-ed for VTDigger.com</a> when he wrote,</p>\n</blockquote>\n\n<p>&quot;Here ALEC’s Vermont chairman, Republican Sen. Kevin Mullin, introduced S.199, a bill seeking to end the “philosophical exemption” in the childhood vaccine laws. A Republican introducing a health care bill, one that removes a parent’s rights, one that obliges all children to participate in a health care plan. … An ugly duckling if ever there was one! Just doesn’t look like all the rest.</p>\n\n<p>&quot;The duckling looks even uglier in the light of Vermont’s exemplary health statistics. We rank right up there on general health, low incidence of infectious diseases, and low child mortality. What’s the problem, what motivates such a bill? Well, several corporations have recently publicly cut their ties with ALEC over ALEC’s Stand Your Ground gun laws, underscoring the reality that ALEC is funded by corporations, and we may guess has their interests at heart more than your child’s well-being.&quot;</p>\n\n<blockquote>\n<p>One might be tempted to argue that the vaccine bill submitted in Vermont was merely an anomaly. That is, one would be tempted to make this argument if the Vermont bill was the only such bill submitted and supported by ALEC and its members.</p>\n\n<p>In California, the infamous and fascist SB 277 which unfortunately became law was introduced by another vaccine fanatic and high priest of the religion of scientism, Richard Pan. Ben Allen, however, the second State Senator to introduce the legislation into the California state Senate is himself connected to ALEC. As <a href=\"https://www.laprogressive.com/ben-allen-sandra-fluke/\">Maureen Cruise of LA Progressive wrote</a> in regards to Allen’s funding,</p>\n</blockquote>\n\n<p>&quot;Among other wealthy conservative donors are William E. Oberndorf, a California billionaire investor who funds conservative causes such as the privatization of education which he promotes via the American Legislative Exchange Council (ALEC). He has contributed to the Karl Rove PAC and to Jeb Bush and the GW Bush Foundation. The Fisher Family of Gap and a dozen other corporations are fans of privatization of the public sector and charter schools.&quot;</p>\n\n<blockquote>\n<p>Oberndorf, the ALEC big wig, is a major donor of Allen.</p>\n\n<p>Cruise also points out that a sizable portion of Allen’s campaign contributions come directly from pharmaceutical interests.</p>\n\n<p>A similar story is discovered in North Carolina, where notoriously arrogant and corrupt Senator Jeff Tarte – in between fits of whining and rage – introduced a bill that would have removed all vaccine exemption rights (except for medical exemptions) from parents and children, including homeschool children.</p>\n\n<p>As if his last name did not accurately describe his disposition, Senator Tarte was one of the <a href=\"http://www.ncleg.net/gascripts/BillLookUp/BillLookUp.pl?Session=2015&amp;BillID=s346\">main sponsors of the NC bill SB 346</a>, a bill that would have eliminated the “religious exemption” clause in the recommended vaccine schedule for children entering NC public schools. He was also a main contender for the title of <a href=\"http://www.naturalblaze.com/2015/05/senator-explodes-when-questioned-about.html\">worst public relations interaction</a> with a constituent in the state of North Carolina in the last several years.</p>\n\n<p>In keeping with the trend of recent events, however, Tarte is also a member of the ALEC organization, a feather in his cap that he was not shy in advertising in his weekly newsletter. Tarte not only is a member, but an active participant taking part in speaking events and even a seat on the ALEC Education Council.</p>\n</blockquote>\n\n<h2>Conclusion</h2>\n\n<blockquote>\n<p>The goal of forced vaccination has been in existence for quite some time, going back to a number of elite think tanks decades ago and the halls of pharmaceutical companies. Major pharmaceutical companies, for many obvious (or should be obvious ) reasons would also like to mandate vaccination. Increased profits from the vaccine sales and the treatment of resulting disease, as well as the cover-up of vaccine risks by a population free of a control group are but a few of the reasons such corporations are supporting the vaccine mandates.</p>\n\n<p>After all, as Bertrand Russell stated as far back as 1953,</p>\n</blockquote>\n\n<p>&quot;Diet, injections, and injunctions will combine, from a very early age, to produce the sort of character and the sort of beliefs that the authorities consider desirable, and any serious criticism of the powers that be will become psychologically impossible.&quot;</p>\n\n<blockquote>\n<p>But, while the push to mandate vaccines for children and adults is by no means an ALEC-centric conspiracy, this recent push for such laws was indeed formulated in ALEC councils.</p>\n\n<p>For this reason, it is highly ironic that the political left should be the half of the paradigm that takes up the charge for mandatory vaccination laws. After all, it is the left (at the lower levels) who seems to live by the motto “If ALEC supports it, we oppose it.” This time, all it took was some clever propaganda, trendy nudging, and social shaming and the left was marching right behind ALEC as militantly as if they were Republicans all along.</p>\n\n<p>The entire vaccine debate can scarcely even be labeled a debate. It is an exercise in social shaming, shouting down opposing views, and religious devotion to television and anyone wearing a lab coat or claiming to be an expert.</p>\n\n<p>With the culprit behind the recent mandatory vaccine/eliminate exemption push now revealed, it is time to begin working toward repealing these laws and making sure that no similar bill is ever politically viable.</p>\n</blockquote>\n</div><!-- SC_ON -->",
  "downs": 0,
  "user_reports": [],
  "over_18": false,
  "score": 6,
  "stickied": false,
  "domain": "self.conspiracy",
  "is_self": true,
  "hidden": false,
  "_orphaned": {},
  "_api_link": "https://api.reddit.com/r/conspiracy/comments/3f653n/alec_behind_recent_push_for_mandatory_vaccination/?ref=search_posts",
  "_comments_by_id": {},
  "visited": false,
  "thumbnail": "self",
  "_has_fetched": true,
  "gilded": 0,
  "hide_score": false,
  "_info_url": "https://api.reddit.com/api/info/",
  "created_utc": 1438273693.0,
  "subreddit_id": "t5_2qh4r",
  "id": "3f653n",
  "_params": {},
  "media_embed": {},
  "name": "t3_3f653n",
  "quarantine": false,
  "permalink": "https://www.reddit.com/r/conspiracy/comments/3f653n/alec_behind_recent_push_for_mandatory_vaccination/?ref=search_posts",
  "ups": 6,
  "url": "https://www.reddit.com/r/conspiracy/comments/3f653n/alec_behind_recent_push_for_mandatory_vaccination/",
  "title": "ALEC Behind Recent Push for Mandatory Vaccination: The reality is that the leftists are the biggest dupes in the vaccine game.",
  "preview": {
    "images": [
      {
        "resolutions": [
          {
            "width": 108,
            "height": 127,
            "url": "https://i.redditmedia.com/jv4TVh8gPpjzx8dx-bQxVNPY3ovLq2og1dA26vN91tM.jpg?fit=crop&crop=faces%2Centropy&arh=2&w=108&s=b9ccc057c53068782d3a8be02bdd8ef4"
          },
          {
            "width": 216,
            "height": 255,
            "url": "https://i.redditmedia.com/jv4TVh8gPpjzx8dx-bQxVNPY3ovLq2og1dA26vN91tM.jpg?fit=crop&crop=faces%2Centropy&arh=2&w=216&s=83584f9aa75ad7645061f72ea09884eb"
          }
        ],
        "id": "9C87ZvMDdCLcl95mYkSmtaSZM97cMbsv7RWS-OTgPhE",
        "variants": {},
        "source": {
          "width": 271,
          "height": 320,
          "url": "https://i.redditmedia.com/jv4TVh8gPpjzx8dx-bQxVNPY3ovLq2og1dA26vN91tM.jpg?s=a1b0fdd1291078c0b3efdad5441b5ac3"
        }
      }
    ]
  }
}