{
  "selftext": "I’ve seen a number of posts on r/makeupaddiction and elsewhere on reddit that discuss the importance of cruelty-free, sustainable, green or “environmentally” cosmetics manufacturers. Often we don’t understand the implications of these terms and many companies take advantage of the fact that “being green” is a difficult concept to nail down.\n\nI have bit of a background in this kinda stuff and am pretty passionate about responsible business so I thought I would do a bit research on the topic of cosmetics and the environmental and social impacts they have. \n\n**What is sustainability? What does it mean to “be green”?**\n\nSustainability has a number of definitions, but in this context, it generally refers to a company that protects the interests of the environment or more broadly society by operating in a manner that does not adversely affect the environment (land, water, air or biodiversity) or communities (employees, local communities, global communities and so on) and that can be sustained over the long-term. This means that the company follows the regulations in the areas it operates but on top of that, works to ensure that its products and/or operations have the least impact on environment and society. \n\nFrom my experience, a “green” company or product is one that integrates sustainability into its entire operations and product base – not only does it have efficient plants to don’t produce lots of greenhouse gases, it specifically designs its products so that their use has minimal impact on the environment and/or society. Additionally, there is actual evidence provided by the company that the things they do reduce their impacts or at least, can be clearly understood to contribute to reducing impact. A green company is not necessarily one that just uses biodegradable packaging or donates lots of money to environmental NGOs. Lots of companies do these things just to attract environmentally minded consumers, while continuing to operate unsustainably in other ways. \n\n**What are some of the environmental impacts associated with cosmetics manufacturing?**\n\nCosmetics, by nature, are chemicals. Chemicals are not necessarily bad for the environment, however, the manufacture of some chemicals can be highly energy intensive processes. Further, the chemicals used in many cosmetics are often created from petroleum or petroleum by-products. Obviously, cosmetics are a drop in the bucket compared to the vast amount of other chemicals produced through these processes, but it’s an interesting thing to keep in mind. Petroleum extraction and manufacturing of chemicals contribute to CO2 and other greenhouse gasses involved in global warming. \n\nCosmetics are also highly packaging intensive (I’m looking at you Benefit!). The manufacture of packaging, especially plastics, can be highly energy intensive and involve petroleum-based chemical byproducts. BPA and other plastics used in cosmetic packaging are non-biodegradable and used packaging for products often end up in landfills or worse, in the ocean, where it is believed large floating garbage piles are starting to form from all the plastic that ends up washed into the sea. Not only is this an eyesore, it presents a danger to marine life who may ingest small quantities of partially broken down plastic and which can end up accumulating in the stomachs of larger mammals through a process called bioaccumulation.\n\nThen let’s talk transport. Are you one of those people who like to use all the codes Sephora sends out to get goodies, separating your shipments into single purchases for extra goodness? All of this extra transport adds on to GHG emissions from the burning of transport fossil fuels, on top of all the other transport the products had to go through from chemical manufacturer to packaging manufacturer to retail warehouse to store shelf! \n\n**What are some of the environmental impacts associated with cosmetic products?**\n\nPalm oil, palm kernel oil and derivatives are present in approximately 70% of cosmetic products. The extraction of palm oil is devastating on the environment, especially to ecosystems and biodiversity. Nearly a 3rd of all mammals in Indonesia are endangered due to the rapid expansion of the palm oil industry. Over 90% of orangutan habitat in Borneo and Sumatra has been destroyed, with anywhere from 1000-5000 animals being killed every year. \n\nPlastic microbeads and nanoparticles are another emerging issue in cosmetic products. Often found in facial and hand cleansers, these itty bitty particles are often missed in wastewater treatment and end up in water ecosystems, where fish and another aquatic animals may ingest them and where they may eventually end up accumulating in the food chain. While the full impact of these particles is currently unknown, many countries and states have worked to ban their presence in products and some cosmetics companies have taken steps to phase them out of products. \n\nOther chemicals found in cosmetics have been linked to reproductive infertility and something called “endocrine disruption” in animal populations. One such example is a family of chemicals known as siloxanes, silicon based products that make cosmetics feel good and smooth skin – Environment Canada found that these chemicals were toxic, persistent and linked to bioaccumulation in the environment.\n\n**What are some of the social impacts associated with cosmetic products?**\n\nRemember palm oil? Well it also has a number of significant impacts on the communities where development is occurring. Indigenous people and lower income communities often become reliant on palm oil manufacturers for work and a number of significant human rights issues have arisen, including reports of child labour and slavery.  \n\nHuman health is another popular concern. Generally speaking, cosmetics manufacturers in North America, Europe and Asia are held to strict safety guidelines for the chemicals that are included in their products. However, there are some unknowns and a certain amount of “risk tolerance” that different regions and companies are willing to accept. Chemicals found in cosmetics have been correlated or directly linked to cancer, including breast cancer, by a variety of independent studies. It is important to note that there are many unknowns when considering the effects chemicals have on human health and that you personally must decide how much risk you are willing to accept. This is not an area I am an expert in so if any ladies have anything else to add, please do!\n\n**What are some big “red flags”?**\n\nBe careful of products that claim to be organic, natural, eco-friendly, cruelty-free, sustainably sourced, and so on. There are no legal definitions for many popular buzzwords in “green” cosmetics. These labels can be stamped on pretty much anything and unless a company clearly and transparently defines how they have come about to classify a product as such, don’t buy something just because it has those terms on it. Sephora can under fire for this for their “naturally beautiful” certified products, many of which contain ingredients that have been linked to toxicity and harmful health effects. Additionally, they provided no specific guidelines or best practices that would indicate these products were good for anything other than the bottom line. I firmly believe that some amount of risk tolerance is fine in respect to what goes into your products BUT I am also strongly against companies greenwashing their products and this is the perfect example.\n\n**How do I tell what companies are “good” and which ones are “bad”?**\n\nGood and bad are terms relative to your perspectives on what environmentally friendly means to you. To me, environmentally friendly cosmetics companies are ones that 1) work to reduce the environmental impacts of their operations 2) support unionization and the UN human rights global compact 3) are transparent about their operations and release reports on their environmental impacts and 4) when faced with data that indicates there are significant risks to health or the environment linked to chemicals, work to reformulate their products without them. To others, a good company is simply one that does not test on animals and that donates to environmental organizations help advance their causes.\n\nHere is a quick review of the major cosmetics companies, a link to a list of their environmental/social initiatives, and an overall collection grade, which is based off reports generated by organizations dedicated to rating the environmental and social sustainability and transparency of companies and my own personal experience. This is not an exhaustive list of companies, just ones that I am familiar with.\n\n**L’Oreal**\n\n*Major Brands:* Lancome, YSL, Kiehls, Biotherm, Shu Umera, Urban Decay, Vichy, The Bodyshop, Maybelline\n\n*Environmental and social commitments/initiatives:* http://www.loreal.com/csr-commitments/csr-commitments-homepage.aspx\n\n*Cruelty free?* No overall cruelty-free mandate, but some brands are cruelty free (such as the Body Shop) in certain juristictions. Additionally, the Body Shop has come under scrutiny for advertising itself as “cruelty-free” in the European Union, when animal testing of cosmetic products is outlawed for all brands in the EU.\n\n***Overall impression:*** **A, above average**\n\nConsistently positively rated by agencies that evaluate the environmental and social performance of companies – receives top ratings in the cosmetics/household products industry. Fairly transparent about operations, but could improve the amount of data they release in reports. Based in Europe and thus subject to costly and intense regulations to assess the health and in some cases, environmental effects of chemicals included in product formulations. Fined for engaging in anti-competitive business practices. Ahead of peers in making specific commitments to operating sustainably.\n\n**Procter and Gamble:**\n\n*Ownership:* CoverGirl and Olay \n\n*Environmental and social commitments/initiatives:* http://www.pg.com/en_US/sustainability/\n\n*Cruelty free?* Difficulty to say, probably yes but technically no. Halted a non-required testing, but may be subject to testing in specific regions depending on regulations. Have partnered with researchers to look for alternatives to animal testing. This is a controversial company for animal-rights advocates because of their unclear stance.\n\n***Overall impression:*** **B, average**\n\nRated okay, but does not seem to be making as significant commitments as other companies to product safety and sustainability goals in general. Lack of transparency compared to other companies with lower reporting of key performance indicators. Has received a number of significant fines for violations related to water, air and land emissions. Above average GHG emissions and above average waste production. Greenpeace, not my favourite organization, does have a campaign against P&G for their sourcing of palm oil, despite the fact that company has made some (although not as substantial) commitments to sustainable sourcing. A number of product safety complaints against P&G have emerged recently – some amount of lead was found in CoverGirl lipsticks but the FDA claims that the levels are low and not significant to human health.\n\n**Estee Lauder:**\n\n\n*Ownership:* Mac, Tom Ford, Bobbi Brown, Clinique, Bumble and Bumble, Origins\n\n*Environmental and social commitments/initiatives:* http://www.elcompanies.com/PdfLibrary/2012%20ELC%20CR%20Report%20-%20The%20Beauty%20of%20Responsibility.pdf\n\n*Cruelty free?* No commitments but the company has stated that no tests have been performed on products release to the US.\n\n***Overall impression:*** **B, average**\n\nThe company does not perform well on sustainable sourcing of products, specifically palm oil. However, it does lead in product safety. The company puts a strong emphasis on reducing waste and emissions in operations, and I am personally a fan of MACs recycling program (you can really see this waste-reduction initiative as a consumer). However, this is where subjectivity comes into play. Estee Lauder is the brand famous for being engaged in the breast cancer awareness “industry,” one that I am personally not a fan of and which I feel they take advantage of for their own personal gain above all else. \n\n**Revlon:** \n\n*Ownership:* Revlon and Almay\n\n*Environmental and social commitments/initiatives:* http://www.revlon.com/Home/Revlon-Home/Revlon-Corporate/Revlon-Care-Landing.aspx\n\n*Cruelty free?* Another brand that is difficult to classify. They have made cruelty free commitments in the past, but do sell product in China and as a result, these are tested on animals. \n\n***Overall impression:*** **C, below average**\n\nRevlon was a really difficult company to find information on – they don’t seem to release a CSR report and while they claim to have some transparent supply chain activities, they don’t elaborate specifically on what these are. The company does not seem to have environmental initiatives to reduce their water, air or land impact and social programmes are difficult to identify. They rank at the very bottom in terms of efforts to reduce product risks and rely on “business as usual” in the area of product health and safety, rarely attempting reformulations that exclude potentially harmful ingredients. There are weak efforts to source sustainable palm oil.\n\n**LVMH Moet Hennessey Louis:**\n\n*Ownership:* Sephora, Guerlain, Givenchy, Dior, Fresh, Benefit, Make Up Forever (I had no idea these were all owned by the same group by the way…)\n\n*Environmental and social commitments/initiatives:*\nGuerlain - http://www.guerlain.com/int/en-int/our-commitment\nLVMH Group - http://www.lvmh.com/the-group/lvmh-and-the-environment\n\n*Cruelty-free:* Unsure.\n\n***Overall impression:*** **C, below average**\n\nLike P&G, this brand owner is not primarily a cosmetics brand, so interpret these results as a broader look at the group. LVMH as a group has strong environmental policies and does make a number of significant commitments to reduce air and land impacts. Environmental policies are set by specific brands – the only brand for which I could find some policies was Guerlain. Recently, 40% of its cosmetics units participated in a carbon footprint assessment. Given the companies huge role in the cosmetics industry as a result of its ownership of Sephora, I was disappointed to find little from Sephora on the company’s environmental policies and supply chain buying practices. It was pretty difficult to find any information on this group – they don’t seem to have released a sustainability report since 2011.\n\n---\n\nI apologize for the horrible wall of text, got a bit overzealous with research. I would especially love to hear everyone's thoughts on whether they try to buy \"eco-friendly\" products and how they feel about \"green\" cosmetics. What issues are most important to you?\n\n",
  "gilded": 0,
  "score": 131,
  "removal_reason": null,
  "approved_by": null,
  "created_utc": 1406841060.0,
  "is_self": true,
  "stickied": false,
  "edited": 1406860572.0,
  "distinguished": null,
  "permalink": "https://www.reddit.com/r/MakeupAddicts/comments/2c9rnn/discussion_which_brands_are_the_most_ecofriendly/?ref=search_posts",
  "banned_by": null,
  "from_id": null,
  "likes": null,
  "_underscore_names": null,
  "num_reports": null,
  "link_flair_css_class": null,
  "_info_url": "https://api.reddit.com/api/info/",
  "id": "2c9rnn",
  "archived": true,
  "secure_media": null,
  "from_kind": null,
  "saved": false,
  "domain": "self.MakeupAddicts",
  "ups": 131,
  "suggested_sort": null,
  "quarantine": false,
  "over_18": false,
  "hide_score": false,
  "url": "https://www.reddit.com/r/MakeupAddicts/comments/2c9rnn/discussion_which_brands_are_the_most_ecofriendly/",
  "subreddit_id": "t5_2xwgx",
  "_params": {},
  "_comments": null,
  "_replaced_more": false,
  "_comments_by_id": {},
  "user_reports": [],
  "media_embed": {},
  "created": 1406841060.0,
  "author_flair_text": null,
  "visited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve seen a number of posts on <a href=\"/r/makeupaddiction\">r/makeupaddiction</a> and elsewhere on reddit that discuss the importance of cruelty-free, sustainable, green or “environmentally” cosmetics manufacturers. Often we don’t understand the implications of these terms and many companies take advantage of the fact that “being green” is a difficult concept to nail down.</p>\n\n<p>I have bit of a background in this kinda stuff and am pretty passionate about responsible business so I thought I would do a bit research on the topic of cosmetics and the environmental and social impacts they have. </p>\n\n<p><strong>What is sustainability? What does it mean to “be green”?</strong></p>\n\n<p>Sustainability has a number of definitions, but in this context, it generally refers to a company that protects the interests of the environment or more broadly society by operating in a manner that does not adversely affect the environment (land, water, air or biodiversity) or communities (employees, local communities, global communities and so on) and that can be sustained over the long-term. This means that the company follows the regulations in the areas it operates but on top of that, works to ensure that its products and/or operations have the least impact on environment and society. </p>\n\n<p>From my experience, a “green” company or product is one that integrates sustainability into its entire operations and product base – not only does it have efficient plants to don’t produce lots of greenhouse gases, it specifically designs its products so that their use has minimal impact on the environment and/or society. Additionally, there is actual evidence provided by the company that the things they do reduce their impacts or at least, can be clearly understood to contribute to reducing impact. A green company is not necessarily one that just uses biodegradable packaging or donates lots of money to environmental NGOs. Lots of companies do these things just to attract environmentally minded consumers, while continuing to operate unsustainably in other ways. </p>\n\n<p><strong>What are some of the environmental impacts associated with cosmetics manufacturing?</strong></p>\n\n<p>Cosmetics, by nature, are chemicals. Chemicals are not necessarily bad for the environment, however, the manufacture of some chemicals can be highly energy intensive processes. Further, the chemicals used in many cosmetics are often created from petroleum or petroleum by-products. Obviously, cosmetics are a drop in the bucket compared to the vast amount of other chemicals produced through these processes, but it’s an interesting thing to keep in mind. Petroleum extraction and manufacturing of chemicals contribute to CO2 and other greenhouse gasses involved in global warming. </p>\n\n<p>Cosmetics are also highly packaging intensive (I’m looking at you Benefit!). The manufacture of packaging, especially plastics, can be highly energy intensive and involve petroleum-based chemical byproducts. BPA and other plastics used in cosmetic packaging are non-biodegradable and used packaging for products often end up in landfills or worse, in the ocean, where it is believed large floating garbage piles are starting to form from all the plastic that ends up washed into the sea. Not only is this an eyesore, it presents a danger to marine life who may ingest small quantities of partially broken down plastic and which can end up accumulating in the stomachs of larger mammals through a process called bioaccumulation.</p>\n\n<p>Then let’s talk transport. Are you one of those people who like to use all the codes Sephora sends out to get goodies, separating your shipments into single purchases for extra goodness? All of this extra transport adds on to GHG emissions from the burning of transport fossil fuels, on top of all the other transport the products had to go through from chemical manufacturer to packaging manufacturer to retail warehouse to store shelf! </p>\n\n<p><strong>What are some of the environmental impacts associated with cosmetic products?</strong></p>\n\n<p>Palm oil, palm kernel oil and derivatives are present in approximately 70% of cosmetic products. The extraction of palm oil is devastating on the environment, especially to ecosystems and biodiversity. Nearly a 3rd of all mammals in Indonesia are endangered due to the rapid expansion of the palm oil industry. Over 90% of orangutan habitat in Borneo and Sumatra has been destroyed, with anywhere from 1000-5000 animals being killed every year. </p>\n\n<p>Plastic microbeads and nanoparticles are another emerging issue in cosmetic products. Often found in facial and hand cleansers, these itty bitty particles are often missed in wastewater treatment and end up in water ecosystems, where fish and another aquatic animals may ingest them and where they may eventually end up accumulating in the food chain. While the full impact of these particles is currently unknown, many countries and states have worked to ban their presence in products and some cosmetics companies have taken steps to phase them out of products. </p>\n\n<p>Other chemicals found in cosmetics have been linked to reproductive infertility and something called “endocrine disruption” in animal populations. One such example is a family of chemicals known as siloxanes, silicon based products that make cosmetics feel good and smooth skin – Environment Canada found that these chemicals were toxic, persistent and linked to bioaccumulation in the environment.</p>\n\n<p><strong>What are some of the social impacts associated with cosmetic products?</strong></p>\n\n<p>Remember palm oil? Well it also has a number of significant impacts on the communities where development is occurring. Indigenous people and lower income communities often become reliant on palm oil manufacturers for work and a number of significant human rights issues have arisen, including reports of child labour and slavery.  </p>\n\n<p>Human health is another popular concern. Generally speaking, cosmetics manufacturers in North America, Europe and Asia are held to strict safety guidelines for the chemicals that are included in their products. However, there are some unknowns and a certain amount of “risk tolerance” that different regions and companies are willing to accept. Chemicals found in cosmetics have been correlated or directly linked to cancer, including breast cancer, by a variety of independent studies. It is important to note that there are many unknowns when considering the effects chemicals have on human health and that you personally must decide how much risk you are willing to accept. This is not an area I am an expert in so if any ladies have anything else to add, please do!</p>\n\n<p><strong>What are some big “red flags”?</strong></p>\n\n<p>Be careful of products that claim to be organic, natural, eco-friendly, cruelty-free, sustainably sourced, and so on. There are no legal definitions for many popular buzzwords in “green” cosmetics. These labels can be stamped on pretty much anything and unless a company clearly and transparently defines how they have come about to classify a product as such, don’t buy something just because it has those terms on it. Sephora can under fire for this for their “naturally beautiful” certified products, many of which contain ingredients that have been linked to toxicity and harmful health effects. Additionally, they provided no specific guidelines or best practices that would indicate these products were good for anything other than the bottom line. I firmly believe that some amount of risk tolerance is fine in respect to what goes into your products BUT I am also strongly against companies greenwashing their products and this is the perfect example.</p>\n\n<p><strong>How do I tell what companies are “good” and which ones are “bad”?</strong></p>\n\n<p>Good and bad are terms relative to your perspectives on what environmentally friendly means to you. To me, environmentally friendly cosmetics companies are ones that 1) work to reduce the environmental impacts of their operations 2) support unionization and the UN human rights global compact 3) are transparent about their operations and release reports on their environmental impacts and 4) when faced with data that indicates there are significant risks to health or the environment linked to chemicals, work to reformulate their products without them. To others, a good company is simply one that does not test on animals and that donates to environmental organizations help advance their causes.</p>\n\n<p>Here is a quick review of the major cosmetics companies, a link to a list of their environmental/social initiatives, and an overall collection grade, which is based off reports generated by organizations dedicated to rating the environmental and social sustainability and transparency of companies and my own personal experience. This is not an exhaustive list of companies, just ones that I am familiar with.</p>\n\n<p><strong>L’Oreal</strong></p>\n\n<p><em>Major Brands:</em> Lancome, YSL, Kiehls, Biotherm, Shu Umera, Urban Decay, Vichy, The Bodyshop, Maybelline</p>\n\n<p><em>Environmental and social commitments/initiatives:</em> <a href=\"http://www.loreal.com/csr-commitments/csr-commitments-homepage.aspx\">http://www.loreal.com/csr-commitments/csr-commitments-homepage.aspx</a></p>\n\n<p><em>Cruelty free?</em> No overall cruelty-free mandate, but some brands are cruelty free (such as the Body Shop) in certain juristictions. Additionally, the Body Shop has come under scrutiny for advertising itself as “cruelty-free” in the European Union, when animal testing of cosmetic products is outlawed for all brands in the EU.</p>\n\n<p><strong><em>Overall impression:</em></strong> <strong>A, above average</strong></p>\n\n<p>Consistently positively rated by agencies that evaluate the environmental and social performance of companies – receives top ratings in the cosmetics/household products industry. Fairly transparent about operations, but could improve the amount of data they release in reports. Based in Europe and thus subject to costly and intense regulations to assess the health and in some cases, environmental effects of chemicals included in product formulations. Fined for engaging in anti-competitive business practices. Ahead of peers in making specific commitments to operating sustainably.</p>\n\n<p><strong>Procter and Gamble:</strong></p>\n\n<p><em>Ownership:</em> CoverGirl and Olay </p>\n\n<p><em>Environmental and social commitments/initiatives:</em> <a href=\"http://www.pg.com/en_US/sustainability/\">http://www.pg.com/en_US/sustainability/</a></p>\n\n<p><em>Cruelty free?</em> Difficulty to say, probably yes but technically no. Halted a non-required testing, but may be subject to testing in specific regions depending on regulations. Have partnered with researchers to look for alternatives to animal testing. This is a controversial company for animal-rights advocates because of their unclear stance.</p>\n\n<p><strong><em>Overall impression:</em></strong> <strong>B, average</strong></p>\n\n<p>Rated okay, but does not seem to be making as significant commitments as other companies to product safety and sustainability goals in general. Lack of transparency compared to other companies with lower reporting of key performance indicators. Has received a number of significant fines for violations related to water, air and land emissions. Above average GHG emissions and above average waste production. Greenpeace, not my favourite organization, does have a campaign against P&amp;G for their sourcing of palm oil, despite the fact that company has made some (although not as substantial) commitments to sustainable sourcing. A number of product safety complaints against P&amp;G have emerged recently – some amount of lead was found in CoverGirl lipsticks but the FDA claims that the levels are low and not significant to human health.</p>\n\n<p><strong>Estee Lauder:</strong></p>\n\n<p><em>Ownership:</em> Mac, Tom Ford, Bobbi Brown, Clinique, Bumble and Bumble, Origins</p>\n\n<p><em>Environmental and social commitments/initiatives:</em> <a href=\"http://www.elcompanies.com/PdfLibrary/2012%20ELC%20CR%20Report%20-%20The%20Beauty%20of%20Responsibility.pdf\">http://www.elcompanies.com/PdfLibrary/2012%20ELC%20CR%20Report%20-%20The%20Beauty%20of%20Responsibility.pdf</a></p>\n\n<p><em>Cruelty free?</em> No commitments but the company has stated that no tests have been performed on products release to the US.</p>\n\n<p><strong><em>Overall impression:</em></strong> <strong>B, average</strong></p>\n\n<p>The company does not perform well on sustainable sourcing of products, specifically palm oil. However, it does lead in product safety. The company puts a strong emphasis on reducing waste and emissions in operations, and I am personally a fan of MACs recycling program (you can really see this waste-reduction initiative as a consumer). However, this is where subjectivity comes into play. Estee Lauder is the brand famous for being engaged in the breast cancer awareness “industry,” one that I am personally not a fan of and which I feel they take advantage of for their own personal gain above all else. </p>\n\n<p><strong>Revlon:</strong> </p>\n\n<p><em>Ownership:</em> Revlon and Almay</p>\n\n<p><em>Environmental and social commitments/initiatives:</em> <a href=\"http://www.revlon.com/Home/Revlon-Home/Revlon-Corporate/Revlon-Care-Landing.aspx\">http://www.revlon.com/Home/Revlon-Home/Revlon-Corporate/Revlon-Care-Landing.aspx</a></p>\n\n<p><em>Cruelty free?</em> Another brand that is difficult to classify. They have made cruelty free commitments in the past, but do sell product in China and as a result, these are tested on animals. </p>\n\n<p><strong><em>Overall impression:</em></strong> <strong>C, below average</strong></p>\n\n<p>Revlon was a really difficult company to find information on – they don’t seem to release a CSR report and while they claim to have some transparent supply chain activities, they don’t elaborate specifically on what these are. The company does not seem to have environmental initiatives to reduce their water, air or land impact and social programmes are difficult to identify. They rank at the very bottom in terms of efforts to reduce product risks and rely on “business as usual” in the area of product health and safety, rarely attempting reformulations that exclude potentially harmful ingredients. There are weak efforts to source sustainable palm oil.</p>\n\n<p><strong>LVMH Moet Hennessey Louis:</strong></p>\n\n<p><em>Ownership:</em> Sephora, Guerlain, Givenchy, Dior, Fresh, Benefit, Make Up Forever (I had no idea these were all owned by the same group by the way…)</p>\n\n<p><em>Environmental and social commitments/initiatives:</em>\nGuerlain - <a href=\"http://www.guerlain.com/int/en-int/our-commitment\">http://www.guerlain.com/int/en-int/our-commitment</a>\nLVMH Group - <a href=\"http://www.lvmh.com/the-group/lvmh-and-the-environment\">http://www.lvmh.com/the-group/lvmh-and-the-environment</a></p>\n\n<p><em>Cruelty-free:</em> Unsure.</p>\n\n<p><strong><em>Overall impression:</em></strong> <strong>C, below average</strong></p>\n\n<p>Like P&amp;G, this brand owner is not primarily a cosmetics brand, so interpret these results as a broader look at the group. LVMH as a group has strong environmental policies and does make a number of significant commitments to reduce air and land impacts. Environmental policies are set by specific brands – the only brand for which I could find some policies was Guerlain. Recently, 40% of its cosmetics units participated in a carbon footprint assessment. Given the companies huge role in the cosmetics industry as a result of its ownership of Sephora, I was disappointed to find little from Sephora on the company’s environmental policies and supply chain buying practices. It was pretty difficult to find any information on this group – they don’t seem to have released a sustainability report since 2011.</p>\n\n<hr/>\n\n<p>I apologize for the horrible wall of text, got a bit overzealous with research. I would especially love to hear everyone&#39;s thoughts on whether they try to buy &quot;eco-friendly&quot; products and how they feel about &quot;green&quot; cosmetics. What issues are most important to you?</p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "_comment_sort": null,
  "report_reasons": null,
  "name": "t3_2c9rnn",
  "from": null,
  "hidden": false,
  "clicked": false,
  "media": null,
  "json_dict": null,
  "_api_link": "https://api.reddit.com/r/MakeupAddicts/comments/2c9rnn/discussion_which_brands_are_the_most_ecofriendly/?ref=search_posts",
  "secure_media_embed": {},
  "mod_reports": [],
  "_orphaned": {},
  "_uniq": null,
  "num_comments": 22,
  "link_flair_text": null,
  "title": "[Discussion] Which brands are the most \"eco-friendly\"? And what does that even mean?",
  "_has_fetched": true,
  "author_flair_css_class": null,
  "thumbnail": "self"
}