{
  "selftext": "*$1.2 Billion\n\n\nFrom the [Wikipedia page](https://en.wikipedia.org/wiki/Berkshire_Hathaway#Manufacturing.2C_service_and_retailing):\n\n\nManufacturing, service and retailing\nClothing\n\nBerkshire’s clothing businesses include manufacturers and distributors of a variety of clothing and footwear. Businesses engaged in the manufacture and distribution of clothing include Union Underwear Corp. – Fruit of the Loom, Garan, Fechheimer Brothers and Russell Corporation. Berkshire’s footwear businesses include H.H. Brown Shoe Group, Acme Boots, Brooks Sports and Justin Brands. Justin Brands is made up of Chippewa Boots, Justin Boots, Justin Original Workboots, Nocona Boots, and Tony Lama Boots.[36] Berkshire acquired Fruit of the Loom on April 29, 2002 for $835 million in cash. Fruit of the Loom, headquartered in Bowling Green, Kentucky, is a vertically integrated manufacturer of basic clothing. Berkshire acquired Russell Corporation on August 2, 2006 for $600 million or $18.00 per share.\nBuilding products\n\nIn August 2000, Berkshire entered the building products business with the acquisition of Acme Building Brands. Acme, headquartered in Fort Worth, Texas, manufactures and distributes clay bricks (Acme Brick), concrete block (Featherlite) and cut limestone (Texas Quarries). It expanded its building products business in December 2000, when it acquired Benjamin Moore & Co. of Montvale, New Jersey. Moore formulates, manufactures and sells architectural coatings that are available primarily in the United States and Canada.\n\nIn 2001, Berkshire acquired three additional building products companies. In February, it purchased Johns Manville which was established in 1858 and manufactures fiber glass wool insulation products for homes and commercial buildings, as well as pipe, duct and equipment insulation products. In July, Berkshire acquired a 90% equity interest in MiTek Inc., which makes engineered connector products, engineering software and services, and manufacturing machinery for the truss fabrication segment of the building components industry and is headquartered in Chesterfield, Missouri.[37] Finally in 2001, Berkshire acquired 87 percent of Dalton, Georgia-based Shaw Industries, Inc.[38] Shaw is the world’s largest carpet manufacturer based on both revenue and volume of production and designs and manufactures over 3,000 styles of tufted and woven carpet and laminate flooring for residential and commercial use under approximately 30 brand and trade names and under certain private labels. In 2002, Berkshire Acquired the remaining 12.7 percent of Shaw.[39]\n\nOn August 7, 2003, Berkshire acquired Clayton Homes, Inc. Clayton, headquartered near Knoxville, Tennessee, is a vertically integrated manufactured housing company. At year-end 2004, Clayton operated 32 manufacturing plants in 12 states. Clayton’s homes are marketed in 48 states through a network of 1,540 retailers, 391 of which are company-owned sales centers. On May 1, 2008, Mitek acquired Hohmann & Barnard a fabricator of anchors and reinforcement systems for masonry and on October 3 of that year, Mitek acquired Blok-Lok, Ltd. of Toronto, Canada. On April 23, 2010, Mitek acquired the assets of Dur-O-Wal from Dayton Superior.\nFlight services\n\nIn 1996, Berkshire acquired FlightSafety International Inc. FSI’s corporate headquarters is located at LaGuardia Airport in Flushing, New York. FSI engages primarily in the business of providing high technology training to operators of aircraft and ships. FlightSafety is the world's leading provider of professional aviation training services. Berkshire acquired NetJets Inc. in 1998. NetJets is the world’s leading provider of fractional ownership programs for general aviation aircraft. In 1986, NetJets created the fractional ownership of aircraft concept and introduced its NetJets program in the United States with one aircraft type. In 2004, the NetJets program operated 15 aircraft types.\nRetail\n\nThe home furnishings businesses are the Nebraska Furniture Mart, RC Willey Home Furnishings, Star Furniture Company, and Jordan’s Furniture, Inc. CORT Business Services Corporation was acquired in 2000 by an 80.1% owned subsidiary of Berkshire and is the leading national provider of rental furniture, accessories and related services in the “rent-to-rent” segment of the furniture rental industry.\n\nIn May 2000, Berkshire purchased Ben Bridge Jewelers. A chain of jewellery stores established in 1912 with locations primarily in the western United States.[40] This joined Berkshire's other jeweler acquisition, Helzberg Diamonds. Helzberg is a chain of jewelry stores based in Kansas City that began in 1915 and became part of Berkshire in 1995.[41]\n\nIn 2002, Berkshire acquired The Pampered Chef, Ltd., the largest direct seller of kitchen tools in the United States. Products are researched, designed and tested by The Pampered Chef, and manufactured by third party suppliers. From its Addison, Illinois headquarters, The Pampered Chef utilizes a network of more than 65,000 independent sales representatives to sell its products through home-based party demonstrations, principally in the United States.\n\nSee's Candies produces boxed chocolates and other confectionery products in two large kitchens in California. See’s revenues are highly seasonal with approximately 50% of total annual revenues being earned in the months of November and December.\n\nDairy Queen, based in Edina, Minnesota, services a system of approximately 6,000 stores operating under the names Dairy Queen, Orange Julius and Karmelkorn that offer various dairy desserts, beverages, prepared foods, blended fruit drinks, popcorn and other snack foods.\n\nIn November 2012, Berkshire announced they would acquire the Oriental Trading Company, a direct marketing company for novelty items, small toys, and party items.[42][43]\nMedia\n\nIn 1977, Berkshire Hathaway purchased the Buffalo Evening News and resumed publication of a Sunday edition of the paper that ceased in 1914. After the morning newspaper Buffalo Courier-Express ceased operation in 1982, the paper began to print morning and evening editions, currently printing only a morning edition.[44] In 2006, the company bought Business Wire, a U.S. press release agency.\n\nThe company began its BH Media Group subsidiary with a purchase of the Omaha World-Herald in December 2011,[45] which included six other daily newspapers and several weeklies across Nebraska and southwest Iowa.[46] In June 2012, Berkshire purchased 63 newspapers from Media General Inc., including the Richmond Times-Dispatch and Winston-Salem Journal, for $142 million in cash.[47]\n\nIn 2012, Berkshire bought Texas dailies The Eagle in Bryan-College Station and the Waco Tribune-Herald.[48] In 2013, the company purchased the Tulsa World, the Greensboro, North Carolina-based News & Record, Virginia's Roanoke Times, and Press of Atlantic City. As of March 2013, BH Media owned 28 daily and 42 non-daily newspapers.[49]\n\nOn March 12, 2014, it was announced that Graham Holdings Company would divest its Miami television station WPLG to BH Media in a cash and stock deal.[50]\nOther non-insurance\n\nMidAmerican Energy Holdings Company's HomeServices of America is a residential real estate brokerage firm based in Minneapolis, Minnesota and founded in 1998. HomeServices has operations in 19 states and over 21,000 sales associates. In addition to brokerage services, these real estate companies provide mortgage loan originations, title and closing services, home warranties, property and casualty insurance and other related services. By the end of 2013 Berkshire Hathaway will enter the residential real estate brokerage sector under the name of HomeServices of America.[51]\n\nIn 2002, Berkshire acquired Albecca Inc. Albecca is headquartered in Norcross, Georgia, and primarily does business under the Larson-Juhl name. Albecca designs, manufactures and distributes custom framing products, including wood and metal molding, matboard, foamboard, glass, equipment and other framing supplies. Berkshire acquired CTB International Corp. in 2002. CTB, headquartered in Milford, Indiana, is a designer, manufacturer and marketer of systems used in the grain industry and in the production of poultry, hogs, and eggs. Products are produced in the United States and Europe and are sold primarily through a global network of independent dealers and distributors, with peak sales occurring in the second and third quarters.\n\nBerkshire acquired McLane Company, Inc. in May 2003 from Walmart , which brought on other subsidiaries such as Professional Datasolutions, Inc. and Salado Sales, among others. McLane provides wholesale distribution and logistics services in all 50 states and internationally in Brazil to customers that include discount retailers, convenience stores, quick service restaurants, drug stores and movie theatre complexes. Scott Fetzer Companies–The Scott Fetzer Companies are a diversified group of 21 businesses that manufacture and distribute a wide variety of products for residential, industrial and institutional use. The three most significant of these businesses are Kirby home cleaning systems, Wayne Water Systems and Campbell Hausfeld products. Scott Fetzer also manufactures Ginsu knives.\n\nOn March 30, 2007, Berkshire Hathaway announced TTI, Inc. to be part of the Berkshire Hathaway Group. Headquartered in Fort Worth, Texas, TTI, Inc. is the largest distributor specialist of passive, interconnect and electromechanical components. TTI’s extensive product line includes: resistors, capacitors, connectors, potentiometers, trimmers, magnetic and circuit protection components, wire and cable, identification products, application tools and electromechanical devices.\n\nOn December 25, 2007, Berkshire Hathaway acquired Marmon Group. Previously it was a privately held conglomerate owned by the Pritzker family for over fifty years, which owned and operated an assortment of manufacturing companies that produce railroad tank cars, shopping carts, plumbing pipes, metal fasteners, wiring and water treatment products used in residential construction.[52]\n\nOn November 14, 2014, Berkshire Hathaway announced that it would acquire Duracell from Procter & Gamble for $4.7 billion in an all-stock deal.[53]\nFinance and financial products\n\nBerkshire acquired Clayton Homes a maker of modular homes, storage trailers, chassis, intermodal piggyback trailers and domestic containers.\n\nClayton's finance business, (loans to manufactured home owners), earned $206 million down from $526 million in 2007. Loan losses remain 3.6% up from 2.9%.[54]\nInvestments\nEquities – beneficial ownership\n\nBerkshire's fifteen largest stock investments by market value, as reported in the 2014 annual report [55] are, in alphabetical order:\n\n    American Express Co. (14.8%)\n    The Coca-Cola Company (9.2%)\n    DaVita (8.6%)\n    John Deere (4.5%)\n    DIRECTV (4.9%)\n    Goldman Sachs (3.0%)\n    IBM (7.8%)\n    Moody's Corporation, owner of Moody's Analytics (12.1%)\n    Munich Re (11.8%)\n    The Procter & Gamble Company (1.9%)\n    Sanofi (1.7%)\n    U.S. Bancorp (5.4%)\n    USG Corporation (30.0%)\n    Wal-Mart (2.1%)\n    Wells Fargo (9.4%)\n\n",
  "gilded": 0,
  "score": 0,
  "removal_reason": null,
  "approved_by": null,
  "created_utc": 1437164327.0,
  "is_self": true,
  "stickied": false,
  "edited": 1437163792.0,
  "distinguished": null,
  "permalink": "https://www.reddit.com/r/Catholicism/comments/3dno7p/warren_buffett_donates_12_to_planned_parenthood/?ref=search_posts",
  "banned_by": null,
  "from_id": null,
  "likes": null,
  "_underscore_names": null,
  "num_reports": null,
  "link_flair_css_class": null,
  "_info_url": "https://api.reddit.com/api/info/",
  "id": "3dno7p",
  "archived": false,
  "secure_media": null,
  "post_hint": "self",
  "from_kind": null,
  "saved": false,
  "domain": "self.Catholicism",
  "ups": 0,
  "suggested_sort": null,
  "quarantine": false,
  "over_18": false,
  "hide_score": false,
  "url": "https://www.reddit.com/r/Catholicism/comments/3dno7p/warren_buffett_donates_12_to_planned_parenthood/",
  "subreddit_id": "t5_2qi4f",
  "_params": {},
  "_comments": null,
  "preview": {
    "images": [
      {
        "source": {
          "width": 220,
          "url": "https://i.redditmedia.com/qd6wr5rYIssBUAFOsAj1VPMISqHbJhFCrb9NGp2G-0Q.jpg?s=57c8525e3c99c0a94cbbaaddd8cf1268",
          "height": 326
        },
        "resolutions": [
          {
            "width": 108,
            "url": "https://i.redditmedia.com/qd6wr5rYIssBUAFOsAj1VPMISqHbJhFCrb9NGp2G-0Q.jpg?fit=crop&crop=faces%2Centropy&arh=2&w=108&s=4a2e6ef6e589a9e7c2e6b94166021430",
            "height": 160
          },
          {
            "width": 216,
            "url": "https://i.redditmedia.com/qd6wr5rYIssBUAFOsAj1VPMISqHbJhFCrb9NGp2G-0Q.jpg?fit=crop&crop=faces%2Centropy&arh=2&w=216&s=bbdbc5e490f7c53abb9eb3a081ab96d0",
            "height": 320
          }
        ],
        "id": "ya16KEzIMp21314_lFfoWodtxBHbKLfhgKcxdwvI_cA",
        "variants": {}
      }
    ]
  },
  "_replaced_more": false,
  "_comments_by_id": {},
  "user_reports": [],
  "media_embed": {},
  "created": 1437164327.0,
  "author_flair_text": null,
  "visited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>*$1.2 Billion</p>\n\n<p>From the <a href=\"https://en.wikipedia.org/wiki/Berkshire_Hathaway#Manufacturing.2C_service_and_retailing\">Wikipedia page</a>:</p>\n\n<p>Manufacturing, service and retailing\nClothing</p>\n\n<p>Berkshire’s clothing businesses include manufacturers and distributors of a variety of clothing and footwear. Businesses engaged in the manufacture and distribution of clothing include Union Underwear Corp. – Fruit of the Loom, Garan, Fechheimer Brothers and Russell Corporation. Berkshire’s footwear businesses include H.H. Brown Shoe Group, Acme Boots, Brooks Sports and Justin Brands. Justin Brands is made up of Chippewa Boots, Justin Boots, Justin Original Workboots, Nocona Boots, and Tony Lama Boots.[36] Berkshire acquired Fruit of the Loom on April 29, 2002 for $835 million in cash. Fruit of the Loom, headquartered in Bowling Green, Kentucky, is a vertically integrated manufacturer of basic clothing. Berkshire acquired Russell Corporation on August 2, 2006 for $600 million or $18.00 per share.\nBuilding products</p>\n\n<p>In August 2000, Berkshire entered the building products business with the acquisition of Acme Building Brands. Acme, headquartered in Fort Worth, Texas, manufactures and distributes clay bricks (Acme Brick), concrete block (Featherlite) and cut limestone (Texas Quarries). It expanded its building products business in December 2000, when it acquired Benjamin Moore &amp; Co. of Montvale, New Jersey. Moore formulates, manufactures and sells architectural coatings that are available primarily in the United States and Canada.</p>\n\n<p>In 2001, Berkshire acquired three additional building products companies. In February, it purchased Johns Manville which was established in 1858 and manufactures fiber glass wool insulation products for homes and commercial buildings, as well as pipe, duct and equipment insulation products. In July, Berkshire acquired a 90% equity interest in MiTek Inc., which makes engineered connector products, engineering software and services, and manufacturing machinery for the truss fabrication segment of the building components industry and is headquartered in Chesterfield, Missouri.[37] Finally in 2001, Berkshire acquired 87 percent of Dalton, Georgia-based Shaw Industries, Inc.[38] Shaw is the world’s largest carpet manufacturer based on both revenue and volume of production and designs and manufactures over 3,000 styles of tufted and woven carpet and laminate flooring for residential and commercial use under approximately 30 brand and trade names and under certain private labels. In 2002, Berkshire Acquired the remaining 12.7 percent of Shaw.[39]</p>\n\n<p>On August 7, 2003, Berkshire acquired Clayton Homes, Inc. Clayton, headquartered near Knoxville, Tennessee, is a vertically integrated manufactured housing company. At year-end 2004, Clayton operated 32 manufacturing plants in 12 states. Clayton’s homes are marketed in 48 states through a network of 1,540 retailers, 391 of which are company-owned sales centers. On May 1, 2008, Mitek acquired Hohmann &amp; Barnard a fabricator of anchors and reinforcement systems for masonry and on October 3 of that year, Mitek acquired Blok-Lok, Ltd. of Toronto, Canada. On April 23, 2010, Mitek acquired the assets of Dur-O-Wal from Dayton Superior.\nFlight services</p>\n\n<p>In 1996, Berkshire acquired FlightSafety International Inc. FSI’s corporate headquarters is located at LaGuardia Airport in Flushing, New York. FSI engages primarily in the business of providing high technology training to operators of aircraft and ships. FlightSafety is the world&#39;s leading provider of professional aviation training services. Berkshire acquired NetJets Inc. in 1998. NetJets is the world’s leading provider of fractional ownership programs for general aviation aircraft. In 1986, NetJets created the fractional ownership of aircraft concept and introduced its NetJets program in the United States with one aircraft type. In 2004, the NetJets program operated 15 aircraft types.\nRetail</p>\n\n<p>The home furnishings businesses are the Nebraska Furniture Mart, RC Willey Home Furnishings, Star Furniture Company, and Jordan’s Furniture, Inc. CORT Business Services Corporation was acquired in 2000 by an 80.1% owned subsidiary of Berkshire and is the leading national provider of rental furniture, accessories and related services in the “rent-to-rent” segment of the furniture rental industry.</p>\n\n<p>In May 2000, Berkshire purchased Ben Bridge Jewelers. A chain of jewellery stores established in 1912 with locations primarily in the western United States.[40] This joined Berkshire&#39;s other jeweler acquisition, Helzberg Diamonds. Helzberg is a chain of jewelry stores based in Kansas City that began in 1915 and became part of Berkshire in 1995.[41]</p>\n\n<p>In 2002, Berkshire acquired The Pampered Chef, Ltd., the largest direct seller of kitchen tools in the United States. Products are researched, designed and tested by The Pampered Chef, and manufactured by third party suppliers. From its Addison, Illinois headquarters, The Pampered Chef utilizes a network of more than 65,000 independent sales representatives to sell its products through home-based party demonstrations, principally in the United States.</p>\n\n<p>See&#39;s Candies produces boxed chocolates and other confectionery products in two large kitchens in California. See’s revenues are highly seasonal with approximately 50% of total annual revenues being earned in the months of November and December.</p>\n\n<p>Dairy Queen, based in Edina, Minnesota, services a system of approximately 6,000 stores operating under the names Dairy Queen, Orange Julius and Karmelkorn that offer various dairy desserts, beverages, prepared foods, blended fruit drinks, popcorn and other snack foods.</p>\n\n<p>In November 2012, Berkshire announced they would acquire the Oriental Trading Company, a direct marketing company for novelty items, small toys, and party items.[42][43]\nMedia</p>\n\n<p>In 1977, Berkshire Hathaway purchased the Buffalo Evening News and resumed publication of a Sunday edition of the paper that ceased in 1914. After the morning newspaper Buffalo Courier-Express ceased operation in 1982, the paper began to print morning and evening editions, currently printing only a morning edition.[44] In 2006, the company bought Business Wire, a U.S. press release agency.</p>\n\n<p>The company began its BH Media Group subsidiary with a purchase of the Omaha World-Herald in December 2011,[45] which included six other daily newspapers and several weeklies across Nebraska and southwest Iowa.[46] In June 2012, Berkshire purchased 63 newspapers from Media General Inc., including the Richmond Times-Dispatch and Winston-Salem Journal, for $142 million in cash.[47]</p>\n\n<p>In 2012, Berkshire bought Texas dailies The Eagle in Bryan-College Station and the Waco Tribune-Herald.[48] In 2013, the company purchased the Tulsa World, the Greensboro, North Carolina-based News &amp; Record, Virginia&#39;s Roanoke Times, and Press of Atlantic City. As of March 2013, BH Media owned 28 daily and 42 non-daily newspapers.[49]</p>\n\n<p>On March 12, 2014, it was announced that Graham Holdings Company would divest its Miami television station WPLG to BH Media in a cash and stock deal.[50]\nOther non-insurance</p>\n\n<p>MidAmerican Energy Holdings Company&#39;s HomeServices of America is a residential real estate brokerage firm based in Minneapolis, Minnesota and founded in 1998. HomeServices has operations in 19 states and over 21,000 sales associates. In addition to brokerage services, these real estate companies provide mortgage loan originations, title and closing services, home warranties, property and casualty insurance and other related services. By the end of 2013 Berkshire Hathaway will enter the residential real estate brokerage sector under the name of HomeServices of America.[51]</p>\n\n<p>In 2002, Berkshire acquired Albecca Inc. Albecca is headquartered in Norcross, Georgia, and primarily does business under the Larson-Juhl name. Albecca designs, manufactures and distributes custom framing products, including wood and metal molding, matboard, foamboard, glass, equipment and other framing supplies. Berkshire acquired CTB International Corp. in 2002. CTB, headquartered in Milford, Indiana, is a designer, manufacturer and marketer of systems used in the grain industry and in the production of poultry, hogs, and eggs. Products are produced in the United States and Europe and are sold primarily through a global network of independent dealers and distributors, with peak sales occurring in the second and third quarters.</p>\n\n<p>Berkshire acquired McLane Company, Inc. in May 2003 from Walmart , which brought on other subsidiaries such as Professional Datasolutions, Inc. and Salado Sales, among others. McLane provides wholesale distribution and logistics services in all 50 states and internationally in Brazil to customers that include discount retailers, convenience stores, quick service restaurants, drug stores and movie theatre complexes. Scott Fetzer Companies–The Scott Fetzer Companies are a diversified group of 21 businesses that manufacture and distribute a wide variety of products for residential, industrial and institutional use. The three most significant of these businesses are Kirby home cleaning systems, Wayne Water Systems and Campbell Hausfeld products. Scott Fetzer also manufactures Ginsu knives.</p>\n\n<p>On March 30, 2007, Berkshire Hathaway announced TTI, Inc. to be part of the Berkshire Hathaway Group. Headquartered in Fort Worth, Texas, TTI, Inc. is the largest distributor specialist of passive, interconnect and electromechanical components. TTI’s extensive product line includes: resistors, capacitors, connectors, potentiometers, trimmers, magnetic and circuit protection components, wire and cable, identification products, application tools and electromechanical devices.</p>\n\n<p>On December 25, 2007, Berkshire Hathaway acquired Marmon Group. Previously it was a privately held conglomerate owned by the Pritzker family for over fifty years, which owned and operated an assortment of manufacturing companies that produce railroad tank cars, shopping carts, plumbing pipes, metal fasteners, wiring and water treatment products used in residential construction.[52]</p>\n\n<p>On November 14, 2014, Berkshire Hathaway announced that it would acquire Duracell from Procter &amp; Gamble for $4.7 billion in an all-stock deal.[53]\nFinance and financial products</p>\n\n<p>Berkshire acquired Clayton Homes a maker of modular homes, storage trailers, chassis, intermodal piggyback trailers and domestic containers.</p>\n\n<p>Clayton&#39;s finance business, (loans to manufactured home owners), earned $206 million down from $526 million in 2007. Loan losses remain 3.6% up from 2.9%.[54]\nInvestments\nEquities – beneficial ownership</p>\n\n<p>Berkshire&#39;s fifteen largest stock investments by market value, as reported in the 2014 annual report [55] are, in alphabetical order:</p>\n\n<pre><code>American Express Co. (14.8%)\nThe Coca-Cola Company (9.2%)\nDaVita (8.6%)\nJohn Deere (4.5%)\nDIRECTV (4.9%)\nGoldman Sachs (3.0%)\nIBM (7.8%)\nMoody&#39;s Corporation, owner of Moody&#39;s Analytics (12.1%)\nMunich Re (11.8%)\nThe Procter &amp; Gamble Company (1.9%)\nSanofi (1.7%)\nU.S. Bancorp (5.4%)\nUSG Corporation (30.0%)\nWal-Mart (2.1%)\nWells Fargo (9.4%)\n</code></pre>\n</div><!-- SC_ON -->",
  "downs": 0,
  "_comment_sort": null,
  "report_reasons": null,
  "name": "t3_3dno7p",
  "from": null,
  "hidden": false,
  "clicked": false,
  "media": null,
  "json_dict": null,
  "_api_link": "https://api.reddit.com/r/Catholicism/comments/3dno7p/warren_buffett_donates_12_to_planned_parenthood/?ref=search_posts",
  "secure_media_embed": {},
  "mod_reports": [],
  "_orphaned": {},
  "_uniq": null,
  "num_comments": 21,
  "link_flair_text": null,
  "title": "Warren Buffett Donates $1.2 to Planned Parenthood Between 2001 - 2012 - Here is a list of all of the companies and brands his corporation, Berkshire Hathaway, owns in case you want to hit him in the wallet.",
  "_has_fetched": true,
  "author_flair_css_class": null,
  "thumbnail": "self"
}