{
  "clicked": false,
  "_replaced_more": false,
  "archived": false,
  "num_comments": 76,
  "created": 1441731698.0,
  "saved": false,
  "selftext": "I think by now almost everybody here knows that trip to Hutton terminal in Alpha Centauri takes some significant time, but I think it putting things in perspective makes it a bit easier to grasp the distnace. So I did some number crunching...\n\nWhen you get into system and lock Hutton as your destination, the panel will tell you it is **0.22 ly** away. Unless you're one of the handful people that use light years as means of measurement in their everyday life, this number will be pretty meaningless to you.\n\nHow much exactly is 0.22 light years?\n\n**0.22 light years** are **6 942 523.71 light seconds**. This is much more easier to relate to than light years in Elite Dangerous, as most in-system distances are in light seconds. Usually you don't go to any stations further than couple thousand light seconds if you're doing any efficient trading route.\n\nBut light seconds are still tough to grasp in everyday life. \n**0.22 light years** equate to **2 081 316 249 074 kilometers**. You would have to circle the Earth (equator) **52 032 906 times** in order to complete that distance! You would need to take roughly **373 263 316 flights** from London to New York or **5 414 412 trips** to Moon and back.\n\nIt's getting crazy.\n\nIf we were to put cars one in front of another from Nav beacon to Hutton, it would take amazing **41 626 324 981 400 cars** to do that. Thought Titanic was a big ship? Not in astronomical proportions. You could put **770 857 870 025 RMS Titanics'** and **2 851 118 149 410 Airbus A380s'** to cover that distance. Let's not limit ourselves just to real life examples. **1 369 287 005 967 Anacondas'** could fit into that distance. Getting the feeling of sizes' we're talking about here? Space is big and empty if you didn't get the feeling yet.\n\nWhat about the most troubling thing about this distance, the time it takes to get to Hutton terminal?\n\nIn-game, flying an average ship takes **75 minutes** to get from Nav beacon to Hutton. If you were flying at **1c**, the speed of light, it would take you **80 days** to complete the journey. If you were traveling at the same speed as lightning when it hits the ground, **1 600 000 km/h**, it would take you **5420 days or almost 15 years**. If you were on board Helios-2 solar probe, AKA the fastest man made object in existence, which travels at **252 800 km/h**, you probably wouldn't even make it to Hutton as it would take you **94 years** to complete the journey and your grandchildren would probably be the ones unloading scrap metal from your ship at the station. Pretty scary! \n\nMoving on with the times. If you were flying on-board Concorde supersonic passenger jet liner, topping at a bit over twice the speed of sound, your flight would be **9435 years** long. Let's hope that there are enough movies on-board to keep you entertained for the duration of flight. Scared of flying? Get on board of the fastest train on earth, the JR-Maglev, which at top speed of **580 km/h** will get you there in not time! Well, not exactly. **40 964 years** would be the duration of that train ride.  What if there was a highway all the way to Hutton? How long of a car ride would that be? If you were a law-obeying citizen driving at **120 km/h**, you'd have some **197 994 years** of traveling. Go for a reliable car I'd say. Or go for a bicycle, and cycle your way to Hutton in about **475 186 years**. And if you'd rather walk, better prepare yourself for exhausting **5 939 829 years** of walking. Then be grateful that you're not a sloth, whose top speed is around **0.30 km/h** and would take him **79 197 726 years** to do the distance. \n\nIn conclusion, those 75 minutes of in-game travel doesn't seem that bad now, doesn't it?\n\nHope this is interesting to some of you guys, I personally like to compare things like this to have a better understanding of things. :D  ",
  "mod_reports": [],
  "secure_media_embed": {},
  "author_flair_css_class": "cmdr img federation",
  "edited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I think by now almost everybody here knows that trip to Hutton terminal in Alpha Centauri takes some significant time, but I think it putting things in perspective makes it a bit easier to grasp the distnace. So I did some number crunching...</p>\n\n<p>When you get into system and lock Hutton as your destination, the panel will tell you it is <strong>0.22 ly</strong> away. Unless you&#39;re one of the handful people that use light years as means of measurement in their everyday life, this number will be pretty meaningless to you.</p>\n\n<p>How much exactly is 0.22 light years?</p>\n\n<p><strong>0.22 light years</strong> are <strong>6 942 523.71 light seconds</strong>. This is much more easier to relate to than light years in Elite Dangerous, as most in-system distances are in light seconds. Usually you don&#39;t go to any stations further than couple thousand light seconds if you&#39;re doing any efficient trading route.</p>\n\n<p>But light seconds are still tough to grasp in everyday life. \n<strong>0.22 light years</strong> equate to <strong>2 081 316 249 074 kilometers</strong>. You would have to circle the Earth (equator) <strong>52 032 906 times</strong> in order to complete that distance! You would need to take roughly <strong>373 263 316 flights</strong> from London to New York or <strong>5 414 412 trips</strong> to Moon and back.</p>\n\n<p>It&#39;s getting crazy.</p>\n\n<p>If we were to put cars one in front of another from Nav beacon to Hutton, it would take amazing <strong>41 626 324 981 400 cars</strong> to do that. Thought Titanic was a big ship? Not in astronomical proportions. You could put <strong>770 857 870 025 RMS Titanics&#39;</strong> and <strong>2 851 118 149 410 Airbus A380s&#39;</strong> to cover that distance. Let&#39;s not limit ourselves just to real life examples. <strong>1 369 287 005 967 Anacondas&#39;</strong> could fit into that distance. Getting the feeling of sizes&#39; we&#39;re talking about here? Space is big and empty if you didn&#39;t get the feeling yet.</p>\n\n<p>What about the most troubling thing about this distance, the time it takes to get to Hutton terminal?</p>\n\n<p>In-game, flying an average ship takes <strong>75 minutes</strong> to get from Nav beacon to Hutton. If you were flying at <strong>1c</strong>, the speed of light, it would take you <strong>80 days</strong> to complete the journey. If you were traveling at the same speed as lightning when it hits the ground, <strong>1 600 000 km/h</strong>, it would take you <strong>5420 days or almost 15 years</strong>. If you were on board Helios-2 solar probe, AKA the fastest man made object in existence, which travels at <strong>252 800 km/h</strong>, you probably wouldn&#39;t even make it to Hutton as it would take you <strong>94 years</strong> to complete the journey and your grandchildren would probably be the ones unloading scrap metal from your ship at the station. Pretty scary! </p>\n\n<p>Moving on with the times. If you were flying on-board Concorde supersonic passenger jet liner, topping at a bit over twice the speed of sound, your flight would be <strong>9435 years</strong> long. Let&#39;s hope that there are enough movies on-board to keep you entertained for the duration of flight. Scared of flying? Get on board of the fastest train on earth, the JR-Maglev, which at top speed of <strong>580 km/h</strong> will get you there in not time! Well, not exactly. <strong>40 964 years</strong> would be the duration of that train ride.  What if there was a highway all the way to Hutton? How long of a car ride would that be? If you were a law-obeying citizen driving at <strong>120 km/h</strong>, you&#39;d have some <strong>197 994 years</strong> of traveling. Go for a reliable car I&#39;d say. Or go for a bicycle, and cycle your way to Hutton in about <strong>475 186 years</strong>. And if you&#39;d rather walk, better prepare yourself for exhausting <strong>5 939 829 years</strong> of walking. Then be grateful that you&#39;re not a sloth, whose top speed is around <strong>0.30 km/h</strong> and would take him <strong>79 197 726 years</strong> to do the distance. </p>\n\n<p>In conclusion, those 75 minutes of in-game travel doesn&#39;t seem that bad now, doesn&#39;t it?</p>\n\n<p>Hope this is interesting to some of you guys, I personally like to compare things like this to have a better understanding of things. :D  </p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "user_reports": [],
  "author_flair_text": "DynoSaur",
  "over_18": false,
  "score": 158,
  "stickied": false,
  "domain": "self.EliteDangerous",
  "is_self": true,
  "hidden": false,
  "_orphaned": {},
  "_api_link": "https://api.reddit.com/r/EliteDangerous/comments/3k3w41/putting_distance_to_hutton_terminal_in_perspective/?ref=search_posts",
  "_comments_by_id": {},
  "visited": false,
  "thumbnail": "self",
  "_has_fetched": true,
  "gilded": 0,
  "hide_score": false,
  "_info_url": "https://api.reddit.com/api/info/",
  "created_utc": 1441728098.0,
  "subreddit_id": "t5_2vi60",
  "id": "3k3w41",
  "_params": {},
  "media_embed": {},
  "name": "t3_3k3w41",
  "quarantine": false,
  "permalink": "https://www.reddit.com/r/EliteDangerous/comments/3k3w41/putting_distance_to_hutton_terminal_in_perspective/?ref=search_posts",
  "ups": 158,
  "url": "https://www.reddit.com/r/EliteDangerous/comments/3k3w41/putting_distance_to_hutton_terminal_in_perspective/",
  "title": "Putting distance to Hutton terminal in perspective..."
}