{
  "clicked": false,
  "_replaced_more": false,
  "archived": true,
  "num_comments": 319,
  "created": 1388299822.0,
  "saved": false,
  "selftext": "Not everyone in the world has a mega-GPU backed PC, and odds are if you are reading this, you are someone who uses an iMac as your primary computer. You're growing through the dogecoin subreddit, so I take it you want to mine up some of these godly coins. Well... it's simple. I'm not going to go into the logistics of what dogecoins are, nor how the mining process works. I'm just here to get your feet wet.\n\nFirst off, go ahead and download a dogecoin wallet client from [here](http://dogecoin.com). Open this up as soon as you download it, because syncing with the network will probably take a couple hours.\n\n**iMacs / Mac Pros**\n\nFor those of you who have iMacs or Mac Pros, you've got the upper-hand when it comes to dogecoin mining. How? Your computer will likely run *much* cooler than notebooks. First off, let's start off with getting you a mining client. For the most part, command-line scripts are a thing of the past. Today, most users will desire the benefits of GUI based mining programs. I personally desire [Asteroid](http://www.asteroidapp.com). It's free, open-sourced, and **very** easy to use. Once you have done this, scroll on down to the section titled \"Mining in Pools.\"\n\n\n**MacBooks**\n\nIf you have a old white MacBook or a MacBook Air, you might want to just try buying dogecoins and hoping the market spikes. These devices simply don't have the processing power (whether it be in regards to CPU or GPU) to be worth the time. With that out of the way, it's time to start talking about cooling. Mining on a MacBook will simply generate more heat than using an iMac. As a precaution, I would recommend downloading and running [SMC Fan Control](https://www.macupdate.com/app/mac/23049/smcfancontrol). The program is nice because it is easy to use, you can monitor your internal temperature easily, and you can ensure your MacBook will be okay. With that said, it can be stated that your MacBook should not have a CPU-based meltdown. I'm not saying it can't happen, but it isn't very likely. So now that you have a temperature monitor installed, you can go ahead and download [Asteroid](http://www.asteroidapp.com). This program is going to be used to mine for your dogecoins. Once this is downloaded, don't run it yet. We still need to set up a pool. Continue to the following section.\n\n**Mining in Pools**\n\nMining in and of itself is an intensive process. For most it would take weeks, if not *years* to mine a block of dogecoin. So rather, networks have been created to solve this block in groups. The funds generated are then split amongst everybody in the pool, based on how much work they did. A more powerful CPU/GPU will result in more dogecoins. Across the internet, there are hundreds of pools. Over in the sidebar, there is a small list of pools you can join. Simply sign up, and you're pretty much done.\n\n**Setting up your worker(s)**\n\nNow that you've joined a pool, it's time to start mining! However, you can't do it just yet. What's left to do is relay the information from your mining client to your mining pool. Go ahead and open Asteroid (since that is what I am using for my example) and click on the drop-down menu that says \"Edit Pool.\" Click *Other* or *Edit Pool*, whichever vernacular is used in the client. Go ahead and give it a name, I simply called my doge. Then be sure to the coin type to litecoin (scrypt). **Do not use bit coin (SHA-256)! You will not be able to mine for dogecoins.** Dogecoin pools are pretty nice, because for the most part, they all use MPOS, a simply pool interface. On the left sidebar, you will find a link that says [Getting Started](http://i.imgur.com/BzXn7Ja.png). The page it links to will have the mining pool server information. Simply copy the STRATUM settings and port to their respective input boxes in your mining platform. the format will be stratum+tcp://**website.something**:**port**      [Example](http://i.imgur.com/zkmEr8R.png).\n\nWith that done, it's time to designate workers through your mining pool. Go ahead and click on [My Workers](http://i.imgur.com/ug432KE.png)  to set up a relay. Go ahead and fill out the input box for a new account and password. Once submitted, you have successfully generated a worker! Congratulations, you're almost done!\n*I tend to make my worker username that computer I am using to mine iMac/MacBook Pro. Whatever you choose. Make the password something easy you can remember.*\n\nNow it's time to enter your worker information. The worker username your mining client will be asking for will follow the format of websiteUsername.workerName and your password will be the password provided recently. [Example](http://i.imgur.com/FwYRder.png).\n\nClick accept, and you should be done!\nAssuming the client does not start immediately (you will see when it starts), click the [play/pause](http://i.imgur.com/0A5i7vu.png) button on the empty bar. Wait five minutes, and if the client is not mining for coins, please drop a reply here. I will gladly assist you with any issues that arise. \n\nIf you are successfully mining, congratulations! I'm sure you're going to want to collect the funds your computer generated! This is done via the mining pool. Click \"my account\" on the pool's website, and pasting your payment address in the box provided. Some sites require that you reach a certain minimum before payout occurs. If this is so, set the value to the lowest available setting. \n\n**Increase Mining**\nIf you have a powerful computer, you can go ahead and boost up the intensity of your mining platform. What this does is increase the processing power dedicated to mining. Note: increasing intensity may lag out your computer to the point you need to do a hard-reboot. Gradually step up your intensity. [Example](http://i.imgur.com/ICWxP18.png).\n\nI hope this guide was simple for you to follow, and helpful to get you mining dogecoins. \n\nI put a lot of work into making this tutorial. If you wish to, I gladly accept donations at **DRQbixjs3KCh6eboUrTcWGNv5FCmc2zE1G**\n\nIf you feel anything should be added, I would love it if you sent me a quick PM explaining your concern. ",
  "mod_reports": [],
  "secure_media_embed": {},
  "author_flair_css_class": "pineapple",
  "edited": 1392853785.0,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Not everyone in the world has a mega-GPU backed PC, and odds are if you are reading this, you are someone who uses an iMac as your primary computer. You&#39;re growing through the dogecoin subreddit, so I take it you want to mine up some of these godly coins. Well... it&#39;s simple. I&#39;m not going to go into the logistics of what dogecoins are, nor how the mining process works. I&#39;m just here to get your feet wet.</p>\n\n<p>First off, go ahead and download a dogecoin wallet client from <a href=\"http://dogecoin.com\">here</a>. Open this up as soon as you download it, because syncing with the network will probably take a couple hours.</p>\n\n<p><strong>iMacs / Mac Pros</strong></p>\n\n<p>For those of you who have iMacs or Mac Pros, you&#39;ve got the upper-hand when it comes to dogecoin mining. How? Your computer will likely run <em>much</em> cooler than notebooks. First off, let&#39;s start off with getting you a mining client. For the most part, command-line scripts are a thing of the past. Today, most users will desire the benefits of GUI based mining programs. I personally desire <a href=\"http://www.asteroidapp.com\">Asteroid</a>. It&#39;s free, open-sourced, and <strong>very</strong> easy to use. Once you have done this, scroll on down to the section titled &quot;Mining in Pools.&quot;</p>\n\n<p><strong>MacBooks</strong></p>\n\n<p>If you have a old white MacBook or a MacBook Air, you might want to just try buying dogecoins and hoping the market spikes. These devices simply don&#39;t have the processing power (whether it be in regards to CPU or GPU) to be worth the time. With that out of the way, it&#39;s time to start talking about cooling. Mining on a MacBook will simply generate more heat than using an iMac. As a precaution, I would recommend downloading and running <a href=\"https://www.macupdate.com/app/mac/23049/smcfancontrol\">SMC Fan Control</a>. The program is nice because it is easy to use, you can monitor your internal temperature easily, and you can ensure your MacBook will be okay. With that said, it can be stated that your MacBook should not have a CPU-based meltdown. I&#39;m not saying it can&#39;t happen, but it isn&#39;t very likely. So now that you have a temperature monitor installed, you can go ahead and download <a href=\"http://www.asteroidapp.com\">Asteroid</a>. This program is going to be used to mine for your dogecoins. Once this is downloaded, don&#39;t run it yet. We still need to set up a pool. Continue to the following section.</p>\n\n<p><strong>Mining in Pools</strong></p>\n\n<p>Mining in and of itself is an intensive process. For most it would take weeks, if not <em>years</em> to mine a block of dogecoin. So rather, networks have been created to solve this block in groups. The funds generated are then split amongst everybody in the pool, based on how much work they did. A more powerful CPU/GPU will result in more dogecoins. Across the internet, there are hundreds of pools. Over in the sidebar, there is a small list of pools you can join. Simply sign up, and you&#39;re pretty much done.</p>\n\n<p><strong>Setting up your worker(s)</strong></p>\n\n<p>Now that you&#39;ve joined a pool, it&#39;s time to start mining! However, you can&#39;t do it just yet. What&#39;s left to do is relay the information from your mining client to your mining pool. Go ahead and open Asteroid (since that is what I am using for my example) and click on the drop-down menu that says &quot;Edit Pool.&quot; Click <em>Other</em> or <em>Edit Pool</em>, whichever vernacular is used in the client. Go ahead and give it a name, I simply called my doge. Then be sure to the coin type to litecoin (scrypt). <strong>Do not use bit coin (SHA-256)! You will not be able to mine for dogecoins.</strong> Dogecoin pools are pretty nice, because for the most part, they all use MPOS, a simply pool interface. On the left sidebar, you will find a link that says <a href=\"http://i.imgur.com/BzXn7Ja.png\">Getting Started</a>. The page it links to will have the mining pool server information. Simply copy the STRATUM settings and port to their respective input boxes in your mining platform. the format will be stratum+tcp://<strong>website.something</strong>:<strong>port</strong>      <a href=\"http://i.imgur.com/zkmEr8R.png\">Example</a>.</p>\n\n<p>With that done, it&#39;s time to designate workers through your mining pool. Go ahead and click on <a href=\"http://i.imgur.com/ug432KE.png\">My Workers</a>  to set up a relay. Go ahead and fill out the input box for a new account and password. Once submitted, you have successfully generated a worker! Congratulations, you&#39;re almost done!\n<em>I tend to make my worker username that computer I am using to mine iMac/MacBook Pro. Whatever you choose. Make the password something easy you can remember.</em></p>\n\n<p>Now it&#39;s time to enter your worker information. The worker username your mining client will be asking for will follow the format of websiteUsername.workerName and your password will be the password provided recently. <a href=\"http://i.imgur.com/FwYRder.png\">Example</a>.</p>\n\n<p>Click accept, and you should be done!\nAssuming the client does not start immediately (you will see when it starts), click the <a href=\"http://i.imgur.com/0A5i7vu.png\">play/pause</a> button on the empty bar. Wait five minutes, and if the client is not mining for coins, please drop a reply here. I will gladly assist you with any issues that arise. </p>\n\n<p>If you are successfully mining, congratulations! I&#39;m sure you&#39;re going to want to collect the funds your computer generated! This is done via the mining pool. Click &quot;my account&quot; on the pool&#39;s website, and pasting your payment address in the box provided. Some sites require that you reach a certain minimum before payout occurs. If this is so, set the value to the lowest available setting. </p>\n\n<p><strong>Increase Mining</strong>\nIf you have a powerful computer, you can go ahead and boost up the intensity of your mining platform. What this does is increase the processing power dedicated to mining. Note: increasing intensity may lag out your computer to the point you need to do a hard-reboot. Gradually step up your intensity. <a href=\"http://i.imgur.com/ICWxP18.png\">Example</a>.</p>\n\n<p>I hope this guide was simple for you to follow, and helpful to get you mining dogecoins. </p>\n\n<p>I put a lot of work into making this tutorial. If you wish to, I gladly accept donations at <strong>DRQbixjs3KCh6eboUrTcWGNv5FCmc2zE1G</strong></p>\n\n<p>If you feel anything should be added, I would love it if you sent me a quick PM explaining your concern. </p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "user_reports": [],
  "author_flair_text": "pineapple shibe",
  "over_18": false,
  "score": 151,
  "stickied": false,
  "domain": "self.dogecoin",
  "is_self": true,
  "hidden": false,
  "_orphaned": {},
  "_api_link": "https://api.reddit.com/r/dogecoin/comments/1txgdi/so_you_want_to_start_mining_dogecoins_on_a_mac_eh/?ref=search_posts",
  "_comments_by_id": {},
  "visited": false,
  "thumbnail": "self",
  "_has_fetched": true,
  "gilded": 0,
  "hide_score": false,
  "_info_url": "https://api.reddit.com/api/info/",
  "created_utc": 1388296222.0,
  "subreddit_id": "t5_2zcp2",
  "id": "1txgdi",
  "_params": {},
  "media_embed": {},
  "name": "t3_1txgdi",
  "quarantine": false,
  "permalink": "https://www.reddit.com/r/dogecoin/comments/1txgdi/so_you_want_to_start_mining_dogecoins_on_a_mac_eh/?ref=search_posts",
  "ups": 151,
  "url": "https://www.reddit.com/r/dogecoin/comments/1txgdi/so_you_want_to_start_mining_dogecoins_on_a_mac_eh/",
  "title": "So... you want to start mining dogecoins on a Mac, eh? A simple how-to!"
}