{
  "clicked": false,
  "_replaced_more": false,
  "archived": true,
  "num_comments": 568,
  "created": 1396936102.0,
  "saved": false,
  "selftext": "**I should preface this by saying that some of what I mention below is purely my opinion, and my opinion is *not* what drives the future of Dogecoin - you are.**\n\nWhat a busy few weeks it’s been - I’ve recently moved from Sydney over to San Francisco so inbetween working my day job, attending CoinSummit and gathering rocket fuel for Dogecoin, I’ve been trying to settle in to a new city.\n\nThere have been a bunch of a shibes who have reached out to me these past few weeks, and if I haven’t been able to reply it’s been purely because of how busy I’ve been (I try to reply to all emails, so sorry if I’ve missed you!). To help answers these questions, I wanted to do a quick check-in here on Reddit just to update everyone on where my head is at, and where I see Dogecoin going (on it’s moon journey, of course!). \n\n\n\n### **The Dogecoin Foundation**\n\nMy good friend Liam (/u/Laika1954) did a fantastic job in helping set up The Dogecoin Foundation initially, and helped drive some great initiatives such as Dogesled and Doge 4 Kids. Unfortunately he’s also recently moved country and found a new (very time consuming) job, so is unable to continue in his duties. \n\nIn his absence, I took on the short-term responsibility of updating the website and making sure initiatives like Doge 4 Water were run responsibly. That being said, I’m only one person and would ultimately end up as the bottleneck to getting things done. Our good friends over at [Moolah](https://moolah.io) have helped lend a hand in setting up and driving initiatives like Doge 4 Nascar, and I’m really grateful for that. \n\nBen Doernberg (/u/NeutralityMentality) and the SaveDogemas team have also come through and are beginning [the final payout](<http://www.reddit.com/r/dogecoin/comments/22gdrj/save_dogemas_is_coming_to_a_close/)>, which will see 14mil DOGE reimbursed to victims of the Dogewallet hack late last year. \n\nI’m happy to share that Ben and Eric Nakagawa (/u/ericnakagawa) are currently working on a plan for the future of The Dogecoin Foundation, which will be vetted and approved by you - the community - in the coming weeks. I trust these guys wholeheartedly and am confident that the future of the foundation is in good hands with them. Stay tuned for updates from them soon.\n\n**Extra note:** Dogecoin.com will become the foundation’s responsibility over time, so you won’t have to sit around and wait for me to review and accept pull requests manually :)\n\n\n\n### **Dogecoin Core Development**\n\nAs you might have guessed, maintaining the codebase for a cryptocurrency as popular as Dogecoin isn’t an easy task. Billy (/u/BillyM2K) and I did our best in the early days to make sure we got bugs fixed and issues addressed, but it was clear that we needed some dedicated, experienced help on the project. \n\nWe’ve come a long way, with /u/lleti and several other key contributors helping drive the development and release of Dogecoin v1.6 and now a whole band of great crypto devs helping push towards [Dogecoin v1.7](https://github.com/dogecoin/dogecoin/tree/1.7-dev) which is entirely rebased off the newly released Bitcoin 0.9 codebase. It’s incredibly exciting stuff, and the work they’re doing is great. \n\nIn line with this, I’m happy to share that I’ve handed the lead developer reins over to Max Keller (/u/langer_hans) who you might know as the developer of dogecoinj, our amazing Android wallet and the awesome Multidoge thin-client. In addition to Billy and myself, Max now holds the alert keys to the Dogecoin network, and will be driving the on-going development of the Dogecoin codebase. \n\nHe and the team working on v1.7 (big ups to /u/leofidus-ger + /u/rnicoll + /u/voidref) are fantastic developers and I trust them to build this rocket ship to the highest standards (with some extra jet boosters, even).\n\n\n\n### **…what you’ve been waiting for: Merged Mining**\n\nThere has been a lot of speculation around a recent comment from Charlie Lee (creator of Litecoin) regarding a discussion we’ve had / are having about merged mining. We just met recently at CoinSummit, and it was great to talk about altcoins with the person who was first to adopt scrypt as a proof-of-work algorithm (which most altcoins are using currently). \n\nCharlie pitched the idea of merged mining to me as a way of securing both the Litecoin and Dogecoin networks, which minimal coding work required. It’s a really interesting concept that has both it’s pros and cons, and I’ve really appreciated the level-headed discussion that’s been going on both here on Reddit and over on the various Dogecoin-related IRC channels. \n\nIf you’re not familiar with merged mining, I’ll let you do a quick Reddit search and do the reading yourself - but here are my thoughts on merged mining between Dogecoin, Litecoin or any altcoin for that matter:\n\n* Dogecoin is in a really interesting position, where we’ll reach block 600k and static rewards of 10,000 DOGE by the end of 2014. Up until then, saying that Dogecoin *needs *to do anything is really just speculation, and we have no real way of knowing how the network and it’s miners will react once block rewards drop.\n* Right now, merged mining with Litecoin wouldn’t really benefit Dogecoin. It’d just force all the dedicated, passionate Dogecoin mining pools out there to shift over to also mining Litecoin to reap their deserved rewards, which they may not want to do. On top of that, it’s fair to assume that Litecoin miners who come in will likely auto-dump the Dogecoin they’re rewarded, which isn’t necessarily great for the stability of Dogecoin as a currency and no better than what multi-pools are doing today. \n* Dogecoin has amazing growth at the moment, the strongest community in cryptocurrency behind it, and it’s viability shouldn’t be pegged to another currency or network while it’s only 4-5 months old. \n\nIn a nutshell, *I don’t believe that merged mining is the answer right now.* Maybe it will be once we see what happens past block 600k, but as I said that’s impossible to predict. \n\nI’d actually propose this: Let’s work with other, smaller scrypt-based altcoins such as [DigiByte](http://www.reddit.com/r/digibyte) to help them merged mine off Dogecoin as the parent blockchain. This helps secure all of our networks into the future (altcoins with lower hashrates are subject to frequent attacks), and I personally love seeing us crypto under-doges working together (DigiByte devs helping with us implementing DigiShield is a fantastic example of this). Just like Dogecoin, there’s no telling what the future of Litecoin holds either - so maybe they’ll want to merge mine off Dogecoin as the parent chain some day :)\n\n\n\n### **The Future (hint: it begins with “M” and ends with “OON”)**\n\nI’ve said it once and I’ll say it again: [1 DOGE = 1 DOGE](http://priceofdoge.com/)\n\nWhat this translates to is that the viability of *any* cryptocurrency is based entirely on whether it can stand alone as a store of value, and not what you can cash out to US dollars for. That means spreading the word, asking your favorite merchants to start accepting DOGE, and building adoption worldwide. \n\nShower the haters in generosity, kindness, and tips :) Dogecoin is what it is purely off the back of this amazing community we’ve built, and you should all be extremely proud of what we’ve achieved. \n\nSo let’s band together and:\n\n* Never lose track of what got us here today: kindness, generosity, light-heartedness, and wow\n* Keep /u/dogetipbot busy by tipping like maniacs (/u/mohland loves staying up late working on scalability issues, trust me)\n* Continue to raise funds for great causes\n* Spread the word and help digital currency gain awareness for it’s real benefits, and not as a get-rich-quick scheme\n\nBy handing over the foundation + development duties for Dogecoin to our great core team, I’m now able to focus my time on doing all of the above, and I can’t wait to work with my fellow shibes in doing just that. \n\nTo the moon!\n\n**Jackson.**\n",
  "mod_reports": [],
  "secure_media_embed": {},
  "author_flair_css_class": "dogecoin orange",
  "edited": 1396933764.0,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>I should preface this by saying that some of what I mention below is purely my opinion, and my opinion is <em>not</em> what drives the future of Dogecoin - you are.</strong></p>\n\n<p>What a busy few weeks it’s been - I’ve recently moved from Sydney over to San Francisco so inbetween working my day job, attending CoinSummit and gathering rocket fuel for Dogecoin, I’ve been trying to settle in to a new city.</p>\n\n<p>There have been a bunch of a shibes who have reached out to me these past few weeks, and if I haven’t been able to reply it’s been purely because of how busy I’ve been (I try to reply to all emails, so sorry if I’ve missed you!). To help answers these questions, I wanted to do a quick check-in here on Reddit just to update everyone on where my head is at, and where I see Dogecoin going (on it’s moon journey, of course!). </p>\n\n<h3><strong>The Dogecoin Foundation</strong></h3>\n\n<p>My good friend Liam (<a href=\"/u/Laika1954\">/u/Laika1954</a>) did a fantastic job in helping set up The Dogecoin Foundation initially, and helped drive some great initiatives such as Dogesled and Doge 4 Kids. Unfortunately he’s also recently moved country and found a new (very time consuming) job, so is unable to continue in his duties. </p>\n\n<p>In his absence, I took on the short-term responsibility of updating the website and making sure initiatives like Doge 4 Water were run responsibly. That being said, I’m only one person and would ultimately end up as the bottleneck to getting things done. Our good friends over at <a href=\"https://moolah.io\">Moolah</a> have helped lend a hand in setting up and driving initiatives like Doge 4 Nascar, and I’m really grateful for that. </p>\n\n<p>Ben Doernberg (<a href=\"/u/NeutralityMentality\">/u/NeutralityMentality</a>) and the SaveDogemas team have also come through and are beginning <a href=\"http://www.reddit.com/r/dogecoin/comments/22gdrj/save_dogemas_is_coming_to_a_close/\">the final payout</a>&gt;, which will see 14mil DOGE reimbursed to victims of the Dogewallet hack late last year. </p>\n\n<p>I’m happy to share that Ben and Eric Nakagawa (<a href=\"/u/ericnakagawa\">/u/ericnakagawa</a>) are currently working on a plan for the future of The Dogecoin Foundation, which will be vetted and approved by you - the community - in the coming weeks. I trust these guys wholeheartedly and am confident that the future of the foundation is in good hands with them. Stay tuned for updates from them soon.</p>\n\n<p><strong>Extra note:</strong> Dogecoin.com will become the foundation’s responsibility over time, so you won’t have to sit around and wait for me to review and accept pull requests manually :)</p>\n\n<h3><strong>Dogecoin Core Development</strong></h3>\n\n<p>As you might have guessed, maintaining the codebase for a cryptocurrency as popular as Dogecoin isn’t an easy task. Billy (<a href=\"/u/BillyM2K\">/u/BillyM2K</a>) and I did our best in the early days to make sure we got bugs fixed and issues addressed, but it was clear that we needed some dedicated, experienced help on the project. </p>\n\n<p>We’ve come a long way, with <a href=\"/u/lleti\">/u/lleti</a> and several other key contributors helping drive the development and release of Dogecoin v1.6 and now a whole band of great crypto devs helping push towards <a href=\"https://github.com/dogecoin/dogecoin/tree/1.7-dev\">Dogecoin v1.7</a> which is entirely rebased off the newly released Bitcoin 0.9 codebase. It’s incredibly exciting stuff, and the work they’re doing is great. </p>\n\n<p>In line with this, I’m happy to share that I’ve handed the lead developer reins over to Max Keller (<a href=\"/u/langer_hans\">/u/langer_hans</a>) who you might know as the developer of dogecoinj, our amazing Android wallet and the awesome Multidoge thin-client. In addition to Billy and myself, Max now holds the alert keys to the Dogecoin network, and will be driving the on-going development of the Dogecoin codebase. </p>\n\n<p>He and the team working on v1.7 (big ups to <a href=\"/u/leofidus-ger\">/u/leofidus-ger</a> + <a href=\"/u/rnicoll\">/u/rnicoll</a> + <a href=\"/u/voidref\">/u/voidref</a>) are fantastic developers and I trust them to build this rocket ship to the highest standards (with some extra jet boosters, even).</p>\n\n<h3><strong>…what you’ve been waiting for: Merged Mining</strong></h3>\n\n<p>There has been a lot of speculation around a recent comment from Charlie Lee (creator of Litecoin) regarding a discussion we’ve had / are having about merged mining. We just met recently at CoinSummit, and it was great to talk about altcoins with the person who was first to adopt scrypt as a proof-of-work algorithm (which most altcoins are using currently). </p>\n\n<p>Charlie pitched the idea of merged mining to me as a way of securing both the Litecoin and Dogecoin networks, which minimal coding work required. It’s a really interesting concept that has both it’s pros and cons, and I’ve really appreciated the level-headed discussion that’s been going on both here on Reddit and over on the various Dogecoin-related IRC channels. </p>\n\n<p>If you’re not familiar with merged mining, I’ll let you do a quick Reddit search and do the reading yourself - but here are my thoughts on merged mining between Dogecoin, Litecoin or any altcoin for that matter:</p>\n\n<ul>\n<li>Dogecoin is in a really interesting position, where we’ll reach block 600k and static rewards of 10,000 DOGE by the end of 2014. Up until then, saying that Dogecoin *needs *to do anything is really just speculation, and we have no real way of knowing how the network and it’s miners will react once block rewards drop.</li>\n<li>Right now, merged mining with Litecoin wouldn’t really benefit Dogecoin. It’d just force all the dedicated, passionate Dogecoin mining pools out there to shift over to also mining Litecoin to reap their deserved rewards, which they may not want to do. On top of that, it’s fair to assume that Litecoin miners who come in will likely auto-dump the Dogecoin they’re rewarded, which isn’t necessarily great for the stability of Dogecoin as a currency and no better than what multi-pools are doing today. </li>\n<li>Dogecoin has amazing growth at the moment, the strongest community in cryptocurrency behind it, and it’s viability shouldn’t be pegged to another currency or network while it’s only 4-5 months old. </li>\n</ul>\n\n<p>In a nutshell, <em>I don’t believe that merged mining is the answer right now.</em> Maybe it will be once we see what happens past block 600k, but as I said that’s impossible to predict. </p>\n\n<p>I’d actually propose this: Let’s work with other, smaller scrypt-based altcoins such as <a href=\"http://www.reddit.com/r/digibyte\">DigiByte</a> to help them merged mine off Dogecoin as the parent blockchain. This helps secure all of our networks into the future (altcoins with lower hashrates are subject to frequent attacks), and I personally love seeing us crypto under-doges working together (DigiByte devs helping with us implementing DigiShield is a fantastic example of this). Just like Dogecoin, there’s no telling what the future of Litecoin holds either - so maybe they’ll want to merge mine off Dogecoin as the parent chain some day :)</p>\n\n<h3><strong>The Future (hint: it begins with “M” and ends with “OON”)</strong></h3>\n\n<p>I’ve said it once and I’ll say it again: <a href=\"http://priceofdoge.com/\">1 DOGE = 1 DOGE</a></p>\n\n<p>What this translates to is that the viability of <em>any</em> cryptocurrency is based entirely on whether it can stand alone as a store of value, and not what you can cash out to US dollars for. That means spreading the word, asking your favorite merchants to start accepting DOGE, and building adoption worldwide. </p>\n\n<p>Shower the haters in generosity, kindness, and tips :) Dogecoin is what it is purely off the back of this amazing community we’ve built, and you should all be extremely proud of what we’ve achieved. </p>\n\n<p>So let’s band together and:</p>\n\n<ul>\n<li>Never lose track of what got us here today: kindness, generosity, light-heartedness, and wow</li>\n<li>Keep <a href=\"/u/dogetipbot\">/u/dogetipbot</a> busy by tipping like maniacs (<a href=\"/u/mohland\">/u/mohland</a> loves staying up late working on scalability issues, trust me)</li>\n<li>Continue to raise funds for great causes</li>\n<li>Spread the word and help digital currency gain awareness for it’s real benefits, and not as a get-rich-quick scheme</li>\n</ul>\n\n<p>By handing over the foundation + development duties for Dogecoin to our great core team, I’m now able to focus my time on doing all of the above, and I can’t wait to work with my fellow shibes in doing just that. </p>\n\n<p>To the moon!</p>\n\n<p><strong>Jackson.</strong></p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "user_reports": [],
  "author_flair_text": "Dogecoin co-founder",
  "over_18": false,
  "score": 501,
  "stickied": false,
  "domain": "self.dogecoin",
  "is_self": true,
  "hidden": false,
  "_orphaned": {},
  "_api_link": "https://api.reddit.com/r/dogecoin/comments/22hqm6/official_an_update_on_the_foundation_core/?ref=search_posts",
  "_comments_by_id": {},
  "visited": false,
  "thumbnail": "self",
  "_has_fetched": true,
  "gilded": 0,
  "hide_score": false,
  "_info_url": "https://api.reddit.com/api/info/",
  "created_utc": 1396932502.0,
  "subreddit_id": "t5_2zcp2",
  "id": "22hqm6",
  "_params": {},
  "media_embed": {},
  "name": "t3_22hqm6",
  "quarantine": false,
  "permalink": "https://www.reddit.com/r/dogecoin/comments/22hqm6/official_an_update_on_the_foundation_core/?ref=search_posts",
  "ups": 501,
  "url": "https://www.reddit.com/r/dogecoin/comments/22hqm6/official_an_update_on_the_foundation_core/",
  "title": "[OFFICIAL] An update on the foundation, core development, merged mining, and the future of Dogecoin."
}