{
  "clicked": false,
  "_replaced_more": false,
  "archived": true,
  "num_comments": 179,
  "created": 1396610031.0,
  "saved": false,
  "selftext": "This is an alternate account, because I've used my actual name on my real account on occasion. \n\n**Background**: I work at a store that sells a variety of things: furniture, foodstuff, repackaged tat you see at Ashens, etc. Usually imported from foreign countries.\n\nThis is a story from a few years back during summer vacation. I was using mine to work in the store. Usually we're put on half shifts for the day: one shift for store-related things and the other shift on register, to break things up a bit. It was afternoon and I manned the register for that shift.\n\nBecause it was holiday season, we get our fair share of foreigners: French people, British people, but also Canadians and Americans on occaission. \n\nIn comes an American woman, I greet her (in English), and she returns the gesture. I ring up all of her products and we proceed to payment. I asked her if she wanted to pay cash, or electronically, she wants to do it electronically. After I told her to go ahead, she pulled out a Visa card, which immediately raised a red flag. Our store doesn't accept credit cards at all, because we don't carry anything that's more expensive than €100,- Also, unlike the US, paying with a credit card is not a common thing, we're used to using debit cards instead for day to day purchases. \n\nHowever, the American woman informs me that it is in fact a Visa **debit card** and wants to proceed. I never had seen one before, but they seem to be a thing. But, I once again had to tell her that she won't be able to pay with it. This time because it lacks a chip on the front. \n\nThis was put into place to prevent the rampant skimming. All stores block off the magnet reader on their debit card terminals, forcing you to use the chip. This means you can only use your card by inserting it into the terminal, not swiping it. Here's how it looks like with a top loading model: [link](http://www.flexipin.nl/wp-content/uploads/2012/10/Pinautomaat-huren-voor-toonbank-FlexiPIN.jpg)\n\nThe woman becomes a bit disgruntled and wants to use it anyways. Well, I ain't stopping her, so I allow her to. She sticks her card into the terminal.... Aaaaand nothing, shocker. Defeated, she pulls out her card and hands me cash, I hand over her change and wish her a nice stay in the Netherlands.\n\nSometimes you just have to let them have it their way.\n\n**TL;DR**: I'm aware that you have your own credit/debit card, but if I tell you you can't use it, please believe me.\n\n**Edit:** There appears to be some confusion about the card that was used. In order to use a debit card in the Netherlands you need a chip, which looks like this: [Link](http://www.creditcards.com/credit-card-news/images/chip-n-pin.jpg) If you don't have one on your card, you cannot use it, because the magnetic strip works by swiping.\n\nAlso, the Netherlands uses Maestro/Mastercard as their primary debit card system. Visa however, is the biggest in the credit card industry, hence my primary assumption.\n",
  "mod_reports": [],
  "secure_media_embed": {},
  "edited": 1396631124.0,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is an alternate account, because I&#39;ve used my actual name on my real account on occasion. </p>\n\n<p><strong>Background</strong>: I work at a store that sells a variety of things: furniture, foodstuff, repackaged tat you see at Ashens, etc. Usually imported from foreign countries.</p>\n\n<p>This is a story from a few years back during summer vacation. I was using mine to work in the store. Usually we&#39;re put on half shifts for the day: one shift for store-related things and the other shift on register, to break things up a bit. It was afternoon and I manned the register for that shift.</p>\n\n<p>Because it was holiday season, we get our fair share of foreigners: French people, British people, but also Canadians and Americans on occaission. </p>\n\n<p>In comes an American woman, I greet her (in English), and she returns the gesture. I ring up all of her products and we proceed to payment. I asked her if she wanted to pay cash, or electronically, she wants to do it electronically. After I told her to go ahead, she pulled out a Visa card, which immediately raised a red flag. Our store doesn&#39;t accept credit cards at all, because we don&#39;t carry anything that&#39;s more expensive than €100,- Also, unlike the US, paying with a credit card is not a common thing, we&#39;re used to using debit cards instead for day to day purchases. </p>\n\n<p>However, the American woman informs me that it is in fact a Visa <strong>debit card</strong> and wants to proceed. I never had seen one before, but they seem to be a thing. But, I once again had to tell her that she won&#39;t be able to pay with it. This time because it lacks a chip on the front. </p>\n\n<p>This was put into place to prevent the rampant skimming. All stores block off the magnet reader on their debit card terminals, forcing you to use the chip. This means you can only use your card by inserting it into the terminal, not swiping it. Here&#39;s how it looks like with a top loading model: <a href=\"http://www.flexipin.nl/wp-content/uploads/2012/10/Pinautomaat-huren-voor-toonbank-FlexiPIN.jpg\">link</a></p>\n\n<p>The woman becomes a bit disgruntled and wants to use it anyways. Well, I ain&#39;t stopping her, so I allow her to. She sticks her card into the terminal.... Aaaaand nothing, shocker. Defeated, she pulls out her card and hands me cash, I hand over her change and wish her a nice stay in the Netherlands.</p>\n\n<p>Sometimes you just have to let them have it their way.</p>\n\n<p><strong>TL;DR</strong>: I&#39;m aware that you have your own credit/debit card, but if I tell you you can&#39;t use it, please believe me.</p>\n\n<p><strong>Edit:</strong> There appears to be some confusion about the card that was used. In order to use a debit card in the Netherlands you need a chip, which looks like this: <a href=\"http://www.creditcards.com/credit-card-news/images/chip-n-pin.jpg\">Link</a> If you don&#39;t have one on your card, you cannot use it, because the magnetic strip works by swiping.</p>\n\n<p>Also, the Netherlands uses Maestro/Mastercard as their primary debit card system. Visa however, is the biggest in the credit card industry, hence my primary assumption.</p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "user_reports": [],
  "over_18": false,
  "score": 188,
  "stickied": false,
  "domain": "self.TalesFromRetail",
  "is_self": true,
  "hidden": false,
  "_orphaned": {},
  "_api_link": "https://api.reddit.com/r/TalesFromRetail/comments/226hzy/but_this_is_a_visa_debit_card/?ref=search_posts",
  "_comments_by_id": {},
  "visited": false,
  "thumbnail": "",
  "_has_fetched": true,
  "gilded": 0,
  "hide_score": false,
  "_info_url": "https://api.reddit.com/api/info/",
  "created_utc": 1396606431.0,
  "subreddit_id": "t5_2t2zt",
  "id": "226hzy",
  "_params": {},
  "media_embed": {},
  "name": "t3_226hzy",
  "quarantine": false,
  "permalink": "https://www.reddit.com/r/TalesFromRetail/comments/226hzy/but_this_is_a_visa_debit_card/?ref=search_posts",
  "ups": 188,
  "url": "https://www.reddit.com/r/TalesFromRetail/comments/226hzy/but_this_is_a_visa_debit_card/",
  "title": "But this is a visa debit card!"
}