{
  "downs": 0,
  "mod_reports": [],
  "secure_media_embed": {},
  "_info_url": "https://api.reddit.com/api/info/",
  "gilded": 0,
  "num_comments": 1915,
  "_orphaned": {},
  "hidden": false,
  "ups": 1440,
  "url": "https://www.reddit.com/r/AskReddit/comments/13507z/reddit_target_walmart_and_other_retail_stores/",
  "_has_fetched": true,
  "quarantine": false,
  "name": "t3_13507z",
  "user_reports": [],
  "saved": false,
  "permalink": "https://www.reddit.com/r/AskReddit/comments/13507z/reddit_target_walmart_and_other_retail_stores/?ref=search_posts",
  "over_18": false,
  "is_self": true,
  "_params": {},
  "thumbnail": "",
  "created_utc": 1352833233.0,
  "_replaced_more": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&quot;Black Friday&quot; is already ridiculous as it is. But <a href=\"http://finance.yahoo.com/news/thanksgiving-shouldnt-black-thursday-target-215753491.html\">forcing employees</a> to work retail on Thanksgiving night is unacceptable. I <a href=\"http://www.change.org/petitions/target-walmart-and-other-retail-stores-across-america-let-your-employees-have-thanksgiving-night-off\">created a petition</a> vowing to only shop at stores that refuse to open on Thanksgiving night. Any other ideas?</p>\n\n<p>Edit: Here&#39;s a <a href=\"http://www.change.org/petitions/target-take-the-high-road-and-save-thanksgiving\">different petition</a> from Target employees that already has some traction. Thanks for the lively discussion. </p>\n\n<p>Edit 2: I recognize there are other issues of importance in this universe, and that this one ranks further down the ladder than others. But, to me, this is one that can be fixed if the right kind of pressure is applied. Reddit can&#39;t fix the debt crisis. But it can apply social pressure on companies to behave in a more compassionate, ethical manner. Will it work? I have no idea. But I thought it was worth trying. Just because there are millions of unemployed people, doesn&#39;t mean people who do have jobs should be denied a holiday off to spend with their families. It may sound naive, but I think treating each other well is a much better ethos for our society than &quot;suck it up and be miserable.&quot;</p>\n\n<p>Edit 3: <a href=\"http://www.reddit.com/r/AskReddit/comments/13507z/reddit_target_walmart_and_other_retail_stores/c710o2n\">This comment</a> by cunt_a_saurus is exactly the reason I posted in the first place. So I&#39;m reposting it here with his/her permission. </p>\n\n<p>&quot;Made an account just to share some horrors of Walmart Black Friday (oh, and we aren&#39;t allowed to call it that anymore, its new name is &quot;The Event&quot;). I&#39;m an overnight associate in California and our managers just informed us that every member of our night crew is required to work and work a twelve hour shift at that. 7pm Thanksgiving night to 7am Friday morning with two half hour lunches. It really is getting more and more ridiculous with every new year. Most everyone I know will not be able to do anything for Thanksgiving because we have to sleep most of the day. Their form of an incentive? An extra 10% on top of our normal 10% discount on one purchase during that weekend. Guess what assholes, we will be too busy slaving for you to purchase anything. Ah, retail...&quot;</p>\n\n<p>Edit 4: Thanks to Foghorn225 I learned that Sam&#39;s Club <a href=\"http://www3.samsclub.com/newsroom/Press/887\">is closed</a> on Thanksgiving. Instead, you can buy discounted goods on their website on Thanskgiving day, and when they open back up on Friday they have an in-store sale and offer free breakfast to shoppers. Sounds a lot better than wasting your holiday getting stampeded by bargain-hunting hordes, no?</p>\n\n<p>Edit 5: I&#39;ve been further told that Walmart owns Sam&#39;s Club, which would explain why it&#39;s closed on Thanksgiving--so as not to cannibalize the business of its larger, more profitable cousin. That said, if you have to visit a big box store, I&#39;d still say make it Sam&#39;s Club. But let them know in the comment box you&#39;re shopping there because they gave their employees the day off on Thanksgiving. Maybe the message will get through to Walmart.</p>\n\n<p>Edit 6: So as not to just single out Walmart and Target: Sears, Toys R Us, Gap, Old Navy, Banana Republic, and Kmart will all be open on Thanksgiving. According to <a href=\"http://www.reuters.com/article/2012/11/12/us-usa-retail-thanksgiving-idUSBRE8AB0TZ20121112\">this story</a>, Best Buy, JC Penny, Macy&#39;s, Kohl&#39;s, Sam&#39;s Club and Costco will hold off until Friday to give their employees a break. If you plan on shopping after Thanksgiving, this might be a good list to refer to. Nordstrum too, though kind of pricey compared to most of these spots, will be closed on Thanksgiving, and is <a href=\"http://www.dailyfinance.com/2011/11/10/black-friday-battle-shapes-up-as-nordstrom-vs-walmart/\">notoriously averse</a> to Black Friday crap.</p>\n\n<p>Edit 7: Thanks for the great discussion everyone. We have in no way reached a consensus on what to do about this matter, but a few ideas have stood out, which I&#39;ve summarized in order of popularity. </p>\n\n<ol>\n<li><a href=\"http://www.adbusters.org/campaigns/bnd\">Don&#39;t go shopping</a> on Thanksgiving. It won&#39;t help workers this year, but hopefully retailers will learn their lesson and stop being assholes next year.</li>\n<li>If you do decide to go shopping, be nice to the employees and don&#39;t yell at them because the toaster you wanted is out of stock. Tip generously if appropriate. And don&#39;t tell them you feel sorry about them having to work on Thanksgiving. They are well aware that it sucks. They don&#39;t need your sympathy. Instead, bring them some turkey, dressing, and pie if you can. Or, just frequent stores like Macy&#39;s that decided to give their employees the holiday off.</li>\n<li>Employees should suck it up and be thankful they have a job. This suggestion can fuck off in my opinion, but apparently lots of Redditors think it&#39;s uppity to ask for a national holiday off to spend with your family. For those who think this way, I suggest you read Mark Ames&#39; wonderful book <a href=\"http://www.exile.ru/articles/detail.php?ARTICLE_ID=7948&amp;IBLOCK_ID=35\">Going Postal</a>. </li>\n<li>Unionize. My own personal suggestion on this matter would be to remember the shitty feeling of working on Thanksgiving day, spent the next year plotting with your colleagues to unionize, then hit your employer with your organizing demands a week or so before Black Friday. You&#39;ll have them by the balls. If they don&#39;t listen to you, they won&#39;t have any employees to work the biggest shopping day of the year. And they won&#39;t have enough time to make up the lost revenue to make their books look good by the end of the year.</li>\n<li>Sign the petitions I linked to above. Not the most popular route, but many thanks to all those who did. </li>\n</ol>\n\n<p>And to all you service industry folks out there who have to work on Thanksgiving, I obviously feel for you too. I hope you&#39;ll find solace in the big, fat tips you will undoubtedly earn.  </p>\n</div><!-- SC_ON -->",
  "subreddit_id": "t5_2qh1i",
  "archived": true,
  "domain": "self.AskReddit",
  "clicked": false,
  "score": 1440,
  "id": "13507z",
  "stickied": false,
  "media_embed": {},
  "visited": false,
  "selftext": "\"Black Friday\" is already ridiculous as it is. But [forcing employees](http://finance.yahoo.com/news/thanksgiving-shouldnt-black-thursday-target-215753491.html) to work retail on Thanksgiving night is unacceptable. I [created a petition](http://www.change.org/petitions/target-walmart-and-other-retail-stores-across-america-let-your-employees-have-thanksgiving-night-off) vowing to only shop at stores that refuse to open on Thanksgiving night. Any other ideas?\n\nEdit: Here's a [different petition](http://www.change.org/petitions/target-take-the-high-road-and-save-thanksgiving) from Target employees that already has some traction. Thanks for the lively discussion. \n\nEdit 2: I recognize there are other issues of importance in this universe, and that this one ranks further down the ladder than others. But, to me, this is one that can be fixed if the right kind of pressure is applied. Reddit can't fix the debt crisis. But it can apply social pressure on companies to behave in a more compassionate, ethical manner. Will it work? I have no idea. But I thought it was worth trying. Just because there are millions of unemployed people, doesn't mean people who do have jobs should be denied a holiday off to spend with their families. It may sound naive, but I think treating each other well is a much better ethos for our society than \"suck it up and be miserable.\"\n\nEdit 3: [This comment](http://www.reddit.com/r/AskReddit/comments/13507z/reddit_target_walmart_and_other_retail_stores/c710o2n) by cunt_a_saurus is exactly the reason I posted in the first place. So I'm reposting it here with his/her permission. \n\n\"Made an account just to share some horrors of Walmart Black Friday (oh, and we aren't allowed to call it that anymore, its new name is \"The Event\"). I'm an overnight associate in California and our managers just informed us that every member of our night crew is required to work and work a twelve hour shift at that. 7pm Thanksgiving night to 7am Friday morning with two half hour lunches. It really is getting more and more ridiculous with every new year. Most everyone I know will not be able to do anything for Thanksgiving because we have to sleep most of the day. Their form of an incentive? An extra 10% on top of our normal 10% discount on one purchase during that weekend. Guess what assholes, we will be too busy slaving for you to purchase anything. Ah, retail...\"\n\nEdit 4: Thanks to Foghorn225 I learned that Sam's Club [is closed](http://www3.samsclub.com/newsroom/Press/887) on Thanksgiving. Instead, you can buy discounted goods on their website on Thanskgiving day, and when they open back up on Friday they have an in-store sale and offer free breakfast to shoppers. Sounds a lot better than wasting your holiday getting stampeded by bargain-hunting hordes, no?\n\nEdit 5: I've been further told that Walmart owns Sam's Club, which would explain why it's closed on Thanksgiving--so as not to cannibalize the business of its larger, more profitable cousin. That said, if you have to visit a big box store, I'd still say make it Sam's Club. But let them know in the comment box you're shopping there because they gave their employees the day off on Thanksgiving. Maybe the message will get through to Walmart.\n\nEdit 6: So as not to just single out Walmart and Target: Sears, Toys R Us, Gap, Old Navy, Banana Republic, and Kmart will all be open on Thanksgiving. According to [this story](http://www.reuters.com/article/2012/11/12/us-usa-retail-thanksgiving-idUSBRE8AB0TZ20121112), Best Buy, JC Penny, Macy's, Kohl's, Sam's Club and Costco will hold off until Friday to give their employees a break. If you plan on shopping after Thanksgiving, this might be a good list to refer to. Nordstrum too, though kind of pricey compared to most of these spots, will be closed on Thanksgiving, and is [notoriously averse](http://www.dailyfinance.com/2011/11/10/black-friday-battle-shapes-up-as-nordstrom-vs-walmart/) to Black Friday crap.\n\nEdit 7: Thanks for the great discussion everyone. We have in no way reached a consensus on what to do about this matter, but a few ideas have stood out, which I've summarized in order of popularity. \n\n1. [Don't go shopping](http://www.adbusters.org/campaigns/bnd) on Thanksgiving. It won't help workers this year, but hopefully retailers will learn their lesson and stop being assholes next year.\n2. If you do decide to go shopping, be nice to the employees and don't yell at them because the toaster you wanted is out of stock. Tip generously if appropriate. And don't tell them you feel sorry about them having to work on Thanksgiving. They are well aware that it sucks. They don't need your sympathy. Instead, bring them some turkey, dressing, and pie if you can. Or, just frequent stores like Macy's that decided to give their employees the holiday off.\n3. Employees should suck it up and be thankful they have a job. This suggestion can fuck off in my opinion, but apparently lots of Redditors think it's uppity to ask for a national holiday off to spend with your family. For those who think this way, I suggest you read Mark Ames' wonderful book [Going Postal](http://www.exile.ru/articles/detail.php?ARTICLE_ID=7948&IBLOCK_ID=35). \n4. Unionize. My own personal suggestion on this matter would be to remember the shitty feeling of working on Thanksgiving day, spent the next year plotting with your colleagues to unionize, then hit your employer with your organizing demands a week or so before Black Friday. You'll have them by the balls. If they don't listen to you, they won't have any employees to work the biggest shopping day of the year. And they won't have enough time to make up the lost revenue to make their books look good by the end of the year.\n5. Sign the petitions I linked to above. Not the most popular route, but many thanks to all those who did. \n\nAnd to all you service industry folks out there who have to work on Thanksgiving, I obviously feel for you too. I hope you'll find solace in the big, fat tips you will undoubtedly earn.  ",
  "hide_score": false,
  "_api_link": "https://api.reddit.com/r/AskReddit/comments/13507z/reddit_target_walmart_and_other_retail_stores/?ref=search_posts",
  "locked": false,
  "edited": 1352884426.0,
  "title": "Reddit: Target, Walmart and other retail stores have decided to extend \"Black Friday\" into Thanksgiving Thursday. What can we do to help their employees so they're not stuck working?",
  "created": 1352836833.0,
  "_comments_by_id": {}
}