{
  "clicked": false,
  "_replaced_more": false,
  "archived": true,
  "num_comments": 1185,
  "created": 1381574878.0,
  "saved": false,
  "selftext": "Never, in my entire life, have I witnessed the level of sheer incompetence that took place tonight while trying to purchase the new Pokemon game.\n\nMy wife and I arrived at Walmart at exactly 11:56pm.  I know this because my wife didn't want to come with me to the store in the first place and complained about the time. I convinced her it would be fast because I had already purchased my $5 prepaid reservation card a week ago.  Upon walking to the back of the store where the electronics are, there were no sales associates in the department.  NONE.  There were 3 other gentlemen wandering around the same area as we were, looking for someone to sell them the game.  We waited back there for approximately 10 minutes (during these 10 minutes, we repeatedly called the store to no avail and searched the shelves for the game) before I decided to go up to the front and take charge of the situation, leaving my wife to wait with the other poor saps.\n\nThe lady at the front of the store informed me that she would send someone to the electronics section and that I could make my way back to that area.  When I returned to electronics, I waited with my wife for about 7-10 minutes for someone, ANYONE, to show up.  Finally, said gentleman came to the back, checked a computer screen, and headed to the store room to find the box of games.  We figured we would be out of there in five, ten minutes, tops.\n\nAbout 20 minutes later, a random woman who worked at the store came over to our line of waiting patrons to inform us that our previous pal was indeed in the back looking for our games.  How did she know this?  Why, she was helping him - until she decided to quit looking and come tell us her story.  She NEVER went back to help him.  That was the last we saw of her.\n\nFORTY MINUTES LATER we hear over the intercom that our associate needed help unlocking the electronics cage in the back.  WHAT THE FLYING FUCK WAS HE DOING FOR AN HOUR?!  Staring at said cage?  Looking somewhere that electronics are not?   At about this time, the electronics manager came to the front of the store and questioned the release date of the game.  Because, you know, all 10 people waiting in line at this point have misread the release date for the game.  After starting at a computer screen with her male counterpart for another 10 minutes, they were pleased to tell us that they did indeed have 52 copies of the game in the store.  They just had no flippin' idea where they were.  They stared at us with doofy smiles on their faces while delivering this news.  \n\nAt this point, they had called back an assistant manager to come help locate the games.  The 3 Stooges repeated everything that had already been established numerous times to one another.  The assistant manager then decided that perhaps somebody put the games in the office.  She left to go check.  The other two decided to go look through pallets on the floor NOT in the electronic section.  Guess who decided to look through the pallets IN the electronic section?  Yes, the line of customers waiting for the game.\n\n15 minutes pass.  The two sales associates returned to the computer to look up a UPC code because they had failed to look for it before.  AN HOUR AND FIFTEEN MINUTES AGO.  Low and behold, they found the fucking UPC code and not 5 minutes later, they located the games and took them out.  Gods be praised!  We were finally going to purchase the game and get the hell out of dodge, right?  RIGHT?!?!?!?!\n\nOur two geniuses (sans the assistant manager) decided to split the line in two - X on one register, Y on the other.  Have I mentioned yet that we were the first people to show up for the game, the first people in line, and the first people to show any initiative to locate a sales rep in order to purchase the game?  Well, we were.  So, we line up first in the Y line.  The X line was significantly longer than the Y line.  We were also the only people with a prepaid reservation card (this is noteworthy).  The instruction inside the boxes said \"Customers must have a prepaid card to purchase this game.\"  We know this because assistant manager is now back and \"taking care\" of us and she read it out loud to no one in particular.  All of the people in the X line, WITHOUT a prepaid card, were able to purchase their game and be on their merry way.  In fact, several of them purchased TWO games each.  Then, while assistant manager was trying to figure out how to process our card, the people in the Y line moved over to the X line and purchased their games there.  We are now the ONLY people left trying to purchase the game because not one of the 3 people back there could figure out how to ring up our card to give us the $5 off.\n\nIt is now 1:45am.  After ringing up our card and trying to make us pay $5 for the card again instead of taking the $5 off the price (several times, this assistant manager was unreal), she decided that she wouldn't be able to figure it out and called back her manager.  When he arrived, he informed in a rather patronizing voice that he doesn't know how to do that.  She'll have to take us up front and get help from the service manager.  So, off we go.\n\nWhen we arrive at the front of the store, we are about at our wits end.  However, we just want to purchase the game and leave.  The service manager was no more adept at ringing up our game and prepaid card than any of his lovely counterparts.  He then looked us straight in the eye and said \"Well, it can't be done.  There's nothing I can do.\"\n\nMy wife lost it.  Fucking lost it.  She told him that we had already been in the store for 2 hours trying to purchase this game and no one can help us.  She then asked if he could return the card, give us our $5 back, and then we will purchase the game.  NOPE.  He can't do that.  She asked if he can give us a $5 store coupon for the game and we will leave the receipt and prepaid card with him.  NOPE.  He can't do that either.  He wanted to just leave it at that.  Not help us at all.  My wife told him to call his manager and see what he could do.  That manager happened to be the same patronizing manager from before.  He told the service manager to go try and ring us up in customer service.\n\nBefore he could go try this, the service manager LEFT us to go help another customer.  My wife followed him and said \"No, you don't get to go help someone else while we have been waiting for 2 hours and you are supposed to be helping us.\"  This frazzled him - his IQ was clearly not very high and all of the lights weren't turned on up there (think of Office Space and the stapler).  He took us back to customer service where all of the registers were closed.  He decided to take a till and some money and start filling the till with bills and coins before helping us.  At this point, I was close to walking out with the game without paying.  I asked \"Is that really necessary to do that right now? We are just trying get our game.\"\n\nI can only assumed that the service manager got so frustrated and confused with us because what happened next was absolutely crazy.  A GIANT snot ball came sliding out of his nose, as if his brain is working so hard that it's squirting things out of his head.  My wife had to turn her back to him for fear of cracking the fuck up and crying at the same time.  No worries friends, he sucked it back up his nose.\n\nIt's 2:06am, I'm frustrated - I'm to the point of tears, hysterical laughter, and anger all rolled into one.  Suddenly, the service manager closes the drawer, grabs our game and prepaid card, and mumbles to himself \"I know what I'll do\" as he starts to walk away.  I have to chase him down and ask him where the hell he is going without informing us of what's going on.  Apparently, he had a brief moment of clarity where his brain reached a higher level of problem solving.  He took us back to the original register, rung up the game, and gave us $10 off as a 3DS promotional game code (which really only amounts to $5 off for our 2 hours of time if you include the $5 prepaid card that NO FUCKING PERSON in the store could figure out).  Holy fucking shit.\n\nEven though I have tried, I don't think that I can completely convey to you the  complete constellation of incompetency displayed at this Walmart.  It was the biggest clusterfuck of morons all working the same shift and not knowing what the hell to do.  My wife has banned us from entering that location ever again.  She also said that this better be the most amaze balls game ever to be released in the history of games.\n\nTL; DR: played a 2 hr round of hot potato with around 8 incompetent staff. Snot.\n\n**Frontpage edit:\nHoly shit didn't believe this blew up overnight! My wife and I were laughing about it by the time we posted this and went to sleep since it was such an Amazingly bad experience that we actually will remember for a long time. I've actually never had a problem before with Walmart, we probably go there 4~8 times a year. Never had a problem until yesterday.**\n\n**Some clarification on most of the questions asked here:**\n\n**Why the hell did you even go to walmart?**\nI wanted a physical copy of the game. I actually had pre ordered the game on Newegg/Amazon but both places were going to ship later and I won't be getting it for a week. There were no stores near me that did midnight release and I chose to pick up the nearest place that carried prepaid card to shop, fuck me right?\n\n**Why the hell did you even go to walmart???**\nLesson Learned.\n\n**Why did you drag your wife along?**\nBecause I was ronery.\n\n**Why are you and your wife such ass holes?**\nMy wife and I have both worked in retail and waited tables as servers, we always tip 20% in restaurants and had NEVER been angry at any one working in those places. Despite the high amount of bitching you read in this post we were actually only bursted out at the last person after 2 ours of frustration for ADDing out while trying to help us when there were so many ways he could have helped us.(We suggested at least 3 ways but he just COULD NOT process the information...)\n\n**Why the hell did you not just wait till tomorrow to get the game instead of being a whinny little bitch?**\nRead the story again please, I'd be one of those that will be there and they tell me there is no game PLUS they have no idea how to refund me $5.\n\n**So is the game worth it?**\nYes.\n\n**Who's your starter?**\nFroakie. Rolled hasty first try, no female though unfortunately.\n\n**Your FC?**\n0576 4758 5944\n\n**\"You best do something for your wife\"**\nTaking her to a fancy restaurant tonight, not only because it's her bday tomorrow... my love for her forever too.\n\nWe are both amazed at so many similar stories some of you shared with us, lesson is learned. Thanks for the nice comments and advice!",
  "mod_reports": [],
  "secure_media_embed": {},
  "edited": 1381597191.0,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Never, in my entire life, have I witnessed the level of sheer incompetence that took place tonight while trying to purchase the new Pokemon game.</p>\n\n<p>My wife and I arrived at Walmart at exactly 11:56pm.  I know this because my wife didn&#39;t want to come with me to the store in the first place and complained about the time. I convinced her it would be fast because I had already purchased my $5 prepaid reservation card a week ago.  Upon walking to the back of the store where the electronics are, there were no sales associates in the department.  NONE.  There were 3 other gentlemen wandering around the same area as we were, looking for someone to sell them the game.  We waited back there for approximately 10 minutes (during these 10 minutes, we repeatedly called the store to no avail and searched the shelves for the game) before I decided to go up to the front and take charge of the situation, leaving my wife to wait with the other poor saps.</p>\n\n<p>The lady at the front of the store informed me that she would send someone to the electronics section and that I could make my way back to that area.  When I returned to electronics, I waited with my wife for about 7-10 minutes for someone, ANYONE, to show up.  Finally, said gentleman came to the back, checked a computer screen, and headed to the store room to find the box of games.  We figured we would be out of there in five, ten minutes, tops.</p>\n\n<p>About 20 minutes later, a random woman who worked at the store came over to our line of waiting patrons to inform us that our previous pal was indeed in the back looking for our games.  How did she know this?  Why, she was helping him - until she decided to quit looking and come tell us her story.  She NEVER went back to help him.  That was the last we saw of her.</p>\n\n<p>FORTY MINUTES LATER we hear over the intercom that our associate needed help unlocking the electronics cage in the back.  WHAT THE FLYING FUCK WAS HE DOING FOR AN HOUR?!  Staring at said cage?  Looking somewhere that electronics are not?   At about this time, the electronics manager came to the front of the store and questioned the release date of the game.  Because, you know, all 10 people waiting in line at this point have misread the release date for the game.  After starting at a computer screen with her male counterpart for another 10 minutes, they were pleased to tell us that they did indeed have 52 copies of the game in the store.  They just had no flippin&#39; idea where they were.  They stared at us with doofy smiles on their faces while delivering this news.  </p>\n\n<p>At this point, they had called back an assistant manager to come help locate the games.  The 3 Stooges repeated everything that had already been established numerous times to one another.  The assistant manager then decided that perhaps somebody put the games in the office.  She left to go check.  The other two decided to go look through pallets on the floor NOT in the electronic section.  Guess who decided to look through the pallets IN the electronic section?  Yes, the line of customers waiting for the game.</p>\n\n<p>15 minutes pass.  The two sales associates returned to the computer to look up a UPC code because they had failed to look for it before.  AN HOUR AND FIFTEEN MINUTES AGO.  Low and behold, they found the fucking UPC code and not 5 minutes later, they located the games and took them out.  Gods be praised!  We were finally going to purchase the game and get the hell out of dodge, right?  RIGHT?!?!?!?!</p>\n\n<p>Our two geniuses (sans the assistant manager) decided to split the line in two - X on one register, Y on the other.  Have I mentioned yet that we were the first people to show up for the game, the first people in line, and the first people to show any initiative to locate a sales rep in order to purchase the game?  Well, we were.  So, we line up first in the Y line.  The X line was significantly longer than the Y line.  We were also the only people with a prepaid reservation card (this is noteworthy).  The instruction inside the boxes said &quot;Customers must have a prepaid card to purchase this game.&quot;  We know this because assistant manager is now back and &quot;taking care&quot; of us and she read it out loud to no one in particular.  All of the people in the X line, WITHOUT a prepaid card, were able to purchase their game and be on their merry way.  In fact, several of them purchased TWO games each.  Then, while assistant manager was trying to figure out how to process our card, the people in the Y line moved over to the X line and purchased their games there.  We are now the ONLY people left trying to purchase the game because not one of the 3 people back there could figure out how to ring up our card to give us the $5 off.</p>\n\n<p>It is now 1:45am.  After ringing up our card and trying to make us pay $5 for the card again instead of taking the $5 off the price (several times, this assistant manager was unreal), she decided that she wouldn&#39;t be able to figure it out and called back her manager.  When he arrived, he informed in a rather patronizing voice that he doesn&#39;t know how to do that.  She&#39;ll have to take us up front and get help from the service manager.  So, off we go.</p>\n\n<p>When we arrive at the front of the store, we are about at our wits end.  However, we just want to purchase the game and leave.  The service manager was no more adept at ringing up our game and prepaid card than any of his lovely counterparts.  He then looked us straight in the eye and said &quot;Well, it can&#39;t be done.  There&#39;s nothing I can do.&quot;</p>\n\n<p>My wife lost it.  Fucking lost it.  She told him that we had already been in the store for 2 hours trying to purchase this game and no one can help us.  She then asked if he could return the card, give us our $5 back, and then we will purchase the game.  NOPE.  He can&#39;t do that.  She asked if he can give us a $5 store coupon for the game and we will leave the receipt and prepaid card with him.  NOPE.  He can&#39;t do that either.  He wanted to just leave it at that.  Not help us at all.  My wife told him to call his manager and see what he could do.  That manager happened to be the same patronizing manager from before.  He told the service manager to go try and ring us up in customer service.</p>\n\n<p>Before he could go try this, the service manager LEFT us to go help another customer.  My wife followed him and said &quot;No, you don&#39;t get to go help someone else while we have been waiting for 2 hours and you are supposed to be helping us.&quot;  This frazzled him - his IQ was clearly not very high and all of the lights weren&#39;t turned on up there (think of Office Space and the stapler).  He took us back to customer service where all of the registers were closed.  He decided to take a till and some money and start filling the till with bills and coins before helping us.  At this point, I was close to walking out with the game without paying.  I asked &quot;Is that really necessary to do that right now? We are just trying get our game.&quot;</p>\n\n<p>I can only assumed that the service manager got so frustrated and confused with us because what happened next was absolutely crazy.  A GIANT snot ball came sliding out of his nose, as if his brain is working so hard that it&#39;s squirting things out of his head.  My wife had to turn her back to him for fear of cracking the fuck up and crying at the same time.  No worries friends, he sucked it back up his nose.</p>\n\n<p>It&#39;s 2:06am, I&#39;m frustrated - I&#39;m to the point of tears, hysterical laughter, and anger all rolled into one.  Suddenly, the service manager closes the drawer, grabs our game and prepaid card, and mumbles to himself &quot;I know what I&#39;ll do&quot; as he starts to walk away.  I have to chase him down and ask him where the hell he is going without informing us of what&#39;s going on.  Apparently, he had a brief moment of clarity where his brain reached a higher level of problem solving.  He took us back to the original register, rung up the game, and gave us $10 off as a 3DS promotional game code (which really only amounts to $5 off for our 2 hours of time if you include the $5 prepaid card that NO FUCKING PERSON in the store could figure out).  Holy fucking shit.</p>\n\n<p>Even though I have tried, I don&#39;t think that I can completely convey to you the  complete constellation of incompetency displayed at this Walmart.  It was the biggest clusterfuck of morons all working the same shift and not knowing what the hell to do.  My wife has banned us from entering that location ever again.  She also said that this better be the most amaze balls game ever to be released in the history of games.</p>\n\n<p>TL; DR: played a 2 hr round of hot potato with around 8 incompetent staff. Snot.</p>\n\n<p><strong>Frontpage edit:\nHoly shit didn&#39;t believe this blew up overnight! My wife and I were laughing about it by the time we posted this and went to sleep since it was such an Amazingly bad experience that we actually will remember for a long time. I&#39;ve actually never had a problem before with Walmart, we probably go there 4~8 times a year. Never had a problem until yesterday.</strong></p>\n\n<p><strong>Some clarification on most of the questions asked here:</strong></p>\n\n<p><strong>Why the hell did you even go to walmart?</strong>\nI wanted a physical copy of the game. I actually had pre ordered the game on Newegg/Amazon but both places were going to ship later and I won&#39;t be getting it for a week. There were no stores near me that did midnight release and I chose to pick up the nearest place that carried prepaid card to shop, fuck me right?</p>\n\n<p><strong>Why the hell did you even go to walmart???</strong>\nLesson Learned.</p>\n\n<p><strong>Why did you drag your wife along?</strong>\nBecause I was ronery.</p>\n\n<p><strong>Why are you and your wife such ass holes?</strong>\nMy wife and I have both worked in retail and waited tables as servers, we always tip 20% in restaurants and had NEVER been angry at any one working in those places. Despite the high amount of bitching you read in this post we were actually only bursted out at the last person after 2 ours of frustration for ADDing out while trying to help us when there were so many ways he could have helped us.(We suggested at least 3 ways but he just COULD NOT process the information...)</p>\n\n<p><strong>Why the hell did you not just wait till tomorrow to get the game instead of being a whinny little bitch?</strong>\nRead the story again please, I&#39;d be one of those that will be there and they tell me there is no game PLUS they have no idea how to refund me $5.</p>\n\n<p><strong>So is the game worth it?</strong>\nYes.</p>\n\n<p><strong>Who&#39;s your starter?</strong>\nFroakie. Rolled hasty first try, no female though unfortunately.</p>\n\n<p><strong>Your FC?</strong>\n0576 4758 5944</p>\n\n<p><strong>&quot;You best do something for your wife&quot;</strong>\nTaking her to a fancy restaurant tonight, not only because it&#39;s her bday tomorrow... my love for her forever too.</p>\n\n<p>We are both amazed at so many similar stories some of you shared with us, lesson is learned. Thanks for the nice comments and advice!</p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "user_reports": [],
  "over_18": false,
  "score": 2053,
  "stickied": false,
  "domain": "self.pokemon",
  "is_self": true,
  "hidden": false,
  "_orphaned": {},
  "_api_link": "https://api.reddit.com/r/pokemon/comments/1oa62f/fuck_walmart/?ref=search_posts",
  "_comments_by_id": {},
  "visited": false,
  "thumbnail": "self",
  "_has_fetched": true,
  "gilded": 0,
  "hide_score": false,
  "_info_url": "https://api.reddit.com/api/info/",
  "created_utc": 1381574878.0,
  "subreddit_id": "t5_2qmeb",
  "id": "1oa62f",
  "_params": {},
  "media_embed": {},
  "name": "t3_1oa62f",
  "quarantine": false,
  "permalink": "https://www.reddit.com/r/pokemon/comments/1oa62f/fuck_walmart/?ref=search_posts",
  "ups": 2053,
  "url": "https://www.reddit.com/r/pokemon/comments/1oa62f/fuck_walmart/",
  "title": "Fuck Walmart"
}