{
  "clicked": false,
  "_replaced_more": false,
  "archived": true,
  "num_comments": 327,
  "created": 1406504698.0,
  "saved": false,
  "selftext": "I live in Ontario Canada and the minimum wage here is $11/hour which is shit yeah and that's what I get paid as a part-time Walmart cashier. I knew what I was signing up for obviously when I chose to work there. What really confuses me is people bash on Walmart *all the time* oh they are horrible, they don't pay their associates enough to live on. I'm sorry? Neither does Target here, neither do the other supermarkets, neither do stores at the mall, neither do any fast food restaurants (McDonalds, Burger King etc.) most people employed at Walmart either move up into management, work multiple jobs, or leave because they have a high turnover rate for hiring younger people ages 16-20 roughly. Minimum wage is what it is quit complaining they are legally allowed to provide minimum wage and it's not just Walmart doing it either.\n\nWhy should they choose to pay their associates a higher wage when there's such a high turnover rate and they don't need to?",
  "mod_reports": [],
  "secure_media_embed": {},
  "edited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I live in Ontario Canada and the minimum wage here is $11/hour which is shit yeah and that&#39;s what I get paid as a part-time Walmart cashier. I knew what I was signing up for obviously when I chose to work there. What really confuses me is people bash on Walmart <em>all the time</em> oh they are horrible, they don&#39;t pay their associates enough to live on. I&#39;m sorry? Neither does Target here, neither do the other supermarkets, neither do stores at the mall, neither do any fast food restaurants (McDonalds, Burger King etc.) most people employed at Walmart either move up into management, work multiple jobs, or leave because they have a high turnover rate for hiring younger people ages 16-20 roughly. Minimum wage is what it is quit complaining they are legally allowed to provide minimum wage and it&#39;s not just Walmart doing it either.</p>\n\n<p>Why should they choose to pay their associates a higher wage when there&#39;s such a high turnover rate and they don&#39;t need to?</p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "user_reports": [],
  "over_18": false,
  "score": 266,
  "stickied": false,
  "domain": "self.explainlikeimfive",
  "is_self": true,
  "hidden": false,
  "_orphaned": {},
  "_api_link": "https://api.reddit.com/r/explainlikeimfive/comments/2bw67s/eli5_why_does_everyone_attack_walmart_for_paying/?ref=search_posts",
  "_comments_by_id": {},
  "visited": false,
  "thumbnail": "",
  "_has_fetched": true,
  "gilded": 0,
  "hide_score": false,
  "_info_url": "https://api.reddit.com/api/info/",
  "created_utc": 1406504698.0,
  "subreddit_id": "t5_2sokd",
  "id": "2bw67s",
  "_params": {},
  "media_embed": {},
  "name": "t3_2bw67s",
  "quarantine": false,
  "permalink": "https://www.reddit.com/r/explainlikeimfive/comments/2bw67s/eli5_why_does_everyone_attack_walmart_for_paying/?ref=search_posts",
  "ups": 266,
  "url": "https://www.reddit.com/r/explainlikeimfive/comments/2bw67s/eli5_why_does_everyone_attack_walmart_for_paying/",
  "title": "ELI5: Why does everyone attack Walmart for paying their associates minimum wage when almost every other store does the exact same thing?"
}