{
  "clicked": false,
  "_replaced_more": false,
  "archived": true,
  "num_comments": 486,
  "created": 1301253617.0,
  "saved": false,
  "selftext": "My wife took some photos of our daughter (9 weeks old) to Walmart today to have them printed.  When she returned to pick them up, the photo counter employee told her that she wouldn't be able to take them without a signed affidavit from the photographer releasing the photos.  We took the photos ourselves, in our bedroom, with a sheet as a backdrop.  She spoke to two managers and explained that she had taken them herself, and they didn't believe her.  She wasn't given an option to sign a release herself... They told her the \"real photographer\" would have to sign it.  How can they do this?  It seems to me that they would want to cater to the better photographers that choose to print there.\n\nWe are obviously going to be taking our business elsewhere from now on (Walmart photo was never that good anyway, just convenient to the house).  I have an account w/ Adorama that we'll be using to print everything from now on.  Do we have any recourse against Walmart though?  They have our photos behind the counter and won't release them unless we provide documentation that we cannot possibly obtain.\n\nTL;DR: Walmart won't give us our photos because they think we're trying to rip off a pro photographer.  We're not, and we want our stuff.\n\n**UPDATE** I went back to wally world with my wife and spoke to someone at the photo desk.  She explained that it was Walmart policy that any \"professional-looking\" photos are required to be accompanied by a release form, as well as the \"original media\" that the photos were recorded on.  I asked for a copy of that policy in writing, which she couldn't produce.  I asked at whom's discretion it was determined whether a photo was professional or not, to which she replied \"Mine.\"  She also explained that I would have to have unedited original images from the camera to prove that I took them.  That seems ridiculous to me, so we had them shred the photos in front of us, and we are taking our business elsewhere.  \n\n**UPDATE 2** Here is one of the \"professional\" images for reference.  Looks like a normal babby photo to me.\n[Photo](http://i.imgur.com/ElEHV.jpg)",
  "mod_reports": [],
  "secure_media_embed": {},
  "edited": true,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My wife took some photos of our daughter (9 weeks old) to Walmart today to have them printed.  When she returned to pick them up, the photo counter employee told her that she wouldn&#39;t be able to take them without a signed affidavit from the photographer releasing the photos.  We took the photos ourselves, in our bedroom, with a sheet as a backdrop.  She spoke to two managers and explained that she had taken them herself, and they didn&#39;t believe her.  She wasn&#39;t given an option to sign a release herself... They told her the &quot;real photographer&quot; would have to sign it.  How can they do this?  It seems to me that they would want to cater to the better photographers that choose to print there.</p>\n\n<p>We are obviously going to be taking our business elsewhere from now on (Walmart photo was never that good anyway, just convenient to the house).  I have an account w/ Adorama that we&#39;ll be using to print everything from now on.  Do we have any recourse against Walmart though?  They have our photos behind the counter and won&#39;t release them unless we provide documentation that we cannot possibly obtain.</p>\n\n<p>TL;DR: Walmart won&#39;t give us our photos because they think we&#39;re trying to rip off a pro photographer.  We&#39;re not, and we want our stuff.</p>\n\n<p><strong>UPDATE</strong> I went back to wally world with my wife and spoke to someone at the photo desk.  She explained that it was Walmart policy that any &quot;professional-looking&quot; photos are required to be accompanied by a release form, as well as the &quot;original media&quot; that the photos were recorded on.  I asked for a copy of that policy in writing, which she couldn&#39;t produce.  I asked at whom&#39;s discretion it was determined whether a photo was professional or not, to which she replied &quot;Mine.&quot;  She also explained that I would have to have unedited original images from the camera to prove that I took them.  That seems ridiculous to me, so we had them shred the photos in front of us, and we are taking our business elsewhere.  </p>\n\n<p><strong>UPDATE 2</strong> Here is one of the &quot;professional&quot; images for reference.  Looks like a normal babby photo to me.\n<a href=\"http://i.imgur.com/ElEHV.jpg\">Photo</a></p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "user_reports": [],
  "over_18": false,
  "score": 285,
  "stickied": false,
  "domain": "self.AskReddit",
  "is_self": true,
  "hidden": false,
  "_orphaned": {},
  "_api_link": "https://api.reddit.com/r/AskReddit/comments/gclsg/walmart_wont_print_my_photos_because_they_look/?ref=search_posts",
  "_comments_by_id": {},
  "visited": false,
  "thumbnail": "",
  "_has_fetched": true,
  "gilded": 0,
  "hide_score": false,
  "_info_url": "https://api.reddit.com/api/info/",
  "created_utc": 1301253617.0,
  "subreddit_id": "t5_2qh1i",
  "id": "gclsg",
  "_params": {},
  "media_embed": {},
  "name": "t3_gclsg",
  "quarantine": false,
  "permalink": "https://www.reddit.com/r/AskReddit/comments/gclsg/walmart_wont_print_my_photos_because_they_look/?ref=search_posts",
  "ups": 285,
  "url": "https://www.reddit.com/r/AskReddit/comments/gclsg/walmart_wont_print_my_photos_because_they_look/",
  "title": "Walmart won't print my photos because they \"look professional\"."
}