{
  "selftext": "Hi all,\nA long time ago in Italy we developped an alternative economic system called FAZ. We're not coders, but as we understood about Ethereum, we think that our original idea could be transformed from analogic to digital! The FAZ could be a DAO, negative rate bonds issuance could be a smart contract and soon.. So we decided to publish here our paper, to share the idea with you.\n\n\nThe FAZ, FINANCIAL AUTONOMOUS ZONE is an alternative economic system based on abundance rather than scarcity. The objective of the FAZ is to create communities among people who share values​​, economic and social relationships and productive activities, providing them a legal tool of exchange like a “complementary currency”. The FAZ is a concrete proposal for a structural economic change through an innovative and sustainable socio-productive model of aggregation, based on participation, which facilitates the creation of wealth and its social redistribution both, providing support, protection and development of the local economy, protection of economically weaker sections of the local population and funding increase of public utility services, without increasing debt.\n\nBasicly, adhering to the FAZ, companies, associations, institutions and individuals will have the opportunity to manage their own economic and social relationships using the unique tools provided by the FAZ:\n\n- currency, to be spent within the FAZ\n- loans without interest\n- basic income periodically distributed equally to all participants as a function of the wealth produced in the FAZ.\n\nWhat is it?\n\nPhilosophy of FAZ\n\nPost-scarcity economy. To facilitate change in our society it is necessary to change the economy, basing it on the abundance rather than scarcity. According to Richard Stallman (GNU Manifesto, 1985) and Cory Doctorow (Down and Out in the Magic Kingdom, 2003), an “economy of post-scarcity” is a system for the management and allocation of resources always sufficient to meet the needs perceived by individuals, where instead the economy as we know, or the ‘”economy of scarcity”, is a system in which there is an efficient allocation of scarce resources for definition, or always below the needs perceived by individuals.\n\nAbundant resources. According to Frank Tipler (Physics of Immortality, 1988), resources are unlimited – so abundant but, of course, not endless – on the physical realm, in the sense that they are always sufficient for each living unit in the time of his life. Concrete example of unlimited abundance and yet finished is solar energy: mankind receives from the sun 3,850,000 exajoules of energy each year, while the total power consumption is less than 440 exajoules (Wikipedia). The fact that this abundance is not yet available shows that the problem of resources is an issue to be seen as not-objective but in perspective, that needs to be placed on the cultural level and not on a level of mere counting of them, given a certain capacity utilization. This, in fact, depends on the scientific knowledge, that has a capacity of growth at least equal to the growth of the expansion of the life in the universe.\n\nThe demonstration provided by Frank Tipler is based on considerations of Friedrik Von Hayek (Selected Writings, 1972) according to which the capital of a company is given by the revenue streams generated from the company itself. The corporate capital is not a sum of goods which have their own intrinsic value and it’s how the existing resources are used that determines how the income streams are generated. Income opportunities generated by how the company’s total assets are used is a function of information flows that can be managed by the company itself. It is possible, therefore, to define the resources in terms of opportunities and therefore of information flows, manageable by an organism. Tipler comes to the conclusion that the resources in the universe are always sufficient, since it is demonstrated that the amount of information that can be managed in the lifetime of an organism is necessarily less than the total available information, whatever the speed of management of such information. This organism could be an elemental life, a society, a galaxy or the entire universe and does not change the nature of the phenomenon.\n\nWealth as information. If resources are not infinite but abundant and their use is related to knowledge, must be redefined the concept of wealth. The wealth of a community is given by the ability to organize information flows that generate income opportunities and this ability of the organization depends on the creativity and the cultural level of the given society. If wealth is not material, it follows that it is no longer necessary to be accumulated. That’s change the idea of money, paving the way for the emergence of a not-money that’s a flow before a status, so – as in the case of gift – is possible to conceive a money that can be spended without causing an impoverishment.\n\nThe first and most revolutionary consequence of this assumption is that there is no need for any material accumulation of capital. The capital required for the development of a company is given by the knowledge of a society and their ability to organize it. Without this element, all the raw materials of the world would be useless and could not produce anything.\n\nSocial Capital. This body of knowledge is the “Social Capital”, the engine of development and growth of a society that should be considered a factor of production along with other commonly considered necessary for the production, such as raw materials, labor, financial capital. It is formed by the multiplication of the knowledge of all members of society and is a reciprocal function of the division and specialization of labor. In fact, the increase of the division of labor involves increase of collective knowledge, but also the increase of these involve an increase in the division of labor.\n\nLife Credit. The remuneration of capital as a factor of production justifies a theoretical level the establishment of a basic income, defined “Life Credit”: all members of a society have the right to participate in the distribution of income resulting from the use of a factor of production in the formation of which everyone participates, regardless of any measure of participation, since the capital would serve no purpose without the contribution of all, without that knowledge it would not be possible any activity of production. The Life Credit is a basic income and as a redistribution of the Social Capital proceeds, generates an idea of ​​social equality that does not involve leveling of differences and individual merit, these differences do not translate into economic inequalities but tend to place themselves on the level of social recognition.\n\nInvestment Credit. Is well known that for the Kahn and Keynes multiplier, the investment of a sum involves a return into wealth, ranging from two to five times the investment done. The basic income must be commensurated with the scale of the investments being made in a society and must be derived from the effect of the multiplier that any investment produces in the society. A portion of each investment goes to remunerate the production factors and the risk of enterprise, but another part must remunerate the Social Capital. Currently, however, this part goes into the financial speculation in a downward spiral that can not come to an end because the interest on the monetary capital always tend to grow and to be repaid must generate more debt that will add to the interest component of the total capital. Life Credit does not replace income from work but it complements it and its determination must tend to an amount at least sufficient to subsistence, so that everyone can have the means and the time required to develop their talent and creativity. Only stimulating creativity and freeing at least for the part relating to the vital needs, the income from work, you can get an increase of the Social Capital.\n\nThe creation of money has to be carried out on investment on a strictly automatic basis. This prevents the management of the credit to be transformed into a discretionary power which is absolutely deleterious whether it is managed according to a political criterion, whether it is instead held by technicians who, through it, handle enormous power. The Social Capital may be expressed by a number which substantially coincides with the money supply as a whole or a portion of it. Of course, this coincidence will be much more precise in an economic environment that issues money on investment, but roughly even today we can say that in essence the non-speculative money supply (ie the set of financial instruments, which provide money excluding substantial part of the derivatives instruments) coincides with the Social Capital.\n\nWe can determine the individual credit capacity in the amount of money supply of each member of a society. A share on which each can have credit and must have at its request. We define it “Investment Credit”. This credit capacity can be transferred to a third party exactly as now you are buying shares of a company on the stock exchange or at the time of the enterprise constitution. From the individual point of view, when someone asks for a loan based on his credit capacity, this resets and reconstitutes itself as the person returns the credit obtained.\n\nBriefly the FAZ after has a request to carry out an activity, creates the money by issuing a sum for investment, (Investment Credit), and consistent with the timing of the realization of this, it creates a corresponding sum to be distributed among all the participants (Life Credit). This issue is fully justified in the Fisher equation on investments, since an increase of the activity must need an increase in the money supply.\n\nNot-Money. In the FAZ, money is issued in the form of negative rate bonds (TITAN). The money supply is made up of different monetary instruments and paper money is only one of them. Another tool is the bond. The proposal is to issue negative rate bonds expressed into the currency existing in a country (euro, dollar, yen, etc. ..).\n\nThis has two important consequences: the first is that the money does not create debt or interest and the second is that it disappears from the system as the assets that it has helped to create become obsolete. The level of negative rate depends on a function that is described by the average rate of obsolescence of the created assets. The negative rate also prevent the accumulation of financial capital and promotes maximum velocity of money circulation (demurrage). The loss of value, namely money supply, is crucial to create a not scarce money. Since the currency gradually expires and leaves the money supply which decreases, you can issue money in surplus, in fact operating a keynesian “deficit spending” without creating debt. The inability to accumulate the money will eliminate the problem of the liquidity trap that’s one of the problems underlying the current financial crisis and the inability to get out. At the same time, on the perspective view of the Fisher equation, the negative rate describes an economic environment that tend to be deflationary, since the money supply tends to decrease gradually and grows only for investments. If wealth creation is greater than the factor of two hypothesized, the prices should tend to decline and this could justify further issues of money as Life Credit. This environment makes reasonable the Say’s law, since each issue of money for investment is accompanied by a for monetary emission for consumption and therefore favoring their collocation.\n\nWhile the ordinary positive rate bonds are issued as loans to fund the issuer and therefore must be redeemed at maturity, the negative rate bonds, since at the end have zero value and therefore the issuer does not have to repay the principal, may be given away for free. While remaining “official” circulating money in all respects, because bonds and banknotes are legal instrument of payment both.\n\nIn the current system there have been several negative emissions rate bonds, convertible bonds generally have a fixed date with a warrant negative in anticipation of a strong increase of the shares to be converted. One of these loans was issued long ago from the bottom of Warren Buffett and signed by more than a billion dollars in a few hours, another issue of bonds with negative rate was carried out in 2001 by the Société Générale in yen on the expectation of deflation in Japan that would reduced the prices of goods to a greater extent the negative rate applied.\n\nBeyond the WIR. In the thirties, a group of Swiss entrepreneurs, in order to cope with the crisis of 1929 that can be compared with the current – with a 50% unemployment rate and a dramatic shortage of liquidity – decided to began to print money. They were 16 on 1934. They made a particular kind of money, that could not be accumulated because it was burdened with a negative rate – a “demurrage” as we say in technical terms – so after a certain period completely it lost its value. They called it WIR, abbreviation of “Wirtschaftsring”, which in german means “economic circuit” and also “we”. The association took the unredeemable debts of the members -, which are fractions of the Social Capital – and gave him in exchange for an equivalent in WIR currency, with which the member could make payments only within the circuit. In a few months the members and the association became thousands. WIR contributed to the recovery and stability of the Swiss economy during those difficult times. The experience is then continued in the post-war period, and the association at some point has turned into a bank. It had to give up negative rate due the diktat of the Swiss Central Bank, but the operations are still made at zero rate. Currently the WIR circuit counts 65,000 companies in 2011 and has made loans totaling more than 18 billion Swiss francs.\n\nOur project aims to retrace the WIR road, excellent for small and medium-sized enterprises, with the necessary adjustments and corrections suggested by the past experiences, involving in the project not only businesses but also individuals and governments.\n\nConclusions\n\nIn conclusion, the FAZ is the most direct way to build a society based on the solidarity behavior without requiring sacrifices and relying rather, on selfish individual. It’s a tool that supports aggregate demand, resulting in recovery of the real local economy, do not create harm to the economic and financial system because it does not affect the debt and encourages the development / evolution of the network culture and society. The not-money is a measure that prevents the accumulation of money and drives people to spend the money to feed their skills and therefore their creativity. In the end, the main stimulus will be the individuals’ creativity and the achievement of ambitious personal and collective targets. Using the same logic that drives the open source world, people will be brought to work together to seek personal glory and not money which only became an unit of account. It will be a long and painful process to remove from the minds of the people the gods of money and its salvific function. But in the end, the not-money has essentially this function: if the value is no longer in things but in people, what is the point to look out for himself?\nHow it works?\n\nFAZ Making\n\nThe FAZ is a structure in which circulate negative rate bonds used legally “as is” money, with which you can create wealth through loans to companies and individuals, and with whom you can redistribute wealth through a basic income to all its participants. The FAZ consists of two subjects, one that issues the money in the form of negative rate bonds and one that accepts and redistributes them respectively which investment credits and life credits. (Note: the latin law legal entities are different from the common law legal entities, so these are to be further analyzed to understand if their features are effective and similar to latin law ones)\n\n1. The FAZ Company. The Public Limited Company (PLC) is the entity which issues the not-money. It can be of two kinds, promoted by public entities (municipalities, provinces, regions, etc. ..), through public controlled companies, with which they can fund new public services and provide basic income to their citizens, without increasing their debt . Or promoted by private companies, through the establishment of a consortium company (syndacate), with which they can increase their business, fund new activities and deliver a social dividend to all members of the consortium, without increasing their debts.\n\n2. The FAZ Association. The Association is the entity which accepts and redistributes the not-money. It consists of individuals, companies and associations. Receives investments’ funds, which distributes to natural and legal persons, and receives the basic income, which distributes to all members of the Association. Inside it there is a Scientific Committee that conducts research and development.\n\nSo the FAZ is of two kinds:\n\nThe Public FAZ, consisting of a public owned company (issuing entity) and the FAZ Association (entity of acceptance and redistribution). The relationship between the company and the Association is governed by a contract. The Public FAZ is carried out by the Public Entity by means of a public company which already exists and then it will enter into an agreement with the Association.\n\nThe Private FAZ, consisting of a private owned company (issuing entity), formed by member companies, and the FAZ Association. The relationship between the company and the Association is governed by a contract. The Private FAZ is performed by private companies through a consortium company – to be established by the member companies through the transfer of unredeemable credits (but not formally written off) to form the shares’ capital – which will enter into an agreement with the FAZ Association.\n\nFAZ Operation\n\nIssuance of negative rate bonds. To corporations is granted the right to issue bonds up to a maximum of twice the share capital, legal reserve and reserves resulting from the approved budget (in latin law). The company then emits negative rate bonds: a first issue for Investment Credit will be underwritten by the Association who will dispense shares to the associated companies and individuals to fund economic projects proposed by those, a second issue for Life Credit will be underwritten by the Association, who will dispense shares to associated individuals as universal and unconditional basic income.\n\nThe bonds will be issued to fund works, production of goods and services, and the rate will be determined by the company managers, upon the proposal of the Association Scientific Committee, taking into account the obsolescence average level of the goods and services produced, so that the life of the created money will be equal to the assets’ life created through investments. Bonds will be issued subsequently taking account of the consistency of production favoured by past emissions, otherwise they will have no justification. Automatic mechanisms for the money issuance and transparency in the accounts’ management will be fundamental FAZ principles, so that no one can have the power of decision in creation of money for investment. The goal is to avoid the possibility that arises a power on currency management. After the emission for investments, there will be an issuance to support demand through provision of basic income to all FAZ members. The circulation of not-money facilitates the creation and development of an economic circuit in which partners can find a market for their goods, as well as aiding the recovery of general well-being through the provision of basic income that stimulates demand.\n\nAt the end of the loan, if it is chosen to issue bond in the form of convertible bonds, is distributed by the issuer among the bonds’ holders a company’s share of a value equal to the rate of increase of wealth made from that investment, distribution which results in an individual credit capacity increase.\n\nThe negative rate bonds may be issued in two ways: (1) Materialized issuance. The issuance of bonds takes place in this way: on paper, in bearer form, with a fixed coupon, at par, with a negative rate of 5% annually, during twenty-year. The bonds are printed in paper form with free graphics, in units of 1, 5, 10, 50 units (i.e. Euros), and report the information required by law. (2) dematerialized issuance. The issuance of bonds takes place in this way: in electronic form, in bearer form, with a fixed coupon, at par, with a negative rate of 5% annually, during twenty-year. The electronic bonds are entered into a electronic bonds’ custody at a bank.\n\nAccession clauses. The relationship between the FAZ members are governed by the Statute of the Association, by the Statute of the Company and by the contract between the Company and the Association. As the contracts are regulated by the law, can be foreseen in case of breach of contract (i.e. a member that get out the FAZ without authorization) financial penalties.\n\n1) to accept, for the exchange of their goods, services and / or activities, to practice a reduction of the price in national currency (i.e. euro) of at least 50% and accept for the rest the negative rate bonds. Obviously, a firm may decide to allocate a part of their production activities within the association and to handle the rest in the national currency (i.e. Euros) as it is commonly done. The important thing is that the price is reduced by at least 50%, as well as the remuneration of the members’ activities will be reduced by 50% and the rest will be paid with the new money. This means that the Association will also become the occasion for meetings between labor supply and demand at conditions that will be supposedly better than the current ones.\n\n2) to do not engage in price increases within the Faz and pricing its products in negative rate bonds;\n\n3) to use for the transactions in negative rate bonds the electronic exchange system operated by the Association;\n\n4) to accept that the bonds are burdened by a negative rate whose measurement is determined periodically by the Assembly of the Association within the range indicated by the Scientific Committee;\n\n5) to accept that the company will emit and distribute negative rate bonds as Life Credit to all members according to criteria set by the Scientific Committee, which are generally commensurate with the total wealth of society (the so-called Social Capital);\n\n6) to comply with the general operating rules and the decisions of the Association.\n\nTax aspects. For the fiscal aspects of the operation, the emissions can be considered as discounts of the list price of the goods and there is a precedent in this direction with decisions of the (italian) Tax Agency on the proper handling of receipts and invoices. Even the acceptance of a negative rate bond, which at the end will be near zero, can be considered as a discount on the total price, just because you take something in return, from the point of view of capital, is zero or close to it. In this respect, one can imagine that the Association is a structure in which it is practiced solidarity among the members who apply substantial discounts between them.\n\nCosts. The costs for the FAZ creation are dependent on the amplitude of the circuit and the complexity of exchange that you want to implement. In general, however, the cost to be taken into account are:\n\n- Administrative: Company and Association incorporation; printing costs for the issuance of paper bonds or holding securities custody for electronic issued bonds;\n- Technological: personalization and program management account maintenance and construction and maintenance of the website and the server;\n- Marketing: preparation and printing of publicity materials initiative and promotion activities;\n- Management control. To make the management control it must be operating a research center that monitors economic activities within the circuit and carries out the analysis and measurements necessary to propose the decisions of its competence; ",
  "gilded": 0,
  "score": 4,
  "removal_reason": null,
  "approved_by": null,
  "created_utc": 1441318679.0,
  "is_self": true,
  "stickied": false,
  "edited": false,
  "distinguished": null,
  "permalink": "https://www.reddit.com/r/CryptoUBI/comments/3jjlyc/faz_financially_autonomous_zone/?ref=search_posts",
  "banned_by": null,
  "from_id": null,
  "likes": null,
  "_underscore_names": null,
  "num_reports": null,
  "link_flair_css_class": null,
  "_info_url": "https://api.reddit.com/api/info/",
  "id": "3jjlyc",
  "archived": false,
  "secure_media": null,
  "from_kind": null,
  "saved": false,
  "domain": "self.CryptoUBI",
  "ups": 4,
  "suggested_sort": null,
  "quarantine": false,
  "over_18": false,
  "hide_score": false,
  "url": "https://www.reddit.com/r/CryptoUBI/comments/3jjlyc/faz_financially_autonomous_zone/",
  "subreddit_id": "t5_312n4",
  "_params": {},
  "_comments": null,
  "_replaced_more": false,
  "_comments_by_id": {},
  "user_reports": [],
  "media_embed": {},
  "created": 1441322279.0,
  "author_flair_text": null,
  "visited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi all,\nA long time ago in Italy we developped an alternative economic system called FAZ. We&#39;re not coders, but as we understood about Ethereum, we think that our original idea could be transformed from analogic to digital! The FAZ could be a DAO, negative rate bonds issuance could be a smart contract and soon.. So we decided to publish here our paper, to share the idea with you.</p>\n\n<p>The FAZ, FINANCIAL AUTONOMOUS ZONE is an alternative economic system based on abundance rather than scarcity. The objective of the FAZ is to create communities among people who share values​​, economic and social relationships and productive activities, providing them a legal tool of exchange like a “complementary currency”. The FAZ is a concrete proposal for a structural economic change through an innovative and sustainable socio-productive model of aggregation, based on participation, which facilitates the creation of wealth and its social redistribution both, providing support, protection and development of the local economy, protection of economically weaker sections of the local population and funding increase of public utility services, without increasing debt.</p>\n\n<p>Basicly, adhering to the FAZ, companies, associations, institutions and individuals will have the opportunity to manage their own economic and social relationships using the unique tools provided by the FAZ:</p>\n\n<ul>\n<li>currency, to be spent within the FAZ</li>\n<li>loans without interest</li>\n<li>basic income periodically distributed equally to all participants as a function of the wealth produced in the FAZ.</li>\n</ul>\n\n<p>What is it?</p>\n\n<p>Philosophy of FAZ</p>\n\n<p>Post-scarcity economy. To facilitate change in our society it is necessary to change the economy, basing it on the abundance rather than scarcity. According to Richard Stallman (GNU Manifesto, 1985) and Cory Doctorow (Down and Out in the Magic Kingdom, 2003), an “economy of post-scarcity” is a system for the management and allocation of resources always sufficient to meet the needs perceived by individuals, where instead the economy as we know, or the ‘”economy of scarcity”, is a system in which there is an efficient allocation of scarce resources for definition, or always below the needs perceived by individuals.</p>\n\n<p>Abundant resources. According to Frank Tipler (Physics of Immortality, 1988), resources are unlimited – so abundant but, of course, not endless – on the physical realm, in the sense that they are always sufficient for each living unit in the time of his life. Concrete example of unlimited abundance and yet finished is solar energy: mankind receives from the sun 3,850,000 exajoules of energy each year, while the total power consumption is less than 440 exajoules (Wikipedia). The fact that this abundance is not yet available shows that the problem of resources is an issue to be seen as not-objective but in perspective, that needs to be placed on the cultural level and not on a level of mere counting of them, given a certain capacity utilization. This, in fact, depends on the scientific knowledge, that has a capacity of growth at least equal to the growth of the expansion of the life in the universe.</p>\n\n<p>The demonstration provided by Frank Tipler is based on considerations of Friedrik Von Hayek (Selected Writings, 1972) according to which the capital of a company is given by the revenue streams generated from the company itself. The corporate capital is not a sum of goods which have their own intrinsic value and it’s how the existing resources are used that determines how the income streams are generated. Income opportunities generated by how the company’s total assets are used is a function of information flows that can be managed by the company itself. It is possible, therefore, to define the resources in terms of opportunities and therefore of information flows, manageable by an organism. Tipler comes to the conclusion that the resources in the universe are always sufficient, since it is demonstrated that the amount of information that can be managed in the lifetime of an organism is necessarily less than the total available information, whatever the speed of management of such information. This organism could be an elemental life, a society, a galaxy or the entire universe and does not change the nature of the phenomenon.</p>\n\n<p>Wealth as information. If resources are not infinite but abundant and their use is related to knowledge, must be redefined the concept of wealth. The wealth of a community is given by the ability to organize information flows that generate income opportunities and this ability of the organization depends on the creativity and the cultural level of the given society. If wealth is not material, it follows that it is no longer necessary to be accumulated. That’s change the idea of money, paving the way for the emergence of a not-money that’s a flow before a status, so – as in the case of gift – is possible to conceive a money that can be spended without causing an impoverishment.</p>\n\n<p>The first and most revolutionary consequence of this assumption is that there is no need for any material accumulation of capital. The capital required for the development of a company is given by the knowledge of a society and their ability to organize it. Without this element, all the raw materials of the world would be useless and could not produce anything.</p>\n\n<p>Social Capital. This body of knowledge is the “Social Capital”, the engine of development and growth of a society that should be considered a factor of production along with other commonly considered necessary for the production, such as raw materials, labor, financial capital. It is formed by the multiplication of the knowledge of all members of society and is a reciprocal function of the division and specialization of labor. In fact, the increase of the division of labor involves increase of collective knowledge, but also the increase of these involve an increase in the division of labor.</p>\n\n<p>Life Credit. The remuneration of capital as a factor of production justifies a theoretical level the establishment of a basic income, defined “Life Credit”: all members of a society have the right to participate in the distribution of income resulting from the use of a factor of production in the formation of which everyone participates, regardless of any measure of participation, since the capital would serve no purpose without the contribution of all, without that knowledge it would not be possible any activity of production. The Life Credit is a basic income and as a redistribution of the Social Capital proceeds, generates an idea of ​​social equality that does not involve leveling of differences and individual merit, these differences do not translate into economic inequalities but tend to place themselves on the level of social recognition.</p>\n\n<p>Investment Credit. Is well known that for the Kahn and Keynes multiplier, the investment of a sum involves a return into wealth, ranging from two to five times the investment done. The basic income must be commensurated with the scale of the investments being made in a society and must be derived from the effect of the multiplier that any investment produces in the society. A portion of each investment goes to remunerate the production factors and the risk of enterprise, but another part must remunerate the Social Capital. Currently, however, this part goes into the financial speculation in a downward spiral that can not come to an end because the interest on the monetary capital always tend to grow and to be repaid must generate more debt that will add to the interest component of the total capital. Life Credit does not replace income from work but it complements it and its determination must tend to an amount at least sufficient to subsistence, so that everyone can have the means and the time required to develop their talent and creativity. Only stimulating creativity and freeing at least for the part relating to the vital needs, the income from work, you can get an increase of the Social Capital.</p>\n\n<p>The creation of money has to be carried out on investment on a strictly automatic basis. This prevents the management of the credit to be transformed into a discretionary power which is absolutely deleterious whether it is managed according to a political criterion, whether it is instead held by technicians who, through it, handle enormous power. The Social Capital may be expressed by a number which substantially coincides with the money supply as a whole or a portion of it. Of course, this coincidence will be much more precise in an economic environment that issues money on investment, but roughly even today we can say that in essence the non-speculative money supply (ie the set of financial instruments, which provide money excluding substantial part of the derivatives instruments) coincides with the Social Capital.</p>\n\n<p>We can determine the individual credit capacity in the amount of money supply of each member of a society. A share on which each can have credit and must have at its request. We define it “Investment Credit”. This credit capacity can be transferred to a third party exactly as now you are buying shares of a company on the stock exchange or at the time of the enterprise constitution. From the individual point of view, when someone asks for a loan based on his credit capacity, this resets and reconstitutes itself as the person returns the credit obtained.</p>\n\n<p>Briefly the FAZ after has a request to carry out an activity, creates the money by issuing a sum for investment, (Investment Credit), and consistent with the timing of the realization of this, it creates a corresponding sum to be distributed among all the participants (Life Credit). This issue is fully justified in the Fisher equation on investments, since an increase of the activity must need an increase in the money supply.</p>\n\n<p>Not-Money. In the FAZ, money is issued in the form of negative rate bonds (TITAN). The money supply is made up of different monetary instruments and paper money is only one of them. Another tool is the bond. The proposal is to issue negative rate bonds expressed into the currency existing in a country (euro, dollar, yen, etc. ..).</p>\n\n<p>This has two important consequences: the first is that the money does not create debt or interest and the second is that it disappears from the system as the assets that it has helped to create become obsolete. The level of negative rate depends on a function that is described by the average rate of obsolescence of the created assets. The negative rate also prevent the accumulation of financial capital and promotes maximum velocity of money circulation (demurrage). The loss of value, namely money supply, is crucial to create a not scarce money. Since the currency gradually expires and leaves the money supply which decreases, you can issue money in surplus, in fact operating a keynesian “deficit spending” without creating debt. The inability to accumulate the money will eliminate the problem of the liquidity trap that’s one of the problems underlying the current financial crisis and the inability to get out. At the same time, on the perspective view of the Fisher equation, the negative rate describes an economic environment that tend to be deflationary, since the money supply tends to decrease gradually and grows only for investments. If wealth creation is greater than the factor of two hypothesized, the prices should tend to decline and this could justify further issues of money as Life Credit. This environment makes reasonable the Say’s law, since each issue of money for investment is accompanied by a for monetary emission for consumption and therefore favoring their collocation.</p>\n\n<p>While the ordinary positive rate bonds are issued as loans to fund the issuer and therefore must be redeemed at maturity, the negative rate bonds, since at the end have zero value and therefore the issuer does not have to repay the principal, may be given away for free. While remaining “official” circulating money in all respects, because bonds and banknotes are legal instrument of payment both.</p>\n\n<p>In the current system there have been several negative emissions rate bonds, convertible bonds generally have a fixed date with a warrant negative in anticipation of a strong increase of the shares to be converted. One of these loans was issued long ago from the bottom of Warren Buffett and signed by more than a billion dollars in a few hours, another issue of bonds with negative rate was carried out in 2001 by the Société Générale in yen on the expectation of deflation in Japan that would reduced the prices of goods to a greater extent the negative rate applied.</p>\n\n<p>Beyond the WIR. In the thirties, a group of Swiss entrepreneurs, in order to cope with the crisis of 1929 that can be compared with the current – with a 50% unemployment rate and a dramatic shortage of liquidity – decided to began to print money. They were 16 on 1934. They made a particular kind of money, that could not be accumulated because it was burdened with a negative rate – a “demurrage” as we say in technical terms – so after a certain period completely it lost its value. They called it WIR, abbreviation of “Wirtschaftsring”, which in german means “economic circuit” and also “we”. The association took the unredeemable debts of the members -, which are fractions of the Social Capital – and gave him in exchange for an equivalent in WIR currency, with which the member could make payments only within the circuit. In a few months the members and the association became thousands. WIR contributed to the recovery and stability of the Swiss economy during those difficult times. The experience is then continued in the post-war period, and the association at some point has turned into a bank. It had to give up negative rate due the diktat of the Swiss Central Bank, but the operations are still made at zero rate. Currently the WIR circuit counts 65,000 companies in 2011 and has made loans totaling more than 18 billion Swiss francs.</p>\n\n<p>Our project aims to retrace the WIR road, excellent for small and medium-sized enterprises, with the necessary adjustments and corrections suggested by the past experiences, involving in the project not only businesses but also individuals and governments.</p>\n\n<p>Conclusions</p>\n\n<p>In conclusion, the FAZ is the most direct way to build a society based on the solidarity behavior without requiring sacrifices and relying rather, on selfish individual. It’s a tool that supports aggregate demand, resulting in recovery of the real local economy, do not create harm to the economic and financial system because it does not affect the debt and encourages the development / evolution of the network culture and society. The not-money is a measure that prevents the accumulation of money and drives people to spend the money to feed their skills and therefore their creativity. In the end, the main stimulus will be the individuals’ creativity and the achievement of ambitious personal and collective targets. Using the same logic that drives the open source world, people will be brought to work together to seek personal glory and not money which only became an unit of account. It will be a long and painful process to remove from the minds of the people the gods of money and its salvific function. But in the end, the not-money has essentially this function: if the value is no longer in things but in people, what is the point to look out for himself?\nHow it works?</p>\n\n<p>FAZ Making</p>\n\n<p>The FAZ is a structure in which circulate negative rate bonds used legally “as is” money, with which you can create wealth through loans to companies and individuals, and with whom you can redistribute wealth through a basic income to all its participants. The FAZ consists of two subjects, one that issues the money in the form of negative rate bonds and one that accepts and redistributes them respectively which investment credits and life credits. (Note: the latin law legal entities are different from the common law legal entities, so these are to be further analyzed to understand if their features are effective and similar to latin law ones)</p>\n\n<ol>\n<li><p>The FAZ Company. The Public Limited Company (PLC) is the entity which issues the not-money. It can be of two kinds, promoted by public entities (municipalities, provinces, regions, etc. ..), through public controlled companies, with which they can fund new public services and provide basic income to their citizens, without increasing their debt . Or promoted by private companies, through the establishment of a consortium company (syndacate), with which they can increase their business, fund new activities and deliver a social dividend to all members of the consortium, without increasing their debts.</p></li>\n<li><p>The FAZ Association. The Association is the entity which accepts and redistributes the not-money. It consists of individuals, companies and associations. Receives investments’ funds, which distributes to natural and legal persons, and receives the basic income, which distributes to all members of the Association. Inside it there is a Scientific Committee that conducts research and development.</p></li>\n</ol>\n\n<p>So the FAZ is of two kinds:</p>\n\n<p>The Public FAZ, consisting of a public owned company (issuing entity) and the FAZ Association (entity of acceptance and redistribution). The relationship between the company and the Association is governed by a contract. The Public FAZ is carried out by the Public Entity by means of a public company which already exists and then it will enter into an agreement with the Association.</p>\n\n<p>The Private FAZ, consisting of a private owned company (issuing entity), formed by member companies, and the FAZ Association. The relationship between the company and the Association is governed by a contract. The Private FAZ is performed by private companies through a consortium company – to be established by the member companies through the transfer of unredeemable credits (but not formally written off) to form the shares’ capital – which will enter into an agreement with the FAZ Association.</p>\n\n<p>FAZ Operation</p>\n\n<p>Issuance of negative rate bonds. To corporations is granted the right to issue bonds up to a maximum of twice the share capital, legal reserve and reserves resulting from the approved budget (in latin law). The company then emits negative rate bonds: a first issue for Investment Credit will be underwritten by the Association who will dispense shares to the associated companies and individuals to fund economic projects proposed by those, a second issue for Life Credit will be underwritten by the Association, who will dispense shares to associated individuals as universal and unconditional basic income.</p>\n\n<p>The bonds will be issued to fund works, production of goods and services, and the rate will be determined by the company managers, upon the proposal of the Association Scientific Committee, taking into account the obsolescence average level of the goods and services produced, so that the life of the created money will be equal to the assets’ life created through investments. Bonds will be issued subsequently taking account of the consistency of production favoured by past emissions, otherwise they will have no justification. Automatic mechanisms for the money issuance and transparency in the accounts’ management will be fundamental FAZ principles, so that no one can have the power of decision in creation of money for investment. The goal is to avoid the possibility that arises a power on currency management. After the emission for investments, there will be an issuance to support demand through provision of basic income to all FAZ members. The circulation of not-money facilitates the creation and development of an economic circuit in which partners can find a market for their goods, as well as aiding the recovery of general well-being through the provision of basic income that stimulates demand.</p>\n\n<p>At the end of the loan, if it is chosen to issue bond in the form of convertible bonds, is distributed by the issuer among the bonds’ holders a company’s share of a value equal to the rate of increase of wealth made from that investment, distribution which results in an individual credit capacity increase.</p>\n\n<p>The negative rate bonds may be issued in two ways: (1) Materialized issuance. The issuance of bonds takes place in this way: on paper, in bearer form, with a fixed coupon, at par, with a negative rate of 5% annually, during twenty-year. The bonds are printed in paper form with free graphics, in units of 1, 5, 10, 50 units (i.e. Euros), and report the information required by law. (2) dematerialized issuance. The issuance of bonds takes place in this way: in electronic form, in bearer form, with a fixed coupon, at par, with a negative rate of 5% annually, during twenty-year. The electronic bonds are entered into a electronic bonds’ custody at a bank.</p>\n\n<p>Accession clauses. The relationship between the FAZ members are governed by the Statute of the Association, by the Statute of the Company and by the contract between the Company and the Association. As the contracts are regulated by the law, can be foreseen in case of breach of contract (i.e. a member that get out the FAZ without authorization) financial penalties.</p>\n\n<p>1) to accept, for the exchange of their goods, services and / or activities, to practice a reduction of the price in national currency (i.e. euro) of at least 50% and accept for the rest the negative rate bonds. Obviously, a firm may decide to allocate a part of their production activities within the association and to handle the rest in the national currency (i.e. Euros) as it is commonly done. The important thing is that the price is reduced by at least 50%, as well as the remuneration of the members’ activities will be reduced by 50% and the rest will be paid with the new money. This means that the Association will also become the occasion for meetings between labor supply and demand at conditions that will be supposedly better than the current ones.</p>\n\n<p>2) to do not engage in price increases within the Faz and pricing its products in negative rate bonds;</p>\n\n<p>3) to use for the transactions in negative rate bonds the electronic exchange system operated by the Association;</p>\n\n<p>4) to accept that the bonds are burdened by a negative rate whose measurement is determined periodically by the Assembly of the Association within the range indicated by the Scientific Committee;</p>\n\n<p>5) to accept that the company will emit and distribute negative rate bonds as Life Credit to all members according to criteria set by the Scientific Committee, which are generally commensurate with the total wealth of society (the so-called Social Capital);</p>\n\n<p>6) to comply with the general operating rules and the decisions of the Association.</p>\n\n<p>Tax aspects. For the fiscal aspects of the operation, the emissions can be considered as discounts of the list price of the goods and there is a precedent in this direction with decisions of the (italian) Tax Agency on the proper handling of receipts and invoices. Even the acceptance of a negative rate bond, which at the end will be near zero, can be considered as a discount on the total price, just because you take something in return, from the point of view of capital, is zero or close to it. In this respect, one can imagine that the Association is a structure in which it is practiced solidarity among the members who apply substantial discounts between them.</p>\n\n<p>Costs. The costs for the FAZ creation are dependent on the amplitude of the circuit and the complexity of exchange that you want to implement. In general, however, the cost to be taken into account are:</p>\n\n<ul>\n<li>Administrative: Company and Association incorporation; printing costs for the issuance of paper bonds or holding securities custody for electronic issued bonds;</li>\n<li>Technological: personalization and program management account maintenance and construction and maintenance of the website and the server;</li>\n<li>Marketing: preparation and printing of publicity materials initiative and promotion activities;</li>\n<li>Management control. To make the management control it must be operating a research center that monitors economic activities within the circuit and carries out the analysis and measurements necessary to propose the decisions of its competence; </li>\n</ul>\n</div><!-- SC_ON -->",
  "downs": 0,
  "_comment_sort": null,
  "report_reasons": null,
  "name": "t3_3jjlyc",
  "from": null,
  "hidden": false,
  "clicked": false,
  "media": null,
  "json_dict": null,
  "_api_link": "https://api.reddit.com/r/CryptoUBI/comments/3jjlyc/faz_financially_autonomous_zone/?ref=search_posts",
  "secure_media_embed": {},
  "mod_reports": [],
  "_orphaned": {},
  "_uniq": null,
  "num_comments": 0,
  "link_flair_text": null,
  "title": "F.A.Z., Financially Autonomous Zone",
  "_has_fetched": true,
  "author_flair_css_class": null,
  "thumbnail": ""
}