{
  "downs": 0,
  "mod_reports": [],
  "secure_media_embed": {},
  "_info_url": "https://api.reddit.com/api/info/",
  "gilded": 0,
  "num_comments": 8,
  "_orphaned": {},
  "hidden": false,
  "ups": 66,
  "url": "https://www.reddit.com/r/respectthreads/comments/2paoj5/respect_bruce_lee/",
  "_has_fetched": true,
  "quarantine": false,
  "name": "t3_2paoj5",
  "user_reports": [],
  "saved": false,
  "permalink": "https://www.reddit.com/r/respectthreads/comments/2paoj5/respect_bruce_lee/?ref=search_posts",
  "over_18": false,
  "is_self": true,
  "_params": {},
  "thumbnail": "",
  "created_utc": 1418594218.0,
  "_replaced_more": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h3>Warning - Bruce Lee Movie Spoilers Below - If you haven&#39;t watched any of Bruce Lee&#39;s legendary martial arts films, there are major scenes from his movies in this thread. I can&#39;t recommend enough that you watch these prime examples of quality action cinema and get to see them in their intended context so you can enjoy it fully as I did.</h3>\n\n<hr/>\n\n<p><a href=\"http://i.imgur.com/kOgddXA.jpg\">Bruce Lee</a>, born in 1940 in San Francisco, California and raised in China, stood at 5&#39;7.5&quot; and typically weighed no more than 140lbs. He studied Wing Chun under Yip Man at the age of 13. He moved back to the US at 18 years old due to excessive fights with rival gangs and studied Philosophy at the University of Washington.</p>\n\n<p>After a dissatisfying fight against a Choy Li Fut man in 1964, he revamped his fighting style, incorporating heavy weight training and tactics, moves and strategies from other arts, such as fencing, judo, jiu-jitsu, karate, and western boxing. During the late 1960&#39;s, Bruce trained Chuck Norris, Joe Lewis, and Mike Stone, who were the top karate competitors of the time, collectively having won every major karate tournament in the US. When he damaged a spinal nerve while weight training in 1970 and was bed-ridden for six months, he put on paper his ideas and philosophy for his martial art, Jeet Kune Do, the Way of the Intercepting Fist.</p>\n\n<p>He passed away on July 20, 1973 due to a hypersensitive reaction to some medication for a headache which caused an increase of the fluids in the brain. He starred in five major films: The Big Boss (1971), Fist of Fury (1972), Way of the Dragon (1972), Enter the Dragon (1973), and The Game of Death (posthumous).</p>\n\n<h3>Physical Fitness</h3>\n\n<blockquote>\n<p><em>&quot;Some guys may not believe it, but I spent hours perfecting whatever I did.&quot;<br/>\n-Bruce Lee</em></p>\n</blockquote>\n\n<p><a href=\"http://gfycat.com/ThirdInfantileHairstreakbutterfly\">The Lat Spread</a> - (WotD) Bruce was renowned for his enormous latissimus dorsi muscles.<br/>\n<a href=\"http://gfycat.com/UnevenScalyKillifish\">The Lat Spread 2: Electric Boogaloo</a> - (WotD) Before the fight with Chuck Norris, Bruce stretches his forearms then displays his front lat spread.<br/>\n<a href=\"http://i.imgur.com/OJpctwH.jpg\">Shredded</a> - He was shredded in every picture and his abs were legendary.<br/>\n<a href=\"http://gfycat.com/DistortedEducatedDunnart\">Shirtless and Slow motion</a> - (EtD) Bruce looking ripped killing some dude in slow motion.<br/>\n<a href=\"http://i.imgur.com/UPAjOIh.jpg\">V-Sit</a> - (GoD) Image of Bruce Lee performing an elevated V-Sit, an advanced bodyweight exercise. Notice the straight legs and good shoulder depression and retraction.<br/>\n<a href=\"http://gfycat.com/SerpentinePettyGadwall\">Planche Attack</a> - (GoD) In a ridiculous scene from the Game of Death, Bruce Lee performs a planche into handstand to get out of a dangerous situation. <a href=\"http://gfycat.com/FineAccomplishedGemsbok\">Here&#39;s a different take that cuts the camera at the waist.</a><br/>\n<a href=\"http://i.imgur.com/pm4h26G.jpg\">Headkick to Kareem</a> - (GoD) A still on the set of the Game of Death showing Bruce performing a hook kick to the head of co-star and student, Kareem Abdul-Jabbar, who stands at a daunting 7&#39;2&quot;.<br/>\n<a href=\"http://i.imgur.com/cNCQyKn.jpg\">Jumpkick to Kareem</a> - (GoD) A shot of Bruce performing a jump kick on Kareem.<br/>\n<a href=\"http://gfycat.com/ElectricPaleBanteng\">Jumpkick to Kareem Scene</a> - (GoD) And an unusued scene from the Game of Death of Bruce performing the jump kick on Kareem in action.<br/>\n<a href=\"http://gfycat.com/CluelessOpenAtlanticbluetang\">How to turn off the light ft. Bruce Lee</a> - (WotD) Bruce intimidates a lackey by jumping up and kicking out a hanging lamp ~8ft in the air.<br/>\n<a href=\"http://gfycat.com/SoreImmediateConure\">Two-Finger Push up</a> - At the 1967 Long Beach International Karate Championship, Bruce displays his phenomenal finger strength by performing pushups using only the thumb and index finger from one hand.<br/>\n<a href=\"http://i.imgur.com/T03VOiT.jpg\">Thumb Push Ups</a> - Bruce could perform pushups with only the use of his thumbs.<br/>\n<a href=\"http://gfycat.com/LastingUnrealisticGiraffe\">One-Inch Punch</a> - Bruce demonstrates the mechanics of a punch on a volunteer from a distance of one inch.<br/>\n<a href=\"http://gfycat.com/FabulousEssentialIrishwaterspaniel\">Six-Inch Punch</a> - And again, this time from six inches away.  </p>\n\n<h3>Speed and Power</h3>\n\n<blockquote>\n<p><em>&quot;A powerful athlete is not a strong athlete, but one who can exert his strength quickly. Since power equals force times speed, if the athlete learns to make faster movements he increases his power, even though the contractile pulling strength of his muscles remains unchanged. Thus, a smaller man who can swing faster may hit as hard as the far heavier man who swings slowly.&quot;<br/>\n-Bruce Lee</em>  </p>\n</blockquote>\n\n<p><a href=\"http://gfycat.com/NimbleDeficientKitty\">1967 Speed Demo</a> - A volunteer attempts to block Bruce&#39;s punches in a speed demonstration.<br/>\n<a href=\"http://gfycat.com/AromaticQuarterlyAmericanpainthorse\">1964 Speed Demo</a> - In a speed demonstration at Ed Parker&#39;s Long Beach International Karate Tournament in 1964, Bruce demonstrates his fast punches from a stand still.<br/>\n<a href=\"https://www.youtube.com/watch?v=v8wL3AA4BP0\">1965 Screen Test Demonstration</a> - Short video of Bruce demonstrating some of his fast strikes at a screen test at 20th Century Fox for TV series Charlie Chan’s Number One Son that never aired.<br/>\n<a href=\"http://gfycat.com/DigitalInsistentChanticleer\">Too fast to react</a> - (EtD) Bruce performs a lightning-fast back fist to Bob Wall&#39;s character. And in case you missed it, Bruce executes an arm deflection with his left hand simultaneously.<br/>\n<a href=\"http://gfycat.com/LiveBrightBedlingtonterrier\">Hook so fast it look like a jab</a> - (FoF) Bruce throws a low jab to the body. Then he feints a low jab and throws a swift and powerful right hook to the face.<br/>\n<a href=\"http://gfycat.com/RecentHighGrasshopper\">Punches Lost in Time</a> - (The Lost Interview) Sitting in an interview, Bruce demonstrates how he punches using the hip. He goes from sitting still to suddenly snapping punches with speed and power.<br/>\n<a href=\"http://gfycat.com/DelayedShyFirebelliedtoad\">Wing Chun vs Bob Wall</a> - (EtD) Bruce holds one of Bob&#39;s arms down then comes under and pulls the blocking arm of Bob Wall to execute a right back fist.<br/>\n<a href=\"http://gfycat.com/DeafeningCourteousDwarfrabbit\">Wing Chun vs Chuck Norris</a> - (WotD) Bruce performing a number of fast wing chun combos against Chuck Norris.<br/>\n<a href=\"http://gfycat.com/WetTanBernesemountaindog\">Wing Chun vs Robert Baker</a> - (FoF) Bruce performing a number of fast wing chun combos against Robert Baker.<br/>\n<a href=\"http://gfycat.com/PhonyNearDegu\">Mirin&#39;</a> - (WotD) In a scene where Bruce is checking himself out in the mirror, he demonstrates some elegant side kicks and footwork, before exploding with punches from stand still.<br/>\n<a href=\"http://gfycat.com/RashEdibleDalmatian\">Roundhouse</a> - (WotD) Bruce throws a few powerful roundhouse kicks on the pad.<br/>\n<a href=\"http://gfycat.com/DizzyInstructiveChafer\">The Side Kick</a> - (WotD) Then he shows his signature side kick.<br/>\n<a href=\"http://gfycat.com/GentleTerrificBrant\">The Side Kick 2</a> - (EtD) Bruce executes a powerful side kick.<br/>\n<a href=\"http://gfycat.com/ThirdPointedAnaconda\">What a dummy</a> - (EtD) Bruce obliterates a rag doll with a roundhouse kick.  </p>\n\n<h3>Skill in Movement</h3>\n\n<blockquote>\n<p><em>&quot;In kicking and striking, especially when launched from the ready position, eliminate all unnecessary motions and muscle contractions which slow and fatigue you without accomplishing any useful purpose. Much energy is wasted by the unrelaxed opposing muscles in resisting the movement--learn and feel proper contraction and recovery (otherwise your physiological engine is racing, but the brakes are on).&quot;<br/>\n-Bruce Lee</em>  </p>\n</blockquote>\n\n<p><a href=\"http://gfycat.com/ShortGentleAmazondolphin\">Float like a butterfly</a> - (GoD) Bruce circles his opponent with a casual cadence while darting in with lightning fast feints and exhibiting unpredictable foot movement.<br/>\n<a href=\"http://gfycat.com/CluelessFreshAmericanlobster\">Quick and Fluid</a> - (FoF) From a standing stance, Bruce reacts quickly and moves fluidly.<br/>\n<a href=\"http://gfycat.com/MealyUnripeIntermediateegret\">Agile</a> - (WotD) Bruce shows his fast straight kick to the extended hand of Bob multiple times and even intercepts Bob&#39;s kick with a stop kick. He finishes with a nice low feint into a high hook kick but notice the agility and grace in his footwork throughout.<br/>\n<a href=\"http://gfycat.com/LivelyWeeklyDassierat\">Smooth Criminal</a> - (GoD) Bruce fakes an overhead strike that causes his opponent to swing. Then he closes in with a strike and smoothly backs out before his opponent&#39;s next strike. Notice the sudden shift in speed of step but also maintaining of good footwork and balance during and thereafter.<br/>\n<a href=\"http://gfycat.com/GrippingAridAztecant\">In-N-Out</a> - (GoD) Bruce expertly judges distance against Ji Han-jae and displays good footwork.<br/>\n<a href=\"http://gfycat.com/SophisticatedIgnorantHake\">Brokerib Mountain</a> - (FoF) Bruce backs out of a side kick and slows the cadence down to a halt. He suddenly feints a right jab while simultaneously executing a side kick to the ribs.<br/>\n<a href=\"http://gfycat.com/SomberSoreJanenschia\">Hip Hopping</a> - (GoD) Bruce backs away from his 7&#39;2&quot; opponent&#39;s attacks before bursting in to close the distance.<br/>\n<a href=\"http://gfycat.com/RelievedGentleAnteater\">Small Talk</a> - (WotD) While in the middle of conversation, Bruce casually and effortlessly throws a few punches and side kicks.<br/>\n<a href=\"http://gfycat.com/HardBraveHedgehog\">Thug life chose Bruce</a> - (WotD) His head movement is quick and relaxed, not unwieldy and reckless. He doesn&#39;t waste energy and returns immediately to his starting position seamlessly. The same goes for his jab.<br/>\n<a href=\"http://gfycat.com/AridBronzeEuropeanfiresalamander\">Quick Attack</a> - (FoF) Bruce goes for a low kick before quickly backing out. As he resets he deliberately shuffles towards his opponent. He feints a straight kick with an astounding agility into a hook kick to the face and recovery back into a ready stance.  </p>\n\n<h3>The Way of the Intercepting Fist</h3>\n\n<blockquote>\n<p><em>&quot;Jeet Kune Do favors formlessness so that it can assume all forms and since Jeet Kune Do has no style, it can fit in with all styles. As a result, Jeet Kune Do utilizes all ways and is bound by none, and likewise uses any technique or means which serves its end.&quot;<br/>\n-Bruce Lee</em>  </p>\n</blockquote>\n\n<p><a href=\"http://gfycat.com/ThornyInsidiousDikdik\">1967 Sparring Demo</a> - In a sparring demonstration, Bruce back steps then quickly intercepts with a heel hook to the face when his opponent throws a wild punch.<br/>\n<a href=\"http://gfycat.com/HoarseRareGrunion\">1967 Sparring Demo 2</a> - Bruce and his opponent reengage when his opponent throws a side kick. Bruce intercepts with the straight right lead.<br/>\n<a href=\"http://gfycat.com/ObviousCooperativeHornet\">1967 Sparring Demo 3</a> - Bruce&#39;s opponent tries to close the distance but is met with a right jab followed by a leg sweep.<br/>\n<a href=\"http://gfycat.com/SnoopyMagnificentAmericancicada\">Old West Showdown</a> - (WotD) Bruce stands off at a distance with Hwang In Sik. Hwang goes in for a side kick but Bruce reacts with a faster hook kick to the head.<br/>\n<a href=\"http://gfycat.com/OffbeatConstantFawn\">Stopping the march</a> - (WotD) Bob Wall throws a side kick which Bruce dodges. He makes a move but Bruce stops his march with a side kick of his own.<br/>\n<a href=\"http://gfycat.com/HomelyPlushCattle\">Denied</a> - (WotD) Chuck Norris throws side kick after side kick. Before he can execute his third, Bruce steps in with a right backfist.<br/>\n<a href=\"http://gfycat.com/VerifiableSmoothAntlion\">STAHP</a> - (WotD) Bruce stops Chuck&#39;s movement with oblique kicks, then feints an oblique kick into a high hook kick.<br/>\n<a href=\"http://gfycat.com/ElementaryWelcomeGiantschnauzer\">&quot;To reach me you must move to me. Your attack offers me an opportunity to intercept you.&quot;</a> - (Longstreet) Bruce asks a curious man to try to reach him. When the man makes a move, Bruce demonstrates interception with a side kick to the knee.<br/>\n<a href=\"http://gfycat.com/ClassicAngelicIberianbarbel\">One-Two</a> - (FoF) Intercept the movement with a roundhouse and clean up with heel kick.  </p>\n\n<h3>Other</h3>\n\n<blockquote>\n<p><em>&quot;To express oneself honestly, not lying to oneself and to express myself honestly, now that, my friend, is very hard to do.&quot;<br/>\n-Bruce Lee</em>  </p>\n</blockquote>\n\n<p><a href=\"http://gfycat.com/AccomplishedShrillAnemonecrab\">Nunchuk Master</a> - Bruce was skilled at using the Nunchuks and brought it to the big screen, immortalizing the unknown weapon.<br/>\n<a href=\"http://gfycat.com/ImmaterialAfraidHart\">Nunchuk Master Master</a> - The man who introduced Bruce to the nun chuk, Dan Inosanto.<br/>\n<a href=\"http://gfycat.com/InfantileCelebratedAmphibian\">Side kick duel with Chuck Norris</a> - Two giants going toe-to-toe<br/>\n<a href=\"http://gfycat.com/FelineAntiqueAuk\">Side kick duel with Robert Baker</a>  - Another duel of the side kicks<br/>\n<a href=\"http://gfycat.com/IncredibleBlueDutchsmoushond\">Nope!</a> - This guys wants none of that.<br/>\n<a href=\"http://gfycat.com/DrearyKnobbyKatydid\">(-.-)</a> - Bruce Lee doesn&#39;t need to use words to get the point across.<br/>\n<a href=\"http://gfycat.com/UnacceptableAdolescentCoati\">Bruce Lee vs Jackie Chan</a> - Bruce beating up a young Jackie Chan and the stunt team.<br/>\n<a href=\"http://gfycat.com/GenuineBrilliantIndianpalmsquirrel\">Leg Raise and Hold</a> - Bruce practicing his static side kick<br/>\n<a href=\"http://gfycat.com/DetailedLimitedChimneyswift\">&quot;Hair Ripper!&quot;</a> - Bruce uses Chuck Norris&#39; hairy chest against him.</p>\n\n<blockquote>\n<p><em>&quot;Ever since The Big Boss, there seems to be a wave, a hot wave in fact, of finding another Bruce Lee among all types of people, particularly martial artists, ranging from Karate man, Hapkido man, Judo man, etc., etc., forgetting about whether or not they possess the ability to act just so as they can halfway decent to kick or punch and hopefully knowing a few tricks or gimmicks, the producers will make them a star. Now let&#39;s stop about here. Is it that simple to become a star? Well, I can assure you it&#39;s not that simple.</em>  </p>\n\n<p><em>Also, I can tell you as more Bruce Lee&#39;s films are shown,</em> <strong>the audience will soon realize, not only in acting ability but in physical skill as well, they will see the difference</strong>. <em>For example, in the Way of the Dragon, my skill is matched with an American champion, Chuck Norris, who happens to be a 7-time winner of both the All-Time American Open and World Karate Championship as well. Then there is Bob Wall, the 1970 Heavyweight Karate Champion, plus Hwang In-shik, the seventh degree Hapkido expert, which some audience have seen him in the film called &#39;Hapkido&#39;.</em> <strong>&#39;Of course, it is only movie-making&#39;, people will say. But I&#39;m sure that the audience are not so insensitive as to not be able to see and judge by themselves and compare these men&#39;s speed, power, rhythm, coordination, versatilities, etc., etc.</strong>&quot;<br/>\n<em>-Bruce Lee</em></p>\n</blockquote>\n</div><!-- SC_ON -->",
  "subreddit_id": "t5_2yfqs",
  "archived": true,
  "domain": "self.respectthreads",
  "clicked": false,
  "score": 66,
  "link_flair_text": "miscellaneous",
  "id": "2paoj5",
  "stickied": false,
  "media_embed": {},
  "link_flair_css_class": "miscellaneous",
  "visited": false,
  "selftext": "###Warning - Bruce Lee Movie Spoilers Below - If you haven't watched any of Bruce Lee's legendary martial arts films, there are major scenes from his movies in this thread. I can't recommend enough that you watch these prime examples of quality action cinema and get to see them in their intended context so you can enjoy it fully as I did.  \n***\n[Bruce Lee](http://i.imgur.com/kOgddXA.jpg), born in 1940 in San Francisco, California and raised in China, stood at 5'7.5\" and typically weighed no more than 140lbs. He studied Wing Chun under Yip Man at the age of 13. He moved back to the US at 18 years old due to excessive fights with rival gangs and studied Philosophy at the University of Washington.\n\nAfter a dissatisfying fight against a Choy Li Fut man in 1964, he revamped his fighting style, incorporating heavy weight training and tactics, moves and strategies from other arts, such as fencing, judo, jiu-jitsu, karate, and western boxing. During the late 1960's, Bruce trained Chuck Norris, Joe Lewis, and Mike Stone, who were the top karate competitors of the time, collectively having won every major karate tournament in the US. When he damaged a spinal nerve while weight training in 1970 and was bed-ridden for six months, he put on paper his ideas and philosophy for his martial art, Jeet Kune Do, the Way of the Intercepting Fist.\n\nHe passed away on July 20, 1973 due to a hypersensitive reaction to some medication for a headache which caused an increase of the fluids in the brain. He starred in five major films: The Big Boss (1971), Fist of Fury (1972), Way of the Dragon (1972), Enter the Dragon (1973), and The Game of Death (posthumous).\n\n###Physical Fitness\n>*\"Some guys may not believe it, but I spent hours perfecting whatever I did.\"  \n>-Bruce Lee*\n\n[The Lat Spread](http://gfycat.com/ThirdInfantileHairstreakbutterfly) - (WotD) Bruce was renowned for his enormous latissimus dorsi muscles.  \n[The Lat Spread 2: Electric Boogaloo](http://gfycat.com/UnevenScalyKillifish) - (WotD) Before the fight with Chuck Norris, Bruce stretches his forearms then displays his front lat spread.  \n[Shredded](http://i.imgur.com/OJpctwH.jpg) - He was shredded in every picture and his abs were legendary.  \n[Shirtless and Slow motion](http://gfycat.com/DistortedEducatedDunnart) - (EtD) Bruce looking ripped killing some dude in slow motion.  \n[V-Sit](http://i.imgur.com/UPAjOIh.jpg) - (GoD) Image of Bruce Lee performing an elevated V-Sit, an advanced bodyweight exercise. Notice the straight legs and good shoulder depression and retraction.  \n[Planche Attack](http://gfycat.com/SerpentinePettyGadwall) - (GoD) In a ridiculous scene from the Game of Death, Bruce Lee performs a planche into handstand to get out of a dangerous situation. [Here's a different take that cuts the camera at the waist.](http://gfycat.com/FineAccomplishedGemsbok)  \n[Headkick to Kareem](http://i.imgur.com/pm4h26G.jpg) - (GoD) A still on the set of the Game of Death showing Bruce performing a hook kick to the head of co-star and student, Kareem Abdul-Jabbar, who stands at a daunting 7'2\".  \n[Jumpkick to Kareem](http://i.imgur.com/cNCQyKn.jpg) - (GoD) A shot of Bruce performing a jump kick on Kareem.  \n[Jumpkick to Kareem Scene](http://gfycat.com/ElectricPaleBanteng) - (GoD) And an unusued scene from the Game of Death of Bruce performing the jump kick on Kareem in action.  \n[How to turn off the light ft. Bruce Lee](http://gfycat.com/CluelessOpenAtlanticbluetang) - (WotD) Bruce intimidates a lackey by jumping up and kicking out a hanging lamp ~8ft in the air.  \n[Two-Finger Push up](http://gfycat.com/SoreImmediateConure) - At the 1967 Long Beach International Karate Championship, Bruce displays his phenomenal finger strength by performing pushups using only the thumb and index finger from one hand.  \n[Thumb Push Ups](http://i.imgur.com/T03VOiT.jpg) - Bruce could perform pushups with only the use of his thumbs.  \n[One-Inch Punch](http://gfycat.com/LastingUnrealisticGiraffe) - Bruce demonstrates the mechanics of a punch on a volunteer from a distance of one inch.  \n[Six-Inch Punch](http://gfycat.com/FabulousEssentialIrishwaterspaniel) - And again, this time from six inches away.  \n\n###Speed and Power  \n>*\"A powerful athlete is not a strong athlete, but one who can exert his strength quickly. Since power equals force times speed, if the athlete learns to make faster movements he increases his power, even though the contractile pulling strength of his muscles remains unchanged. Thus, a smaller man who can swing faster may hit as hard as the far heavier man who swings slowly.\"  \n>-Bruce Lee*  \n\n[1967 Speed Demo](http://gfycat.com/NimbleDeficientKitty) - A volunteer attempts to block Bruce's punches in a speed demonstration.  \n[1964 Speed Demo](http://gfycat.com/AromaticQuarterlyAmericanpainthorse) - In a speed demonstration at Ed Parker's Long Beach International Karate Tournament in 1964, Bruce demonstrates his fast punches from a stand still.  \n[1965 Screen Test Demonstration](https://www.youtube.com/watch?v=v8wL3AA4BP0) - Short video of Bruce demonstrating some of his fast strikes at a screen test at 20th Century Fox for TV series Charlie Chan’s Number One Son that never aired.  \n[Too fast to react](http://gfycat.com/DigitalInsistentChanticleer) - (EtD) Bruce performs a lightning-fast back fist to Bob Wall's character. And in case you missed it, Bruce executes an arm deflection with his left hand simultaneously.  \n[Hook so fast it look like a jab](http://gfycat.com/LiveBrightBedlingtonterrier) - (FoF) Bruce throws a low jab to the body. Then he feints a low jab and throws a swift and powerful right hook to the face.  \n[Punches Lost in Time](http://gfycat.com/RecentHighGrasshopper) - (The Lost Interview) Sitting in an interview, Bruce demonstrates how he punches using the hip. He goes from sitting still to suddenly snapping punches with speed and power.  \n[Wing Chun vs Bob Wall](http://gfycat.com/DelayedShyFirebelliedtoad) - (EtD) Bruce holds one of Bob's arms down then comes under and pulls the blocking arm of Bob Wall to execute a right back fist.  \n[Wing Chun vs Chuck Norris](http://gfycat.com/DeafeningCourteousDwarfrabbit) - (WotD) Bruce performing a number of fast wing chun combos against Chuck Norris.  \n[Wing Chun vs Robert Baker](http://gfycat.com/WetTanBernesemountaindog) - (FoF) Bruce performing a number of fast wing chun combos against Robert Baker.  \n[Mirin'](http://gfycat.com/PhonyNearDegu) - (WotD) In a scene where Bruce is checking himself out in the mirror, he demonstrates some elegant side kicks and footwork, before exploding with punches from stand still.  \n[Roundhouse](http://gfycat.com/RashEdibleDalmatian) - (WotD) Bruce throws a few powerful roundhouse kicks on the pad.  \n[The Side Kick](http://gfycat.com/DizzyInstructiveChafer) - (WotD) Then he shows his signature side kick.  \n[The Side Kick 2](http://gfycat.com/GentleTerrificBrant) - (EtD) Bruce executes a powerful side kick.  \n[What a dummy](http://gfycat.com/ThirdPointedAnaconda) - (EtD) Bruce obliterates a rag doll with a roundhouse kick.  \n\n###Skill in Movement  \n>*\"In kicking and striking, especially when launched from the ready position, eliminate all unnecessary motions and muscle contractions which slow and fatigue you without accomplishing any useful purpose. Much energy is wasted by the unrelaxed opposing muscles in resisting the movement--learn and feel proper contraction and recovery (otherwise your physiological engine is racing, but the brakes are on).\"  \n>-Bruce Lee*  \n\n[Float like a butterfly](http://gfycat.com/ShortGentleAmazondolphin) - (GoD) Bruce circles his opponent with a casual cadence while darting in with lightning fast feints and exhibiting unpredictable foot movement.  \n[Quick and Fluid](http://gfycat.com/CluelessFreshAmericanlobster) - (FoF) From a standing stance, Bruce reacts quickly and moves fluidly.  \n[Agile](http://gfycat.com/MealyUnripeIntermediateegret) - (WotD) Bruce shows his fast straight kick to the extended hand of Bob multiple times and even intercepts Bob's kick with a stop kick. He finishes with a nice low feint into a high hook kick but notice the agility and grace in his footwork throughout.  \n[Smooth Criminal](http://gfycat.com/LivelyWeeklyDassierat) - (GoD) Bruce fakes an overhead strike that causes his opponent to swing. Then he closes in with a strike and smoothly backs out before his opponent's next strike. Notice the sudden shift in speed of step but also maintaining of good footwork and balance during and thereafter.  \n[In-N-Out](http://gfycat.com/GrippingAridAztecant) - (GoD) Bruce expertly judges distance against Ji Han-jae and displays good footwork.  \n[Brokerib Mountain](http://gfycat.com/SophisticatedIgnorantHake) - (FoF) Bruce backs out of a side kick and slows the cadence down to a halt. He suddenly feints a right jab while simultaneously executing a side kick to the ribs.  \n[Hip Hopping](http://gfycat.com/SomberSoreJanenschia) - (GoD) Bruce backs away from his 7'2\" opponent's attacks before bursting in to close the distance.  \n[Small Talk](http://gfycat.com/RelievedGentleAnteater) - (WotD) While in the middle of conversation, Bruce casually and effortlessly throws a few punches and side kicks.  \n[Thug life chose Bruce](http://gfycat.com/HardBraveHedgehog) - (WotD) His head movement is quick and relaxed, not unwieldy and reckless. He doesn't waste energy and returns immediately to his starting position seamlessly. The same goes for his jab.  \n[Quick Attack](http://gfycat.com/AridBronzeEuropeanfiresalamander) - (FoF) Bruce goes for a low kick before quickly backing out. As he resets he deliberately shuffles towards his opponent. He feints a straight kick with an astounding agility into a hook kick to the face and recovery back into a ready stance.  \n\n###The Way of the Intercepting Fist  \n>*\"Jeet Kune Do favors formlessness so that it can assume all forms and since Jeet Kune Do has no style, it can fit in with all styles. As a result, Jeet Kune Do utilizes all ways and is bound by none, and likewise uses any technique or means which serves its end.\"  \n>-Bruce Lee*  \n\n[1967 Sparring Demo](http://gfycat.com/ThornyInsidiousDikdik) - In a sparring demonstration, Bruce back steps then quickly intercepts with a heel hook to the face when his opponent throws a wild punch.  \n[1967 Sparring Demo 2](http://gfycat.com/HoarseRareGrunion) - Bruce and his opponent reengage when his opponent throws a side kick. Bruce intercepts with the straight right lead.  \n[1967 Sparring Demo 3](http://gfycat.com/ObviousCooperativeHornet) - Bruce's opponent tries to close the distance but is met with a right jab followed by a leg sweep.  \n[Old West Showdown](http://gfycat.com/SnoopyMagnificentAmericancicada) - (WotD) Bruce stands off at a distance with Hwang In Sik. Hwang goes in for a side kick but Bruce reacts with a faster hook kick to the head.  \n[Stopping the march](http://gfycat.com/OffbeatConstantFawn) - (WotD) Bob Wall throws a side kick which Bruce dodges. He makes a move but Bruce stops his march with a side kick of his own.  \n[Denied](http://gfycat.com/HomelyPlushCattle) - (WotD) Chuck Norris throws side kick after side kick. Before he can execute his third, Bruce steps in with a right backfist.   \n[STAHP](http://gfycat.com/VerifiableSmoothAntlion) - (WotD) Bruce stops Chuck's movement with oblique kicks, then feints an oblique kick into a high hook kick.  \n[\"To reach me you must move to me. Your attack offers me an opportunity to intercept you.\"](http://gfycat.com/ElementaryWelcomeGiantschnauzer) - (Longstreet) Bruce asks a curious man to try to reach him. When the man makes a move, Bruce demonstrates interception with a side kick to the knee.  \n[One-Two](http://gfycat.com/ClassicAngelicIberianbarbel) - (FoF) Intercept the movement with a roundhouse and clean up with heel kick.  \n\n###Other  \n>*\"To express oneself honestly, not lying to oneself and to express myself honestly, now that, my friend, is very hard to do.\"  \n>-Bruce Lee*  \n\n\n[Nunchuk Master](http://gfycat.com/AccomplishedShrillAnemonecrab) - Bruce was skilled at using the Nunchuks and brought it to the big screen, immortalizing the unknown weapon.  \n[Nunchuk Master Master](http://gfycat.com/ImmaterialAfraidHart) - The man who introduced Bruce to the nun chuk, Dan Inosanto.  \n[Side kick duel with Chuck Norris](http://gfycat.com/InfantileCelebratedAmphibian) - Two giants going toe-to-toe  \n[Side kick duel with Robert Baker](http://gfycat.com/FelineAntiqueAuk)  - Another duel of the side kicks  \n[Nope!](http://gfycat.com/IncredibleBlueDutchsmoushond) - This guys wants none of that.  \n[(-.-)](http://gfycat.com/DrearyKnobbyKatydid) - Bruce Lee doesn't need to use words to get the point across.  \n[Bruce Lee vs Jackie Chan](http://gfycat.com/UnacceptableAdolescentCoati) - Bruce beating up a young Jackie Chan and the stunt team.  \n[Leg Raise and Hold](http://gfycat.com/GenuineBrilliantIndianpalmsquirrel) - Bruce practicing his static side kick  \n[\"Hair Ripper!\"](http://gfycat.com/DetailedLimitedChimneyswift) - Bruce uses Chuck Norris' hairy chest against him.\n\n>*\"Ever since The Big Boss, there seems to be a wave, a hot wave in fact, of finding another Bruce Lee among all types of people, particularly martial artists, ranging from Karate man, Hapkido man, Judo man, etc., etc., forgetting about whether or not they possess the ability to act just so as they can halfway decent to kick or punch and hopefully knowing a few tricks or gimmicks, the producers will make them a star. Now let's stop about here. Is it that simple to become a star? Well, I can assure you it's not that simple.*  \n\n>*Also, I can tell you as more Bruce Lee's films are shown,* **the audience will soon realize, not only in acting ability but in physical skill as well, they will see the difference**. *For example, in the Way of the Dragon, my skill is matched with an American champion, Chuck Norris, who happens to be a 7-time winner of both the All-Time American Open and World Karate Championship as well. Then there is Bob Wall, the 1970 Heavyweight Karate Champion, plus Hwang In-shik, the seventh degree Hapkido expert, which some audience have seen him in the film called 'Hapkido'.* **'Of course, it is only movie-making', people will say. But I'm sure that the audience are not so insensitive as to not be able to see and judge by themselves and compare these men's speed, power, rhythm, coordination, versatilities, etc., etc.**\"  \n>*-Bruce Lee*",
  "hide_score": false,
  "_api_link": "https://api.reddit.com/r/respectthreads/comments/2paoj5/respect_bruce_lee/?ref=search_posts",
  "locked": false,
  "edited": 1420094779.0,
  "title": "Respect: Bruce Lee",
  "created": 1418594218.0,
  "_comments_by_id": {}
}