{
  "selftext": "Out of the multitude of companies, which ones would legendary value investor Benjamin Graham buy today?  I've compiled ten great companies that fit the [ModernGraham criteria](http://www.moderngraham.com/the-moderngraham-way), based on Benjamin Graham's methods. \n\nThe companies in this list pass the rigorous requirements of either the Defensive Investor or the Enterprising Investor and are undervalued by the market. \n\n#Here are the ten companies Benjamin Graham would invest in today:#\n\n##Denbury Resources Inc. (DNR)##\n\nDenbury Resources Inc. qualifies for the Enterprising Investor but not the more conservative Defensive Investor.  The Defensive Investor is concerned with the company size, insufficient earnings growth or stability over the last ten years along with the short dividend history.  The Enterprising Investor is concerned with the level of debt relative to the net current assets.  As a result, all Enterprising Investors following the ModernGraham approach based on Benjamin Graham's methods should feel comfortable proceeding with the evaluation.\n\nAs for a valuation, the company appears to be undervalued after growing its EPSmg (normalized earnings) from $0.88 in 2011 to an estimated $1.05 for 2015.  This level of demonstrated earnings growth surpasses the market's implied estimate of 2.58% annual earnings decline over the next 7-10 years.  As a result, the ModernGraham valuation model, based on Benjamin Graham's formula, returns an estimate of intrinsic value above the price. \n\n\n##Ford Motor Company (F)##\n\nFord Motor Company performs well in the ModernGraham model and is suitable for Enterprising Investors. The Defensive Investor is concerned with the inconsistent dividend record and the lack of earnings stability over the last ten years, while the Enterprising Investor has no initial concerns. As a result, Enterprising Investors should feel very comfortable proceeding to the next part of the analysis, which is a determination of the company's intrinsic value.\n\nWhen it comes to valuation, it is critical to consider the company's earnings history. In this case, the company has grown its EPSmg (normalized earnings) from $1.30 in 2011 to an estimated $1.55 for 2015. Even though this is not a very high level of growth, it is well above the market's implied estimate of only 0.69% annual earnings growth over the next 7-10 years.\n\nHere, actual growth in EPSmg over the last several years has averaged 3.8% annually, so the market is expecting a very significant drop in earnings growth. The ModernGraham valuation model reduces the historical growth to a more conservative figure, assuming that some slowdown will occur, but still estimates a growth figure much higher than the market's implied rate. Therefore, the model returns an estimate of intrinsic value well above the current price, indicating the company is significantly undervalued at the present time.  \n\n\n##Fossil Group (FOSL)##\n\nFossil Group performs well in the ModernGraham model and is suitable for both Defensive and Enterprising Investors. Both investor types are only initially concerned by the lack of dividend payments. As a result, all value investors should feel very comfortable proceeding to the next part of the analysis, which is a determination of the company's intrinsic value.\n\nWhen it comes to valuation, it is critical to consider the company's earnings history. In this case, the company has grown its EPSmg (normalized earnings) from $1.68 in 2011 to an estimated $6.01 for 2015. This is a strong level of growth and is well above the market's implied estimate of only 1.68% annual earnings growth over the next 7-10 years.\n\nHere, actual growth in EPSmg over the last several years has averaged nearly 16% annually, so the market is expecting a very significant drop in earnings growth. The ModernGraham valuation model reduces the historical growth to a more conservative figure, assuming that some slowdown will occur, but still estimates a growth figure much higher than the market's implied rate. Therefore, the model returns an estimate of intrinsic value well above the current price, indicating the company is significantly undervalued at the present time. \n\n\n##Helmerich & Payne (HP)##\n\nHelmerich & Payne Inc. is suitable for both the Defensive Investor and the Enterprising Investor.  The company passes all of the requirements of each investor type, which is a rare accomplishment indicative of the company's strong financial position.  As a result, value investors following the ModernGraham approach based on Benjamin Graham's methods should feel very comfortable proceeding with further research and comparing the company to other opportunities.\n\nFrom a valuation side of things, the company appears to be undervalued after growing its EPSmg (normalized earnings) from $3.24 in 2011 to an estimated $5.11 for 2015.  This level of demonstrated growth outpaces the market's implied estimate of 2.97% annual earnings growth over the next 7-10 years and leads the ModernGraham valuation model, based on Benjamin Graham's formula, to return an estimate of intrinsic value well above the price. \n\n\n##Lincoln National Corporation (LNC)##\n\nLincoln National Corporation passes the initial requirements of the Enterprising Investor, but not the more conservative Defensive Investor. The Defensive Investor is concerned by the company's lack of earnings stability over the last ten years. The Enterprising Investor has no initial concerns. As a result, all Enterprising Investors should feel very comfortable proceeding to the next part of the analysis, which is a determination of the company's intrinsic value.\n\nWhen it comes to that valuation, it is critical to consider the company's earnings history. In this case, it has grown its EPSmg (normalized earnings) from $0.80 in 2011 to an estimated $5.01 for 2015. This is a very strong level of demonstrated growth, which is well above the market's implied estimate for annual earnings growth of 1.59% over the next 7-10 years.\n\nIn recent years, the company's actual growth in EPSmg has been astronomical, and while the ModernGraham valuation model reduces the actual growth to a more conservative figure when making an estimate, the model still returns an estimate of intrinsic value well above the current price, indicating that the company is undervalued at the present time. \n\n\n##People's United Financial (PBCT)##\n\nPeople's United Financial Inc. qualifies for both the Defensive Investor and the Enterprising Investor.  In fact, the company passes all of the requirements of both investor types, indicating it is in a very strong financial position.  As a result, all value investors following the ModernGraham approach based on Benjamin Graham's methods should feel comfortable proceeding with further research into the company and comparing it to other opportunities.\n\nAs for a valuation, the company appears undervalued after growing its EPSmg (normalized earnings) from $0.40 in 2011 to an estimated $0.78 for 2015.  This level of demonstrated growth outpaces the market's implied estimate of 5.62% earnings growth and leads the ModernGraham valuation model, which is based on Benjamin Graham's formula, to return an estimate of intrinsic value above the market price.  \n\n\n##Seagate Technology (STX)##\n\nSeagate Technology is suitable for the Enterprising Investor but not the Defensive Investor.  The Defensive Investor is concerned by the low current ratio, lack of earnings stability over the last ten years, inconsistent dividend record, and the high PB ratio.  The Enterprising Investor is only concerned with the level of debt relative to the net current assets.  As a result, all Enterprising Investors following the ModernGraham approach based on Benjamin Graham's methods should feel very comfortable proceeding with further research and comparing the company to other opportunities.\n\nFrom a valuation side of things, the company appears to be undervalued after growing its EPSmg (normalized earnings) from $0.34 in 2011 to an estimated $5.01 for 2015.  This level of demonstrated growth outpaces the market's implied estimate of 1.26% annual earnings growth over the next 7-10 years and leads the ModernGraham valuation model, based on Benjamin Graham's formula, to return an estimate of intrinsic value well above the price. \n\n\n##Starwood Property Trust (STWD)##\n\nStarwood Property Trust Inc. qualifies for the Enterprising Investor but not the Defensive Investor.  The Defensive Investor is concerned by the short history as a publicly traded company, while the company passes all of the Enterprising Investor's requirements.  As a result, Enterprising Investors following the ModernGraham approach based on Benjamin Graham's methods should feel comfortable proceeding with further research into the company and comparing it to other opportunities.\n\nAs for a valuation, the company appears undervalued after growing its EPSmg (normalized earnings) from $0.76 in 2011 to an estimated $1.98 for 2015.  This level of demonstrated growth is greater than the market's implied estimate of 1.18% earnings growth and leads the ModernGraham valuation model, which is based on Benjamin Graham's formula, to return an estimate of intrinsic value above the market price.  \n\n\n##Tegna Inc. (TGNA)##\n\nTegna Inc. qualifies for the Enterprising Investor but not the more conservative Defensive Investor.  The Defensive Investor is concerned with the insufficient earnings growth or stability over the last ten years along with the low current ratio.  The Enterprising Investor is concerned with the level of debt relative to the net current assets.  As a result, all Enterprising Investors following the ModernGraham approach based on Benjamin Graham's methods should feel comfortable proceeding with the evaluation.\n\nAs for a valuation, the company appears to be undervalued after growing its EPSmg (normalized earnings) from a loss of $2.00 in 2011 to an estimated gain of $2.50 for 2015.  This level of demonstrated earnings growth surpasses the market's implied estimate of 1.06% annual earnings growth over the next 7-10 years.  As a result, the ModernGraham valuation model, based on Benjamin Graham's formula, returns an estimate of intrinsic value above the price. \n\n\n##Twenty-First Century Fox (FOXA)##\n\nTwenty-First Century Fox is not suitable for Defensive Investors but it does pass the initial requirements of the Enterprising Investor. The Defensive Investor is concerned with the insufficient earnings stability over the last ten years, and the high PB ratio, while the Enterprising Investor's only concern is the level of debt relative to the net current assets. As a result, all Enterprising Investors should feel very comfortable proceeding to the next part of the analysis, which is a determination of the company's intrinsic value.\n\nWhen it comes to that valuation, it is critical to consider the company's earnings history. In this case, it has grown its EPSmg (normalized earnings) from $0.66 in 2011 to an estimated $2.64 for 2015. This is a fairly strong level of demonstrated growth, and outpaces the market's implied estimate for annual earnings growth of 2.11% over the next 7-10 years.\n\nIn recent years, the company's actual growth in EPSmg has averaged nearly 60% annually, and while the ModernGraham valuation model reduces the actual growth to a more conservative figure when making an estimate, the model still returns an estimate of intrinsic value well above the current price, indicating that Twenty-First Century Fox is significantly undervalued at the present time. \n\n*Disclaimer:*  The author held a long position in Ford Motor Company (F) but did not hold a position in any of the other companies listed in this article at the time of publication and had no intention of changing that position within the next 72 hours.  This should not be considered investment advice as the author is not a registered investment adviser.  Readers should consult a registered investment adviser prior to making any investment decision.  This post originally appeared on [ModernGraham](http://www.moderngraham.com/2015/08/10/10-companies-benjamin-graham-would-invest-in-today-august-2015/).",
  "gilded": 0,
  "score": 3,
  "removal_reason": null,
  "approved_by": null,
  "created_utc": 1440014151.0,
  "is_self": true,
  "stickied": false,
  "edited": false,
  "distinguished": null,
  "permalink": "https://www.reddit.com/r/StockMarket/comments/3hmawp/10_companies_benjamin_graham_would_invest_in/?ref=search_posts",
  "banned_by": null,
  "from_id": null,
  "likes": null,
  "_underscore_names": null,
  "num_reports": null,
  "link_flair_css_class": null,
  "_info_url": "https://api.reddit.com/api/info/",
  "id": "3hmawp",
  "archived": false,
  "secure_media": null,
  "post_hint": "self",
  "from_kind": null,
  "saved": false,
  "domain": "self.StockMarket",
  "ups": 3,
  "suggested_sort": null,
  "quarantine": false,
  "over_18": false,
  "hide_score": false,
  "url": "https://www.reddit.com/r/StockMarket/comments/3hmawp/10_companies_benjamin_graham_would_invest_in/",
  "subreddit_id": "t5_2qjuv",
  "_params": {},
  "_comments": null,
  "preview": {
    "images": [
      {
        "source": {
          "width": 800,
          "url": "https://i.redditmedia.com/qseZwTNT9ANIQf5tkxcehpEpVNhw1nLMbaj98fKJM2o.jpg?s=69c7cbef6bd5f81275bf9b8037b10ee0",
          "height": 800
        },
        "resolutions": [
          {
            "width": 108,
            "url": "https://i.redditmedia.com/qseZwTNT9ANIQf5tkxcehpEpVNhw1nLMbaj98fKJM2o.jpg?fit=crop&crop=faces%2Centropy&arh=2&w=108&s=32b5cbd9ff34800f42fe81968b2ad209",
            "height": 108
          },
          {
            "width": 216,
            "url": "https://i.redditmedia.com/qseZwTNT9ANIQf5tkxcehpEpVNhw1nLMbaj98fKJM2o.jpg?fit=crop&crop=faces%2Centropy&arh=2&w=216&s=371eaa87ee1866631d3939d634aaf3ab",
            "height": 216
          },
          {
            "width": 320,
            "url": "https://i.redditmedia.com/qseZwTNT9ANIQf5tkxcehpEpVNhw1nLMbaj98fKJM2o.jpg?fit=crop&crop=faces%2Centropy&arh=2&w=320&s=9054c55a5692e85eec55333244b5a2b0",
            "height": 320
          },
          {
            "width": 640,
            "url": "https://i.redditmedia.com/qseZwTNT9ANIQf5tkxcehpEpVNhw1nLMbaj98fKJM2o.jpg?fit=crop&crop=faces%2Centropy&arh=2&w=640&s=e4421a77e21cfe300579e042b919d4dc",
            "height": 640
          }
        ],
        "id": "ng8BP22zCw95rUD6uGlutzVDevgMyV4fLZiAmhKK3b0",
        "variants": {}
      }
    ]
  },
  "_replaced_more": false,
  "_comments_by_id": {},
  "user_reports": [],
  "media_embed": {},
  "created": 1440014151.0,
  "author_flair_text": null,
  "visited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Out of the multitude of companies, which ones would legendary value investor Benjamin Graham buy today?  I&#39;ve compiled ten great companies that fit the <a href=\"http://www.moderngraham.com/the-moderngraham-way\">ModernGraham criteria</a>, based on Benjamin Graham&#39;s methods. </p>\n\n<p>The companies in this list pass the rigorous requirements of either the Defensive Investor or the Enterprising Investor and are undervalued by the market. </p>\n\n<h1>Here are the ten companies Benjamin Graham would invest in today:</h1>\n\n<h2>Denbury Resources Inc. (DNR)</h2>\n\n<p>Denbury Resources Inc. qualifies for the Enterprising Investor but not the more conservative Defensive Investor.  The Defensive Investor is concerned with the company size, insufficient earnings growth or stability over the last ten years along with the short dividend history.  The Enterprising Investor is concerned with the level of debt relative to the net current assets.  As a result, all Enterprising Investors following the ModernGraham approach based on Benjamin Graham&#39;s methods should feel comfortable proceeding with the evaluation.</p>\n\n<p>As for a valuation, the company appears to be undervalued after growing its EPSmg (normalized earnings) from $0.88 in 2011 to an estimated $1.05 for 2015.  This level of demonstrated earnings growth surpasses the market&#39;s implied estimate of 2.58% annual earnings decline over the next 7-10 years.  As a result, the ModernGraham valuation model, based on Benjamin Graham&#39;s formula, returns an estimate of intrinsic value above the price. </p>\n\n<h2>Ford Motor Company (F)</h2>\n\n<p>Ford Motor Company performs well in the ModernGraham model and is suitable for Enterprising Investors. The Defensive Investor is concerned with the inconsistent dividend record and the lack of earnings stability over the last ten years, while the Enterprising Investor has no initial concerns. As a result, Enterprising Investors should feel very comfortable proceeding to the next part of the analysis, which is a determination of the company&#39;s intrinsic value.</p>\n\n<p>When it comes to valuation, it is critical to consider the company&#39;s earnings history. In this case, the company has grown its EPSmg (normalized earnings) from $1.30 in 2011 to an estimated $1.55 for 2015. Even though this is not a very high level of growth, it is well above the market&#39;s implied estimate of only 0.69% annual earnings growth over the next 7-10 years.</p>\n\n<p>Here, actual growth in EPSmg over the last several years has averaged 3.8% annually, so the market is expecting a very significant drop in earnings growth. The ModernGraham valuation model reduces the historical growth to a more conservative figure, assuming that some slowdown will occur, but still estimates a growth figure much higher than the market&#39;s implied rate. Therefore, the model returns an estimate of intrinsic value well above the current price, indicating the company is significantly undervalued at the present time.  </p>\n\n<h2>Fossil Group (FOSL)</h2>\n\n<p>Fossil Group performs well in the ModernGraham model and is suitable for both Defensive and Enterprising Investors. Both investor types are only initially concerned by the lack of dividend payments. As a result, all value investors should feel very comfortable proceeding to the next part of the analysis, which is a determination of the company&#39;s intrinsic value.</p>\n\n<p>When it comes to valuation, it is critical to consider the company&#39;s earnings history. In this case, the company has grown its EPSmg (normalized earnings) from $1.68 in 2011 to an estimated $6.01 for 2015. This is a strong level of growth and is well above the market&#39;s implied estimate of only 1.68% annual earnings growth over the next 7-10 years.</p>\n\n<p>Here, actual growth in EPSmg over the last several years has averaged nearly 16% annually, so the market is expecting a very significant drop in earnings growth. The ModernGraham valuation model reduces the historical growth to a more conservative figure, assuming that some slowdown will occur, but still estimates a growth figure much higher than the market&#39;s implied rate. Therefore, the model returns an estimate of intrinsic value well above the current price, indicating the company is significantly undervalued at the present time. </p>\n\n<h2>Helmerich &amp; Payne (HP)</h2>\n\n<p>Helmerich &amp; Payne Inc. is suitable for both the Defensive Investor and the Enterprising Investor.  The company passes all of the requirements of each investor type, which is a rare accomplishment indicative of the company&#39;s strong financial position.  As a result, value investors following the ModernGraham approach based on Benjamin Graham&#39;s methods should feel very comfortable proceeding with further research and comparing the company to other opportunities.</p>\n\n<p>From a valuation side of things, the company appears to be undervalued after growing its EPSmg (normalized earnings) from $3.24 in 2011 to an estimated $5.11 for 2015.  This level of demonstrated growth outpaces the market&#39;s implied estimate of 2.97% annual earnings growth over the next 7-10 years and leads the ModernGraham valuation model, based on Benjamin Graham&#39;s formula, to return an estimate of intrinsic value well above the price. </p>\n\n<h2>Lincoln National Corporation (LNC)</h2>\n\n<p>Lincoln National Corporation passes the initial requirements of the Enterprising Investor, but not the more conservative Defensive Investor. The Defensive Investor is concerned by the company&#39;s lack of earnings stability over the last ten years. The Enterprising Investor has no initial concerns. As a result, all Enterprising Investors should feel very comfortable proceeding to the next part of the analysis, which is a determination of the company&#39;s intrinsic value.</p>\n\n<p>When it comes to that valuation, it is critical to consider the company&#39;s earnings history. In this case, it has grown its EPSmg (normalized earnings) from $0.80 in 2011 to an estimated $5.01 for 2015. This is a very strong level of demonstrated growth, which is well above the market&#39;s implied estimate for annual earnings growth of 1.59% over the next 7-10 years.</p>\n\n<p>In recent years, the company&#39;s actual growth in EPSmg has been astronomical, and while the ModernGraham valuation model reduces the actual growth to a more conservative figure when making an estimate, the model still returns an estimate of intrinsic value well above the current price, indicating that the company is undervalued at the present time. </p>\n\n<h2>People&#39;s United Financial (PBCT)</h2>\n\n<p>People&#39;s United Financial Inc. qualifies for both the Defensive Investor and the Enterprising Investor.  In fact, the company passes all of the requirements of both investor types, indicating it is in a very strong financial position.  As a result, all value investors following the ModernGraham approach based on Benjamin Graham&#39;s methods should feel comfortable proceeding with further research into the company and comparing it to other opportunities.</p>\n\n<p>As for a valuation, the company appears undervalued after growing its EPSmg (normalized earnings) from $0.40 in 2011 to an estimated $0.78 for 2015.  This level of demonstrated growth outpaces the market&#39;s implied estimate of 5.62% earnings growth and leads the ModernGraham valuation model, which is based on Benjamin Graham&#39;s formula, to return an estimate of intrinsic value above the market price.  </p>\n\n<h2>Seagate Technology (STX)</h2>\n\n<p>Seagate Technology is suitable for the Enterprising Investor but not the Defensive Investor.  The Defensive Investor is concerned by the low current ratio, lack of earnings stability over the last ten years, inconsistent dividend record, and the high PB ratio.  The Enterprising Investor is only concerned with the level of debt relative to the net current assets.  As a result, all Enterprising Investors following the ModernGraham approach based on Benjamin Graham&#39;s methods should feel very comfortable proceeding with further research and comparing the company to other opportunities.</p>\n\n<p>From a valuation side of things, the company appears to be undervalued after growing its EPSmg (normalized earnings) from $0.34 in 2011 to an estimated $5.01 for 2015.  This level of demonstrated growth outpaces the market&#39;s implied estimate of 1.26% annual earnings growth over the next 7-10 years and leads the ModernGraham valuation model, based on Benjamin Graham&#39;s formula, to return an estimate of intrinsic value well above the price. </p>\n\n<h2>Starwood Property Trust (STWD)</h2>\n\n<p>Starwood Property Trust Inc. qualifies for the Enterprising Investor but not the Defensive Investor.  The Defensive Investor is concerned by the short history as a publicly traded company, while the company passes all of the Enterprising Investor&#39;s requirements.  As a result, Enterprising Investors following the ModernGraham approach based on Benjamin Graham&#39;s methods should feel comfortable proceeding with further research into the company and comparing it to other opportunities.</p>\n\n<p>As for a valuation, the company appears undervalued after growing its EPSmg (normalized earnings) from $0.76 in 2011 to an estimated $1.98 for 2015.  This level of demonstrated growth is greater than the market&#39;s implied estimate of 1.18% earnings growth and leads the ModernGraham valuation model, which is based on Benjamin Graham&#39;s formula, to return an estimate of intrinsic value above the market price.  </p>\n\n<h2>Tegna Inc. (TGNA)</h2>\n\n<p>Tegna Inc. qualifies for the Enterprising Investor but not the more conservative Defensive Investor.  The Defensive Investor is concerned with the insufficient earnings growth or stability over the last ten years along with the low current ratio.  The Enterprising Investor is concerned with the level of debt relative to the net current assets.  As a result, all Enterprising Investors following the ModernGraham approach based on Benjamin Graham&#39;s methods should feel comfortable proceeding with the evaluation.</p>\n\n<p>As for a valuation, the company appears to be undervalued after growing its EPSmg (normalized earnings) from a loss of $2.00 in 2011 to an estimated gain of $2.50 for 2015.  This level of demonstrated earnings growth surpasses the market&#39;s implied estimate of 1.06% annual earnings growth over the next 7-10 years.  As a result, the ModernGraham valuation model, based on Benjamin Graham&#39;s formula, returns an estimate of intrinsic value above the price. </p>\n\n<h2>Twenty-First Century Fox (FOXA)</h2>\n\n<p>Twenty-First Century Fox is not suitable for Defensive Investors but it does pass the initial requirements of the Enterprising Investor. The Defensive Investor is concerned with the insufficient earnings stability over the last ten years, and the high PB ratio, while the Enterprising Investor&#39;s only concern is the level of debt relative to the net current assets. As a result, all Enterprising Investors should feel very comfortable proceeding to the next part of the analysis, which is a determination of the company&#39;s intrinsic value.</p>\n\n<p>When it comes to that valuation, it is critical to consider the company&#39;s earnings history. In this case, it has grown its EPSmg (normalized earnings) from $0.66 in 2011 to an estimated $2.64 for 2015. This is a fairly strong level of demonstrated growth, and outpaces the market&#39;s implied estimate for annual earnings growth of 2.11% over the next 7-10 years.</p>\n\n<p>In recent years, the company&#39;s actual growth in EPSmg has averaged nearly 60% annually, and while the ModernGraham valuation model reduces the actual growth to a more conservative figure when making an estimate, the model still returns an estimate of intrinsic value well above the current price, indicating that Twenty-First Century Fox is significantly undervalued at the present time. </p>\n\n<p><em>Disclaimer:</em>  The author held a long position in Ford Motor Company (F) but did not hold a position in any of the other companies listed in this article at the time of publication and had no intention of changing that position within the next 72 hours.  This should not be considered investment advice as the author is not a registered investment adviser.  Readers should consult a registered investment adviser prior to making any investment decision.  This post originally appeared on <a href=\"http://www.moderngraham.com/2015/08/10/10-companies-benjamin-graham-would-invest-in-today-august-2015/\">ModernGraham</a>.</p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "_comment_sort": null,
  "report_reasons": null,
  "name": "t3_3hmawp",
  "from": null,
  "hidden": false,
  "clicked": false,
  "media": null,
  "json_dict": null,
  "_api_link": "https://api.reddit.com/r/StockMarket/comments/3hmawp/10_companies_benjamin_graham_would_invest_in/?ref=search_posts",
  "secure_media_embed": {},
  "mod_reports": [],
  "_orphaned": {},
  "_uniq": null,
  "num_comments": 0,
  "link_flair_text": null,
  "title": "10 Companies Benjamin Graham Would Invest In Today - August 2015",
  "_has_fetched": true,
  "author_flair_css_class": null,
  "thumbnail": "self"
}