{
  "selftext": "For the base of this part, I'd like to use a few selected quotes from [\"The Honored Place of Woman\"](https://www.lds.org/general-conference/1981/10/the-honored-place-of-woman?lang=eng), a General Conference talk by Ezra Taft Benson in 1981. \n\n>> Since the beginning, her role has been to teach her children eternal gospel principles. \n\n* In the modern church, women have no right to leadership, no right to govern their own beyond trivial matters, no right to officiate, no right to bless or anoint the sick, no right to ever make church-wide decisions.  In fact, they are generally left only to teach other women as instructed in material developed by the male correlation committee, or to govern children under 12 in much the same way.  However, this was not always the case. When Joseph and Emma founded the original Relief Society, women's rights and responsibilities greatly extended beyond children and recitation alone.   \n\n* For example, [Eliza R Snow](http://en.wikipedia.org/wiki/Women_and_Mormonism#Frontier_women_in_19th_century_Utah) clearly stated that women were duty bound to anoint and bless the sick by laying on of hands. She said, \"Is it necessary for sisters to be set apart to officiate in the sacred ordinances of washing, anointing, and laying on of hands in administering to the sick? It certainly is not. Any and all sisters who honor their holy endowments, not only have right, but should feel it a duty, whenever called upon to administer to our sisters in these ordinances, which God has graciously committed to His daughters as well as to His sons; and we testify that when administered and received in faith and humility they are accompanied with almighty power\"\n\n* She also stated that the relief society replaced and super-ceded the bishop for counseling and governing other women.  [Snow said](http://contentdm.lib.byu.edu/cdm/ref/collection/WomansExp/id/11591), \"Should the members of the Relief society go to the bishops for counsel? The Relief Society is designed to be a self-governing organization:to relieve the Bishops as well as to relieve the poor, to deal with its members, correct abuses, etc.  If difficulties arise between members of a branch which they cannot settle between the members themselves, sided by the teachers, instead of troubling the Bishop, the matter should be referred to their [Relief Society] president and her counselors.\"  (See notes below for the definition of counsel)\n\n* There were multiple references [in the old testament](http://classic.scriptures.lds.org/en/tg/p/234) to \"prophetess\", and Brigham Young even called [Eliza R Snow](http://www.ldswomenofgod.com/?p=989) \"a Priestess, Prophetess, and Presidentess\".  Even so, The modern LDS church has [redefined the term](http://www.lds.org/scriptures/gs/prophetess?lang=eng) to be a women, [somehow special](https://www.lds.org/ensign/1980/12/i-have-a-question?lang=eng), who does not hold priesthood keys.  Also, the recent [old testament manuals](http://tinyurl.com/a36587s) have shied away from the word entirely.  Deborah, for example, was called a \"true friend\" instead.  Even when the term is used, such as [Huldah](http://tinyurl.com/bkqcrx3), it's vague and then immediately replaced with a male prophet's comments; however, I give them credit for leaving the term in.  \n\n* Even today, women anoint and bless other women as a part of the temple initiatory rite.  They are not ordained, but they are \"endowed\" with priesthood power for this initiatory.  Perhaps this is less important with the [2005 initiatory change](http://www.ldsendowment.org/parallelinitiatory.html), where the washing and anointing is now only done symbolically to the old rite (their word, not mine).  Other beneficial points are that women are now allowed to pray [Edit: changed as of Apr 2013](http://www.reddit.com/r/exmormon/comments/1akn4u/women_to_pray_in_upcoming_april_conference/) in general conference [as of 1984](http://exmormon.org/phorum/read.php?2,223435,223458), women are allowed to pray in sacrament meetings [as of 1978](http://bycommonconsent.com/2008/05/05/not-letting-women-open-sacrament-meeting-redux/), and women are allowed to open meetings [as of 1999](http://bycommonconsent.com/2008/05/05/not-letting-women-open-sacrament-meeting-redux/).  \n\n* All of this said, [women still have a way to go for full equality](http://empoweringldswomen.blogspot.com/2010/11/non-doctrinal-changes-to-improve-gender.html)\n\n* And I'll give a final nod to Emma, a woman for whom I have much sympathy.  She had power as the \"elect lady\", she ran the Relief society for noble objectives, and she served as a Scribe for the Book of Mormon; albeit, the lost pages.  I like to imagine that she used punctuation, but that's just me.\n\n>> These individuals spread their discontent by the propaganda that there are more exciting and self-fulfilling roles for women than homemaking. Some even have been bold to suggest that the Church move away from the “Mormon woman stereotype” of homemaking and rearing children. They also say it is wise to limit your family so you can have more time for personal goals and self-fulfillment.\n\n>> In the beginning, Adam was instructed to earn the bread by the sweat of his brow—not Eve. Contrary to conventional wisdom, a mother’s place is in the home! I recognize there are voices in our midst which would attempt to convince you that these truths are not applicable to our present-day conditions. If you listen and heed, you will be lured away from your principal obligations.\n\n* And move away they have.  See [Sherri L Dew](http://en.wikipedia.org/wiki/Sheri_L._Dew).  Unmarried, in fact the first unmarried woman to be called as a Relief Society President.  CEO of Deseret Book.  Director of Bonneville International.  A member of Marriott School of Management’s National Advisory Council.   And perhaps the most celebrated female role model of modern LDS culture. \n\n* The [I'm a Mormon](http://wellbehavedmormonwoman.blogspot.com/2012/10/mormon-women-working-outside-home.html) commercials highlight women working outside of the home (see the video at the bottom of the link).  [Some have postulated](http://exmormon.org/phorum/read.php?2,319125,319379#msg-319379) that these are the majority of women shown.   Rarely will you find the obedient home maker with pictures of prophets and temples and proclamations adorning the walls of every room.\n\n* This helps to further convince me that we're witnessing [an internal only doctrine](http://www.lds.org/general-conference/2011/04/lds-women-are-incredible?lang=eng).  Nearly every talk on women appends the pregnant homemaker statement; however, in addition to the points above, the [Proclamation to the World on the Family](https://www.lds.org/topics/family-proclamation) conveniently leaves it out.  Instead, it softens the text to read \"Mothers are primarily responsible for the nurture of their children\" and says little more on her responsibility. \n\n>> It is a misguided idea that a woman should leave the home, where there is a husband and children, to prepare educationally and financially for an unforeseen eventuality. Too often, I fear, even women in the Church use the world as their standard for success and basis for self-worth.\n\n* [Gordon B Hinckley](http://www.lds.org/ensign/2007/11/three-goals-to-guide-you#1) stated, \"Beyond our study of spiritual matters, secular learning is also essential. Often the future is unknown; therefore, it behooves us to prepare for uncertainties. Statistics reveal that at some time, because of the illness or death of a husband or because of economic necessity, you may find yourself in the role of financial provider. Some of you already occupy that role. I urge you to pursue your education—if you are not already doing so or have not done so—that you might be prepared to provide if circumstances necessitate such.\"\n\n* [Thomas S Monson](http://www.lds.org/broadcasts/article/print/general-young-women-meeting/2012/03/seek-learning-you-have-a-work-to-do?lang=eng) stated, \"Often the future is unknown; therefore, it behooves us to prepare for uncertainties. … I urge you to pursue your education and learn marketable skills so that, should such a situation arise, you are prepared to provide.\"\n\n* [Spencer W Kimball](https://www.lds.org/manual/young-women-manual-1/lesson-46-the-purpose-and-value-of-education?lang=eng) stated, \"Some are inclined toward formal university training, and some are inclined more toward the practical vocational training. We feel that our people should receive that kind of training which is most consistent with their interests and talents. Whether it be in the professions, the arts, or the vocations; whether it be university or vocational training, we applaud and encourage it\"\n\n>> President Joseph F. Smith said that “parents in Zion will be held responsible for the acts of their children, not only until they become eight years old but, perhaps, throughout all the lives of their children, provided they have neglected their duty to their children while they were under their care and guidance, and the parents were responsible for them.” \n\n>> I do not wish to wound any feelings, but all of us are aware of instances of active Latter-day Saint families who are experiencing difficulties with their children because mother is not where she ought to be—in the home.\n\n>> Do you want a principle for successful motherhood? Make time to teach your children the gospel and principles of gospel living when they are young. It may be that you too will need to “renounce the world” and “devote above twenty years of the prime of life in hopes to save the souls of [your] children.”\n\nOh, what a terrible, terrible claim.  It's lines like this that cause so much problems for the poor mothers of disaffected children.  They blame themselves for the choices of others.  Is Eve to blame for Abel's death? For Sodom? For you? \n\n* I like [Hugh W Pinrock's](http://www.lds.org/general-conference/1989/04/now-is-the-time?lang=Eng&clang=eng) comments about personal responsibility, \"We feel that we, perhaps, had something to do with it—and, hopefully, our love and encouragement did help. But it was the person who returned who has taken responsibility for their salvation...A missionary might say, 'I brought fifteen people into the Church.' No, fifteen of our brothers and sisters decided to come unto Christ and, by being baptized, assumed responsibility for their own spiritual progress. Our converts must be taught that fact.\" - Surely this extends to children who have taken their spiritual progression into their own hands. \n\n* This is taken out of context, but still has some relevancy: [From Dallin H Oaks](https://www.lds.org/general-conference/2007/04/divorce?lang=eng), \"Personal circumstances vary greatly. We cannot control and we are not responsible for the choices of others, even when they impact us so painfully.\"\n\n* [James E. Faust](https://www.lds.org/general-conference/1990/10/the-greatest-challenge-in-the-world-good-parenting?lang=eng) stated, \"Let parents who have been conscientious, loving, and concerned and who have lived the principles of righteousness as best they could be comforted in knowing that they are good parents despite the actions of some of their children.\"  From his standpoint, he's referring to bad actions on the part of the child are not the responsibility of a good parent.  While I disagree on what he implies as \"bad actions\", the contradiction is clear. \n\nMothers *and Fathers* should feel an obligation to raise their children correctly; however, in the end, the child will eventually grow up and be responsible for their own decisions.  It is horrendous and cruel for the church to try and pin decisions of an adult child on the spiritual success of the parent.  \n\n>> Support, encourage, and strengthen your husband in his responsibility as patriarch in the home. You are partners with him. A woman’s role in a man’s life is to lift him, to help him uphold lofty standards, and to prepare through righteous living to be his queen for all eternity.\n\nPartners implies a certain equality.  Yet, this is not the case. \n\n* [Women covenant](http://www.ldsendowment.org/parallelgarden.html)\\* to obey their husband, before god, in the solemn temple ceremonies. Originally, this specified obedience to the \"law of their husband\", but has now been softened to \"obey his counsel\".  The [church has defined counsel as follows](https://www.lds.org/scriptures/gs/counsel-verb?lang=eng): \"As used in the scriptures, counsel means to advise or instruct.\" So a woman is agreeing to obey the advice and instruction of their husband.  Even with the softened language, that is a servant, not a partner.\\* - Look at the side by side comparison in God's lecture to Eve.  Originally, he stated, \"Thy desire shall be to thy husband, and he shall rule over thee in righteousness....Eve:  Adam, I now covenant to obey your law as you obey our Father....We will put the sisters under covenant to obey the law of their husbands.\"  I'll give them some credit for giving women an out by adding the addition, \"...as her husband hearkens unto the counsel of the Father.\"  It's still not enough, but it's something.\n\n* Also note the [church's opposition to the Equal Rights Amendment (ERA)](http://www.humanistsofutah.org/2005/MormonChurchAndERA_Aug-05.html).  Such opposition exemplified a case where the actions of the church did not [match it's declarations](https://www.lds.org/new-era/1971/11/for-girls-only?lang=eng) (search for equal rights).  In many cases, the church stated it supported equal rights of Women and Men, but then actively attempted to squash them as they came closer to reality. \n\n----\n\nWhile not referencing any part of the original talk, I want to briefly touch on polygamy's influence in the destruction of the Relief Society, that one Bastian of control given to women.  The relief society was disbanded in [in early 1844 after only operating for two years](http://runtu.wordpress.com/2009/05/12/suspending-relief-society/).  This was done due to their publicly opposition to polygamy (interestingly while Eliza R Snow, Emma's current first counselor, was one of Joseph's secret wives).  Brigham re-instated it with far less power [in 1867](http://en.wikipedia.org/wiki/Relief_Society).  Today, [that gap, the original powers, and reasoning has been buried](http://mormon.org/faq/women-in-the-church) along with the rest of polygamy (such as [Brigham\ns statement](http://scriptures.byu.edu/jod/jodhtml.php?vol=03&disc=39) that \"If any of you will deny the plurality of wives and continue to do so, I promise that you will be damned\").    The memory hole is strong ~~with this doctrine~~.\n\n----\n\n**Next up: Part 07: Restoration of all things**\n\n----\n\nLast Part [05: Trust in the Prophet and all of his doings](http://tinyurl.com/bg49k43)\n",
  "gilded": 0,
  "score": 30,
  "removal_reason": null,
  "approved_by": null,
  "created_utc": 1356895094.0,
  "is_self": true,
  "stickied": false,
  "edited": 1414959663.0,
  "distinguished": null,
  "permalink": "https://www.reddit.com/r/exmormon/comments/15opm1/hypocrisy_series_part_06_we_honor_the_woman/?ref=search_posts",
  "banned_by": null,
  "from_id": null,
  "likes": null,
  "_underscore_names": null,
  "num_reports": null,
  "link_flair_css_class": null,
  "_info_url": "https://api.reddit.com/api/info/",
  "id": "15opm1",
  "archived": true,
  "secure_media": null,
  "from_kind": null,
  "saved": false,
  "domain": "self.exmormon",
  "ups": 30,
  "suggested_sort": null,
  "quarantine": false,
  "over_18": false,
  "hide_score": false,
  "url": "https://www.reddit.com/r/exmormon/comments/15opm1/hypocrisy_series_part_06_we_honor_the_woman/",
  "subreddit_id": "t5_2r0gj",
  "_params": {},
  "_comments": null,
  "_replaced_more": false,
  "_comments_by_id": {},
  "user_reports": [],
  "media_embed": {},
  "created": 1356898694.0,
  "author_flair_text": "Truth never lost ground by enquiry.",
  "visited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For the base of this part, I&#39;d like to use a few selected quotes from <a href=\"https://www.lds.org/general-conference/1981/10/the-honored-place-of-woman?lang=eng\">&quot;The Honored Place of Woman&quot;</a>, a General Conference talk by Ezra Taft Benson in 1981. </p>\n\n<blockquote>\n<blockquote>\n<p>Since the beginning, her role has been to teach her children eternal gospel principles. </p>\n</blockquote>\n</blockquote>\n\n<ul>\n<li><p>In the modern church, women have no right to leadership, no right to govern their own beyond trivial matters, no right to officiate, no right to bless or anoint the sick, no right to ever make church-wide decisions.  In fact, they are generally left only to teach other women as instructed in material developed by the male correlation committee, or to govern children under 12 in much the same way.  However, this was not always the case. When Joseph and Emma founded the original Relief Society, women&#39;s rights and responsibilities greatly extended beyond children and recitation alone.   </p></li>\n<li><p>For example, <a href=\"http://en.wikipedia.org/wiki/Women_and_Mormonism#Frontier_women_in_19th_century_Utah\">Eliza R Snow</a> clearly stated that women were duty bound to anoint and bless the sick by laying on of hands. She said, &quot;Is it necessary for sisters to be set apart to officiate in the sacred ordinances of washing, anointing, and laying on of hands in administering to the sick? It certainly is not. Any and all sisters who honor their holy endowments, not only have right, but should feel it a duty, whenever called upon to administer to our sisters in these ordinances, which God has graciously committed to His daughters as well as to His sons; and we testify that when administered and received in faith and humility they are accompanied with almighty power&quot;</p></li>\n<li><p>She also stated that the relief society replaced and super-ceded the bishop for counseling and governing other women.  <a href=\"http://contentdm.lib.byu.edu/cdm/ref/collection/WomansExp/id/11591\">Snow said</a>, &quot;Should the members of the Relief society go to the bishops for counsel? The Relief Society is designed to be a self-governing organization:to relieve the Bishops as well as to relieve the poor, to deal with its members, correct abuses, etc.  If difficulties arise between members of a branch which they cannot settle between the members themselves, sided by the teachers, instead of troubling the Bishop, the matter should be referred to their [Relief Society] president and her counselors.&quot;  (See notes below for the definition of counsel)</p></li>\n<li><p>There were multiple references <a href=\"http://classic.scriptures.lds.org/en/tg/p/234\">in the old testament</a> to &quot;prophetess&quot;, and Brigham Young even called <a href=\"http://www.ldswomenofgod.com/?p=989\">Eliza R Snow</a> &quot;a Priestess, Prophetess, and Presidentess&quot;.  Even so, The modern LDS church has <a href=\"http://www.lds.org/scriptures/gs/prophetess?lang=eng\">redefined the term</a> to be a women, <a href=\"https://www.lds.org/ensign/1980/12/i-have-a-question?lang=eng\">somehow special</a>, who does not hold priesthood keys.  Also, the recent <a href=\"http://tinyurl.com/a36587s\">old testament manuals</a> have shied away from the word entirely.  Deborah, for example, was called a &quot;true friend&quot; instead.  Even when the term is used, such as <a href=\"http://tinyurl.com/bkqcrx3\">Huldah</a>, it&#39;s vague and then immediately replaced with a male prophet&#39;s comments; however, I give them credit for leaving the term in.  </p></li>\n<li><p>Even today, women anoint and bless other women as a part of the temple initiatory rite.  They are not ordained, but they are &quot;endowed&quot; with priesthood power for this initiatory.  Perhaps this is less important with the <a href=\"http://www.ldsendowment.org/parallelinitiatory.html\">2005 initiatory change</a>, where the washing and anointing is now only done symbolically to the old rite (their word, not mine).  Other beneficial points are that women are now allowed to pray <a href=\"http://www.reddit.com/r/exmormon/comments/1akn4u/women_to_pray_in_upcoming_april_conference/\">Edit: changed as of Apr 2013</a> in general conference <a href=\"http://exmormon.org/phorum/read.php?2,223435,223458\">as of 1984</a>, women are allowed to pray in sacrament meetings <a href=\"http://bycommonconsent.com/2008/05/05/not-letting-women-open-sacrament-meeting-redux/\">as of 1978</a>, and women are allowed to open meetings <a href=\"http://bycommonconsent.com/2008/05/05/not-letting-women-open-sacrament-meeting-redux/\">as of 1999</a>.  </p></li>\n<li><p>All of this said, <a href=\"http://empoweringldswomen.blogspot.com/2010/11/non-doctrinal-changes-to-improve-gender.html\">women still have a way to go for full equality</a></p></li>\n<li><p>And I&#39;ll give a final nod to Emma, a woman for whom I have much sympathy.  She had power as the &quot;elect lady&quot;, she ran the Relief society for noble objectives, and she served as a Scribe for the Book of Mormon; albeit, the lost pages.  I like to imagine that she used punctuation, but that&#39;s just me.</p></li>\n</ul>\n\n<blockquote>\n<blockquote>\n<p>These individuals spread their discontent by the propaganda that there are more exciting and self-fulfilling roles for women than homemaking. Some even have been bold to suggest that the Church move away from the “Mormon woman stereotype” of homemaking and rearing children. They also say it is wise to limit your family so you can have more time for personal goals and self-fulfillment.</p>\n\n<p>In the beginning, Adam was instructed to earn the bread by the sweat of his brow—not Eve. Contrary to conventional wisdom, a mother’s place is in the home! I recognize there are voices in our midst which would attempt to convince you that these truths are not applicable to our present-day conditions. If you listen and heed, you will be lured away from your principal obligations.</p>\n</blockquote>\n</blockquote>\n\n<ul>\n<li><p>And move away they have.  See <a href=\"http://en.wikipedia.org/wiki/Sheri_L._Dew\">Sherri L Dew</a>.  Unmarried, in fact the first unmarried woman to be called as a Relief Society President.  CEO of Deseret Book.  Director of Bonneville International.  A member of Marriott School of Management’s National Advisory Council.   And perhaps the most celebrated female role model of modern LDS culture. </p></li>\n<li><p>The <a href=\"http://wellbehavedmormonwoman.blogspot.com/2012/10/mormon-women-working-outside-home.html\">I&#39;m a Mormon</a> commercials highlight women working outside of the home (see the video at the bottom of the link).  <a href=\"http://exmormon.org/phorum/read.php?2,319125,319379#msg-319379\">Some have postulated</a> that these are the majority of women shown.   Rarely will you find the obedient home maker with pictures of prophets and temples and proclamations adorning the walls of every room.</p></li>\n<li><p>This helps to further convince me that we&#39;re witnessing <a href=\"http://www.lds.org/general-conference/2011/04/lds-women-are-incredible?lang=eng\">an internal only doctrine</a>.  Nearly every talk on women appends the pregnant homemaker statement; however, in addition to the points above, the <a href=\"https://www.lds.org/topics/family-proclamation\">Proclamation to the World on the Family</a> conveniently leaves it out.  Instead, it softens the text to read &quot;Mothers are primarily responsible for the nurture of their children&quot; and says little more on her responsibility. </p></li>\n</ul>\n\n<blockquote>\n<blockquote>\n<p>It is a misguided idea that a woman should leave the home, where there is a husband and children, to prepare educationally and financially for an unforeseen eventuality. Too often, I fear, even women in the Church use the world as their standard for success and basis for self-worth.</p>\n</blockquote>\n</blockquote>\n\n<ul>\n<li><p><a href=\"http://www.lds.org/ensign/2007/11/three-goals-to-guide-you#1\">Gordon B Hinckley</a> stated, &quot;Beyond our study of spiritual matters, secular learning is also essential. Often the future is unknown; therefore, it behooves us to prepare for uncertainties. Statistics reveal that at some time, because of the illness or death of a husband or because of economic necessity, you may find yourself in the role of financial provider. Some of you already occupy that role. I urge you to pursue your education—if you are not already doing so or have not done so—that you might be prepared to provide if circumstances necessitate such.&quot;</p></li>\n<li><p><a href=\"http://www.lds.org/broadcasts/article/print/general-young-women-meeting/2012/03/seek-learning-you-have-a-work-to-do?lang=eng\">Thomas S Monson</a> stated, &quot;Often the future is unknown; therefore, it behooves us to prepare for uncertainties. … I urge you to pursue your education and learn marketable skills so that, should such a situation arise, you are prepared to provide.&quot;</p></li>\n<li><p><a href=\"https://www.lds.org/manual/young-women-manual-1/lesson-46-the-purpose-and-value-of-education?lang=eng\">Spencer W Kimball</a> stated, &quot;Some are inclined toward formal university training, and some are inclined more toward the practical vocational training. We feel that our people should receive that kind of training which is most consistent with their interests and talents. Whether it be in the professions, the arts, or the vocations; whether it be university or vocational training, we applaud and encourage it&quot;</p></li>\n</ul>\n\n<blockquote>\n<blockquote>\n<p>President Joseph F. Smith said that “parents in Zion will be held responsible for the acts of their children, not only until they become eight years old but, perhaps, throughout all the lives of their children, provided they have neglected their duty to their children while they were under their care and guidance, and the parents were responsible for them.” </p>\n\n<p>I do not wish to wound any feelings, but all of us are aware of instances of active Latter-day Saint families who are experiencing difficulties with their children because mother is not where she ought to be—in the home.</p>\n\n<p>Do you want a principle for successful motherhood? Make time to teach your children the gospel and principles of gospel living when they are young. It may be that you too will need to “renounce the world” and “devote above twenty years of the prime of life in hopes to save the souls of [your] children.”</p>\n</blockquote>\n</blockquote>\n\n<p>Oh, what a terrible, terrible claim.  It&#39;s lines like this that cause so much problems for the poor mothers of disaffected children.  They blame themselves for the choices of others.  Is Eve to blame for Abel&#39;s death? For Sodom? For you? </p>\n\n<ul>\n<li><p>I like <a href=\"http://www.lds.org/general-conference/1989/04/now-is-the-time?lang=Eng&amp;clang=eng\">Hugh W Pinrock&#39;s</a> comments about personal responsibility, &quot;We feel that we, perhaps, had something to do with it—and, hopefully, our love and encouragement did help. But it was the person who returned who has taken responsibility for their salvation...A missionary might say, &#39;I brought fifteen people into the Church.&#39; No, fifteen of our brothers and sisters decided to come unto Christ and, by being baptized, assumed responsibility for their own spiritual progress. Our converts must be taught that fact.&quot; - Surely this extends to children who have taken their spiritual progression into their own hands. </p></li>\n<li><p>This is taken out of context, but still has some relevancy: <a href=\"https://www.lds.org/general-conference/2007/04/divorce?lang=eng\">From Dallin H Oaks</a>, &quot;Personal circumstances vary greatly. We cannot control and we are not responsible for the choices of others, even when they impact us so painfully.&quot;</p></li>\n<li><p><a href=\"https://www.lds.org/general-conference/1990/10/the-greatest-challenge-in-the-world-good-parenting?lang=eng\">James E. Faust</a> stated, &quot;Let parents who have been conscientious, loving, and concerned and who have lived the principles of righteousness as best they could be comforted in knowing that they are good parents despite the actions of some of their children.&quot;  From his standpoint, he&#39;s referring to bad actions on the part of the child are not the responsibility of a good parent.  While I disagree on what he implies as &quot;bad actions&quot;, the contradiction is clear. </p></li>\n</ul>\n\n<p>Mothers <em>and Fathers</em> should feel an obligation to raise their children correctly; however, in the end, the child will eventually grow up and be responsible for their own decisions.  It is horrendous and cruel for the church to try and pin decisions of an adult child on the spiritual success of the parent.  </p>\n\n<blockquote>\n<blockquote>\n<p>Support, encourage, and strengthen your husband in his responsibility as patriarch in the home. You are partners with him. A woman’s role in a man’s life is to lift him, to help him uphold lofty standards, and to prepare through righteous living to be his queen for all eternity.</p>\n</blockquote>\n</blockquote>\n\n<p>Partners implies a certain equality.  Yet, this is not the case. </p>\n\n<ul>\n<li><p><a href=\"http://www.ldsendowment.org/parallelgarden.html\">Women covenant</a>* to obey their husband, before god, in the solemn temple ceremonies. Originally, this specified obedience to the &quot;law of their husband&quot;, but has now been softened to &quot;obey his counsel&quot;.  The <a href=\"https://www.lds.org/scriptures/gs/counsel-verb?lang=eng\">church has defined counsel as follows</a>: &quot;As used in the scriptures, counsel means to advise or instruct.&quot; So a woman is agreeing to obey the advice and instruction of their husband.  Even with the softened language, that is a servant, not a partner.* - Look at the side by side comparison in God&#39;s lecture to Eve.  Originally, he stated, &quot;Thy desire shall be to thy husband, and he shall rule over thee in righteousness....Eve:  Adam, I now covenant to obey your law as you obey our Father....We will put the sisters under covenant to obey the law of their husbands.&quot;  I&#39;ll give them some credit for giving women an out by adding the addition, &quot;...as her husband hearkens unto the counsel of the Father.&quot;  It&#39;s still not enough, but it&#39;s something.</p></li>\n<li><p>Also note the <a href=\"http://www.humanistsofutah.org/2005/MormonChurchAndERA_Aug-05.html\">church&#39;s opposition to the Equal Rights Amendment (ERA)</a>.  Such opposition exemplified a case where the actions of the church did not <a href=\"https://www.lds.org/new-era/1971/11/for-girls-only?lang=eng\">match it&#39;s declarations</a> (search for equal rights).  In many cases, the church stated it supported equal rights of Women and Men, but then actively attempted to squash them as they came closer to reality. </p></li>\n</ul>\n\n<hr/>\n\n<p>While not referencing any part of the original talk, I want to briefly touch on polygamy&#39;s influence in the destruction of the Relief Society, that one Bastian of control given to women.  The relief society was disbanded in <a href=\"http://runtu.wordpress.com/2009/05/12/suspending-relief-society/\">in early 1844 after only operating for two years</a>.  This was done due to their publicly opposition to polygamy (interestingly while Eliza R Snow, Emma&#39;s current first counselor, was one of Joseph&#39;s secret wives).  Brigham re-instated it with far less power <a href=\"http://en.wikipedia.org/wiki/Relief_Society\">in 1867</a>.  Today, <a href=\"http://mormon.org/faq/women-in-the-church\">that gap, the original powers, and reasoning has been buried</a> along with the rest of polygamy (such as <a href=\"http://scriptures.byu.edu/jod/jodhtml.php?vol=03&amp;disc=39\">Brigham\ns statement</a> that &quot;If any of you will deny the plurality of wives and continue to do so, I promise that you will be damned&quot;).    The memory hole is strong <del>with this doctrine</del>.</p>\n\n<hr/>\n\n<p><strong>Next up: Part 07: Restoration of all things</strong></p>\n\n<hr/>\n\n<p>Last Part <a href=\"http://tinyurl.com/bg49k43\">05: Trust in the Prophet and all of his doings</a></p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "_comment_sort": null,
  "report_reasons": null,
  "name": "t3_15opm1",
  "from": null,
  "hidden": false,
  "clicked": false,
  "media": null,
  "json_dict": null,
  "_api_link": "https://api.reddit.com/r/exmormon/comments/15opm1/hypocrisy_series_part_06_we_honor_the_woman/?ref=search_posts",
  "secure_media_embed": {},
  "mod_reports": [],
  "_orphaned": {},
  "_uniq": null,
  "num_comments": 13,
  "link_flair_text": null,
  "title": "Hypocrisy Series Part 06: We honor the woman",
  "_has_fetched": true,
  "author_flair_css_class": "moderator",
  "thumbnail": "self"
}