{
  "selftext": "Indeed, virtual currencies are nothing new to the Chinese. For example, more than 100 million people on the social platform QQ have used the Q coin for more than 10 years. And after China’s state-run China Central Television, or CCTV, ran a half-hour-long documentary on bitcoins, downloads of apps for processing and “mining” bitcoins soared in the world’s second largest economy.\n\nBitcoin, long the plaything of the Western ubernerd, now appears poised to grow substantially in China and other markets, like the euro zone, where government meddling in native currency valuations has left many distrustful of the money in their bank accounts.\n\nAmericans don’t have this problem -- yet. And that may be a problem in itself. According to bitcoin proponents, if the U.S. tries to ignore the nascent currency, writing it off as a financial fad with less value than the seemingly stable dollar, Americans risk ceding to the Chinese and others control of the future of what could be the most disruptive force in monetary exchanges since the credit card. In turn, the dollar and the ability of the U.S. to navigate global currency conflicts could be seriously weakened.\n\n“Here’s the bottom line: Bitcoin has much higher popularity outside the U.S. and much higher potential outside the U.S.,” observed Andreas M. Antonopoulos of the Bitcoin Foundation. “If you go to an American and say, ‘Hey, there’s this new thing, bitcoin,’ they say, ‘Well, what’s wrong with the dollar?’ That question is different in other countries.”\n\nBitcoins are a finite, Web-based currency created in 2009 by a group of hackers working under the nom-de-Internet Satoshi Nakamoto. Exactly 10,952,975 bitcoins are in circulation, all of which have been purchased on exchange networks or mined. The currency is mined using software that processes transactions on the bitcoin network, adding groups of transactions, called blocks, to the chain. Miners are paid about 25 bitcoins per block. That digital money can then be used to purchase a variety of goods online, from legitimate software to heroin on the infamous virtual black-market Silk Road.\n\nBitcoin surged in value to $266 last month, thrusting the currency into the mainstream spotlight as investment poured in from sources as diverse as the hapless Brothers Winklevoss (of Facebook infamy) and Union Capital Ventures principal Fred Wilson (an early investor in Zynga, Twitter, and Kickstarter). Suddenly, everyone was talking about buying bitcoins. But the bubble burst in late April, and in the U.S. at least, bitcoin faded from the news. That was not the case in China, where Antonopoulos said downloads of bitcoin clients have eclipsed those in the U.S.\n\nBitcoins are mined in several steps. After downloading a bitcoin client, such as Coinbase (which serves as a wallet in which to store the bits of code that constitute the digital money), miners often join pools where they share computing power to decode algorithms in which bitcoins are hidden. The concept of bitcoins and bitcoin mining is cryptic for many people, even some otherwise forward-thinking American investors. The irony is that, for now, American startups are leading the bitcoin charge, and the U.S. government was the first to issue guidance on using the currency as payment -- a seemingly tacit recognition of bitcoin’s validity as legal tender.\n\n**Why China Poses A Threat**\n\nFeng Li, the IDG partner who chose to fund Coinbase, said the Chinese have yearned for access to a virtual currency since the central government cracked down on the use of Q coins.\n\nQ coins were introduced in March 2002 by Tencent Holdings Ltd. (HKG:0700), the parent company of the country’s most popular instant-messaging service, QQ , and they currently average an annual transaction value of more than 1 billion yuan ($163 million). That value is growing at about 15 to 25 percent each year.\n\nQ coins, purchased with yuan, are predominantly used to buy virtual products and services in QQ and its related online games and social media. Originally, Tencent regulations prevented Q coins from being traded between users or converted back to yuan, but allowed users to trade points and purchase Q coins with their game accounts, then use the black market to convert them into cash. That caused concerns at the People’s Bank of China, China’s central bank. In January 2007, converting game points to Q coins was banned, and Tencent reiterated that Q coins constitute a product, not a currency, which seemed to satisfy the concerns.\n\n“There has already been proof with the Q coin,” Feng said of the Chinese likeliness to start using bitcoin. “It’s been very well circulated and very well adopted.”\n\nAlready, shops on Taobao -- the Chinese equivalent to eBay Inc. (NASDAQ:EBAY), owned by Alibaba.com Ltd. (HKG:1688) -- accept bitcoins as payment for goods, as does the similar service, Tencent’s PaiPai.com.\n\nThe Chinese are embracing bitcoins in other ways. The first bitcoin fund began to raise money in June, with the goal of raising 20 million yuan. The fund’s investment threshold is 10,000 yuan, and it will mature in four years.\n\nQ coin’s popularity isn’t the only reason bitcoin has appeal in China. As it turns out, China is the perfect place for bitcoin mining. While much of the developed world is well into the transition from personal computers to mobile devices, China’s PC market is still thriving, which provides the necessary computing power to run a successful business converting electricity into mined coins. Price caps on electricity already create wasteful use of energy in China, so running a code-crunching computer for hours on end isn’t as costly an investment as it would be in the U.S. And so-called “gold-mining” or “gold-farming” businesses already exist in China’s cybersphere. None of that will come as a surprise to any “World of Warcraft” player: Gamers in Chinese urban sweatshops are known to sit in front of glowing blue screens for hours, slaughtering players in the game for their spoils or mining gold deposits found in the sprawling milieu of Blizzard Entertainment’s international blockbuster. Those treasures are then sold to players in the game for real money.\n\nChina has a heavily controlled currency, which also makes bitcoin attractive.  \n\n“The more controlled the currency is, the harder the transactions are, the more friction there is in the national currency, the more appealing the coin is,” Antonopoulos said, noted that the most appealing place to use bitcoin would be a country whose economy is a veritable train wreck -- like Zimbabwe, except that the southern African nation lacks the necessary technology. “I would say China is perfect,” he said. “It’s got the penetration, it’s got the smartphones, it’s got the Internet and the people are familiar with virtual currencies. And, it’s got the not-as-appealing national currency.”\n\n**Regulation In The U.S.**\n\nGuidance issued in March by the U.S. Treasury Department said that companies issuing or exchanging online cash, including bitcoin, would be subject to the same scrutiny as traditional firms such as the Western Union Co. (NYSE:WU) to prevent money laundering.\n\nLess than two months later, the Department of Homeland Security proved that edict had teeth.\n\nFederal officials obtained a warrant Tuesday to seize an account tied to Mt.Gox, the Tokyo-based exchange company that handles about 80 percent of all bitcoin trades. Authorities accused Mt.Gox’s U.S. subsidiary, Mutum Sigillum LLC, of failing to register as a money-services company with the Treasury’s Financial Crimes Enforcement Network. An account held by the online-payments firm Dwolla was subsequently seized.\n\nMany feared the warrant execution could cast a chill over the bitcoin industry as a sector centered on a borderless, decentralized money came under the scrutiny of the federal government.\n\nThat proved not to be the case, Coinbase’s Ehrsam said. “For bitcoin to go mainstream, or as it goes mainstream, it will be used in a higher and higher amount of transactions,” he said, adding that Coinbase is registered as a money-services firm. “There’s no way there will be all this money flowing through an unregulated system.”\n\nChris Larsen -- the CEO of OpenCoin, a fellow San Francisco-based payment platform that processes most national currencies as well as bitcoin and its own virtual cash, Ripple -- agreed. “They definitely are regulating them, [and] we actually think that’s a really good thing for the industry,” he told IBTimes. “I thought the guidance was a good idea. One of the things the guidelines seem to make clear for the first time is that a virtual currency could be used for goods and services.”\n\n**The Price Of Regulation**\n\nBut such regulation is a slippery slope, said Jerry Brito, a senior research fellow at the Mercatus Center at George Mason University.\n\nPerhaps it begins with measures to prevent money-laundering, he said. But what measures would the government take to prevent the untraceable currency from being used for child pornography or human trafficking?\n\n“Bitcoin has the potential to be a disruptive technology that would be beneficial to the economy, and we don’t want to kill off that potential to get at the other potential for bad stuff,” he observed. Brito, who plans to speak next month at a conference on virtual currencies organized by the National Center for Missing and Exploited Children, added: “We’re already the first country to enforce money-laundering laws against bitcoin. But the U.S. would be shooting itself in the foot if it went too far [with regulations] and either outlawed bitcoin or made the legal guidelines impossible to comply with.”\n\n**Will China Step In?**\n\nSo far, Chinese bitcoin merchants have little to fear. For many, the CCTV segment on bitcoin seemed to be a signal from Beijing, which heavily controls the channel’s content, that the currency is worth exploring.\n\nSome of those interviewed speculated that the Communist Party wants to see bitcoin stockpiled in China, allowing the government to invest in it if, or when, the dollar is shaken from its perch as the world’s reserve currency.\n\nIt remains to be seen whether -- or, more likely, when -- China will intervene in the trade of bitcoin in its own economy. But for the U.S. to experience widespread adoption of the currency, which is considered a necessary step for gaining a grasp on the bitcoin market, limited government control will have to allow the money, like the Internet that birthed it, to develop organically.\n\n- ibtimes.com\n",
  "gilded": 0,
  "score": 257,
  "removal_reason": null,
  "approved_by": null,
  "created_utc": 1370719249.0,
  "is_self": true,
  "stickied": false,
  "edited": false,
  "distinguished": null,
  "permalink": "https://www.reddit.com/r/Bitcoin/comments/1fxuxa/battle_over_bitcoin_china_backs_us_startup/?ref=search_posts",
  "banned_by": null,
  "from_id": null,
  "likes": null,
  "_underscore_names": null,
  "num_reports": null,
  "link_flair_css_class": null,
  "_info_url": "https://api.reddit.com/api/info/",
  "id": "1fxuxa",
  "archived": true,
  "secure_media": null,
  "from_kind": null,
  "saved": false,
  "domain": "self.Bitcoin",
  "ups": 257,
  "suggested_sort": null,
  "quarantine": false,
  "over_18": false,
  "hide_score": false,
  "url": "https://www.reddit.com/r/Bitcoin/comments/1fxuxa/battle_over_bitcoin_china_backs_us_startup/",
  "subreddit_id": "t5_2s3qj",
  "_params": {},
  "_comments": null,
  "_replaced_more": false,
  "_comments_by_id": {},
  "user_reports": [],
  "media_embed": {},
  "created": 1370722849.0,
  "author_flair_text": null,
  "visited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Indeed, virtual currencies are nothing new to the Chinese. For example, more than 100 million people on the social platform QQ have used the Q coin for more than 10 years. And after China’s state-run China Central Television, or CCTV, ran a half-hour-long documentary on bitcoins, downloads of apps for processing and “mining” bitcoins soared in the world’s second largest economy.</p>\n\n<p>Bitcoin, long the plaything of the Western ubernerd, now appears poised to grow substantially in China and other markets, like the euro zone, where government meddling in native currency valuations has left many distrustful of the money in their bank accounts.</p>\n\n<p>Americans don’t have this problem -- yet. And that may be a problem in itself. According to bitcoin proponents, if the U.S. tries to ignore the nascent currency, writing it off as a financial fad with less value than the seemingly stable dollar, Americans risk ceding to the Chinese and others control of the future of what could be the most disruptive force in monetary exchanges since the credit card. In turn, the dollar and the ability of the U.S. to navigate global currency conflicts could be seriously weakened.</p>\n\n<p>“Here’s the bottom line: Bitcoin has much higher popularity outside the U.S. and much higher potential outside the U.S.,” observed Andreas M. Antonopoulos of the Bitcoin Foundation. “If you go to an American and say, ‘Hey, there’s this new thing, bitcoin,’ they say, ‘Well, what’s wrong with the dollar?’ That question is different in other countries.”</p>\n\n<p>Bitcoins are a finite, Web-based currency created in 2009 by a group of hackers working under the nom-de-Internet Satoshi Nakamoto. Exactly 10,952,975 bitcoins are in circulation, all of which have been purchased on exchange networks or mined. The currency is mined using software that processes transactions on the bitcoin network, adding groups of transactions, called blocks, to the chain. Miners are paid about 25 bitcoins per block. That digital money can then be used to purchase a variety of goods online, from legitimate software to heroin on the infamous virtual black-market Silk Road.</p>\n\n<p>Bitcoin surged in value to $266 last month, thrusting the currency into the mainstream spotlight as investment poured in from sources as diverse as the hapless Brothers Winklevoss (of Facebook infamy) and Union Capital Ventures principal Fred Wilson (an early investor in Zynga, Twitter, and Kickstarter). Suddenly, everyone was talking about buying bitcoins. But the bubble burst in late April, and in the U.S. at least, bitcoin faded from the news. That was not the case in China, where Antonopoulos said downloads of bitcoin clients have eclipsed those in the U.S.</p>\n\n<p>Bitcoins are mined in several steps. After downloading a bitcoin client, such as Coinbase (which serves as a wallet in which to store the bits of code that constitute the digital money), miners often join pools where they share computing power to decode algorithms in which bitcoins are hidden. The concept of bitcoins and bitcoin mining is cryptic for many people, even some otherwise forward-thinking American investors. The irony is that, for now, American startups are leading the bitcoin charge, and the U.S. government was the first to issue guidance on using the currency as payment -- a seemingly tacit recognition of bitcoin’s validity as legal tender.</p>\n\n<p><strong>Why China Poses A Threat</strong></p>\n\n<p>Feng Li, the IDG partner who chose to fund Coinbase, said the Chinese have yearned for access to a virtual currency since the central government cracked down on the use of Q coins.</p>\n\n<p>Q coins were introduced in March 2002 by Tencent Holdings Ltd. (HKG:0700), the parent company of the country’s most popular instant-messaging service, QQ , and they currently average an annual transaction value of more than 1 billion yuan ($163 million). That value is growing at about 15 to 25 percent each year.</p>\n\n<p>Q coins, purchased with yuan, are predominantly used to buy virtual products and services in QQ and its related online games and social media. Originally, Tencent regulations prevented Q coins from being traded between users or converted back to yuan, but allowed users to trade points and purchase Q coins with their game accounts, then use the black market to convert them into cash. That caused concerns at the People’s Bank of China, China’s central bank. In January 2007, converting game points to Q coins was banned, and Tencent reiterated that Q coins constitute a product, not a currency, which seemed to satisfy the concerns.</p>\n\n<p>“There has already been proof with the Q coin,” Feng said of the Chinese likeliness to start using bitcoin. “It’s been very well circulated and very well adopted.”</p>\n\n<p>Already, shops on Taobao -- the Chinese equivalent to eBay Inc. (NASDAQ:EBAY), owned by Alibaba.com Ltd. (HKG:1688) -- accept bitcoins as payment for goods, as does the similar service, Tencent’s PaiPai.com.</p>\n\n<p>The Chinese are embracing bitcoins in other ways. The first bitcoin fund began to raise money in June, with the goal of raising 20 million yuan. The fund’s investment threshold is 10,000 yuan, and it will mature in four years.</p>\n\n<p>Q coin’s popularity isn’t the only reason bitcoin has appeal in China. As it turns out, China is the perfect place for bitcoin mining. While much of the developed world is well into the transition from personal computers to mobile devices, China’s PC market is still thriving, which provides the necessary computing power to run a successful business converting electricity into mined coins. Price caps on electricity already create wasteful use of energy in China, so running a code-crunching computer for hours on end isn’t as costly an investment as it would be in the U.S. And so-called “gold-mining” or “gold-farming” businesses already exist in China’s cybersphere. None of that will come as a surprise to any “World of Warcraft” player: Gamers in Chinese urban sweatshops are known to sit in front of glowing blue screens for hours, slaughtering players in the game for their spoils or mining gold deposits found in the sprawling milieu of Blizzard Entertainment’s international blockbuster. Those treasures are then sold to players in the game for real money.</p>\n\n<p>China has a heavily controlled currency, which also makes bitcoin attractive.  </p>\n\n<p>“The more controlled the currency is, the harder the transactions are, the more friction there is in the national currency, the more appealing the coin is,” Antonopoulos said, noted that the most appealing place to use bitcoin would be a country whose economy is a veritable train wreck -- like Zimbabwe, except that the southern African nation lacks the necessary technology. “I would say China is perfect,” he said. “It’s got the penetration, it’s got the smartphones, it’s got the Internet and the people are familiar with virtual currencies. And, it’s got the not-as-appealing national currency.”</p>\n\n<p><strong>Regulation In The U.S.</strong></p>\n\n<p>Guidance issued in March by the U.S. Treasury Department said that companies issuing or exchanging online cash, including bitcoin, would be subject to the same scrutiny as traditional firms such as the Western Union Co. (NYSE:WU) to prevent money laundering.</p>\n\n<p>Less than two months later, the Department of Homeland Security proved that edict had teeth.</p>\n\n<p>Federal officials obtained a warrant Tuesday to seize an account tied to Mt.Gox, the Tokyo-based exchange company that handles about 80 percent of all bitcoin trades. Authorities accused Mt.Gox’s U.S. subsidiary, Mutum Sigillum LLC, of failing to register as a money-services company with the Treasury’s Financial Crimes Enforcement Network. An account held by the online-payments firm Dwolla was subsequently seized.</p>\n\n<p>Many feared the warrant execution could cast a chill over the bitcoin industry as a sector centered on a borderless, decentralized money came under the scrutiny of the federal government.</p>\n\n<p>That proved not to be the case, Coinbase’s Ehrsam said. “For bitcoin to go mainstream, or as it goes mainstream, it will be used in a higher and higher amount of transactions,” he said, adding that Coinbase is registered as a money-services firm. “There’s no way there will be all this money flowing through an unregulated system.”</p>\n\n<p>Chris Larsen -- the CEO of OpenCoin, a fellow San Francisco-based payment platform that processes most national currencies as well as bitcoin and its own virtual cash, Ripple -- agreed. “They definitely are regulating them, [and] we actually think that’s a really good thing for the industry,” he told IBTimes. “I thought the guidance was a good idea. One of the things the guidelines seem to make clear for the first time is that a virtual currency could be used for goods and services.”</p>\n\n<p><strong>The Price Of Regulation</strong></p>\n\n<p>But such regulation is a slippery slope, said Jerry Brito, a senior research fellow at the Mercatus Center at George Mason University.</p>\n\n<p>Perhaps it begins with measures to prevent money-laundering, he said. But what measures would the government take to prevent the untraceable currency from being used for child pornography or human trafficking?</p>\n\n<p>“Bitcoin has the potential to be a disruptive technology that would be beneficial to the economy, and we don’t want to kill off that potential to get at the other potential for bad stuff,” he observed. Brito, who plans to speak next month at a conference on virtual currencies organized by the National Center for Missing and Exploited Children, added: “We’re already the first country to enforce money-laundering laws against bitcoin. But the U.S. would be shooting itself in the foot if it went too far [with regulations] and either outlawed bitcoin or made the legal guidelines impossible to comply with.”</p>\n\n<p><strong>Will China Step In?</strong></p>\n\n<p>So far, Chinese bitcoin merchants have little to fear. For many, the CCTV segment on bitcoin seemed to be a signal from Beijing, which heavily controls the channel’s content, that the currency is worth exploring.</p>\n\n<p>Some of those interviewed speculated that the Communist Party wants to see bitcoin stockpiled in China, allowing the government to invest in it if, or when, the dollar is shaken from its perch as the world’s reserve currency.</p>\n\n<p>It remains to be seen whether -- or, more likely, when -- China will intervene in the trade of bitcoin in its own economy. But for the U.S. to experience widespread adoption of the currency, which is considered a necessary step for gaining a grasp on the bitcoin market, limited government control will have to allow the money, like the Internet that birthed it, to develop organically.</p>\n\n<ul>\n<li>ibtimes.com</li>\n</ul>\n</div><!-- SC_ON -->",
  "downs": 0,
  "_comment_sort": null,
  "report_reasons": null,
  "name": "t3_1fxuxa",
  "from": null,
  "hidden": false,
  "clicked": false,
  "media": null,
  "json_dict": null,
  "_api_link": "https://api.reddit.com/r/Bitcoin/comments/1fxuxa/battle_over_bitcoin_china_backs_us_startup/?ref=search_posts",
  "secure_media_embed": {},
  "mod_reports": [],
  "_orphaned": {},
  "_uniq": null,
  "num_comments": 75,
  "link_flair_text": null,
  "title": "Battle Over Bitcoin: China Backs US Startup Coinbase And US Falls Behind In Virtual Currencies.",
  "_has_fetched": true,
  "author_flair_css_class": null,
  "thumbnail": "self"
}