{
  "clicked": false,
  "_replaced_more": false,
  "archived": false,
  "post_hint": "self",
  "num_comments": 7,
  "created": 1433868754.0,
  "saved": false,
  "selftext": "[Source 1](http://gizadeathstar.com/2015/06/more-banker-deaths-gilligan-at-american-express-noyce-at-goldman-sachs-and-the-repeating-pattern/)\n\n[Source 2](http://gizadeathstar.com/2015/06/the-third-dead-banker-suicided-thomas-j-hughes/)\n\n>I cannot help but be suspicious any more on all the bankers and financiers dying, even if they do so due to \"natural causes.\" Case in point here are the deaths, within this last week, of the President of American Express, and a key analyst for Goldman Sachs. Here are the stories:\n\n[Markets More: American Express Death American Express president Ed Gilligan has died](http://uk.businessinsider.com/american-express-president-ed-gilligan-dies-suddenly-2015-5?r=US)\n\n[John Noyce, ‘Must Read’ Goldman Currency Analyst, Dies at 36](http://www.bloomberg.com/news/articles/2015-06-04/john-noyce-goldman-s-must-read-foreign-exchange-analyst-dies)\n\n>Now, so far, everything seems normal: Mr. Noyce had apparently been battling with cancer for some time, and Mr. Gilligan simply become \"suddenly ill\" on an airplane flight and expired. But again, these two unfortunate men appear to be part of that \"pattern\" that seems to be emerging with all the banker deaths. Here's the way Mr. Gilligan's death is being reported by Bloomberg:\n\n\"He became seriously ill on a flight home to New York this morning, the statement said.\n\n\"This is deeply painful and frankly unimaginable for all of us who had the great fortune to work with Ed, and benefit from his insights, leadership and enthusiasm,\" CEO Ken Chenault said in the letter to employees.\n\n\"Our thoughts and prayers go out to his wife, Lisa, and their four children – Katie, Meaghan, Kevin and Shane. He was a proud husband and father, and his love for his family was evident in all that he did.\"\n\n>And then in American Express's own release:\n\n\"His contributions have left an indelible imprint on practically every area of our business, from Commercial Card and Travel to International, Consumer, Small Business, Merchant Services, Network Services and, most recently, the group forging our digital partnerships and driving payment innovations.\"\n\n>So where's the familiar pattern? Well, in Mr. Gilligan's case, it is (1) in his popularity with employees, colleagues, and family, a feature that seems to recur with each such death; and (2) he was involved in aspects of the financial sector having directly to do with computers, electronic payments and clearing, and, in his case, \"forging digital partnerships\", and driving \"payment innovaitons,\" language that at least to this amateur's instincts sound all too like the formation of financial data cartels and trusts.\n\n>Then there is this about the unfortunate Mr. Noyce at Goldman Sachs:\n\n\"John Noyce, a technical analyst at Goldman Sachs Group Inc.’s London currency trading desk whose weekly report “The Charts That Matter Next Week” was widely followed, has died. He was 36.\n\n\"He died on June 4 after a long battle with cancer, Goldman Sachs wrote in an internal memo signed by Isabelle Ealet, Pablo Salame and Ashok Varadhan, co-heads of its securities unit.\n\n“He was well respected by market participants for his insightful analysis,” they wrote. “On the trading floor, he was a trusted colleague and friend -- demonstrated clearly by the overwhelming support he received from GS colleagues throughout his illness.”\n\n>And toward the end of the article, this tidbit is offered:\n\n\"Noyce left Citigroup for New York-based Goldman Sachs in 2008, according to his employment history on the Financial Industry Regulatory Authority website. He joined Goldman Sachs as a vice president for European fixed income, currencies and commodities strategies, according to the company memo.\"\n\n>Again, one has the familiar pattern of (1) respected and liked by fellow colleagues and professionals, and (2) involvement in the sector of the business having to do with computers and electronic trading, and notably, in this case, with currencies and commodities strategies.\n\n>All we are told about the unfortunate Mr. Noyce is that he had been battling cancer \"for a long time.\" We are told nothing about whatever illness Mr. Gilligan apparently died from, nor is there even any indication that an autopsy will be, or has been performed. \n\n>But it's the consistency of the pattern that has emerged that disturbs, and the connections to those aspects of the financial sector that would put these men into the position of possibly being able to see, or observe, the signatures of untoward financial activity, including indicators of a hidden system interfaced with the public system of finance. \n\n>At a certain point, financiers taking walks off of skyscraper rooftops, or out of ten story windows in Paris, or walking in front of a train, or drowning in lakes, or being shot as they're getting into their car, or dying in midair of \"illnesses\", or expiring from cancer, or murdered while taking a jog on a well-known public park... at a certain point, one must acknowledge that the likelihood of all of this just being \"coincidence\" isn't very high.  \n\n>And then the real question becomes, which is no one within the mainstream lamestream media, or the alternative media, investigating it?\n\n>For my two cents' worth, I have suspected all along, and suspect now, that these individuals are being \"suicided\" because they have either uncovered something significant about the world financial system, something that few people in the public sector suspect, or they are being \"suicided\" as \"precautionary\" measures to protect some secret they themselves may not have understood fully that they knew.\n\n##Part 2: \"Suicided\" Thomas J. Hughes\n\n>Yes, you read that correctly. In addition to John Noyce of Goldman Sachs, and Ed Gilligan of American Express, who respectively died of cancer and \"a sudden\" (and unexplained) illness while on a flight to New York, there has been a third banker death within the last week, and this one, of Mr. Thomas J. Hughes, a twenty-nine year old, has finally brought at least some of the media attention the story deserves: consider these two articles, shared by many of you:\n\n[The Bankster Suicides](https://www.corbettreport.com/the-bankster-suicides/)\n\n[Wall Street Banker Deaths Continue; Where Are the Serious Investigations?](http://wallstreetonparade.com/2015/06/wall-street-banker-deaths-continue-where-are-the-serious-investigations/)\n\n>Note that in the case of Mr. Hughes, the mainstream-lamestream media coverage of the usual memes of \"banker stress and burnout\" and \"well-liked and respected by colleagues\" does not play here (citing the first article):\n\n“Exclusive: Father of investment banker, 29, fears son turned to drink and drugs to cope with stress and jumped to his death after a ‘Wolf of Wall Street cocaine party’!” blares the typically unwieldy tabloid title, and sadly the reporting does not rise above the level of that headline. After noting that Hughes is in fact the 12th person in high finance so far this year to take their own life (if that is indeed what he did), we are promptly informed that this has prompted a “renewed focus on the demands that Wall St places on young bankers.”\n\n\"And his father’s “fear” that Thomas “jumped to his death after a ‘Wolf of Wall Street Cocaine party’?” If you can cover up the sidebar on the right-hand side of the DM’s clickbait-infested site long enough to actually read the article, you’ll find out that this is not what his father was actually saying. “I wish I would have crystal clear answers. If you met him you would say this is the opposite person who would seem like the kind of person who was considering taking this type of action,” the father was quoted as saying after asserting that his son was “enjoying his work.”\n\n\"So what is happening here? Why are MSM outlets like the Daily Mail rushing to wrap this up as ‘just another suicide of an over-stressed banker’ before the police have even identified the body (which was unrecognizable after impact)?\"\n\n>Why indeed? Wall Street on Parade (the second article) puts to rest some hypotheses concerning Mr. Hughes' \"suicide\":\n\n\"The death of Thomas Hughes last Thursday has many unusual aspects. He was part of a close, loving, affluent Westchester family. If he had money problems, as one New York tabloid suggested, he could have asked one of numerous affluent family members for a loan. Another curiosity is that Hughes had insights into the culture and potential crimes of an inordinate number of mega banks on Wall Street. The number of major banks he had worked for by age 29 is almost unprecedented.\n\n\"According to his resume filed with the Financial Industry Regulatory Authority (FINRA), Hughes had interned at both JPMorgan and Goldman Sachs, then held full time jobs with Citigroup and UBS after graduating from Northwestern University. He was currently employed at investment bank, Moelis & Company LLC. According to reports at the Wall Street Journal and Bloomberg News, the U.S. Justice Department continues to investigate market rigging on Wall Street, including the potential rigging of precious metals markets by the largest banks.\"\n\n>And JP Morgan and UBS (Union Bank of Switzerland)? The first article points out something unusual about those banks, all of which Mr. Hughes was at some point connected with:\n\n\"Although you could be forgiven for having blinked-and-missed-it in the midst of the wall-to-wall coverage of the earth-shatteringly important Caitlyn Jenner kerfuffle, those three banks were part of the sextet that were just found guilty of manipulating the $5 trillion a day foreign exchange market and collectively fined an impressive-sounding but ultimately trivial $6 billion for the crime.\"\n\n>It is the second article, however, that contains a potential bombshell, and one which contains inevitable implications for our high octane speculations. \n\n>Consider carefully these statements from former Attorney General Eric Holder on the US Federal Government's attempts to investigate all these matters:\n\n\"Another worry for Wall Street is how many of their employees are now wearing wires to work. Former U.S. Attorney General Eric Holder raised paranoia to a whole new level last September 17 when he delivered a speech at the NYU School of Law in Manhattan. Holder told the crowd of legal luminaries on Wall Street:\n\n“'…in our full-court press to investigate and prosecute the ongoing LIBOR matter – which is being led by the Criminal and Antitrust Divisions, and involved a wide-ranging scheme to rig one of the world’s benchmark interest rates – witnesses from inside some of the world’s leading financial firms have played important roles.\n\n\"They have strengthened our ability to follow leads; to obtain guilty pleas from subsidiaries of major banks like UBS and RBS; and to pursue individual charges against nine former traders and managers at these institutions. Our ongoing investigation into the manipulation of foreign exchange rates has relied on similar investigative techniques involving undercover cooperators, as well.”\n\n>There are, of course, two ways to read this. One is that with the Federal Government's own corruption, and the tight interface between various departments and agencies of the Federal Government and the institutions participating in what I have been calling a \"hidden system of finance,\" this investigation is nothing but smoke and mirrors. \n\n>Certainly there is a great deal of historical and contextual evidence to suggest this may be the case, as anyone familiar with the history of that hidden system, as I have tried to reconstruct it in various books (chiefly Covert Wars and Breakaway Civilizations), will understand. \n\n>But there is yet another possibility, and that is that there is growing realization within the public institutions of government and with its public departments and agencies, that it has lost control of that hidden system, and that, perhaps, the banks participating in that system may have lost control of it as well, and that it is now being directed from some hidden center or centers. Time alone will tell.\n\n>But as for the unfortunate Mr. Hughes, here again, he fits the now familiar pattern, for in addition to involvement in areas of finance that would certainly seem to touch upon those areas where a hidden system might have become evident to him, he also fits the now familiar pattern of being a decent person, well-liked by friends and family, according to the Wall Street on Parade article:\n\n\"On a family member’s recently updated Facebook page, Thomas Hughes was described as “popular and outgoing,” with a “great sense of humor.” Friends posted comments such as: “Tom was such a wonderful, kind and gentle soul.” Another female friend called him a “wonderful gentleman.” An individual identifying himself as Mark Witte said “Even Wednesday Tom was strategizing with Northwestern students to help them build the careers they dreamed about.” Wednesday was the day before Hughes allegedly took his life.\"\n\n>While those analysts concentrating on the BOLI or Bank Owned Life Insurance aspects of the scenario are correct in that insurance companies may have unique insights into what is going on, I continue to believe that this is only one aspect, perhaps the shallowest hidden aspect of the problem, and that the real problem remains the vast extent of black budget and hidden systems of finance. \n\n>It is, in short, an international, multi-disciplinary problem, and will require that kind of effort to address. And this, I suspect, is only going to come from the international alternative research community. \n\n>Governments, and the lamestream media, do not appear to be interested.",
  "mod_reports": [],
  "secure_media_embed": {},
  "author_flair_css_class": "AXO",
  "edited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"http://gizadeathstar.com/2015/06/more-banker-deaths-gilligan-at-american-express-noyce-at-goldman-sachs-and-the-repeating-pattern/\">Source 1</a></p>\n\n<p><a href=\"http://gizadeathstar.com/2015/06/the-third-dead-banker-suicided-thomas-j-hughes/\">Source 2</a></p>\n\n<blockquote>\n<p>I cannot help but be suspicious any more on all the bankers and financiers dying, even if they do so due to &quot;natural causes.&quot; Case in point here are the deaths, within this last week, of the President of American Express, and a key analyst for Goldman Sachs. Here are the stories:</p>\n</blockquote>\n\n<p><a href=\"http://uk.businessinsider.com/american-express-president-ed-gilligan-dies-suddenly-2015-5?r=US\">Markets More: American Express Death American Express president Ed Gilligan has died</a></p>\n\n<p><a href=\"http://www.bloomberg.com/news/articles/2015-06-04/john-noyce-goldman-s-must-read-foreign-exchange-analyst-dies\">John Noyce, ‘Must Read’ Goldman Currency Analyst, Dies at 36</a></p>\n\n<blockquote>\n<p>Now, so far, everything seems normal: Mr. Noyce had apparently been battling with cancer for some time, and Mr. Gilligan simply become &quot;suddenly ill&quot; on an airplane flight and expired. But again, these two unfortunate men appear to be part of that &quot;pattern&quot; that seems to be emerging with all the banker deaths. Here&#39;s the way Mr. Gilligan&#39;s death is being reported by Bloomberg:</p>\n</blockquote>\n\n<p>&quot;He became seriously ill on a flight home to New York this morning, the statement said.</p>\n\n<p>&quot;This is deeply painful and frankly unimaginable for all of us who had the great fortune to work with Ed, and benefit from his insights, leadership and enthusiasm,&quot; CEO Ken Chenault said in the letter to employees.</p>\n\n<p>&quot;Our thoughts and prayers go out to his wife, Lisa, and their four children – Katie, Meaghan, Kevin and Shane. He was a proud husband and father, and his love for his family was evident in all that he did.&quot;</p>\n\n<blockquote>\n<p>And then in American Express&#39;s own release:</p>\n</blockquote>\n\n<p>&quot;His contributions have left an indelible imprint on practically every area of our business, from Commercial Card and Travel to International, Consumer, Small Business, Merchant Services, Network Services and, most recently, the group forging our digital partnerships and driving payment innovations.&quot;</p>\n\n<blockquote>\n<p>So where&#39;s the familiar pattern? Well, in Mr. Gilligan&#39;s case, it is (1) in his popularity with employees, colleagues, and family, a feature that seems to recur with each such death; and (2) he was involved in aspects of the financial sector having directly to do with computers, electronic payments and clearing, and, in his case, &quot;forging digital partnerships&quot;, and driving &quot;payment innovaitons,&quot; language that at least to this amateur&#39;s instincts sound all too like the formation of financial data cartels and trusts.</p>\n\n<p>Then there is this about the unfortunate Mr. Noyce at Goldman Sachs:</p>\n</blockquote>\n\n<p>&quot;John Noyce, a technical analyst at Goldman Sachs Group Inc.’s London currency trading desk whose weekly report “The Charts That Matter Next Week” was widely followed, has died. He was 36.</p>\n\n<p>&quot;He died on June 4 after a long battle with cancer, Goldman Sachs wrote in an internal memo signed by Isabelle Ealet, Pablo Salame and Ashok Varadhan, co-heads of its securities unit.</p>\n\n<p>“He was well respected by market participants for his insightful analysis,” they wrote. “On the trading floor, he was a trusted colleague and friend -- demonstrated clearly by the overwhelming support he received from GS colleagues throughout his illness.”</p>\n\n<blockquote>\n<p>And toward the end of the article, this tidbit is offered:</p>\n</blockquote>\n\n<p>&quot;Noyce left Citigroup for New York-based Goldman Sachs in 2008, according to his employment history on the Financial Industry Regulatory Authority website. He joined Goldman Sachs as a vice president for European fixed income, currencies and commodities strategies, according to the company memo.&quot;</p>\n\n<blockquote>\n<p>Again, one has the familiar pattern of (1) respected and liked by fellow colleagues and professionals, and (2) involvement in the sector of the business having to do with computers and electronic trading, and notably, in this case, with currencies and commodities strategies.</p>\n\n<p>All we are told about the unfortunate Mr. Noyce is that he had been battling cancer &quot;for a long time.&quot; We are told nothing about whatever illness Mr. Gilligan apparently died from, nor is there even any indication that an autopsy will be, or has been performed. </p>\n\n<p>But it&#39;s the consistency of the pattern that has emerged that disturbs, and the connections to those aspects of the financial sector that would put these men into the position of possibly being able to see, or observe, the signatures of untoward financial activity, including indicators of a hidden system interfaced with the public system of finance. </p>\n\n<p>At a certain point, financiers taking walks off of skyscraper rooftops, or out of ten story windows in Paris, or walking in front of a train, or drowning in lakes, or being shot as they&#39;re getting into their car, or dying in midair of &quot;illnesses&quot;, or expiring from cancer, or murdered while taking a jog on a well-known public park... at a certain point, one must acknowledge that the likelihood of all of this just being &quot;coincidence&quot; isn&#39;t very high.  </p>\n\n<p>And then the real question becomes, which is no one within the mainstream lamestream media, or the alternative media, investigating it?</p>\n\n<p>For my two cents&#39; worth, I have suspected all along, and suspect now, that these individuals are being &quot;suicided&quot; because they have either uncovered something significant about the world financial system, something that few people in the public sector suspect, or they are being &quot;suicided&quot; as &quot;precautionary&quot; measures to protect some secret they themselves may not have understood fully that they knew.</p>\n</blockquote>\n\n<h2>Part 2: &quot;Suicided&quot; Thomas J. Hughes</h2>\n\n<blockquote>\n<p>Yes, you read that correctly. In addition to John Noyce of Goldman Sachs, and Ed Gilligan of American Express, who respectively died of cancer and &quot;a sudden&quot; (and unexplained) illness while on a flight to New York, there has been a third banker death within the last week, and this one, of Mr. Thomas J. Hughes, a twenty-nine year old, has finally brought at least some of the media attention the story deserves: consider these two articles, shared by many of you:</p>\n</blockquote>\n\n<p><a href=\"https://www.corbettreport.com/the-bankster-suicides/\">The Bankster Suicides</a></p>\n\n<p><a href=\"http://wallstreetonparade.com/2015/06/wall-street-banker-deaths-continue-where-are-the-serious-investigations/\">Wall Street Banker Deaths Continue; Where Are the Serious Investigations?</a></p>\n\n<blockquote>\n<p>Note that in the case of Mr. Hughes, the mainstream-lamestream media coverage of the usual memes of &quot;banker stress and burnout&quot; and &quot;well-liked and respected by colleagues&quot; does not play here (citing the first article):</p>\n</blockquote>\n\n<p>“Exclusive: Father of investment banker, 29, fears son turned to drink and drugs to cope with stress and jumped to his death after a ‘Wolf of Wall Street cocaine party’!” blares the typically unwieldy tabloid title, and sadly the reporting does not rise above the level of that headline. After noting that Hughes is in fact the 12th person in high finance so far this year to take their own life (if that is indeed what he did), we are promptly informed that this has prompted a “renewed focus on the demands that Wall St places on young bankers.”</p>\n\n<p>&quot;And his father’s “fear” that Thomas “jumped to his death after a ‘Wolf of Wall Street Cocaine party’?” If you can cover up the sidebar on the right-hand side of the DM’s clickbait-infested site long enough to actually read the article, you’ll find out that this is not what his father was actually saying. “I wish I would have crystal clear answers. If you met him you would say this is the opposite person who would seem like the kind of person who was considering taking this type of action,” the father was quoted as saying after asserting that his son was “enjoying his work.”</p>\n\n<p>&quot;So what is happening here? Why are MSM outlets like the Daily Mail rushing to wrap this up as ‘just another suicide of an over-stressed banker’ before the police have even identified the body (which was unrecognizable after impact)?&quot;</p>\n\n<blockquote>\n<p>Why indeed? Wall Street on Parade (the second article) puts to rest some hypotheses concerning Mr. Hughes&#39; &quot;suicide&quot;:</p>\n</blockquote>\n\n<p>&quot;The death of Thomas Hughes last Thursday has many unusual aspects. He was part of a close, loving, affluent Westchester family. If he had money problems, as one New York tabloid suggested, he could have asked one of numerous affluent family members for a loan. Another curiosity is that Hughes had insights into the culture and potential crimes of an inordinate number of mega banks on Wall Street. The number of major banks he had worked for by age 29 is almost unprecedented.</p>\n\n<p>&quot;According to his resume filed with the Financial Industry Regulatory Authority (FINRA), Hughes had interned at both JPMorgan and Goldman Sachs, then held full time jobs with Citigroup and UBS after graduating from Northwestern University. He was currently employed at investment bank, Moelis &amp; Company LLC. According to reports at the Wall Street Journal and Bloomberg News, the U.S. Justice Department continues to investigate market rigging on Wall Street, including the potential rigging of precious metals markets by the largest banks.&quot;</p>\n\n<blockquote>\n<p>And JP Morgan and UBS (Union Bank of Switzerland)? The first article points out something unusual about those banks, all of which Mr. Hughes was at some point connected with:</p>\n</blockquote>\n\n<p>&quot;Although you could be forgiven for having blinked-and-missed-it in the midst of the wall-to-wall coverage of the earth-shatteringly important Caitlyn Jenner kerfuffle, those three banks were part of the sextet that were just found guilty of manipulating the $5 trillion a day foreign exchange market and collectively fined an impressive-sounding but ultimately trivial $6 billion for the crime.&quot;</p>\n\n<blockquote>\n<p>It is the second article, however, that contains a potential bombshell, and one which contains inevitable implications for our high octane speculations. </p>\n\n<p>Consider carefully these statements from former Attorney General Eric Holder on the US Federal Government&#39;s attempts to investigate all these matters:</p>\n</blockquote>\n\n<p>&quot;Another worry for Wall Street is how many of their employees are now wearing wires to work. Former U.S. Attorney General Eric Holder raised paranoia to a whole new level last September 17 when he delivered a speech at the NYU School of Law in Manhattan. Holder told the crowd of legal luminaries on Wall Street:</p>\n\n<p>“&#39;…in our full-court press to investigate and prosecute the ongoing LIBOR matter – which is being led by the Criminal and Antitrust Divisions, and involved a wide-ranging scheme to rig one of the world’s benchmark interest rates – witnesses from inside some of the world’s leading financial firms have played important roles.</p>\n\n<p>&quot;They have strengthened our ability to follow leads; to obtain guilty pleas from subsidiaries of major banks like UBS and RBS; and to pursue individual charges against nine former traders and managers at these institutions. Our ongoing investigation into the manipulation of foreign exchange rates has relied on similar investigative techniques involving undercover cooperators, as well.”</p>\n\n<blockquote>\n<p>There are, of course, two ways to read this. One is that with the Federal Government&#39;s own corruption, and the tight interface between various departments and agencies of the Federal Government and the institutions participating in what I have been calling a &quot;hidden system of finance,&quot; this investigation is nothing but smoke and mirrors. </p>\n\n<p>Certainly there is a great deal of historical and contextual evidence to suggest this may be the case, as anyone familiar with the history of that hidden system, as I have tried to reconstruct it in various books (chiefly Covert Wars and Breakaway Civilizations), will understand. </p>\n\n<p>But there is yet another possibility, and that is that there is growing realization within the public institutions of government and with its public departments and agencies, that it has lost control of that hidden system, and that, perhaps, the banks participating in that system may have lost control of it as well, and that it is now being directed from some hidden center or centers. Time alone will tell.</p>\n\n<p>But as for the unfortunate Mr. Hughes, here again, he fits the now familiar pattern, for in addition to involvement in areas of finance that would certainly seem to touch upon those areas where a hidden system might have become evident to him, he also fits the now familiar pattern of being a decent person, well-liked by friends and family, according to the Wall Street on Parade article:</p>\n</blockquote>\n\n<p>&quot;On a family member’s recently updated Facebook page, Thomas Hughes was described as “popular and outgoing,” with a “great sense of humor.” Friends posted comments such as: “Tom was such a wonderful, kind and gentle soul.” Another female friend called him a “wonderful gentleman.” An individual identifying himself as Mark Witte said “Even Wednesday Tom was strategizing with Northwestern students to help them build the careers they dreamed about.” Wednesday was the day before Hughes allegedly took his life.&quot;</p>\n\n<blockquote>\n<p>While those analysts concentrating on the BOLI or Bank Owned Life Insurance aspects of the scenario are correct in that insurance companies may have unique insights into what is going on, I continue to believe that this is only one aspect, perhaps the shallowest hidden aspect of the problem, and that the real problem remains the vast extent of black budget and hidden systems of finance. </p>\n\n<p>It is, in short, an international, multi-disciplinary problem, and will require that kind of effort to address. And this, I suspect, is only going to come from the international alternative research community. </p>\n\n<p>Governments, and the lamestream media, do not appear to be interested.</p>\n</blockquote>\n</div><!-- SC_ON -->",
  "downs": 0,
  "user_reports": [],
  "over_18": false,
  "score": 48,
  "stickied": false,
  "domain": "self.conspiracy",
  "is_self": true,
  "hidden": false,
  "_orphaned": {},
  "_api_link": "https://api.reddit.com/r/conspiracy/comments/396bc5/more_banker_deaths_gilligan_at_american_express/?ref=search_posts",
  "_comments_by_id": {},
  "visited": false,
  "thumbnail": "self",
  "_has_fetched": true,
  "gilded": 0,
  "hide_score": false,
  "_info_url": "https://api.reddit.com/api/info/",
  "created_utc": 1433868754.0,
  "subreddit_id": "t5_2qh4r",
  "id": "396bc5",
  "_params": {},
  "media_embed": {},
  "name": "t3_396bc5",
  "quarantine": false,
  "permalink": "https://www.reddit.com/r/conspiracy/comments/396bc5/more_banker_deaths_gilligan_at_american_express/?ref=search_posts",
  "ups": 48,
  "url": "https://www.reddit.com/r/conspiracy/comments/396bc5/more_banker_deaths_gilligan_at_american_express/",
  "title": "More Banker Deaths: Gilligan at American Express, Noyce at Goldman Sachs, and 29-year-old Thomas J. Hughes",
  "preview": {
    "images": [
      {
        "resolutions": [
          {
            "width": 108,
            "height": 69,
            "url": "https://i.redditmedia.com/Vmn-e1M3BN58iEnHmR10Y8yebqp0xQim2v657zp_R8Y.jpg?fit=crop&crop=faces%2Centropy&arh=2&w=108&s=0e94361290386b6b649e61a05c2c2da1"
          },
          {
            "width": 216,
            "height": 139,
            "url": "https://i.redditmedia.com/Vmn-e1M3BN58iEnHmR10Y8yebqp0xQim2v657zp_R8Y.jpg?fit=crop&crop=faces%2Centropy&arh=2&w=216&s=4479378ee6ec0baf068b05f4df389e78"
          },
          {
            "width": 320,
            "height": 206,
            "url": "https://i.redditmedia.com/Vmn-e1M3BN58iEnHmR10Y8yebqp0xQim2v657zp_R8Y.jpg?fit=crop&crop=faces%2Centropy&arh=2&w=320&s=5edc80017c7f6df5c0f30bb20bb96b1a"
          }
        ],
        "id": "MX2Sc9B8KZWrICZUUpI887aV9xORuOXUvcqXf-Ei3a0",
        "variants": {},
        "source": {
          "width": 450,
          "height": 291,
          "url": "https://i.redditmedia.com/Vmn-e1M3BN58iEnHmR10Y8yebqp0xQim2v657zp_R8Y.jpg?s=fc0486628641729e1fa3fa6069b9540c"
        }
      }
    ]
  }
}