{
  "selftext": "I wish I had more time to write out full expositions for each of these choices, but frankly, anyone who has managed to stay subscribed to this sub has a pretty good idea of where I stand on these candidates and issues anyway. Please feel free to discuss openly. Share your opinion. Tear my opinion to shreds. Let's share what we know.\n\n**County Executive** Ed Day. Fried is in every way an establishment candidate and his relationship to the Clintons and subsequently their relationship to the New Square Four is hard to overlook, not to mention his close relationship with convicted felon Paul Adler. Day's experience and stated platform are sound, specifically, he should be held to his promises to implement zero-based budgeting.\n\n**County Clerk** Paul Piperato. Piperato has done a fine job in this capacity during his tenure. He recently came under fire for complying with applicable state law during the gun map controversy. However, his failure to do so would have almost certainly resulted in expensive litigation between the county and Gannett (who did, in fact, file suit against Putnam county for failure to release records). As much as it pains me to unenthusiastically endorse an incumbent, there is really no reason to oust him from this position.\n\n**Supreme Court Justices** Abstain. Unfortunately I don't know enough about any of the candidates to make an informed decision.\n\n**Orangetown, all races** Orangetown First party, Row H. The Orangetown First party is a unique amalgamation between the incumbent Supervisor, Andy Stewart, hopefuls for Council, Ann Marie Uhl and Dan Salmon, and receiver of taxes Chris Smith. First and foremost, I enthusiastically endorse Andy Stewart for re-election as supervisor. I endorsed Stewart in 2011 and have no regrets. Stewart has demonstrated the same values and work-ethic in his role as Supervisor as he did as CEO at Keep Rockland Beautiful. The Republican Supervisor and Council challengers have desperately tried to sling mud at Stewart to no avail. Most recently it was claimed that Stewart's budget exceeded the tax cap, when in fact his budget precisely met the tax cap, and he has worked effortlessly to fight the police union and close the deficit at the town's fledgling and wholly unnecessary psychiatric center golf course. Dan Salmon, like Stewart, is notable for his volunteer involvements and is also enthusiastically endorsed. Chris Smith, a Republican who crosses party lines to join Row H with Democratic candidates, is also enthusiastically endorsed for his platform of eliminating his own position upon election. The reality is that the receiver of taxes is a superfluous position, and Smith recognizes this issue and brings it to light. Smith's challenger made the argument that eliminating the receiver of taxes position would \"only\" save the town $30,000 - a telling indication that the position is wholly unnecessary. Uhl is endorsed, but reluctantly. Uhl currently serves on the South Orangetown Central School District board, where her term has been mostly non-notable. She also lives in an exceptionally extravagant nigh-mansion set on Clausland Mountain which, in my humble opinion, calls into question her ability to sympathize with middle- and lower-class voters and her true position on preservation of open space.\n\n**Supervisor, Clarkstown** Brian Moran. As if it weren't painfully obvious that Clarkstown was rife with corruption, the Republican's utter failure to even bother running a candidate spoke volumes on the subject. A vote for Moran, while practically futile, is a conscionable vote against Gromack's reign. Gromack is essentially certain to win regardless, but given that he personally vetted Jay Savino, a target in the recent FBI probes into Rockland Politics, and given the recent $20+ million tax cert his administration gifted to the Palisades Center out of school district funds, it would be nothing short of masochistic for voters to extend Gromack's role into a second decade.\n\n**Council, Clarkstown** John Noto, Robert Pitofsky. This is an anti-endorsement based solely on the fact that George Hoehmann and Stephanie Hausner are incumbents, and based on their failure to achieve any positive meaningful change within the town.\n\n**Justice, Clarkstown** Adam Garth, Ed Kallen. Again an anti-endorsement against Johns and Ugell, both long-time incumbents (over 20 years for both). Kallen astutely noted in his interview with Patch that \"turn-over of judges (or any elected official) creates a healthier flow of diverse talent and results in ongoing and fresh examinations of the office.\"\n\n**Highway Superintendent, Clarkstown** Dennis Malone. This is a particularly reluctant endorsement, however, Ballard is easy to anti-endorse. Ballard has been incumbent for years and most recently is remembered for his questionable patronage hiring of Frank Sparaco for a $75,000-per-year no-show job answering Ballard's phone. Sparaco's \"FBI probe\" was particularly unusual. The FBI's official response, appropriately, was that investigations are not publicized until charges are filed. Sparaco's choice to have a press conference in which he announced that secret, highly edited recordings smearing Malone were turned over to the FBI is incredibly bizarre. My personal opinion, with no evidence whatsoever to support it, is that Sparaco likely taped the conversations, edited them, presented them to Malone in an attempt to extort him, and when that failed, threw out the baby with the bath water so to speak, revealing the tapes publicly, despite that the FBI disavowed him as an informant immediately.\n\n**Ramapo, Supervisor** Michael Koplen. This race likely will not matter as St. Lawrence (and all other races in the town) are essentially locked, historically, by the bloc vote. The Supervisor race is particularly of interest since it is my opinion that the FBI probe will likely result in St. Lawrence's indictment before his term is over.\n\n**Ramapo, all other races** Unfortunately, I do not know enough about the other candidates to make an informed decision, however, I strongly anti-endorse all incumbents in Ramapo given the rampant alleged corruption and pandering to the Orthodox communities needs at the expense of the surrounding residents.\n\n**Proposition 1 - An Amendment Authorizing Casino Gaming** *NOT approved.* The casino lobby has been hard at work sending mailers, running commercials, and robo-dialing everyone in the state of New York begging for this amendment to pass. Contrary to claims by the casino lobbyists, casino gambling is not a net economic benefit to the communities in which it is permitted. While I admit that it will \"create jobs\" in the Catskills, it is hard to argue that these jobs will be anything more than minimum wage, low skill jobs with virtually no transferability to other sectors. Furthermore, anyone that believes that casino gambling will \"lower property taxes\" is also welcome to buy a bridge from me and should carefully examine similar claims that were made about the Palisades Center when it was constructed. Not only are casinos associated with various vice crimes, and increased reliance on social services resulting from problem drinking and gambling, they are also part of a uniquely bound market. The casino industry in the United States is already struggling to maintain a status quo given the cannibalization of the market between various states. If New York lowers the bar further, it only assures an even lower standard for the industry at large. Atlantic City's \"Revel\" project is a perfect example of how a casino project in a saturated market is doomed to fail: $2 billion in the hole, subsidized by taxpayers, and still bankrupt within a year of opening. Don't fall for the casino lobby's bullshit. Let New Jersey keep its gambling problem.\n\n**Proposition 2 - Additional Civil Service Credit for Veterans with Disabilities Certified Post-Appointment** *NOT approved.* How this makes sense to anyone is baffling to me. This is a complete non-issue and a giveaway to civil servants that happen to be disabled veterans. Our veterans deserve every bit of respect for their service but our Country, not our State, is responsible to repay that debt, and any disability benefits should not be solely tied to civil service.\n\n**Proposition 3 - Exclusion of Indebtedness Contracted for Sewage Facilities** Approved. As much as I am hesitant to endorse such an amendment in the face of bloated sewer districts like that in Orangetown, the reconstruction of sewer districts is but one part of a multifaceted infrastructure crisis that we are facing as a nation. Compared to many other types of government spending that are full of shit, sewers are an actual necessity that we rely on daily, and the infrastructure involved is often extremely old and subject to failure if not maintained.\n\n**Proposition 4 - Settling Disputed Title in the Forest Preserve** I abstain, noting that the language is loaded and reminiscent of many other similar ballot propositions. Who has decided that the land to be incorporated into the preserves \"would benefit the forest preserve more than the disputed parcels,\" and on what basis?\n\n**Proposition 5 - In Relation to a Land Exchange in the State Forest Preserve with NYCO Minerals, Inc.** *NOT approved*. An obvious and transparent land grab by a mining corporation. This initiative even goes so far as to say \"When NYCO Minerals finishes mining, it would restore the condition of the land and return it to the forest preserve.\" If you believe that, I have a second bridge to sell you.\n\n**Proposition 6 - Increasing Age until which Certain State Judges Can Serve** *NOT approved*. Sorry guys, but it's time to take off the wigs and retire at 70. Let some new blood onto the bench.",
  "gilded": 0,
  "score": 7,
  "removal_reason": null,
  "approved_by": null,
  "created_utc": 1383629031.0,
  "is_self": true,
  "stickied": false,
  "edited": false,
  "distinguished": null,
  "permalink": "https://www.reddit.com/r/Rockland/comments/1pxo42/the_official_highly_opinionated_secondsafestcity/?ref=search_posts",
  "banned_by": null,
  "from_id": null,
  "likes": null,
  "_underscore_names": null,
  "num_reports": null,
  "link_flair_css_class": null,
  "_info_url": "https://api.reddit.com/api/info/",
  "id": "1pxo42",
  "archived": true,
  "secure_media": null,
  "from_kind": null,
  "saved": false,
  "domain": "self.Rockland",
  "ups": 7,
  "suggested_sort": null,
  "quarantine": false,
  "over_18": false,
  "hide_score": false,
  "url": "https://www.reddit.com/r/Rockland/comments/1pxo42/the_official_highly_opinionated_secondsafestcity/",
  "subreddit_id": "t5_2r9f7",
  "_params": {},
  "_comments": null,
  "_replaced_more": false,
  "_comments_by_id": {},
  "user_reports": [],
  "media_embed": {},
  "created": 1383632631.0,
  "author_flair_text": null,
  "visited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I wish I had more time to write out full expositions for each of these choices, but frankly, anyone who has managed to stay subscribed to this sub has a pretty good idea of where I stand on these candidates and issues anyway. Please feel free to discuss openly. Share your opinion. Tear my opinion to shreds. Let&#39;s share what we know.</p>\n\n<p><strong>County Executive</strong> Ed Day. Fried is in every way an establishment candidate and his relationship to the Clintons and subsequently their relationship to the New Square Four is hard to overlook, not to mention his close relationship with convicted felon Paul Adler. Day&#39;s experience and stated platform are sound, specifically, he should be held to his promises to implement zero-based budgeting.</p>\n\n<p><strong>County Clerk</strong> Paul Piperato. Piperato has done a fine job in this capacity during his tenure. He recently came under fire for complying with applicable state law during the gun map controversy. However, his failure to do so would have almost certainly resulted in expensive litigation between the county and Gannett (who did, in fact, file suit against Putnam county for failure to release records). As much as it pains me to unenthusiastically endorse an incumbent, there is really no reason to oust him from this position.</p>\n\n<p><strong>Supreme Court Justices</strong> Abstain. Unfortunately I don&#39;t know enough about any of the candidates to make an informed decision.</p>\n\n<p><strong>Orangetown, all races</strong> Orangetown First party, Row H. The Orangetown First party is a unique amalgamation between the incumbent Supervisor, Andy Stewart, hopefuls for Council, Ann Marie Uhl and Dan Salmon, and receiver of taxes Chris Smith. First and foremost, I enthusiastically endorse Andy Stewart for re-election as supervisor. I endorsed Stewart in 2011 and have no regrets. Stewart has demonstrated the same values and work-ethic in his role as Supervisor as he did as CEO at Keep Rockland Beautiful. The Republican Supervisor and Council challengers have desperately tried to sling mud at Stewart to no avail. Most recently it was claimed that Stewart&#39;s budget exceeded the tax cap, when in fact his budget precisely met the tax cap, and he has worked effortlessly to fight the police union and close the deficit at the town&#39;s fledgling and wholly unnecessary psychiatric center golf course. Dan Salmon, like Stewart, is notable for his volunteer involvements and is also enthusiastically endorsed. Chris Smith, a Republican who crosses party lines to join Row H with Democratic candidates, is also enthusiastically endorsed for his platform of eliminating his own position upon election. The reality is that the receiver of taxes is a superfluous position, and Smith recognizes this issue and brings it to light. Smith&#39;s challenger made the argument that eliminating the receiver of taxes position would &quot;only&quot; save the town $30,000 - a telling indication that the position is wholly unnecessary. Uhl is endorsed, but reluctantly. Uhl currently serves on the South Orangetown Central School District board, where her term has been mostly non-notable. She also lives in an exceptionally extravagant nigh-mansion set on Clausland Mountain which, in my humble opinion, calls into question her ability to sympathize with middle- and lower-class voters and her true position on preservation of open space.</p>\n\n<p><strong>Supervisor, Clarkstown</strong> Brian Moran. As if it weren&#39;t painfully obvious that Clarkstown was rife with corruption, the Republican&#39;s utter failure to even bother running a candidate spoke volumes on the subject. A vote for Moran, while practically futile, is a conscionable vote against Gromack&#39;s reign. Gromack is essentially certain to win regardless, but given that he personally vetted Jay Savino, a target in the recent FBI probes into Rockland Politics, and given the recent $20+ million tax cert his administration gifted to the Palisades Center out of school district funds, it would be nothing short of masochistic for voters to extend Gromack&#39;s role into a second decade.</p>\n\n<p><strong>Council, Clarkstown</strong> John Noto, Robert Pitofsky. This is an anti-endorsement based solely on the fact that George Hoehmann and Stephanie Hausner are incumbents, and based on their failure to achieve any positive meaningful change within the town.</p>\n\n<p><strong>Justice, Clarkstown</strong> Adam Garth, Ed Kallen. Again an anti-endorsement against Johns and Ugell, both long-time incumbents (over 20 years for both). Kallen astutely noted in his interview with Patch that &quot;turn-over of judges (or any elected official) creates a healthier flow of diverse talent and results in ongoing and fresh examinations of the office.&quot;</p>\n\n<p><strong>Highway Superintendent, Clarkstown</strong> Dennis Malone. This is a particularly reluctant endorsement, however, Ballard is easy to anti-endorse. Ballard has been incumbent for years and most recently is remembered for his questionable patronage hiring of Frank Sparaco for a $75,000-per-year no-show job answering Ballard&#39;s phone. Sparaco&#39;s &quot;FBI probe&quot; was particularly unusual. The FBI&#39;s official response, appropriately, was that investigations are not publicized until charges are filed. Sparaco&#39;s choice to have a press conference in which he announced that secret, highly edited recordings smearing Malone were turned over to the FBI is incredibly bizarre. My personal opinion, with no evidence whatsoever to support it, is that Sparaco likely taped the conversations, edited them, presented them to Malone in an attempt to extort him, and when that failed, threw out the baby with the bath water so to speak, revealing the tapes publicly, despite that the FBI disavowed him as an informant immediately.</p>\n\n<p><strong>Ramapo, Supervisor</strong> Michael Koplen. This race likely will not matter as St. Lawrence (and all other races in the town) are essentially locked, historically, by the bloc vote. The Supervisor race is particularly of interest since it is my opinion that the FBI probe will likely result in St. Lawrence&#39;s indictment before his term is over.</p>\n\n<p><strong>Ramapo, all other races</strong> Unfortunately, I do not know enough about the other candidates to make an informed decision, however, I strongly anti-endorse all incumbents in Ramapo given the rampant alleged corruption and pandering to the Orthodox communities needs at the expense of the surrounding residents.</p>\n\n<p><strong>Proposition 1 - An Amendment Authorizing Casino Gaming</strong> <em>NOT approved.</em> The casino lobby has been hard at work sending mailers, running commercials, and robo-dialing everyone in the state of New York begging for this amendment to pass. Contrary to claims by the casino lobbyists, casino gambling is not a net economic benefit to the communities in which it is permitted. While I admit that it will &quot;create jobs&quot; in the Catskills, it is hard to argue that these jobs will be anything more than minimum wage, low skill jobs with virtually no transferability to other sectors. Furthermore, anyone that believes that casino gambling will &quot;lower property taxes&quot; is also welcome to buy a bridge from me and should carefully examine similar claims that were made about the Palisades Center when it was constructed. Not only are casinos associated with various vice crimes, and increased reliance on social services resulting from problem drinking and gambling, they are also part of a uniquely bound market. The casino industry in the United States is already struggling to maintain a status quo given the cannibalization of the market between various states. If New York lowers the bar further, it only assures an even lower standard for the industry at large. Atlantic City&#39;s &quot;Revel&quot; project is a perfect example of how a casino project in a saturated market is doomed to fail: $2 billion in the hole, subsidized by taxpayers, and still bankrupt within a year of opening. Don&#39;t fall for the casino lobby&#39;s bullshit. Let New Jersey keep its gambling problem.</p>\n\n<p><strong>Proposition 2 - Additional Civil Service Credit for Veterans with Disabilities Certified Post-Appointment</strong> <em>NOT approved.</em> How this makes sense to anyone is baffling to me. This is a complete non-issue and a giveaway to civil servants that happen to be disabled veterans. Our veterans deserve every bit of respect for their service but our Country, not our State, is responsible to repay that debt, and any disability benefits should not be solely tied to civil service.</p>\n\n<p><strong>Proposition 3 - Exclusion of Indebtedness Contracted for Sewage Facilities</strong> Approved. As much as I am hesitant to endorse such an amendment in the face of bloated sewer districts like that in Orangetown, the reconstruction of sewer districts is but one part of a multifaceted infrastructure crisis that we are facing as a nation. Compared to many other types of government spending that are full of shit, sewers are an actual necessity that we rely on daily, and the infrastructure involved is often extremely old and subject to failure if not maintained.</p>\n\n<p><strong>Proposition 4 - Settling Disputed Title in the Forest Preserve</strong> I abstain, noting that the language is loaded and reminiscent of many other similar ballot propositions. Who has decided that the land to be incorporated into the preserves &quot;would benefit the forest preserve more than the disputed parcels,&quot; and on what basis?</p>\n\n<p><strong>Proposition 5 - In Relation to a Land Exchange in the State Forest Preserve with NYCO Minerals, Inc.</strong> <em>NOT approved</em>. An obvious and transparent land grab by a mining corporation. This initiative even goes so far as to say &quot;When NYCO Minerals finishes mining, it would restore the condition of the land and return it to the forest preserve.&quot; If you believe that, I have a second bridge to sell you.</p>\n\n<p><strong>Proposition 6 - Increasing Age until which Certain State Judges Can Serve</strong> <em>NOT approved</em>. Sorry guys, but it&#39;s time to take off the wigs and retire at 70. Let some new blood onto the bench.</p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "_comment_sort": null,
  "report_reasons": null,
  "name": "t3_1pxo42",
  "from": null,
  "hidden": false,
  "clicked": false,
  "media": null,
  "json_dict": null,
  "_api_link": "https://api.reddit.com/r/Rockland/comments/1pxo42/the_official_highly_opinionated_secondsafestcity/?ref=search_posts",
  "secure_media_embed": {},
  "mod_reports": [],
  "_orphaned": {},
  "_uniq": null,
  "num_comments": 10,
  "link_flair_text": null,
  "title": "The Official Highly Opinionated SecondSafestCity Voter Guide - 2013 Edition",
  "_has_fetched": true,
  "author_flair_css_class": null,
  "thumbnail": ""
}