{
  "clicked": false,
  "_replaced_more": false,
  "archived": true,
  "num_comments": 34,
  "created": 1429918247.0,
  "saved": false,
  "selftext": "Hi there r/toronto, \n\n\nI am currently living with two roommates. For the past week, I have reason to believe that they have been withholding my mail. \n\n\nOn April 22, I was supposed to receive a shipment from UPS. The UPS driver came by when I wasn't home, and the tracking then changed to \"The receiver has moved.\" - meaning that obviously someone told UPS that I no longer resided there. \n\n\nI asked both my roommates about this and they said that they weren't home, so I thought that maybe it was my building's superintendent that thought I had moved already (I am due to move out May 1). I sent her an email reminding her that I still live there, and moved on with my day. \n\n\nOn April 23, UPS re-attempted delivery. Again, they were told that I had moved. I called UPS to follow-up, and UPS said that the driver's notes stated that a **roommate** said that I had moved. So obviously one of them was lying to me and did, in fact, tell UPS that I had moved -- which I haven't yet (...we don't get along)  \n\n\nI was also supposed to receive a package from Canada Post on April 21. Canada Post's tracking says it was delivered, however I never received it... I believe one of my roommates took it, and probably just threw it out. \n\n\nSo my question is, what can I do? Honestly, I'm pretty fucking pissed - who just throws out someone's mail? who is too lazy to accept a UPS delivery and instead just lies to UPS -- two days in a row!?\n\n\n[According to this website](http://yourlaws.ca/criminal-code-canada/356-theft-mail) anyone who \"fraudulently redirects, or causes to be redirected, anything sent by post.\" (as they did with UPS on April 22/23) *and* anyone who \"steals anything sent by post, after it is deposited at a post office and before it is delivered, or after it is delivered but before it is in the possession of the addressee or of a person who may reasonably be considered to be authorized by the addressee to receive mail\" (as I believe they did April 21) is guilty of an indictable offense under the criminal code of Canada. \n\n\nExcept I have no idea how to pursue that and really I just want my fucking stuff back/for them to pay the fees it cost me to have UPS re-ship my stuff. Does anyone have any advice, or any ideas of where this could be cross-posted to for potentially better advice?\n\n\nThanks!\n\n**tl;dr** my roommates told UPS that I've moved when I actually haven't yet. Twice. I also haven't received mail that Canada Post has said is delivered... I'm pretty sure they took it. What do?",
  "mod_reports": [],
  "secure_media_embed": {},
  "edited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi there <a href=\"/r/toronto\">r/toronto</a>, </p>\n\n<p>I am currently living with two roommates. For the past week, I have reason to believe that they have been withholding my mail. </p>\n\n<p>On April 22, I was supposed to receive a shipment from UPS. The UPS driver came by when I wasn&#39;t home, and the tracking then changed to &quot;The receiver has moved.&quot; - meaning that obviously someone told UPS that I no longer resided there. </p>\n\n<p>I asked both my roommates about this and they said that they weren&#39;t home, so I thought that maybe it was my building&#39;s superintendent that thought I had moved already (I am due to move out May 1). I sent her an email reminding her that I still live there, and moved on with my day. </p>\n\n<p>On April 23, UPS re-attempted delivery. Again, they were told that I had moved. I called UPS to follow-up, and UPS said that the driver&#39;s notes stated that a <strong>roommate</strong> said that I had moved. So obviously one of them was lying to me and did, in fact, tell UPS that I had moved -- which I haven&#39;t yet (...we don&#39;t get along)  </p>\n\n<p>I was also supposed to receive a package from Canada Post on April 21. Canada Post&#39;s tracking says it was delivered, however I never received it... I believe one of my roommates took it, and probably just threw it out. </p>\n\n<p>So my question is, what can I do? Honestly, I&#39;m pretty fucking pissed - who just throws out someone&#39;s mail? who is too lazy to accept a UPS delivery and instead just lies to UPS -- two days in a row!?</p>\n\n<p><a href=\"http://yourlaws.ca/criminal-code-canada/356-theft-mail\">According to this website</a> anyone who &quot;fraudulently redirects, or causes to be redirected, anything sent by post.&quot; (as they did with UPS on April 22/23) <em>and</em> anyone who &quot;steals anything sent by post, after it is deposited at a post office and before it is delivered, or after it is delivered but before it is in the possession of the addressee or of a person who may reasonably be considered to be authorized by the addressee to receive mail&quot; (as I believe they did April 21) is guilty of an indictable offense under the criminal code of Canada. </p>\n\n<p>Except I have no idea how to pursue that and really I just want my fucking stuff back/for them to pay the fees it cost me to have UPS re-ship my stuff. Does anyone have any advice, or any ideas of where this could be cross-posted to for potentially better advice?</p>\n\n<p>Thanks!</p>\n\n<p><strong>tl;dr</strong> my roommates told UPS that I&#39;ve moved when I actually haven&#39;t yet. Twice. I also haven&#39;t received mail that Canada Post has said is delivered... I&#39;m pretty sure they took it. What do?</p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "user_reports": [],
  "over_18": false,
  "score": 6,
  "stickied": false,
  "domain": "self.toronto",
  "is_self": true,
  "hidden": false,
  "_orphaned": {},
  "_api_link": "https://api.reddit.com/r/toronto/comments/33rghg/need_advice_my_roommates_have_been_withholding_my/?ref=search_posts",
  "_comments_by_id": {},
  "visited": false,
  "thumbnail": "self",
  "_has_fetched": true,
  "gilded": 0,
  "hide_score": false,
  "_info_url": "https://api.reddit.com/api/info/",
  "created_utc": 1429914647.0,
  "subreddit_id": "t5_2qi63",
  "id": "33rghg",
  "_params": {},
  "media_embed": {},
  "name": "t3_33rghg",
  "quarantine": false,
  "permalink": "https://www.reddit.com/r/toronto/comments/33rghg/need_advice_my_roommates_have_been_withholding_my/?ref=search_posts",
  "ups": 6,
  "url": "https://www.reddit.com/r/toronto/comments/33rghg/need_advice_my_roommates_have_been_withholding_my/",
  "title": "Need advice - my roommates have been withholding my mail."
}