{
  "downs": 0,
  "mod_reports": [],
  "secure_media_embed": {},
  "_info_url": "https://api.reddit.com/api/info/",
  "gilded": 0,
  "num_comments": 101,
  "_orphaned": {},
  "hidden": false,
  "ups": 346,
  "url": "https://www.reddit.com/r/gamecollecting/comments/1kd6rw/so_i_bought_a_video_game_store_1_year_update_more/",
  "_has_fetched": true,
  "quarantine": false,
  "name": "t3_1kd6rw",
  "author_flair_text": "FOTW Winner 2012/520",
  "user_reports": [],
  "saved": false,
  "permalink": "https://www.reddit.com/r/gamecollecting/comments/1kd6rw/so_i_bought_a_video_game_store_1_year_update_more/?ref=search_posts",
  "over_18": false,
  "is_self": true,
  "_params": {},
  "thumbnail": "self",
  "created_utc": 1376506579.0,
  "_replaced_more": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello <a href=\"/r/GamingCollecting\">/r/GamingCollecting</a>!!! Has it been a year already? A little over a year ago I took a crazy chance and bought a video game store at a local flea market. For those of you that do no remember my original post, you can <a href=\"http://www.reddit.com/r/gamecollecting/comments/txbnv/fotw_so_i_bought_a_video_game_store/\">see my find of the week here.</a> This store has changed my life in so many ways. A few months after buying the store I left my job (working for the man) and pursued this dream of mine full time. I took this dirty, run-down store and made it into the best that it can be. See what the <a href=\"http://imgur.com/a/a6qst\"> store looked like one year ago</a> and see the <a href=\"http://i.imgur.com/cyDToEg.jpg\">panorama I took this past week.</a>. I am really trying to help build a local game collecting community in Jacksonville and I think I am making some headway. I have regulars that make an appearance each weekend and buy/trade. I have also built a name for myself by being the only person in town that will take EVERYTHING video game related. Video games are not the only thing that I sell at the store now. I have slowly started to add vintage toys, board games, memorabilia and other geek awesomeness. </p>\n\n<p>I love this place and want nothing more but share my passion with the world. With that being said, I am running out of room at the flea market and need to take the next step to opening a retail location. Several months ago I started taking classes about business and started meeting with a business adviser. I have written my business plan, saved a few dollars and gathered inventory. It is now time to open a retail location! /excited This will give us a lot more room and we can be open up seven days a week! YAY! I still need a little more help getting the funds needed to open the store. My adviser suggested that I start an <a href=\"http://igg.me/at/VideoGameRescue/x/3287807\">IndieGoGo campaign</a> to crowdfund the remaining funds needed. I want this post to be more about an update on my store than a plea for $. <strong>I do not want anyone to feel obligated to donate</strong> and I want to thank everyone here for all the support and encouragement I have received from my fellow collectors.</p>\n</div><!-- SC_ON -->",
  "author_flair_css_class": "greenrupee",
  "subreddit_id": "t5_2s8fe",
  "archived": true,
  "domain": "self.gamecollecting",
  "clicked": false,
  "score": 346,
  "id": "1kd6rw",
  "stickied": false,
  "media_embed": {},
  "visited": false,
  "selftext": "Hello /r/GamingCollecting!!! Has it been a year already? A little over a year ago I took a crazy chance and bought a video game store at a local flea market. For those of you that do no remember my original post, you can [see my find of the week here.](http://www.reddit.com/r/gamecollecting/comments/txbnv/fotw_so_i_bought_a_video_game_store/) This store has changed my life in so many ways. A few months after buying the store I left my job (working for the man) and pursued this dream of mine full time. I took this dirty, run-down store and made it into the best that it can be. See what the [ store looked like one year ago](http://imgur.com/a/a6qst) and see the [panorama I took this past week.](http://i.imgur.com/cyDToEg.jpg). I am really trying to help build a local game collecting community in Jacksonville and I think I am making some headway. I have regulars that make an appearance each weekend and buy/trade. I have also built a name for myself by being the only person in town that will take EVERYTHING video game related. Video games are not the only thing that I sell at the store now. I have slowly started to add vintage toys, board games, memorabilia and other geek awesomeness. \n\nI love this place and want nothing more but share my passion with the world. With that being said, I am running out of room at the flea market and need to take the next step to opening a retail location. Several months ago I started taking classes about business and started meeting with a business adviser. I have written my business plan, saved a few dollars and gathered inventory. It is now time to open a retail location! /excited This will give us a lot more room and we can be open up seven days a week! YAY! I still need a little more help getting the funds needed to open the store. My adviser suggested that I start an [IndieGoGo campaign](http://igg.me/at/VideoGameRescue/x/3287807) to crowdfund the remaining funds needed. I want this post to be more about an update on my store than a plea for $. **I do not want anyone to feel obligated to donate** and I want to thank everyone here for all the support and encouragement I have received from my fellow collectors.\n",
  "hide_score": false,
  "_api_link": "https://api.reddit.com/r/gamecollecting/comments/1kd6rw/so_i_bought_a_video_game_store_1_year_update_more/?ref=search_posts",
  "locked": false,
  "edited": false,
  "title": "So I bought a video game store... (1 year update & more!)",
  "created": 1376510179.0,
  "_comments_by_id": {}
}