{
  "selftext": "#/r/GMOMyths\n\n\n**610 readers** for **1 year!**\n\nThe health food trend is one that has increased significantly over the past decade, and with hilarious results. Not to say that eating healthy food isn’t good, but that people will stop consuming anything if they think it’s bad for them. This is seen predominantly in upper-middle-class communities, like those in California, where people have a stable and leisurely enough living situation to spend their valuable free time wondering whether that last batch of strawberries they just bought was actually organically-grown, pesticide-free, Locavore-friendly, and Democrat-voting like the label said it was. This progresses far beyond the normal “McDonalds is bad, vegetables are good” mindset present in regular health-conscious people and transcends the bounds of reality and pseudoscience. Like [this recent Jimmy Kimmel skit](https://www.youtube.com/watch?v=AdJFE1sp4Fw), where his producers took to an oft-traveled exercise spot near Los Angeles to ask participants in the popular “gluten-free” health trend exactly what they thought gluten was. But the issue is even larger than that.\n\nOne of the most popular trends in “healthy eating” consists of a strong opposition to GMO foods. There are those who believe that genetically modified foods are bad for your health, and absolutely refuse to eat them. Natural food companies have thoroughly embraced this trend, marking their packages as “non-GMO” in an attempt to market to those savvy consumers. Various state legislatures have even attempted to make mandatory GMO labelling into a law, and [at least one](http://www.cnn.com/2014/05/08/health/vermont-gmo-labeling/) has succeeded. But this issue isn’t constrained to *only* impact upper-middle-class Americans with too much free time; it goes far beyond that, contributing to the stigmatization of GM crops in hundreds of nations across the world -- like Zambia, who [turned down a shipment](http://news.bbc.co.uk/2/hi/africa/2371675.stm) of GM food aid for its starving population of millions, or [a blockade of](https://en.wikipedia.org/wiki/Golden_rice#Controversy) the life-saving genetically modified golden rice crop which saved millions more from potentially fatal vitamin deficiencies. \n\nIn typical reddit fashion, however, this non-GMO trend tends to be a fair bit more militant and *a lot* more insane. There are those on this very website who believe not only that GM foods are bad for you, but that they’re *literally poison* - produced by the shady Monsanto in collusion with the Jews to enslave the population and turn us all into mindless zombies. This despite the widespread consensus amongst public health organizations, like the United Nations’ WHO and the UK’s Royal Society of Medicine, who acknowledged the exceptional safety and lack of health implications from GM crops. Even then, there is a very active community of redditors who are dedicated entirely to spreading the myth that GMOs are harmful, [operating out of dozens of subreddits](http://i.imgur.com/GOQMxLY.png) and persistently spamming every news subreddit imaginable to spread their message. With such a strong showing from the anti-GMO side, there’s a very clear need for an opposition force to stop the spread of misinformation.\n\n/r/GMOMyths fills the role of an opposition, and it fills it well. Like the /r/conspiratard of GMOs, /r/GMOMyths showcases the most hilarious, depressing and straight-up ridiculous myths and accusations that surround the anti-GMO crowd. Have you ever been accused of shilling for Monsanto? How about being told that GMOs are a ploy by the United Nations to enact Agenda 21? Those on /r/GMOMyths have experienced it all, and more. But as it stands, the subreddit exists to serve one simple and enlightening purpose: educate the general population (through humor, satire and mockery), not about the *dangers* of GMOs, but about the *safeties*. \n\nWe were asked to feature this on May 24th in commemoration of *March Against Monsanto*, the coordinated anti-GMO movement which claims to hold marches that will “occur on six continents and 52 countries,” otherwise known as “in Lincoln, Nebraska, consisting of like 30 people and a bunch of crudely-drawn signs.” I sat down with the moderators of /r/GMOMyths to ask them some questions, like “how much are you being paid?” and “why do you want to poison the planet?” Their answers are below.\n\n\n\n\n>##1. Tell us a bit about yourselves.\n\n\n>> **JF_Queeny** I first came to Reddit five years ago. I began by of course following, cheering for, and sometimes weeping for my Pirates in /r/buccos. After a few years I discovered a few other subs and lived a typical reddit lifestyle... [until this post.](http://www.reddit.com/r/politics/comments/o27hr/i_worked_for_monsanto_and_will_be_releasing/)\nI've farmed and used pesticides/herbicides my whole life. This was laughable and pathetic...yet quite a few on reddit, even those outside of conspiracy, believed it. Before you ask, no, /u/Beemergency never did deliver. A few weeks later a farmer in North Dakota does an AMA, and folks rip him to shreds, saying he pollutes the earth, lives in fear of Monsanto, kills babies etc etc.\nThis scared me for a few moments. My original reddit account had pictures of my house, specific location info about my hometown and name, all sorts of things the rather insane activists would love to find. So I took a step back, pondered for a moment on what could I choose as a s/n to not only correct these fools, but drive conspiracy theorists nuts.\nHence the name being the very dead founder of Monsanto. The number of threads devoted to guys claiming to 'expose ' me as a shill is easily over fifty. It's great to see that instead of addressing the reality of modern agriculture and biotechnology, they get worked up over me!\n\n\n>##2. What's the best/most hilarious/saddest thing you've been accused of? \n\n\n>> **JF_Queeny** I'm an agent of MI6 according to one moderator.\n\n\n>##3. In your opinion, how can we successfully educate consumers on the safeties of GM foods?\n\n>> **JF_Queeny** Nothing is as bad as 'Natural News' makes it out to be. Nobody wants to release anything dangerous to the public for the sake of weed or disease control. I'm proud of the plants I grow. Ask a real farmer about what they do and how they care for the environment and your dinner plate.\n\n\n\n>> **Anonymous mod** Essentially, academia and industry dropped the ball hard when it came to biotech education. Accordingly, the vast majority of the public lacks knowledge and critical thinking skills when it comes to this issue. As a result, this allows eco-reactionary groups to come in and spread misinformation and myths - which the public perceives as fact. To mitigate this, we need better discourse on the topic from people who are knowledgeable about the topic and able to refute this misinformation.\n\n>##4. What's your favorite aspect of /r/GMOMyths?\n\n>> **JF_Queeny** Folks who believe /u/totes_meta_bot is a Monsanto Robot. Also, had some jackass make a new reddit login as variations of my s/n for most of a year. Every possible combo and offensive slang word you could think of, easily over 40 or so. Most would culminate in a death threat. Here's to you thesaurus holding stalker guy! I also really enjoy watching someone change their mind about modern farming. You'll see a guy making a claim about 'Food Inc' and within one hours time six or seven people will speak up and point out how wrong the portions about Monsanto lawsuits are. It used to be four years ago the entire mindset of Reddit was 'GMO EVIL' in all the subreddits but Science and Farming. Now only the crack pot regions (/r/WorldNews and /r/Conspiracy, plus the GMOInfo subreddits, all 25+ of them) think that Monsanto is the devil.\n\n\n>##5. If you had to describe /r/GMOMyths to a militant environmental activist, what would you say?\n\n\n>> **JF_Queeny** You know how angry you get at Jon Stewart for making fun the Occupy movement? You felt as if he must have sold out to his corporate masters and shilled for Wall Street, right? Well, great news you field burning hippie, I'm here to make fun of you for walking around a grocery store in a biohazard suit screaming 'POISON APPLES' at the top of your lungs.\n\n\n\n>##6. Anything else to add?\n\n\n\n>> **JF_Queeny** I have had some medical issues in the last year and a half which is why I have been posting more frequently. In an effort to not divulge too much information I will be having to retire from farming due to physical issues with my body. No, it isn't herbicide related, /u/axolotl_peyotl.\n\nAs I post this, I sit at my dining room table munching on some non-GMO potato chips. But in my defense, they're absolutely delicious.\n\n\n\n[- BipolarBear0](http://i.imgur.com/ll6EsTq.gif)",
  "gilded": 0,
  "score": 195,
  "removal_reason": null,
  "approved_by": null,
  "created_utc": 1400911668.0,
  "is_self": true,
  "stickied": false,
  "edited": 1400912228.0,
  "distinguished": null,
  "permalink": "https://www.reddit.com/r/subredditoftheday/comments/26cutj/may_24_2014_rgmomyths_dont_worry_starving_african/?ref=search_posts",
  "banned_by": null,
  "from_id": null,
  "likes": null,
  "_underscore_names": null,
  "num_reports": null,
  "link_flair_css_class": null,
  "_info_url": "https://api.reddit.com/api/info/",
  "id": "26cutj",
  "archived": true,
  "secure_media": null,
  "from_kind": null,
  "saved": false,
  "domain": "self.subredditoftheday",
  "ups": 195,
  "suggested_sort": null,
  "quarantine": false,
  "over_18": false,
  "hide_score": false,
  "url": "https://www.reddit.com/r/subredditoftheday/comments/26cutj/may_24_2014_rgmomyths_dont_worry_starving_african/",
  "subreddit_id": "t5_2sgno",
  "_params": {},
  "_comments": null,
  "_replaced_more": false,
  "_comments_by_id": {},
  "user_reports": [],
  "media_embed": {},
  "created": 1400911668.0,
  "author_flair_text": "ʕ•ᴥ•ʔ",
  "visited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1><a href=\"/r/GMOMyths\">/r/GMOMyths</a></h1>\n\n<p><strong>610 readers</strong> for <strong>1 year!</strong></p>\n\n<p>The health food trend is one that has increased significantly over the past decade, and with hilarious results. Not to say that eating healthy food isn’t good, but that people will stop consuming anything if they think it’s bad for them. This is seen predominantly in upper-middle-class communities, like those in California, where people have a stable and leisurely enough living situation to spend their valuable free time wondering whether that last batch of strawberries they just bought was actually organically-grown, pesticide-free, Locavore-friendly, and Democrat-voting like the label said it was. This progresses far beyond the normal “McDonalds is bad, vegetables are good” mindset present in regular health-conscious people and transcends the bounds of reality and pseudoscience. Like <a href=\"https://www.youtube.com/watch?v=AdJFE1sp4Fw\">this recent Jimmy Kimmel skit</a>, where his producers took to an oft-traveled exercise spot near Los Angeles to ask participants in the popular “gluten-free” health trend exactly what they thought gluten was. But the issue is even larger than that.</p>\n\n<p>One of the most popular trends in “healthy eating” consists of a strong opposition to GMO foods. There are those who believe that genetically modified foods are bad for your health, and absolutely refuse to eat them. Natural food companies have thoroughly embraced this trend, marking their packages as “non-GMO” in an attempt to market to those savvy consumers. Various state legislatures have even attempted to make mandatory GMO labelling into a law, and <a href=\"http://www.cnn.com/2014/05/08/health/vermont-gmo-labeling/\">at least one</a> has succeeded. But this issue isn’t constrained to <em>only</em> impact upper-middle-class Americans with too much free time; it goes far beyond that, contributing to the stigmatization of GM crops in hundreds of nations across the world -- like Zambia, who <a href=\"http://news.bbc.co.uk/2/hi/africa/2371675.stm\">turned down a shipment</a> of GM food aid for its starving population of millions, or <a href=\"https://en.wikipedia.org/wiki/Golden_rice#Controversy\">a blockade of</a> the life-saving genetically modified golden rice crop which saved millions more from potentially fatal vitamin deficiencies. </p>\n\n<p>In typical reddit fashion, however, this non-GMO trend tends to be a fair bit more militant and <em>a lot</em> more insane. There are those on this very website who believe not only that GM foods are bad for you, but that they’re <em>literally poison</em> - produced by the shady Monsanto in collusion with the Jews to enslave the population and turn us all into mindless zombies. This despite the widespread consensus amongst public health organizations, like the United Nations’ WHO and the UK’s Royal Society of Medicine, who acknowledged the exceptional safety and lack of health implications from GM crops. Even then, there is a very active community of redditors who are dedicated entirely to spreading the myth that GMOs are harmful, <a href=\"http://i.imgur.com/GOQMxLY.png\">operating out of dozens of subreddits</a> and persistently spamming every news subreddit imaginable to spread their message. With such a strong showing from the anti-GMO side, there’s a very clear need for an opposition force to stop the spread of misinformation.</p>\n\n<p><a href=\"/r/GMOMyths\">/r/GMOMyths</a> fills the role of an opposition, and it fills it well. Like the <a href=\"/r/conspiratard\">/r/conspiratard</a> of GMOs, <a href=\"/r/GMOMyths\">/r/GMOMyths</a> showcases the most hilarious, depressing and straight-up ridiculous myths and accusations that surround the anti-GMO crowd. Have you ever been accused of shilling for Monsanto? How about being told that GMOs are a ploy by the United Nations to enact Agenda 21? Those on <a href=\"/r/GMOMyths\">/r/GMOMyths</a> have experienced it all, and more. But as it stands, the subreddit exists to serve one simple and enlightening purpose: educate the general population (through humor, satire and mockery), not about the <em>dangers</em> of GMOs, but about the <em>safeties</em>. </p>\n\n<p>We were asked to feature this on May 24th in commemoration of <em>March Against Monsanto</em>, the coordinated anti-GMO movement which claims to hold marches that will “occur on six continents and 52 countries,” otherwise known as “in Lincoln, Nebraska, consisting of like 30 people and a bunch of crudely-drawn signs.” I sat down with the moderators of <a href=\"/r/GMOMyths\">/r/GMOMyths</a> to ask them some questions, like “how much are you being paid?” and “why do you want to poison the planet?” Their answers are below.</p>\n\n<blockquote>\n<h2>1. Tell us a bit about yourselves.</h2>\n\n<blockquote>\n<p><strong>JF_Queeny</strong> I first came to Reddit five years ago. I began by of course following, cheering for, and sometimes weeping for my Pirates in <a href=\"/r/buccos\">/r/buccos</a>. After a few years I discovered a few other subs and lived a typical reddit lifestyle... <a href=\"http://www.reddit.com/r/politics/comments/o27hr/i_worked_for_monsanto_and_will_be_releasing/\">until this post.</a>\nI&#39;ve farmed and used pesticides/herbicides my whole life. This was laughable and pathetic...yet quite a few on reddit, even those outside of conspiracy, believed it. Before you ask, no, <a href=\"/u/Beemergency\">/u/Beemergency</a> never did deliver. A few weeks later a farmer in North Dakota does an AMA, and folks rip him to shreds, saying he pollutes the earth, lives in fear of Monsanto, kills babies etc etc.\nThis scared me for a few moments. My original reddit account had pictures of my house, specific location info about my hometown and name, all sorts of things the rather insane activists would love to find. So I took a step back, pondered for a moment on what could I choose as a s/n to not only correct these fools, but drive conspiracy theorists nuts.\nHence the name being the very dead founder of Monsanto. The number of threads devoted to guys claiming to &#39;expose &#39; me as a shill is easily over fifty. It&#39;s great to see that instead of addressing the reality of modern agriculture and biotechnology, they get worked up over me!</p>\n</blockquote>\n\n<h2>2. What&#39;s the best/most hilarious/saddest thing you&#39;ve been accused of?</h2>\n\n<blockquote>\n<p><strong>JF_Queeny</strong> I&#39;m an agent of MI6 according to one moderator.</p>\n</blockquote>\n\n<h2>3. In your opinion, how can we successfully educate consumers on the safeties of GM foods?</h2>\n\n<blockquote>\n<p><strong>JF_Queeny</strong> Nothing is as bad as &#39;Natural News&#39; makes it out to be. Nobody wants to release anything dangerous to the public for the sake of weed or disease control. I&#39;m proud of the plants I grow. Ask a real farmer about what they do and how they care for the environment and your dinner plate.</p>\n\n<p><strong>Anonymous mod</strong> Essentially, academia and industry dropped the ball hard when it came to biotech education. Accordingly, the vast majority of the public lacks knowledge and critical thinking skills when it comes to this issue. As a result, this allows eco-reactionary groups to come in and spread misinformation and myths - which the public perceives as fact. To mitigate this, we need better discourse on the topic from people who are knowledgeable about the topic and able to refute this misinformation.</p>\n</blockquote>\n\n<h2>4. What&#39;s your favorite aspect of <a href=\"/r/GMOMyths\">/r/GMOMyths</a>?</h2>\n\n<blockquote>\n<p><strong>JF_Queeny</strong> Folks who believe <a href=\"/u/totes_meta_bot\">/u/totes_meta_bot</a> is a Monsanto Robot. Also, had some jackass make a new reddit login as variations of my s/n for most of a year. Every possible combo and offensive slang word you could think of, easily over 40 or so. Most would culminate in a death threat. Here&#39;s to you thesaurus holding stalker guy! I also really enjoy watching someone change their mind about modern farming. You&#39;ll see a guy making a claim about &#39;Food Inc&#39; and within one hours time six or seven people will speak up and point out how wrong the portions about Monsanto lawsuits are. It used to be four years ago the entire mindset of Reddit was &#39;GMO EVIL&#39; in all the subreddits but Science and Farming. Now only the crack pot regions (<a href=\"/r/WorldNews\">/r/WorldNews</a> and <a href=\"/r/Conspiracy\">/r/Conspiracy</a>, plus the GMOInfo subreddits, all 25+ of them) think that Monsanto is the devil.</p>\n</blockquote>\n\n<h2>5. If you had to describe <a href=\"/r/GMOMyths\">/r/GMOMyths</a> to a militant environmental activist, what would you say?</h2>\n\n<blockquote>\n<p><strong>JF_Queeny</strong> You know how angry you get at Jon Stewart for making fun the Occupy movement? You felt as if he must have sold out to his corporate masters and shilled for Wall Street, right? Well, great news you field burning hippie, I&#39;m here to make fun of you for walking around a grocery store in a biohazard suit screaming &#39;POISON APPLES&#39; at the top of your lungs.</p>\n</blockquote>\n\n<h2>6. Anything else to add?</h2>\n\n<blockquote>\n<p><strong>JF_Queeny</strong> I have had some medical issues in the last year and a half which is why I have been posting more frequently. In an effort to not divulge too much information I will be having to retire from farming due to physical issues with my body. No, it isn&#39;t herbicide related, <a href=\"/u/axolotl_peyotl\">/u/axolotl_peyotl</a>.</p>\n</blockquote>\n</blockquote>\n\n<p>As I post this, I sit at my dining room table munching on some non-GMO potato chips. But in my defense, they&#39;re absolutely delicious.</p>\n\n<p><a href=\"http://i.imgur.com/ll6EsTq.gif\">- BipolarBear0</a></p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "_comment_sort": null,
  "report_reasons": null,
  "name": "t3_26cutj",
  "from": null,
  "hidden": false,
  "clicked": false,
  "media": null,
  "json_dict": null,
  "_api_link": "https://api.reddit.com/r/subredditoftheday/comments/26cutj/may_24_2014_rgmomyths_dont_worry_starving_african/?ref=search_posts",
  "secure_media_embed": {},
  "mod_reports": [],
  "_orphaned": {},
  "_uniq": null,
  "num_comments": 78,
  "link_flair_text": null,
  "title": "May 24, 2014 - /r/GMOMyths: Don't worry starving African children, we're saving you from yourselves!",
  "_has_fetched": true,
  "author_flair_css_class": "WRITER",
  "thumbnail": ""
}