{
  "selftext": "I'm not a nutritionist, or a health guru, or a fitness guru. But I was pretty big a few years ago and I know what it's like to be addicted to sugar, and fast food, and all that shit that your brain tells you tastes so good. Hopefully this might help a few people! An important thing to remember is that you're just a pawn for industrial food corporations, they don't care about you, or your health, or your eventual death. They just want you to keep consuming their products which they manage to do through marketing and by making their food as addictive as possible. \n\nIf you want to get healthy, stay away from ingredients you don't recognize, processed foods, microwave meals, *any* kind of soda, fruit juice, foods that are \"low in fat\" or \"low in sugar.\" Eating healthy doesn't mean switching from Coke to Diet Coke. Learn to avoid pretty much anything that comes in packaging. Cook your own meals; **absolutely no fast food, ever**. Someone will mention Jared from Subway, or the people who look fit and eat fast food every day. It obviously doesn't work for you, and besides, looking thin doesn't make you healthy. At first glance cigarette smokers look healthy but what they're doing is killing them. This is about your health, and your life, cut fast food. \n\nEat vegetables and fruit, support local food, go to the farmer's market instead of the drive through. Your body will learn to love fresh fruits and vegetables. Cut anything that's loaded with salt and sugars; for instance, fruit is good, fruit juice is bad (all sugar - even if natural sugar - and no fiber means your body takes it in the same way it does soda). Check your servings as well, maybe going for seconds and thirds isn't such a great idea. Change won't be easy but it'll come progressively with **determination** and **knowledge of self**. Be aware of your weaknesses and resist them. Eventually you won't even miss the crap you used to eat.\n\n**Exercise** is also extremely important but it isn't a substitute for eating healthy! Saying to yourself I can have those cinnamon rolls because I spent 15 minutes on a stationary bike isn't the best way to go about this. That said, cardio is essential for your health and you should **exercise daily**. Everyone has time to exercise. \n\nThese are some books and movies that show how the food industry works and gives you actual information on how to live a healthy lifestyle. This is just what I've read and seen, but there's obviously thousands more. Add some in the comments!\n\nKeep in mind that if you dive into diet books you'll see plenty of contradictions, some saying you should cut carbs, some saying only carbs, some saying high or low protein, etc. Change doesn't come by spending all your time and money reading, but by actually doing exercise and cutting unnecessary sugar, salt, and fatty foods from your diet. Deep down you know if you should be eating something or not. \n\n\n**Movies** (most are on Netflix): \n\n* Fed Up\n\n* Food, Inc\n\n* Forks Over Knives\n\n* Food Chains\n\n* Super Size Me\n\n* Vegucated\n\n* Hungry For a Change\n\n* Fat, Sick, and Nearly Dead\n\n* Even the Gabriel Iglesias movie goes into detail about how he lost weight (if you can stand him)\n\n**Books**:\n\n* Eat, Drink, and Be Healthy: The Harvard Medical School Guide to Healthy Eating\n\n* The Marshmallow Test\n\n* Prevent and Reverse Heart Disease\n\n* Whole: Rethinking the Science of Nutrition\n\n* The China Study\n\n* Salt, Sugar, Fat: How the Food Giants Hooked Us\n\n* Sugar Crush: How to Reduce Inflammation, Reverse Nerve Damage, and Reclaim Good Health\n\n* Forks Over Knives: The Cookbook\n\nI won't go into fitness as there's thousands and thousands of books that teach you how to run properly, or teach you swimming, yoga, what to do at the gym, etc. \n",
  "gilded": 0,
  "score": 34,
  "removal_reason": null,
  "approved_by": null,
  "created_utc": 1434017751.0,
  "is_self": true,
  "stickied": false,
  "edited": false,
  "distinguished": null,
  "permalink": "https://www.reddit.com/r/ObesityHealthConcern/comments/39f899/i_like_the_idea_of_this_subreddit_for_anyone/?ref=search_posts",
  "banned_by": null,
  "from_id": null,
  "likes": null,
  "_underscore_names": null,
  "num_reports": null,
  "link_flair_css_class": null,
  "_info_url": "https://api.reddit.com/api/info/",
  "id": "39f899",
  "archived": false,
  "secure_media": null,
  "from_kind": null,
  "saved": false,
  "domain": "self.ObesityHealthConcern",
  "ups": 34,
  "suggested_sort": null,
  "quarantine": false,
  "over_18": false,
  "hide_score": false,
  "url": "https://www.reddit.com/r/ObesityHealthConcern/comments/39f899/i_like_the_idea_of_this_subreddit_for_anyone/",
  "subreddit_id": "t5_38lfu",
  "_params": {},
  "_comments": null,
  "_replaced_more": false,
  "_comments_by_id": {},
  "user_reports": [],
  "media_embed": {},
  "created": 1434017751.0,
  "author_flair_text": null,
  "visited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m not a nutritionist, or a health guru, or a fitness guru. But I was pretty big a few years ago and I know what it&#39;s like to be addicted to sugar, and fast food, and all that shit that your brain tells you tastes so good. Hopefully this might help a few people! An important thing to remember is that you&#39;re just a pawn for industrial food corporations, they don&#39;t care about you, or your health, or your eventual death. They just want you to keep consuming their products which they manage to do through marketing and by making their food as addictive as possible. </p>\n\n<p>If you want to get healthy, stay away from ingredients you don&#39;t recognize, processed foods, microwave meals, <em>any</em> kind of soda, fruit juice, foods that are &quot;low in fat&quot; or &quot;low in sugar.&quot; Eating healthy doesn&#39;t mean switching from Coke to Diet Coke. Learn to avoid pretty much anything that comes in packaging. Cook your own meals; <strong>absolutely no fast food, ever</strong>. Someone will mention Jared from Subway, or the people who look fit and eat fast food every day. It obviously doesn&#39;t work for you, and besides, looking thin doesn&#39;t make you healthy. At first glance cigarette smokers look healthy but what they&#39;re doing is killing them. This is about your health, and your life, cut fast food. </p>\n\n<p>Eat vegetables and fruit, support local food, go to the farmer&#39;s market instead of the drive through. Your body will learn to love fresh fruits and vegetables. Cut anything that&#39;s loaded with salt and sugars; for instance, fruit is good, fruit juice is bad (all sugar - even if natural sugar - and no fiber means your body takes it in the same way it does soda). Check your servings as well, maybe going for seconds and thirds isn&#39;t such a great idea. Change won&#39;t be easy but it&#39;ll come progressively with <strong>determination</strong> and <strong>knowledge of self</strong>. Be aware of your weaknesses and resist them. Eventually you won&#39;t even miss the crap you used to eat.</p>\n\n<p><strong>Exercise</strong> is also extremely important but it isn&#39;t a substitute for eating healthy! Saying to yourself I can have those cinnamon rolls because I spent 15 minutes on a stationary bike isn&#39;t the best way to go about this. That said, cardio is essential for your health and you should <strong>exercise daily</strong>. Everyone has time to exercise. </p>\n\n<p>These are some books and movies that show how the food industry works and gives you actual information on how to live a healthy lifestyle. This is just what I&#39;ve read and seen, but there&#39;s obviously thousands more. Add some in the comments!</p>\n\n<p>Keep in mind that if you dive into diet books you&#39;ll see plenty of contradictions, some saying you should cut carbs, some saying only carbs, some saying high or low protein, etc. Change doesn&#39;t come by spending all your time and money reading, but by actually doing exercise and cutting unnecessary sugar, salt, and fatty foods from your diet. Deep down you know if you should be eating something or not. </p>\n\n<p><strong>Movies</strong> (most are on Netflix): </p>\n\n<ul>\n<li><p>Fed Up</p></li>\n<li><p>Food, Inc</p></li>\n<li><p>Forks Over Knives</p></li>\n<li><p>Food Chains</p></li>\n<li><p>Super Size Me</p></li>\n<li><p>Vegucated</p></li>\n<li><p>Hungry For a Change</p></li>\n<li><p>Fat, Sick, and Nearly Dead</p></li>\n<li><p>Even the Gabriel Iglesias movie goes into detail about how he lost weight (if you can stand him)</p></li>\n</ul>\n\n<p><strong>Books</strong>:</p>\n\n<ul>\n<li><p>Eat, Drink, and Be Healthy: The Harvard Medical School Guide to Healthy Eating</p></li>\n<li><p>The Marshmallow Test</p></li>\n<li><p>Prevent and Reverse Heart Disease</p></li>\n<li><p>Whole: Rethinking the Science of Nutrition</p></li>\n<li><p>The China Study</p></li>\n<li><p>Salt, Sugar, Fat: How the Food Giants Hooked Us</p></li>\n<li><p>Sugar Crush: How to Reduce Inflammation, Reverse Nerve Damage, and Reclaim Good Health</p></li>\n<li><p>Forks Over Knives: The Cookbook</p></li>\n</ul>\n\n<p>I won&#39;t go into fitness as there&#39;s thousands and thousands of books that teach you how to run properly, or teach you swimming, yoga, what to do at the gym, etc. </p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "_comment_sort": null,
  "report_reasons": null,
  "name": "t3_39f899",
  "from": null,
  "hidden": false,
  "clicked": false,
  "media": null,
  "json_dict": null,
  "_api_link": "https://api.reddit.com/r/ObesityHealthConcern/comments/39f899/i_like_the_idea_of_this_subreddit_for_anyone/?ref=search_posts",
  "secure_media_embed": {},
  "mod_reports": [],
  "_orphaned": {},
  "_uniq": null,
  "num_comments": 1,
  "link_flair_text": null,
  "title": "I like the idea of this subreddit. For anyone wanting to change their lifestyle there are plenty of books and documentaries to help you change your life. But remember this is a change in the way you live your life, not a diet. A diet implies you can eventually go back to eating badly. More inside.",
  "_has_fetched": true,
  "author_flair_css_class": null,
  "thumbnail": "self"
}