{
  "selftext": "This is from the book [Life Inc.: How the World Became a Corporation  and How To Take it Back](http://www.rushkoff.com/life-inc/) by Douglas Rushkoff. I was reminded of it by the recent death of John Forbes Nash.\n\nRushkoff's book is about how the 'free' market became the dominant factor in human life and how we all must accommodate our behavior to the market, rather than the economy being centered around human needs. Justifying this is the depiction of humans as rational, self-interested, competitive, acquisitive automatons, ceaselessly pursuing our own benefit and 'utility maximization' above all else. This concept of humanity is the underlying assumption in nearly all the mathematical models that economists use, including those developed by Nash (of 'A Beautiful Mind' fame).\n\nPart of the justification for this was the ultra-violent depiction of humanity promoted by Social Darwinism and by certain anthropologists. In this passage, he makes the connection between these depictions of 'natural' human behavior and the structure of the competitive market economy:\n\n>For all the ability of genes and even memes to battle for survival against one another, human beings are just as likely to share and cooperate as they are to cheat and compete. But the ascendance of market rhetoric in America and Britain was accompanied by the assertion of some decidedly antiromantic science. University anthropologists seemed determined to correct the hopeful impressions that so many still clung to of peaceful, vegetarian gorillas enjoying one another's company in the jungle. Like stories of supposedly peaceful aboriginal tribes as yet untainted by corrupt Western civilization, such visions according to the new social Darwinists—were pure fantasy. \n\n>The people-are-actually-really-mean hypothesis was supported by the anthropologist Napoleon Chagnon's observation of violence among the Yanomami people of South America. Chagnon's documentary footage depicted tribesmen attacking one another with machetes. He demonstrated that the seemingly random violence had broken out along complex familial lines, supposedly proving that the tribesmen's genes were still competing for dominance. Buried deeper in his documentation was the real reason for these attacks: Chagnon had distributed a small number of machetes to just one of the tribes. The neighboring tribes wanted the machetes, too. Although the study has been argued over for decades now, the artificially introduced scarce resource  was at least part of the reason they were fighting. \n\n>Paleontologists and social biologists such as *Lucifer Principle* author Howard Bloom present contagiously popular evidence of violence among competing gorilla and chimpanzee groups, going as far as to describe the steps by which a certain female chimp dashed out the brains of its rivals. That the chimps were fighting over rights to a human garbage dump isn't considered germane. Perhaps predictably, Bloom's follow-up work, *Reinventing Capitalism*, applies these same skewed insights to the market. He is not alone. Volumes could be filled (and actually are) with essays and studies about the violent, self-interested behaviors of monkeys and indigenous peoples, written by prominent scholars and directed to policy-makers and economists. \n\n>Just because many participants in leading intellectual forums such as *The New York Review of Books* or [Edge.org](http://edge.org/) (a website on which I participate) consider these proudly unromantic views of human nature more consistent with a godless universe doesn't make them any more true. More scientifically gathered evidence points the other way. \n\n>A South African archeologist and Harvard professor named Glynn Isaac based his own studies of human behavior less on abstract models or analogies with apes than on hard evidence from fossils and archeological digs. By focusing on the evolutionary record, Isaac showed how social networks and food sharing were the deciding factors in allowing early hominids to succeed over their peers. Researchers at Ohio State University studied sex-based size differences in human fossil remains, concluding that competition between males for mates was much less prevalent than earlier believed. \"Males were cooperating more than they were competing among themselves,\" the researchers concluded. \n\n>Studies by psychologists at the University of Chicago in which researchers measured subjects' ability to see problems from the perspective of others demonstrated how \"cultures that emphasize inter\tdependence over individualism may have the upper hand.\" (In their conclusions, the psychologists noted the individualistic bias of Western corporations compared with those of Asia. A Texas corporation \"aiming to improve productivity told its employees to look in the mirror and say 'I am beautiful' 100 times before coming to work. In contrast, a Japanese supermarket instructed its employees to begin their day by telling each other 'you are beautiful.' \") \n\n>While legends of violent meat-eating Homo sapiens vanquishing tribes of Neanderthals still garner rapt attention at dinner parties, there is little evidence that such events ever took place. On the other hand, there's plenty of evidence for the less dramatic assertion that a combination of tools, hunting, gathering, and food-sharing permitted what we now think of as civilization to evolve out of cooperative human activity. In certain circumstances, the tendency toward conflict with neighboring tribes inhibited survival, while cooperation within a social group and beyond promoted it. \n\n>We shouldn't be too shocked that the world's intellectuals would be so prone to perceive humanity as driven by instinctual self-interested violence. This behavior is as old as colonialism itself and calls to mind wealthy plantation owners arguing that Africans were better equipped anatomically—by the Maker or by evolution—to pick cotton. Today's equivalent, however well masked in scientific jargon, is no better supported by the facts. As a cultural mythology, however, it helps assuage any residual guilt the rich might feel over the inequitable distribution of wealth built into the existing economic order. \n\n>Or perhaps the wealthy obsess over what they hope is an entirely dog-eat-dog reality because their participation in the culture of money hasn't ended up making them any happier. According to a study conducted at the height of the market, 23 percent of brokers and traders at the seven largest firms on Wall Street suffered from depression—more than three times the national average. Scientists and United Nations sociologists alike have concluded that affluence produces rapidly diminishing returns on happiness. Alter achieving an income per capita of about $15,000, any increase in wealth makes little difference to a nation's total happiness metrics.\n \n>Among the six articles I found from *Forbes* in 2006 fiercely criticizing this \"swath of studies\" as well as the whole notion of \"happiness research,\" none mentioned any of them specifically, or their findings. The libertarian think tank the Cato Institute similarly criticized these studies along with any attempt to measure subjective well-being—but concluded that even if they were true and money didn't make people happier, this would only support the libertarian position that wealth redistribution by government was unnecessary. Still others have criticized happiness research because it could lead to the implementation of authoritarian policies by central governments under the pretense that they were trying to make people happier. \n\n[...]\n\n>There is a vast middle ground between attempting to design a socialist welfare state and leaving self-interested individuals alone to spontaneously develop a free-market Utopia—especially when the rules of that marketplace have been imposed by forces as powerful as any dictator. To approach that middle ground, however, we must dispense with the assumption that human beings were born to be economic actors or, in Hayek's more nuanced view, that we are all the unconscious arbiters of natural market forces. The principles of the intentionally corporatized marketplace are not embedded in the human genome, nor is self-interested behavior an innate human instinct. If anything, it's the other way around: a landscape defined by the competitive market will promote self-interested behavior. It's the surest path to a corporatist society. \n\n>Maybe that was the objective all along. \n\nSimilar to stuff Chris has said in the past. It's a good book on economics for anyone who is interested-worth a read.",
  "gilded": 0,
  "score": 5,
  "removal_reason": null,
  "approved_by": null,
  "created_utc": 1435366552.0,
  "is_self": true,
  "stickied": false,
  "edited": 1435363352.0,
  "distinguished": null,
  "permalink": "https://www.reddit.com/r/tangentiallyspeaking/comments/3b94ml/good_passage_from_life_inc_by_douglas_rushkoff/?ref=search_posts",
  "banned_by": null,
  "from_id": null,
  "likes": null,
  "_underscore_names": null,
  "num_reports": null,
  "link_flair_css_class": null,
  "_info_url": "https://api.reddit.com/api/info/",
  "id": "3b94ml",
  "archived": false,
  "secure_media": null,
  "from_kind": null,
  "saved": false,
  "domain": "self.tangentiallyspeaking",
  "ups": 5,
  "suggested_sort": null,
  "quarantine": false,
  "over_18": false,
  "hide_score": false,
  "url": "https://www.reddit.com/r/tangentiallyspeaking/comments/3b94ml/good_passage_from_life_inc_by_douglas_rushkoff/",
  "subreddit_id": "t5_2yj8m",
  "_params": {},
  "_comments": null,
  "_replaced_more": false,
  "_comments_by_id": {},
  "user_reports": [],
  "media_embed": {},
  "created": 1435366552.0,
  "author_flair_text": null,
  "visited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is from the book <a href=\"http://www.rushkoff.com/life-inc/\">Life Inc.: How the World Became a Corporation  and How To Take it Back</a> by Douglas Rushkoff. I was reminded of it by the recent death of John Forbes Nash.</p>\n\n<p>Rushkoff&#39;s book is about how the &#39;free&#39; market became the dominant factor in human life and how we all must accommodate our behavior to the market, rather than the economy being centered around human needs. Justifying this is the depiction of humans as rational, self-interested, competitive, acquisitive automatons, ceaselessly pursuing our own benefit and &#39;utility maximization&#39; above all else. This concept of humanity is the underlying assumption in nearly all the mathematical models that economists use, including those developed by Nash (of &#39;A Beautiful Mind&#39; fame).</p>\n\n<p>Part of the justification for this was the ultra-violent depiction of humanity promoted by Social Darwinism and by certain anthropologists. In this passage, he makes the connection between these depictions of &#39;natural&#39; human behavior and the structure of the competitive market economy:</p>\n\n<blockquote>\n<p>For all the ability of genes and even memes to battle for survival against one another, human beings are just as likely to share and cooperate as they are to cheat and compete. But the ascendance of market rhetoric in America and Britain was accompanied by the assertion of some decidedly antiromantic science. University anthropologists seemed determined to correct the hopeful impressions that so many still clung to of peaceful, vegetarian gorillas enjoying one another&#39;s company in the jungle. Like stories of supposedly peaceful aboriginal tribes as yet untainted by corrupt Western civilization, such visions according to the new social Darwinists—were pure fantasy. </p>\n\n<p>The people-are-actually-really-mean hypothesis was supported by the anthropologist Napoleon Chagnon&#39;s observation of violence among the Yanomami people of South America. Chagnon&#39;s documentary footage depicted tribesmen attacking one another with machetes. He demonstrated that the seemingly random violence had broken out along complex familial lines, supposedly proving that the tribesmen&#39;s genes were still competing for dominance. Buried deeper in his documentation was the real reason for these attacks: Chagnon had distributed a small number of machetes to just one of the tribes. The neighboring tribes wanted the machetes, too. Although the study has been argued over for decades now, the artificially introduced scarce resource  was at least part of the reason they were fighting. </p>\n\n<p>Paleontologists and social biologists such as <em>Lucifer Principle</em> author Howard Bloom present contagiously popular evidence of violence among competing gorilla and chimpanzee groups, going as far as to describe the steps by which a certain female chimp dashed out the brains of its rivals. That the chimps were fighting over rights to a human garbage dump isn&#39;t considered germane. Perhaps predictably, Bloom&#39;s follow-up work, <em>Reinventing Capitalism</em>, applies these same skewed insights to the market. He is not alone. Volumes could be filled (and actually are) with essays and studies about the violent, self-interested behaviors of monkeys and indigenous peoples, written by prominent scholars and directed to policy-makers and economists. </p>\n\n<p>Just because many participants in leading intellectual forums such as <em>The New York Review of Books</em> or <a href=\"http://edge.org/\">Edge.org</a> (a website on which I participate) consider these proudly unromantic views of human nature more consistent with a godless universe doesn&#39;t make them any more true. More scientifically gathered evidence points the other way. </p>\n\n<p>A South African archeologist and Harvard professor named Glynn Isaac based his own studies of human behavior less on abstract models or analogies with apes than on hard evidence from fossils and archeological digs. By focusing on the evolutionary record, Isaac showed how social networks and food sharing were the deciding factors in allowing early hominids to succeed over their peers. Researchers at Ohio State University studied sex-based size differences in human fossil remains, concluding that competition between males for mates was much less prevalent than earlier believed. &quot;Males were cooperating more than they were competing among themselves,&quot; the researchers concluded. </p>\n\n<p>Studies by psychologists at the University of Chicago in which researchers measured subjects&#39; ability to see problems from the perspective of others demonstrated how &quot;cultures that emphasize inter   dependence over individualism may have the upper hand.&quot; (In their conclusions, the psychologists noted the individualistic bias of Western corporations compared with those of Asia. A Texas corporation &quot;aiming to improve productivity told its employees to look in the mirror and say &#39;I am beautiful&#39; 100 times before coming to work. In contrast, a Japanese supermarket instructed its employees to begin their day by telling each other &#39;you are beautiful.&#39; &quot;) </p>\n\n<p>While legends of violent meat-eating Homo sapiens vanquishing tribes of Neanderthals still garner rapt attention at dinner parties, there is little evidence that such events ever took place. On the other hand, there&#39;s plenty of evidence for the less dramatic assertion that a combination of tools, hunting, gathering, and food-sharing permitted what we now think of as civilization to evolve out of cooperative human activity. In certain circumstances, the tendency toward conflict with neighboring tribes inhibited survival, while cooperation within a social group and beyond promoted it. </p>\n\n<p>We shouldn&#39;t be too shocked that the world&#39;s intellectuals would be so prone to perceive humanity as driven by instinctual self-interested violence. This behavior is as old as colonialism itself and calls to mind wealthy plantation owners arguing that Africans were better equipped anatomically—by the Maker or by evolution—to pick cotton. Today&#39;s equivalent, however well masked in scientific jargon, is no better supported by the facts. As a cultural mythology, however, it helps assuage any residual guilt the rich might feel over the inequitable distribution of wealth built into the existing economic order. </p>\n\n<p>Or perhaps the wealthy obsess over what they hope is an entirely dog-eat-dog reality because their participation in the culture of money hasn&#39;t ended up making them any happier. According to a study conducted at the height of the market, 23 percent of brokers and traders at the seven largest firms on Wall Street suffered from depression—more than three times the national average. Scientists and United Nations sociologists alike have concluded that affluence produces rapidly diminishing returns on happiness. Alter achieving an income per capita of about $15,000, any increase in wealth makes little difference to a nation&#39;s total happiness metrics.</p>\n\n<p>Among the six articles I found from <em>Forbes</em> in 2006 fiercely criticizing this &quot;swath of studies&quot; as well as the whole notion of &quot;happiness research,&quot; none mentioned any of them specifically, or their findings. The libertarian think tank the Cato Institute similarly criticized these studies along with any attempt to measure subjective well-being—but concluded that even if they were true and money didn&#39;t make people happier, this would only support the libertarian position that wealth redistribution by government was unnecessary. Still others have criticized happiness research because it could lead to the implementation of authoritarian policies by central governments under the pretense that they were trying to make people happier. </p>\n</blockquote>\n\n<p>[...]</p>\n\n<blockquote>\n<p>There is a vast middle ground between attempting to design a socialist welfare state and leaving self-interested individuals alone to spontaneously develop a free-market Utopia—especially when the rules of that marketplace have been imposed by forces as powerful as any dictator. To approach that middle ground, however, we must dispense with the assumption that human beings were born to be economic actors or, in Hayek&#39;s more nuanced view, that we are all the unconscious arbiters of natural market forces. The principles of the intentionally corporatized marketplace are not embedded in the human genome, nor is self-interested behavior an innate human instinct. If anything, it&#39;s the other way around: a landscape defined by the competitive market will promote self-interested behavior. It&#39;s the surest path to a corporatist society. </p>\n\n<p>Maybe that was the objective all along. </p>\n</blockquote>\n\n<p>Similar to stuff Chris has said in the past. It&#39;s a good book on economics for anyone who is interested-worth a read.</p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "_comment_sort": null,
  "report_reasons": null,
  "name": "t3_3b94ml",
  "from": null,
  "hidden": false,
  "clicked": false,
  "media": null,
  "json_dict": null,
  "_api_link": "https://api.reddit.com/r/tangentiallyspeaking/comments/3b94ml/good_passage_from_life_inc_by_douglas_rushkoff/?ref=search_posts",
  "secure_media_embed": {},
  "mod_reports": [],
  "_orphaned": {},
  "_uniq": null,
  "num_comments": 1,
  "link_flair_text": null,
  "title": "Good passage from *Life Inc.* by Douglas Rushkoff",
  "_has_fetched": true,
  "author_flair_css_class": null,
  "thumbnail": ""
}