{
  "downs": 0,
  "mod_reports": [],
  "secure_media_embed": {},
  "_info_url": "https://api.reddit.com/api/info/",
  "gilded": 0,
  "num_comments": 0,
  "_orphaned": {},
  "hidden": false,
  "ups": 0,
  "url": "https://www.reddit.com/r/investing/comments/1cv8st/can_equities_cushion_the_blow_of_falling_gold/",
  "_has_fetched": true,
  "quarantine": false,
  "name": "t3_1cv8st",
  "user_reports": [],
  "saved": false,
  "permalink": "https://www.reddit.com/r/investing/comments/1cv8st/can_equities_cushion_the_blow_of_falling_gold/?ref=search_posts",
  "over_18": false,
  "is_self": true,
  "_params": {},
  "thumbnail": "self",
  "created_utc": 1366648160.0,
  "_replaced_more": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"http://www.theaureport.com/pub/na/15171\">Source</a>: Brian Sylvester of The Gold Report (4/19/13)</p>\n\n<p>The recent fall in precious metals prices has investors on edge. Many precious metals equities were hurting even before the latest precious metals drop. In this interview with The Gold Report, Peter Rose, head of mining research with Fox-Davies Capital Ltd. in London, provides a European perspective on mining and advises looking at under-appreciated jurisdictions (think Europe) and neglected metals like tin, lead and zinc.</p>\n\n<p>The Gold Report: Peter, can you give us your long-term view of the Eurozone as it lurches from bailout to bailout?</p>\n\n<p>Peter Rose: Some major things have to happen in Europe and the sooner, the better. Unfortunately, I think it will get worse in the short term.</p>\n\n<p>But from the mining industry perspective, these crises are bringing a lot of realism to certain governments. Greece has opposed mining, despite having quite good ore bodies, as do Portugal, Spain and Cyprus. Mining companies can generate real revenues, exports and jobs and contribute to the financial coffers.</p>\n\n<p>In addition, the European Union has good rules of law. The tenures are pretty safe, there are pro-mining interests and there are deposits of strategic elements. If you compare the operating costs with Australia, the European infrastructure tends to be better; wage rates are significantly lower. It makes for a pretty compelling story.</p>\n\n<p>TGR: You deal with many junior mining companies. In 2004, the junior mining companies listed on the TSX Venture Exchange (TSX.V) averaged 27 million (27M) shares outstanding. Today, the average is 73M shares. Why have share floats risen so dramatically?</p>\n\n<p>PR: I put it down to the euphoria about rising metal prices. There was a long period when it was very easy to raise money due to rising metal prices. On the TSX.V there was always a bigger focus on exploration companies. I believe these to be the major reasons, although sentiment is very different today compared with even two years ago.</p>\n\n<p>A lot of exploration companies had no hope of bringing a mine into production, but it was very easy to raise money in 2004, so they did. Today, the writing is on the wall for quite a few of them. It is exceptionally hard for an exploration company with no near-term development potential to raise money.</p>\n\n<p>From what I understand of the Canadian market, it is easier to raise money for exploration than development. On this side of the Atlantic, it has been easier to raise money for development because you get something at the end, even if it may not be much.</p>\n\n<p>TGR: Your firm, Fox-Davies, helps public companies raise money. Which mine commodities and which types of projects are consistently getting funded now?</p>\n\n<p>PR: It is easier to raise money for oil and gas companies. People like gold and copper, and while the outlook for tin is as good as for any other metal, it is has some in-built resistance.</p>\n\n<p>The funds do not like obscure commodities. As long as you stick to the main London Metal Exchange-traded metals—copper, lead, zinc, gold, silver, and less so, nickel—the funds tend to be content with that.</p>\n\n<p>TGR: But gold and silver don’t trade on the London Metal Exchange.</p>\n\n<p>PR: No, but there is a good market for them, and they make the headlines quite often. Tin does not make headlines and nickel is in oversupply at the moment.</p>\n\n<p>TGR: Have there been initial public offerings for tin juniors?</p>\n\n<p>PR: A number of them are trying. We are looking at off-market financing for them. There are private tin companies out there.</p>\n\n<p>TGR: What is your outlook for gold this year and beyond?</p>\n\n<p>PR: I am not positive over the next three months. India has raised import duties to slow down the rate of imports and help with its balance-of-payments deficit. In addition, too many gold companies have chased production instead of profits, and people are a bit fed up, especially fund managers.</p>\n\n<p>Longer term, I am not optimistic. When interest rates return to more normal levels, as they must do eventually, the gold price will come way down. Prices will overreact before stabilizing well off the bottom. However, I am surprised with the speed in which the market turned.</p>\n\n<p>TGR: What is your timeframe for that?</p>\n\n<p>PR: About five or six years.</p>\n\n<p>TGR: What is your outlook for silver?</p>\n\n<p>PR: In the short term, silver will track the gold price. However, given that silver is an industrial metal and that a lot of it is a byproduct of lead-zinc mining, I think there will be a disconnect between the gold and silver prices in 2014 and 2015. A number of lead-zinc mines will be nearing the end of their lives over the next couple of years. That will remove a lot of silver from the market, tightening up the supply side considerably.</p>\n\n<p>TGR: Is silver’s recent price weakness an early indicator of global economic weakness?</p>\n\n<p>PR: No, it is more of a sympathy move with the gold market.</p>\n\n<p>While global industrial production is not exactly brilliant at the moment, certain pockets are performing very well. The British automobile industry, for example, is performing as well as it has in the last 20 years. The aerospace industry is going really well, too. These are sectors that use quite a bit of silver, regardless of price.</p>\n\n<p>TGR: Should precious metals investors buy select equities for growth, protection or both?</p>\n\n<p>PR: I think it is probably better to buy equities than the metal, quite honestly. I think you get better leverage.</p>\n\n<p>If you think that your currency is going to be devalued dramatically, you are better off buying gold or silver, depending on what you can afford. But generally, you have more liquidity and better leverage if you buy the correct stocks.</p>\n\n<p>TGR: Should investors be more optimistic than they are right now?</p>\n\n<p>PR: Yes. You can make a valid argument that precious metal mining companies are finally listening to the fund managers and starting to think of profit and returns rather than ounces of production. I think that is a positive development.</p>\n\n<p>TGR: What silver names can you tell our readers about?</p>\n\n<p>PR: The sole silver company I cover is Hochschild Mining Plc (HOC:LSE). While I do not like it in the short term, toward the end of 2014 the company will have two or three mines coming into production. I think Immaculada in Peru will be a cracker of a mine. The gold grades there are better than at Hochschild’s other Peruvian operations, and it has good silver grades. At that point, its production will shoot up 50%. You will have to weather some hardships in the short term, but if you were to start buying 12 months from now, you could make some serious money.</p>\n\n<p>TGR: In 2012, Hochschild posted earnings of $0.19/share. How long will it take to get back there?</p>\n\n<p>PR: I am not optimistic that 2013 will be as good as 2012. Production measured in silver equivalents will be flat. Peru’s currency, the nuevo sol, has been strengthening against the U.S. dollar for about five years, resulting in some imported wage inflation. There also is inflation at San José in Argentina. Profits will probably be down a little bit. It has spent a lot of its cash, so interest income will be down as well. It will struggle this year, but 2014 looks better.</p>\n\n<p>TGR: Hochschild has been something of an acquirer. Given the prices of juniors, might it use some of its cash for acquisitions?</p>\n\n<p>PR: It made a big acquisition late last year. Hochschild also has been putting large amounts of money into exploration with a twofold aim. One was to extend the mine lives of its existing operations and the other was to find more company makers. I think it has 13 company makers in its exploration portfolio right now. My instinct says Hochschild will be more inclined to develop its own properties rather than buy more. However, with the recent dramatic decline in share prices, this may now change.</p>\n\n<p>TGR: What gold names do you follow?</p>\n\n<p>PR: I follow Randgold Resources Ltd. (GOLD:NASDAQ; RRS:LSE), Minera IRL Ltd. (IRL:TSX; MIRL:LSE; MIRL:BVL), Highland Gold Mining Ltd. (HGHGF:OTCGM; HGM:LSE), Centamin Plc (CEE:TSX; CNT:ASX, CEY:LSE) and African Barrick Gold Plc (ABG:LSE).</p>\n\n<p>TGR: Would you like to expand on any of those?</p>\n\n<p>PR: I think Highland Gold will emerge as an interesting company.</p>\n\n<p>Apart from one prospect in Kyrgyzstan, everything Highland Gold has is in Russia, where it has been operating successfully for a number of years. The company’s Belaya Gora mine is coming into production this year, and its newly purchased asset, Kekura, has a pilot plant that will be in production very shortly. Initially that project will produce only 20,000–30,000 ounces/year (20,000–30,000 Koz/year), at a cost of $1,000/ounce ($1,000/oz). But that is the precursor to production levels near 200 Koz/year after 2017 with cash costs around $550/oz. There is a lot of synergistic benefit with its Klen property.</p>\n\n<p>On its conference call on April 9, the company was asked about divestitures. Rather than giving a direct answer, the response was it would be addressed in its 2012 final earnings presentation. I think there probably are one or two divestitures in the pipeline to ease the funding issues related to developing its newer acquisitions.</p>\n\n<p>TGR: Other gold mining companies operating in Russia have had issues with, among other things, nationalization. What gives you confidence something similar will not happen to Highland?</p>\n\n<p>PR: Highland is a small company operating midsized deposits, not big, strategic deposits.</p>\n\n<p>Highland is a good corporate citizen. It is developing mines in Russia and employing lots of Russians, very few Europeans or Americans. Its headquarters is identified as Jersey, but it is de facto a Russian company and will be left alone because of that.</p>\n\n<p>Another thing that interests me about Highland is its Novoshirokinskoye lead-zinc mine, with byproduct gold and silver, which it has always reported as gold equivalents. Highland now owns 96% of Kazzinc and this project.</p>\n\n<p>We are bullish on lead and zinc because a number of lead-zinc mines will close over the next two years, and the zinc price will remain very firm. If you combine that with the growing gold production, it becomes a story you can back each way, so to speak.</p>\n\n<p>TGR: Nonetheless, there is a lot of resistance to investing in a Russian asset or a Russia-based gold producer.</p>\n\n<p>PR: I have covered Highland for nearly six years, and apart from a fire just before I initiated coverage, there has not been a single hiccup. Production has gone up and down, but the ore reserves have gone up. Cash costs have remained around $550/oz. It has made some promising acquisitions. There have never been any concerns about ownership or shutting projects down, which you have with Randgold and Centamin, or the social issues faced by African Barrick. Highland has had a much smoother ride than those companies.</p>\n\n<p>TGR: Minera has one producing asset and two at the development stage. The Don Nicolas mine is scheduled to go into production in 2014. Does Minera have enough cash and is it on schedule?</p>\n\n<p>PR: When I asked Courtney Chamberlain, Minera’s executive chairman, about that in late 2012, he said he was looking at some innovative financing techniques in Argentina—options that would not be available if a company was developing a mine in Peru, North America or Australia. There are people with dollars in Argentina who cannot use them, and this has led to the development of locked-in funds. He was very optimistic about financing.</p>\n\n<p>I am more interested in Minera’s Ollachea mine. The company recently released some very good drill results. If you draw some conclusions, you could estimate that there will be 300–500 Koz additional gold there. The latest drill results were closer to the mine portal than the main ore body, and suggest there is continuity all the way across. I think annual gold production will exceed what is in its feasibility study and the mine life will be longer.</p>\n\n<p>TGR: But Minera has to start generating cash from Don Nicolas before it brings Ollachea on-line, right?</p>\n\n<p>PR: That was the original plan, but I think it might finance the properties separately. Ollachea will certainly lag Don Nicolas, but you might have construction at both sites at the same time.</p>\n\n<p>TGR: There have been some permitting issues in Peru. Is Ollachea fully permitted?</p>\n\n<p>PR: No, the permitting process has only recently started. Peru does have some permitting issues, but if you do your groundwork and get the community on your side before you start, it minimizes the issues. Minera has been exceptionally good at this, so I would not expect any real problems. The environmental and other permits are not too far off, and I expect a good outcome.</p>\n\n<p>Overall, Peru is a very positive place to go mining.</p>\n\n<p>TGR: In a downmarket for mining companies, Randgold had a record year of profit production and earnings per share. Where will its growth come from?</p>\n\n<p>PR: I do not think the Loulo-Gounkoto complex has reached its full potential, and the life of the Morila mine is going to be extended. Its joint venture in the Congo with AngloGold Ashanti Ltd. (AU:NYSE; ANG:JSE; AGG:ASX; AGD:LSE), Kibali, should be coming into production late this year or early 2014. That will be a huge, low-cost producer with a long mine life.</p>\n\n<p>TGR: Many investors are nervous about the Congo. What is the risk profile of that joint venture?</p>\n\n<p>PR: Everything has gone to schedule and very smoothly to date. Villages have been moved, a hydro system installed and a road built. The project is far from where a lot of the problems in the Congo have been. The lack of problems might be a reflection of excellent management.</p>\n\n<p>TGR: Centamin is a direct contrast to Randgold. It had an awful 2012, but your research report says it could rebound this year. Tell us more about that.</p>\n\n<p>PR: I am not a big fan of Centamin, but having said that, the preliminary quarterly production figures it released this morning were quite good. Its guidance for 2013 is 320 Koz.</p>\n\n<p>I was under the impression that production would ramp up across the year, as the mill moves toward full production and more higher-grade ore was mined. We also expected better recoveries as it improved the carbon stripping. But it actually produced 87 Koz in Q1/13. If you multiply that by four, you have left guidance far behind. It is off to a good start.</p>\n\n<p>When the mine was shut down in December, the company brought some maintenance forward from March 2013. If that maintenance had been done when initially planned, the company probably would not have had quite as good a quarter.</p>\n\n<p>My problem with Centamin is that it based its five-year plan on underground ore reserves that do not exist today. They may exist when the new reserves resources statement comes out in the middle of this year, but not today. When you get to the end of the underground, the grade drops to about 1 gram per ton (1 g/t), with a cash cost of $700–750/oz. Once you add royalties, head office expenses and such, it moves quite swiftly into losses, given my view of the gold price.</p>\n\n<p>But there are a couple of interesting points about Centamin. First, the underground is open and there could be a lot more there. Second, Sukari Hill, located in Egypt, could contain mineralization. Even if it is only 1 g/t, that would halve the stripping ratio. Right now, its stripping ratio life-of-mine is about 5.6:1, which is quite high for a low-grade deposit. If Sukari Hill, which has to be moved, contained metal in downhill-loaded holes, the strip ratio would probably go to 2.5–2.8:1. That could transform the economics of the ore body.</p>\n\n<p>TGR: Nearby assets with significant potential cannot find funding. Is Centamin looking beyond Egypt’s borders?</p>\n\n<p>PR: Definitely. Centamin has been investing in companies operating in other countries, but it has to be careful in the short term. Its ramp-up to 5 million tons per annum (5 Mtpa) is going faster than I expected. The next ramp-up will be to 10 Mtpa. In mid-2014, the Egyptian state starts taking its share: 40% for two years, 55% the next two years, and then to a straight 50/50 ownership.</p>\n\n<p>It would be wrong to focus too much on other things in the short term, when the company has a major expansion underway. Once it gets the Sukari mine up to 10 Mtpa, it would have a much clearer run at acquisitions or joint developments outside Egypt.</p>\n\n<p>TGR: Are African Barrick’s social issues at its Bulyanhulu project in Tanzania behind it?</p>\n\n<p>PR: I think they are improving. At Bulyanhulu, most of the problems were related to Tanzanian superannuation. It was thought that if the mine kept working, workers would lose some of their pensions. As a result, a lot of the workforce resigned to make sure it got it all. To be honest, I think the problems were driven not by African Barrick, but by the Tanzanian government.</p>\n\n<p>TGR: What are the next catalysts for African Barrick? Is this one of your better stories in 2013?</p>\n\n<p>PR: I hope it is. But when Barrick ran these assets and gave guidance for all its areas, the African assets never met guidance on price, and perhaps once on production. That is an appalling track record.</p>\n\n<p>As Bulyanhulu goes deeper and farther from the shaft, it will have to refrigerate. That will raise its mining costs and add a lot of pressure. I would rather pay up and invest in Randgold.</p>\n\n<p>If Centamin can continue at a run rate of 87 Koz/quarter, it will smash its guidance. Its share price would have to come up on the back of performance like that. If it gets a good 12-month run in Egypt, its share price will strengthen significantly.</p>\n\n<p>TGR: Do you have any words of wisdom for investors in this space?</p>\n\n<p>PR: I would be optimistic about mining in Europe. If you are selective, there are quite good reasons to be upbeat.</p>\n\n<p>For example, I cover Colt Resources Inc. (GTP:TSX.V; COLTF:OTCQX). The company has a gold deposit and a tungsten deposit in Portugal, and I think the tungsten deposit is currently the better of the two. It had a maiden gold resource last year and increased the gold resource this year. None of the drilling has been deeper than 200 meters. It has about 30–35 kilometers of strike. It is right in the middle of civilization. The company wants to develop it small and fund ongoing exploration out of cash flow. I think it has a good game plan. Portugal has a lot of unemployed people the company could employ fairly cheaply. It will not take long to get permits; the Chaminé, Banhos and Casa Novas deposits are on an Experimental Mining License.</p>\n\n<p>TGR: Peter, thank you for your time and your insights.</p>\n\n<p>Peter Rose has 26 years of experience in equities as a resources analyst; he has been at Fox-Davies Capital for six years, after having spent 11 years with Deutsche Bank in Australia. Prior to this he spent three years with Prudential Bache and five years with James Capel. Rose’s industry experience includes 16 years as a metallurgist, three years with De Beers in South Africa and eight years in the uranium industry, five of which were spent at the Ranger uranium mine. Rose holds a Bachelor of Science degree in applied mineral science from Leeds University and a Bachelor of Commerce from the University of South Africa. Rose is also a member of the Institute of Materials, Mining &amp; Metallurgy and a chartered engineer.</p>\n</div><!-- SC_ON -->",
  "subreddit_id": "t5_2qhhq",
  "archived": true,
  "domain": "self.investing",
  "clicked": false,
  "score": 0,
  "id": "1cv8st",
  "stickied": false,
  "media_embed": {},
  "visited": false,
  "selftext": "[Source](http://www.theaureport.com/pub/na/15171): Brian Sylvester of The Gold Report (4/19/13)\n\nThe recent fall in precious metals prices has investors on edge. Many precious metals equities were hurting even before the latest precious metals drop. In this interview with The Gold Report, Peter Rose, head of mining research with Fox-Davies Capital Ltd. in London, provides a European perspective on mining and advises looking at under-appreciated jurisdictions (think Europe) and neglected metals like tin, lead and zinc.\n\nThe Gold Report: Peter, can you give us your long-term view of the Eurozone as it lurches from bailout to bailout?\n\nPeter Rose: Some major things have to happen in Europe and the sooner, the better. Unfortunately, I think it will get worse in the short term.\n\nBut from the mining industry perspective, these crises are bringing a lot of realism to certain governments. Greece has opposed mining, despite having quite good ore bodies, as do Portugal, Spain and Cyprus. Mining companies can generate real revenues, exports and jobs and contribute to the financial coffers.\n\nIn addition, the European Union has good rules of law. The tenures are pretty safe, there are pro-mining interests and there are deposits of strategic elements. If you compare the operating costs with Australia, the European infrastructure tends to be better; wage rates are significantly lower. It makes for a pretty compelling story.\n\nTGR: You deal with many junior mining companies. In 2004, the junior mining companies listed on the TSX Venture Exchange (TSX.V) averaged 27 million (27M) shares outstanding. Today, the average is 73M shares. Why have share floats risen so dramatically?\n\nPR: I put it down to the euphoria about rising metal prices. There was a long period when it was very easy to raise money due to rising metal prices. On the TSX.V there was always a bigger focus on exploration companies. I believe these to be the major reasons, although sentiment is very different today compared with even two years ago.\n\nA lot of exploration companies had no hope of bringing a mine into production, but it was very easy to raise money in 2004, so they did. Today, the writing is on the wall for quite a few of them. It is exceptionally hard for an exploration company with no near-term development potential to raise money.\n\nFrom what I understand of the Canadian market, it is easier to raise money for exploration than development. On this side of the Atlantic, it has been easier to raise money for development because you get something at the end, even if it may not be much.\n\nTGR: Your firm, Fox-Davies, helps public companies raise money. Which mine commodities and which types of projects are consistently getting funded now?\n\nPR: It is easier to raise money for oil and gas companies. People like gold and copper, and while the outlook for tin is as good as for any other metal, it is has some in-built resistance.\n\nThe funds do not like obscure commodities. As long as you stick to the main London Metal Exchange-traded metals—copper, lead, zinc, gold, silver, and less so, nickel—the funds tend to be content with that.\n\nTGR: But gold and silver don’t trade on the London Metal Exchange.\n\nPR: No, but there is a good market for them, and they make the headlines quite often. Tin does not make headlines and nickel is in oversupply at the moment.\n\nTGR: Have there been initial public offerings for tin juniors?\n\nPR: A number of them are trying. We are looking at off-market financing for them. There are private tin companies out there.\n\nTGR: What is your outlook for gold this year and beyond?\n\nPR: I am not positive over the next three months. India has raised import duties to slow down the rate of imports and help with its balance-of-payments deficit. In addition, too many gold companies have chased production instead of profits, and people are a bit fed up, especially fund managers.\n\nLonger term, I am not optimistic. When interest rates return to more normal levels, as they must do eventually, the gold price will come way down. Prices will overreact before stabilizing well off the bottom. However, I am surprised with the speed in which the market turned.\n\nTGR: What is your timeframe for that?\n\nPR: About five or six years.\n\nTGR: What is your outlook for silver?\n\nPR: In the short term, silver will track the gold price. However, given that silver is an industrial metal and that a lot of it is a byproduct of lead-zinc mining, I think there will be a disconnect between the gold and silver prices in 2014 and 2015. A number of lead-zinc mines will be nearing the end of their lives over the next couple of years. That will remove a lot of silver from the market, tightening up the supply side considerably.\n\nTGR: Is silver’s recent price weakness an early indicator of global economic weakness?\n\nPR: No, it is more of a sympathy move with the gold market.\n\nWhile global industrial production is not exactly brilliant at the moment, certain pockets are performing very well. The British automobile industry, for example, is performing as well as it has in the last 20 years. The aerospace industry is going really well, too. These are sectors that use quite a bit of silver, regardless of price.\n\nTGR: Should precious metals investors buy select equities for growth, protection or both?\n\nPR: I think it is probably better to buy equities than the metal, quite honestly. I think you get better leverage.\n\nIf you think that your currency is going to be devalued dramatically, you are better off buying gold or silver, depending on what you can afford. But generally, you have more liquidity and better leverage if you buy the correct stocks.\n\nTGR: Should investors be more optimistic than they are right now?\n\nPR: Yes. You can make a valid argument that precious metal mining companies are finally listening to the fund managers and starting to think of profit and returns rather than ounces of production. I think that is a positive development.\n\nTGR: What silver names can you tell our readers about?\n\nPR: The sole silver company I cover is Hochschild Mining Plc (HOC:LSE). While I do not like it in the short term, toward the end of 2014 the company will have two or three mines coming into production. I think Immaculada in Peru will be a cracker of a mine. The gold grades there are better than at Hochschild’s other Peruvian operations, and it has good silver grades. At that point, its production will shoot up 50%. You will have to weather some hardships in the short term, but if you were to start buying 12 months from now, you could make some serious money.\n\nTGR: In 2012, Hochschild posted earnings of $0.19/share. How long will it take to get back there?\n\nPR: I am not optimistic that 2013 will be as good as 2012. Production measured in silver equivalents will be flat. Peru’s currency, the nuevo sol, has been strengthening against the U.S. dollar for about five years, resulting in some imported wage inflation. There also is inflation at San José in Argentina. Profits will probably be down a little bit. It has spent a lot of its cash, so interest income will be down as well. It will struggle this year, but 2014 looks better.\n\nTGR: Hochschild has been something of an acquirer. Given the prices of juniors, might it use some of its cash for acquisitions?\n\nPR: It made a big acquisition late last year. Hochschild also has been putting large amounts of money into exploration with a twofold aim. One was to extend the mine lives of its existing operations and the other was to find more company makers. I think it has 13 company makers in its exploration portfolio right now. My instinct says Hochschild will be more inclined to develop its own properties rather than buy more. However, with the recent dramatic decline in share prices, this may now change.\n\nTGR: What gold names do you follow?\n\nPR: I follow Randgold Resources Ltd. (GOLD:NASDAQ; RRS:LSE), Minera IRL Ltd. (IRL:TSX; MIRL:LSE; MIRL:BVL), Highland Gold Mining Ltd. (HGHGF:OTCGM; HGM:LSE), Centamin Plc (CEE:TSX; CNT:ASX, CEY:LSE) and African Barrick Gold Plc (ABG:LSE).\n\nTGR: Would you like to expand on any of those?\n\nPR: I think Highland Gold will emerge as an interesting company.\n\nApart from one prospect in Kyrgyzstan, everything Highland Gold has is in Russia, where it has been operating successfully for a number of years. The company’s Belaya Gora mine is coming into production this year, and its newly purchased asset, Kekura, has a pilot plant that will be in production very shortly. Initially that project will produce only 20,000–30,000 ounces/year (20,000–30,000 Koz/year), at a cost of $1,000/ounce ($1,000/oz). But that is the precursor to production levels near 200 Koz/year after 2017 with cash costs around $550/oz. There is a lot of synergistic benefit with its Klen property.\n\nOn its conference call on April 9, the company was asked about divestitures. Rather than giving a direct answer, the response was it would be addressed in its 2012 final earnings presentation. I think there probably are one or two divestitures in the pipeline to ease the funding issues related to developing its newer acquisitions.\n\nTGR: Other gold mining companies operating in Russia have had issues with, among other things, nationalization. What gives you confidence something similar will not happen to Highland?\n\nPR: Highland is a small company operating midsized deposits, not big, strategic deposits.\n\nHighland is a good corporate citizen. It is developing mines in Russia and employing lots of Russians, very few Europeans or Americans. Its headquarters is identified as Jersey, but it is de facto a Russian company and will be left alone because of that.\n\nAnother thing that interests me about Highland is its Novoshirokinskoye lead-zinc mine, with byproduct gold and silver, which it has always reported as gold equivalents. Highland now owns 96% of Kazzinc and this project.\n\nWe are bullish on lead and zinc because a number of lead-zinc mines will close over the next two years, and the zinc price will remain very firm. If you combine that with the growing gold production, it becomes a story you can back each way, so to speak.\n\nTGR: Nonetheless, there is a lot of resistance to investing in a Russian asset or a Russia-based gold producer.\n\nPR: I have covered Highland for nearly six years, and apart from a fire just before I initiated coverage, there has not been a single hiccup. Production has gone up and down, but the ore reserves have gone up. Cash costs have remained around $550/oz. It has made some promising acquisitions. There have never been any concerns about ownership or shutting projects down, which you have with Randgold and Centamin, or the social issues faced by African Barrick. Highland has had a much smoother ride than those companies.\n\nTGR: Minera has one producing asset and two at the development stage. The Don Nicolas mine is scheduled to go into production in 2014. Does Minera have enough cash and is it on schedule?\n\nPR: When I asked Courtney Chamberlain, Minera’s executive chairman, about that in late 2012, he said he was looking at some innovative financing techniques in Argentina—options that would not be available if a company was developing a mine in Peru, North America or Australia. There are people with dollars in Argentina who cannot use them, and this has led to the development of locked-in funds. He was very optimistic about financing.\n\nI am more interested in Minera’s Ollachea mine. The company recently released some very good drill results. If you draw some conclusions, you could estimate that there will be 300–500 Koz additional gold there. The latest drill results were closer to the mine portal than the main ore body, and suggest there is continuity all the way across. I think annual gold production will exceed what is in its feasibility study and the mine life will be longer.\n\nTGR: But Minera has to start generating cash from Don Nicolas before it brings Ollachea on-line, right?\n\nPR: That was the original plan, but I think it might finance the properties separately. Ollachea will certainly lag Don Nicolas, but you might have construction at both sites at the same time.\n\nTGR: There have been some permitting issues in Peru. Is Ollachea fully permitted?\n\nPR: No, the permitting process has only recently started. Peru does have some permitting issues, but if you do your groundwork and get the community on your side before you start, it minimizes the issues. Minera has been exceptionally good at this, so I would not expect any real problems. The environmental and other permits are not too far off, and I expect a good outcome.\n\nOverall, Peru is a very positive place to go mining.\n\nTGR: In a downmarket for mining companies, Randgold had a record year of profit production and earnings per share. Where will its growth come from?\n\nPR: I do not think the Loulo-Gounkoto complex has reached its full potential, and the life of the Morila mine is going to be extended. Its joint venture in the Congo with AngloGold Ashanti Ltd. (AU:NYSE; ANG:JSE; AGG:ASX; AGD:LSE), Kibali, should be coming into production late this year or early 2014. That will be a huge, low-cost producer with a long mine life.\n\nTGR: Many investors are nervous about the Congo. What is the risk profile of that joint venture?\n\nPR: Everything has gone to schedule and very smoothly to date. Villages have been moved, a hydro system installed and a road built. The project is far from where a lot of the problems in the Congo have been. The lack of problems might be a reflection of excellent management.\n\nTGR: Centamin is a direct contrast to Randgold. It had an awful 2012, but your research report says it could rebound this year. Tell us more about that.\n\nPR: I am not a big fan of Centamin, but having said that, the preliminary quarterly production figures it released this morning were quite good. Its guidance for 2013 is 320 Koz.\n\nI was under the impression that production would ramp up across the year, as the mill moves toward full production and more higher-grade ore was mined. We also expected better recoveries as it improved the carbon stripping. But it actually produced 87 Koz in Q1/13. If you multiply that by four, you have left guidance far behind. It is off to a good start.\n\nWhen the mine was shut down in December, the company brought some maintenance forward from March 2013. If that maintenance had been done when initially planned, the company probably would not have had quite as good a quarter.\n\nMy problem with Centamin is that it based its five-year plan on underground ore reserves that do not exist today. They may exist when the new reserves resources statement comes out in the middle of this year, but not today. When you get to the end of the underground, the grade drops to about 1 gram per ton (1 g/t), with a cash cost of $700–750/oz. Once you add royalties, head office expenses and such, it moves quite swiftly into losses, given my view of the gold price.\n\nBut there are a couple of interesting points about Centamin. First, the underground is open and there could be a lot more there. Second, Sukari Hill, located in Egypt, could contain mineralization. Even if it is only 1 g/t, that would halve the stripping ratio. Right now, its stripping ratio life-of-mine is about 5.6:1, which is quite high for a low-grade deposit. If Sukari Hill, which has to be moved, contained metal in downhill-loaded holes, the strip ratio would probably go to 2.5–2.8:1. That could transform the economics of the ore body.\n\nTGR: Nearby assets with significant potential cannot find funding. Is Centamin looking beyond Egypt’s borders?\n\nPR: Definitely. Centamin has been investing in companies operating in other countries, but it has to be careful in the short term. Its ramp-up to 5 million tons per annum (5 Mtpa) is going faster than I expected. The next ramp-up will be to 10 Mtpa. In mid-2014, the Egyptian state starts taking its share: 40% for two years, 55% the next two years, and then to a straight 50/50 ownership.\n\nIt would be wrong to focus too much on other things in the short term, when the company has a major expansion underway. Once it gets the Sukari mine up to 10 Mtpa, it would have a much clearer run at acquisitions or joint developments outside Egypt.\n\nTGR: Are African Barrick’s social issues at its Bulyanhulu project in Tanzania behind it?\n\nPR: I think they are improving. At Bulyanhulu, most of the problems were related to Tanzanian superannuation. It was thought that if the mine kept working, workers would lose some of their pensions. As a result, a lot of the workforce resigned to make sure it got it all. To be honest, I think the problems were driven not by African Barrick, but by the Tanzanian government.\n\nTGR: What are the next catalysts for African Barrick? Is this one of your better stories in 2013?\n\nPR: I hope it is. But when Barrick ran these assets and gave guidance for all its areas, the African assets never met guidance on price, and perhaps once on production. That is an appalling track record.\n\nAs Bulyanhulu goes deeper and farther from the shaft, it will have to refrigerate. That will raise its mining costs and add a lot of pressure. I would rather pay up and invest in Randgold.\n\nIf Centamin can continue at a run rate of 87 Koz/quarter, it will smash its guidance. Its share price would have to come up on the back of performance like that. If it gets a good 12-month run in Egypt, its share price will strengthen significantly.\n\nTGR: Do you have any words of wisdom for investors in this space?\n\nPR: I would be optimistic about mining in Europe. If you are selective, there are quite good reasons to be upbeat.\n\nFor example, I cover Colt Resources Inc. (GTP:TSX.V; COLTF:OTCQX). The company has a gold deposit and a tungsten deposit in Portugal, and I think the tungsten deposit is currently the better of the two. It had a maiden gold resource last year and increased the gold resource this year. None of the drilling has been deeper than 200 meters. It has about 30–35 kilometers of strike. It is right in the middle of civilization. The company wants to develop it small and fund ongoing exploration out of cash flow. I think it has a good game plan. Portugal has a lot of unemployed people the company could employ fairly cheaply. It will not take long to get permits; the Chaminé, Banhos and Casa Novas deposits are on an Experimental Mining License.\n\nTGR: Peter, thank you for your time and your insights.\n\nPeter Rose has 26 years of experience in equities as a resources analyst; he has been at Fox-Davies Capital for six years, after having spent 11 years with Deutsche Bank in Australia. Prior to this he spent three years with Prudential Bache and five years with James Capel. Rose’s industry experience includes 16 years as a metallurgist, three years with De Beers in South Africa and eight years in the uranium industry, five of which were spent at the Ranger uranium mine. Rose holds a Bachelor of Science degree in applied mineral science from Leeds University and a Bachelor of Commerce from the University of South Africa. Rose is also a member of the Institute of Materials, Mining & Metallurgy and a chartered engineer.",
  "hide_score": false,
  "_api_link": "https://api.reddit.com/r/investing/comments/1cv8st/can_equities_cushion_the_blow_of_falling_gold/?ref=search_posts",
  "locked": false,
  "edited": false,
  "title": "Can Equities Cushion the Blow of Falling Gold Prices?: Peter Rose",
  "created": 1366648160.0,
  "_comments_by_id": {}
}