{
  "selftext": "I figure it's time to write out a post I've been thinking of for a while. Week in the life of a maintenance electrician. I hope this can help some people thinking of getting into the trade. Maybe some commercial and construction guys can write similar posts! \n\nIt's a great job, but has it's wide range of tasks. Some days I feel over-paid to sit in the air conditioned shop and wire a panel for a new machine. The plant I work for has a bunch of buildings within a 20 min drive, and a few others outside that with their own maintenance crew. We make something food related, so we have a lot of HVAC, dust extraction, air handling, etc equipment in the buildings, as well as needing to \"gown up\" when entering production areas. The plant runs 24 hours a day, between 5 and 7 days per week. Our maintenance crew is around 20 guys, all having their own areas of expertise, but everyone is typically a millwright or electrician. Some also have their power engineering tickets (2nd through 4th class.)\n\nAlthough I’m an apprentice as an electrician, I’ve been in this industry since I was a teen. I also have an electronics diploma. My home base is our main factory where the head electrician works, but I am in charge of electrical for 3 of our remote buildings. \n\n\n\n**Monday Morning**\n\n0500 - Show up at the shop a bit early to sync up with the Sunday night crew that was doing some projects over the weekend. Get changed into my company provided uniform. We get 10 sets of \"blues\", dark blue pants and a collared long-sleeve shirt (no short sleeves allowed in the factory), and two sets of cover-alls for the dirty tasks. The janitors wear coveralls though, so we try not to look like them too much. ;-)  Laundry is done every couple of days, so you always have plenty of uniforms in order to stay clean if you work on something messy. There is a spacious change room with lockers and private showers. It's cleaned three times per day, so it’s always smelling and looking nice.\n\n0515 - Coffee in the break room with the weekend workers. Power on my blackberry to see what emergencies have happened over the weekend. A dumpster fire at one of our buildings, air conditioning doesn’t seem to be working in an office, and one department is ordering a new piece of equipment that they will need some circuits for. Oh yeah, I’m also supposed to catch up on what happened this weekend, but I have a voicemail saying a major piece of equipment is acting up with what seems to be a PLC problem, and I’m the one that knows it best. \n\n0530 - Stop by the shop, grab a cart with my tools and laptop. Gown up with gloves, hair-net, beard-net, and wash the bottom of my boots. I get up to the machine and find it’s just a loose bolt that the operator forgot to tighten after they cleaned the machine. It holds a sensor, and the sensor would make/break as the machine was vibrating. Too quick for the operator to see the LED on the sensor, but the PLC would pick it up and error out.\n\n0600 - The rest of my shift is here, go join them for another cup of coffee and find out what projects are going on this week. The fire marshall is calling now too to see if we want to pursue an arson investigation from the dumpster fire. One of our neighbours caught the incident on their security camera, so we will go meet with them at 0900.  Normally we have 6 electricians, but two are away this week, one is on graveyard shift, and the last is at another location. It’ll be busy for the two of us that are here this week.\n\n0630 - We all get back to the workshop, and someone is banging on the production door. (Our workshop has three entrances, one to production, one to the warehouse, and one to the outside.)  It’s instantly recognized as one of our regulars from the department right outside our door. We make a quick bet on who it is and if they will need an electrician or a millwright. The bet is for who gets to ration out the candy that the janitor left on our desk.  We are correct on the person, but not the problem. It’s an urgent electrical problem with the safety circuit of a machine. It’s in the middle of a cleaning cycle and is stopped dead with water pouring out of it. Myself and another sparky put on gum-boots and insulated gloves. \n\n0715 - Neither one of us have worked on this machine before, but we went back to the shop to quickly review the prints. It turns out that the safety circuit also has a low and high pressure switch for the pneumatics in it, and the low pressure is tripping. A burnt out lightbulb is responsible for it taking this long to figure out what’s going on. We have another electrical call, so I send off the other electrician while I finish this up. But, since it’s all wet and electrified, I want someone else there with me. \n\n0745 - A millwright is free to help me finish this up. We trace it out to be a worn down pneumatic valve. We adjust it and close up all the panels on the machines. In testing, we find out that one function of the machine has been broken for a few weeks, but they hardly ever use it, so they didn’t report it. We’ll put it on the list to fix when we get time. \n\n0830 - Looks like I’m finally free to look at my project…rebuilding a machine from 1970 with a new PLC and touch screen. Oh, crap, nope, time to head out and meet the fire marshall. \n\n1000 - Normally I’d have breakfast at 9, so I’m starving at this point. Don’t want to eat now because SWMBO has the day off work and is going to meet me for a quick sushi date at 1130. I get a call from reception that a couple of light bulbs are out. A nice easy job. Surprisingly I get through the job without being interrupted. \n\n1005 - Back to the shop to work on my project. I get about an hour into it, things are looking great, I might even have it ready to test run this afternoon when the mechanic I’m working with gets in! \n\n1100 - Sushi time is near, but my blackberry senses my hunger and decides to ring. The IT department needs me in the electrical vault now because our head electrician is away, the the UPS technician is here. The replacement UPS is going to be 208volt input and output, instead of 600 volt like the current one is. \n\n1115 - I’m heading out to go for lunch, but am stopped by a machine operator. One of our most complex process machines in the plant is down, there’s a full batch of product inside that will spoil. The machine is totally dead, they can’t even open the bottom hatch to remove the product. Shit. I call SWMBO and cancel our date. I also call for a power engineer and the other electrician. Drop everything and meet me there right now.\n\n1130 - The power engineer got chilled water flowing using manual valves, at least the product won’t spoil. We are very unfamiliar with this machine, it’s run relatively trouble free since it was installed in 2005. The HMI is showing wacky numbers, and they are no lights on any of the remote control panels. It’s all explosion proof, so junction boxes and control panels are a royal PITA to open.  I’ve worked on the smaller version of this same machine we have in our pilot plant, so I “know” about a circuit breaker in one of the control panels. \n\n1145 - We track down an impact wrench and get the panel open. Nope, no circuit breakers there. Everything must be in the control room. It’s a simple blown fuse so we will keep pushing through hunger to find it. \n\n1230 - We’ve checked every fuse, breaker, overload, and incoming power source. Need some lunch now before we pass out into a live panel. \n\n1235 - The director of engineering calls me to ask what’s up with the machine. I let him know that things aren’t looking great, but he doesn’t like that answer. This product is urgent, and it’s already run up the chain that the machine is down for unplanned maintenance issues. The pressure is on, but I’m in no trouble. The director is an electrical engineer, and understands the problems we face. He lets me know to give him a call if we want help troubleshooting. \n\n1300 - Back at the control room feeling refreshed. Since I started at 0500, I should be out in half an hour but I think this is going to be a late night. I cancel my golf game later that afternoon. While I’m messing around on my phone I remember to book a contractor for another project, e-mail out to let one building know we will be shutting off power for UPS maintenance next weekend, and get back to IT about their UPS installation. While I’m dicking around on the phone “working” (They say it’s work, but when I’m not touching tools it really doesn’t feel like it. I was hired to work with tools, not to eft around with a phone all day), my partner made a discovery. We though no outputs on the PLC were lighting up because it wasn’t getting an input it needed. Turns out the fault light on the PLC is flashing out a code. \n\n1315 - The code on that PLC meant that the backup battery was out. What the hell? They get changed every two years. I head up to the directors office to check the maintenance records. Last time it was changed was…2006. Shit. I call our supplier to see if they have it in stock. They do. While I head out to pick it up, the director calls our head electrician on vacation to find out what happened. My partner will be getting the laptop ready with a backup copy of the program.\n\n1400 - I’m back with the new battery, install it, and the fault code is gone but there is no program in the PLC. Our night shift electrician has made it back to the plant to back us up, cover the rest of the calls while we sort this out. We haven’t managed to find the backup, as the location isn’t specified in our spreadsheet. We can’t even find a hardcopy. The binder list shows pneumatic drawings, steam drawings, chilled water drawings, but nothing for electrical. Call back to our head electrician and he remembers where he stuck it, but he’ll be out of cell range soon. \n\n1430 - No luck on finding a soft copy of the PLC program yet. Worse case scenario we can re-enter it into the computer from the printed hard copy. We call the original programmer, but he is out of office for the day already. My partner has to head home, so I’m on my own. I call down our director to give me a hand. \n\n1445 - FINALLY find the PLC program. It was not named anything that made sense. And it was on a different laptop than what we thought it would be on. The file is password protected though. I put in a call to tech support, search around on some forums, and eventually find a way to bypass the password.\n\n1530 - File is unlocked, we are hooked up with the laptop, attempting to load the software. Not having a lot of success, but keep messing around with it until we get it. \n\n1700 - The PLC is back up and running. Most inputs seem to be working, but now a sensor in the lubrication system is showing no flow on the HMI, even though the analog gauge shows all is well. We pull the line off and i get covered in mineral oil. Yup, it was working just fine. Head up to change my shirt.\n\n1730 - All systems are go. Graveyard electrician is trying to get me to do some PLC changes for him on another machine for one of his projects, but I just don’t care right now. The fab shop we use is calling me…am I free for a meeting about a few projects I have ongoing? Not today…\n\n1745 - I’m on my way home and get a call. Shit. Turns out they just wanted to make sure they could run the machine, and I tell them to go ahead, and leave me an e-mail to let me know how it goes.  I go to bed as soon as I get home, and sleep through the night.",
  "gilded": 0,
  "score": 9,
  "removal_reason": null,
  "approved_by": null,
  "created_utc": 1406608405.0,
  "is_self": true,
  "stickied": false,
  "edited": false,
  "distinguished": null,
  "permalink": "https://www.reddit.com/r/electricians/comments/2c0eq0/a_day_in_the_life_maintenance_electrician/?ref=search_posts",
  "banned_by": null,
  "from_id": null,
  "likes": null,
  "_underscore_names": null,
  "num_reports": null,
  "link_flair_css_class": null,
  "_info_url": "https://api.reddit.com/api/info/",
  "id": "2c0eq0",
  "archived": true,
  "secure_media": null,
  "from_kind": null,
  "saved": false,
  "domain": "self.electricians",
  "ups": 9,
  "suggested_sort": null,
  "quarantine": false,
  "over_18": false,
  "hide_score": false,
  "url": "https://www.reddit.com/r/electricians/comments/2c0eq0/a_day_in_the_life_maintenance_electrician/",
  "subreddit_id": "t5_2slrm",
  "_params": {},
  "_comments": null,
  "_replaced_more": false,
  "_comments_by_id": {},
  "user_reports": [],
  "media_embed": {},
  "created": 1406608405.0,
  "author_flair_text": "Maintenance",
  "visited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I figure it&#39;s time to write out a post I&#39;ve been thinking of for a while. Week in the life of a maintenance electrician. I hope this can help some people thinking of getting into the trade. Maybe some commercial and construction guys can write similar posts! </p>\n\n<p>It&#39;s a great job, but has it&#39;s wide range of tasks. Some days I feel over-paid to sit in the air conditioned shop and wire a panel for a new machine. The plant I work for has a bunch of buildings within a 20 min drive, and a few others outside that with their own maintenance crew. We make something food related, so we have a lot of HVAC, dust extraction, air handling, etc equipment in the buildings, as well as needing to &quot;gown up&quot; when entering production areas. The plant runs 24 hours a day, between 5 and 7 days per week. Our maintenance crew is around 20 guys, all having their own areas of expertise, but everyone is typically a millwright or electrician. Some also have their power engineering tickets (2nd through 4th class.)</p>\n\n<p>Although I’m an apprentice as an electrician, I’ve been in this industry since I was a teen. I also have an electronics diploma. My home base is our main factory where the head electrician works, but I am in charge of electrical for 3 of our remote buildings. </p>\n\n<p><strong>Monday Morning</strong></p>\n\n<p>0500 - Show up at the shop a bit early to sync up with the Sunday night crew that was doing some projects over the weekend. Get changed into my company provided uniform. We get 10 sets of &quot;blues&quot;, dark blue pants and a collared long-sleeve shirt (no short sleeves allowed in the factory), and two sets of cover-alls for the dirty tasks. The janitors wear coveralls though, so we try not to look like them too much. ;-)  Laundry is done every couple of days, so you always have plenty of uniforms in order to stay clean if you work on something messy. There is a spacious change room with lockers and private showers. It&#39;s cleaned three times per day, so it’s always smelling and looking nice.</p>\n\n<p>0515 - Coffee in the break room with the weekend workers. Power on my blackberry to see what emergencies have happened over the weekend. A dumpster fire at one of our buildings, air conditioning doesn’t seem to be working in an office, and one department is ordering a new piece of equipment that they will need some circuits for. Oh yeah, I’m also supposed to catch up on what happened this weekend, but I have a voicemail saying a major piece of equipment is acting up with what seems to be a PLC problem, and I’m the one that knows it best. </p>\n\n<p>0530 - Stop by the shop, grab a cart with my tools and laptop. Gown up with gloves, hair-net, beard-net, and wash the bottom of my boots. I get up to the machine and find it’s just a loose bolt that the operator forgot to tighten after they cleaned the machine. It holds a sensor, and the sensor would make/break as the machine was vibrating. Too quick for the operator to see the LED on the sensor, but the PLC would pick it up and error out.</p>\n\n<p>0600 - The rest of my shift is here, go join them for another cup of coffee and find out what projects are going on this week. The fire marshall is calling now too to see if we want to pursue an arson investigation from the dumpster fire. One of our neighbours caught the incident on their security camera, so we will go meet with them at 0900.  Normally we have 6 electricians, but two are away this week, one is on graveyard shift, and the last is at another location. It’ll be busy for the two of us that are here this week.</p>\n\n<p>0630 - We all get back to the workshop, and someone is banging on the production door. (Our workshop has three entrances, one to production, one to the warehouse, and one to the outside.)  It’s instantly recognized as one of our regulars from the department right outside our door. We make a quick bet on who it is and if they will need an electrician or a millwright. The bet is for who gets to ration out the candy that the janitor left on our desk.  We are correct on the person, but not the problem. It’s an urgent electrical problem with the safety circuit of a machine. It’s in the middle of a cleaning cycle and is stopped dead with water pouring out of it. Myself and another sparky put on gum-boots and insulated gloves. </p>\n\n<p>0715 - Neither one of us have worked on this machine before, but we went back to the shop to quickly review the prints. It turns out that the safety circuit also has a low and high pressure switch for the pneumatics in it, and the low pressure is tripping. A burnt out lightbulb is responsible for it taking this long to figure out what’s going on. We have another electrical call, so I send off the other electrician while I finish this up. But, since it’s all wet and electrified, I want someone else there with me. </p>\n\n<p>0745 - A millwright is free to help me finish this up. We trace it out to be a worn down pneumatic valve. We adjust it and close up all the panels on the machines. In testing, we find out that one function of the machine has been broken for a few weeks, but they hardly ever use it, so they didn’t report it. We’ll put it on the list to fix when we get time. </p>\n\n<p>0830 - Looks like I’m finally free to look at my project…rebuilding a machine from 1970 with a new PLC and touch screen. Oh, crap, nope, time to head out and meet the fire marshall. </p>\n\n<p>1000 - Normally I’d have breakfast at 9, so I’m starving at this point. Don’t want to eat now because SWMBO has the day off work and is going to meet me for a quick sushi date at 1130. I get a call from reception that a couple of light bulbs are out. A nice easy job. Surprisingly I get through the job without being interrupted. </p>\n\n<p>1005 - Back to the shop to work on my project. I get about an hour into it, things are looking great, I might even have it ready to test run this afternoon when the mechanic I’m working with gets in! </p>\n\n<p>1100 - Sushi time is near, but my blackberry senses my hunger and decides to ring. The IT department needs me in the electrical vault now because our head electrician is away, the the UPS technician is here. The replacement UPS is going to be 208volt input and output, instead of 600 volt like the current one is. </p>\n\n<p>1115 - I’m heading out to go for lunch, but am stopped by a machine operator. One of our most complex process machines in the plant is down, there’s a full batch of product inside that will spoil. The machine is totally dead, they can’t even open the bottom hatch to remove the product. Shit. I call SWMBO and cancel our date. I also call for a power engineer and the other electrician. Drop everything and meet me there right now.</p>\n\n<p>1130 - The power engineer got chilled water flowing using manual valves, at least the product won’t spoil. We are very unfamiliar with this machine, it’s run relatively trouble free since it was installed in 2005. The HMI is showing wacky numbers, and they are no lights on any of the remote control panels. It’s all explosion proof, so junction boxes and control panels are a royal PITA to open.  I’ve worked on the smaller version of this same machine we have in our pilot plant, so I “know” about a circuit breaker in one of the control panels. </p>\n\n<p>1145 - We track down an impact wrench and get the panel open. Nope, no circuit breakers there. Everything must be in the control room. It’s a simple blown fuse so we will keep pushing through hunger to find it. </p>\n\n<p>1230 - We’ve checked every fuse, breaker, overload, and incoming power source. Need some lunch now before we pass out into a live panel. </p>\n\n<p>1235 - The director of engineering calls me to ask what’s up with the machine. I let him know that things aren’t looking great, but he doesn’t like that answer. This product is urgent, and it’s already run up the chain that the machine is down for unplanned maintenance issues. The pressure is on, but I’m in no trouble. The director is an electrical engineer, and understands the problems we face. He lets me know to give him a call if we want help troubleshooting. </p>\n\n<p>1300 - Back at the control room feeling refreshed. Since I started at 0500, I should be out in half an hour but I think this is going to be a late night. I cancel my golf game later that afternoon. While I’m messing around on my phone I remember to book a contractor for another project, e-mail out to let one building know we will be shutting off power for UPS maintenance next weekend, and get back to IT about their UPS installation. While I’m dicking around on the phone “working” (They say it’s work, but when I’m not touching tools it really doesn’t feel like it. I was hired to work with tools, not to eft around with a phone all day), my partner made a discovery. We though no outputs on the PLC were lighting up because it wasn’t getting an input it needed. Turns out the fault light on the PLC is flashing out a code. </p>\n\n<p>1315 - The code on that PLC meant that the backup battery was out. What the hell? They get changed every two years. I head up to the directors office to check the maintenance records. Last time it was changed was…2006. Shit. I call our supplier to see if they have it in stock. They do. While I head out to pick it up, the director calls our head electrician on vacation to find out what happened. My partner will be getting the laptop ready with a backup copy of the program.</p>\n\n<p>1400 - I’m back with the new battery, install it, and the fault code is gone but there is no program in the PLC. Our night shift electrician has made it back to the plant to back us up, cover the rest of the calls while we sort this out. We haven’t managed to find the backup, as the location isn’t specified in our spreadsheet. We can’t even find a hardcopy. The binder list shows pneumatic drawings, steam drawings, chilled water drawings, but nothing for electrical. Call back to our head electrician and he remembers where he stuck it, but he’ll be out of cell range soon. </p>\n\n<p>1430 - No luck on finding a soft copy of the PLC program yet. Worse case scenario we can re-enter it into the computer from the printed hard copy. We call the original programmer, but he is out of office for the day already. My partner has to head home, so I’m on my own. I call down our director to give me a hand. </p>\n\n<p>1445 - FINALLY find the PLC program. It was not named anything that made sense. And it was on a different laptop than what we thought it would be on. The file is password protected though. I put in a call to tech support, search around on some forums, and eventually find a way to bypass the password.</p>\n\n<p>1530 - File is unlocked, we are hooked up with the laptop, attempting to load the software. Not having a lot of success, but keep messing around with it until we get it. </p>\n\n<p>1700 - The PLC is back up and running. Most inputs seem to be working, but now a sensor in the lubrication system is showing no flow on the HMI, even though the analog gauge shows all is well. We pull the line off and i get covered in mineral oil. Yup, it was working just fine. Head up to change my shirt.</p>\n\n<p>1730 - All systems are go. Graveyard electrician is trying to get me to do some PLC changes for him on another machine for one of his projects, but I just don’t care right now. The fab shop we use is calling me…am I free for a meeting about a few projects I have ongoing? Not today…</p>\n\n<p>1745 - I’m on my way home and get a call. Shit. Turns out they just wanted to make sure they could run the machine, and I tell them to go ahead, and leave me an e-mail to let me know how it goes.  I go to bed as soon as I get home, and sleep through the night.</p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "_comment_sort": null,
  "report_reasons": null,
  "name": "t3_2c0eq0",
  "from": null,
  "hidden": false,
  "clicked": false,
  "media": null,
  "json_dict": null,
  "_api_link": "https://api.reddit.com/r/electricians/comments/2c0eq0/a_day_in_the_life_maintenance_electrician/?ref=search_posts",
  "secure_media_embed": {},
  "mod_reports": [],
  "_orphaned": {},
  "_uniq": null,
  "num_comments": 12,
  "link_flair_text": null,
  "title": "A day in the life - Maintenance Electrician",
  "_has_fetched": true,
  "author_flair_css_class": "flair-ca",
  "thumbnail": "self"
}