{
  "selftext": "It may be disappointing that the recent Chinese rover is the first  human activity on the Moon in more than forty years.  But it is not unusual, or in retrospect unexpected.  It follows historical patterns.\n \nThe first pattern is the inevitable time delay between exploration and colonization.  At the turn of the (last) century, the race for the poles was the Victorian equivalent of our race for the moon. Once the flags of Britain, Norway, etc. had been planted at the south pole, national prestige was satisfied.  Afterwards, nobody bothered much with Antarctica for about another half century, until the first international geophysical year (1959). Since then, the continent has been studded with permanently manned scientific bases and weather stations.\n \nBut nobody has bothered to try to colonize Antarctica on a large scale. Primarily because it is a crappy place to live. Yet it is far more inviting and cheaper/easier to colonize (and to get to) than the moon or Mars. If history is any guide, about a half century after the Apollo program (within the next ten to twenty years) look for permanently manned stations in orbit, on the moon and maybe on Mars. The ISS is the first of these stations.  But don't expect massive colonization anytime soon. Our species simply won't move anywhere in large numbers that we can't walk around outside in shirt sleeves for at least part of the year. \n \nThe second pattern is that government funded exploration (Ferdinand and Isabella paying for Columbus’ voyages, Jefferson sending Lewis and Clark westward, etc.) is always followed by true colonization being performed by private enterprise (the conquistadors, the Massachusetts Bay company, settlers travelling the Oregon trail, Dutch East India Company, railroads spanning the west, etc.).  In fact, the early colonization efforts in the Americas were the work of the world’s first stock holder corporations.  Planetary Resources, Inc. (asteroid mining) and SpaceX (private space launches) are just the first corporations being formed to colonize and exploit the “New World” of the Solar System. Which means we won’t be colonizing planets.\n \nScrew planets.\n \nThe near term future of manned colonization of space is the asteroid belt.  Instead of Mars, we should colonize Ceres in order to establish a logistical base for asteroid prospecting and mining. Ceres has no significant gravity well to overcome and lots of water for life and fuel. \n \nhttp://www.pagef30.com/2009/04/why-ceres-might-be-better-location-for.html\n \nSo instead of Star Fleet starting human colonies on the surfaces of planets, we'll have the Weyland-Yutani Corporation contracting out the space equivalent of oil rig and crab fishing work - extremely dirty and dangerous work with a high death rate. Work that makes investor back home extremely wealthy, mankind more prosperous and the workers making a small fortune with each service contract (if they live long enough to return to Earth to spend their money). Maybe we'll have the occasional scientific base established on Mars or floating in the atmosphere of Venus, but they'll be no bigger than a current Antarctic base and be nothing more than a PR stunt.\n \nSo forget about the bright, shiny and clean Enterprise, our future in space is the dirty, gritty and dangerous Nostromo.\n \nEventually, the wealth generated by asteroid mining will create the resources and infrastructure needed to colonize the planets.  But how to create a shirt sleeve environment that people will actually want to move to?  We should just start \"small\" and just para-terraform just the 4 mile deep Valles Marineris. It's depth would allow us to sustain (with some biological or industrial maintenance and replenishment) a sufficiently thick and breathable atmosphere. The colonists can treat the rest of Mars like we treat the Himalayas. At 2,500 miles long and 360 miles wide, it's area is 900,000 square miles (about the size of Alaska and Texas combined, more than enough room for any conceivable initial colonization effort). Cities could be carved into the canyon walls like pueblos. The colonists would then proceed with the terraforming of the rest of the planet.  Electrical cables can be strung across the canyon opening creating an artificial magnetic field that would shield colonists and life on the valley floor from cosmic radiation.\n \nIf we become tunnel dwellers on Mars, we can live in floating cities on Venus. The upper reaches of the thick, heavy carbon dioxide atmosphere of Venus are Earth-like in terms of pressure and temperature.  Dirigibles filled with a breathable oxygen-nitrogen atmosphere would be buoyant – just like cloud city in Star Wars. We just got to protect the city's external skin from all that sulfuric acid in the Venusian atmosphere. Factories in the floating city can extract carbon dioxide from the thick atmosphere to produce carbon based nano-structures which can be used to build even more cities or floating solar screens to block sunlight. Eventually, the dense, hot Venusian atmosphere can be rendered into habitable structures and sun screens.  Centuries later we can walk on the surface of Venus without being crushed and fried.\n \nIf the asteroid miners are going to have dangerous work and high death rates, planetary colonists won't be coming home at all. As Buzz Aldrin pointed out, manned colonization of the solar system SHOULD be one way for the same reasons that the Pilgrims knew they were never going back to England and settlers travelling the Oregon Trail (with many dying along the way) were never going back East. Manned travel to Mars only makes sense if you plan on it being a one-way trip.\n \nOnce an industrial infrastructure is established in the asteroid belt and colonies established on Mars and Venus, we can push outward to the Jovian worlds, Kuiper Belt and Oort Cloud.  There we can establish hundreds of terraformed and para-terraformed planets, moons, asteroids, Kuiper Belt objects (which the former planet Pluto is now classified as), Oort cloud planetoids and comets, and moons orbiting nearby brown dwarfs (worlds half way in size between Jupiter and the Sun).  \n \nOnce we have established an industrial zone in the asteroid belt, colonized/terraformed Mars, Venus and the moons of Jupiter and Saturn, where to next?  Ad astra?\n \nMaybe we won't have to make giant leaps to actual stars. Maybe we can take small steps to brown dwarfs between the stars. Who knows, there may be dozens of BDs between the stars for every visible star:\n \nhttp://nextbigfuture.com/2009/11/could-nasa-wide-infrared-survey.html\n \n\"The other headline would be the discovery of a brown dwarf that is even closer to Earth than the nearest star, the Alpha Centauri system at 4.3 light-years. Brown dwarfs are objects that form along with stars but do not have enough mass to trigger or sustain nuclear fusion. They are so cool and dim very little is known about their distribution in the galaxy\"\n \nand:\n \nhttp://www.scifi.com/sfw/issue183/labnotes.html\n \n\"What if space is littered with these failed stars, scattered between the bright ones like a stellar Polynesia, making interstellar travel a series of short hops, rather than a single gigantic one? What if a simple fusion reactor carried just enough fuel to push a spacecraft to our solar system's Planet X in reasonable time? What if it could refuel there, harvesting just enough hydrogen or deuterium or helium to limp along to another dark neighbor, and another, and another? Granted, it would take a long, long time to get to Alpha Centauri that way, and probably a much, much longer time to find a planet somewhere that looked even remotely like our rain- and sun-drenched Earth. But given the likelihood of tidally warmed moons, and the obvious possibilities for life there, we may just find that the cold, dark spaces are where most of the action is anyway.\"\n \nThere may be dozens or hundreds of mini-solar systems between Sol and Alpha Centauri. With the discovery of brown dwarfs, free floating planets between the stars, and extra-solar planetoids like Sedna, future space explorers may find plenty to keep them occupied in our own solar neighborhood for centuries to come. While not the galaxy spanning empires and federations of science fiction, it would be enough for our species to explore far into the future.\n \nWhat if Brown Dwarfs turn out to be scattered by the dozens or hundreds in the space between the stars?  And what if most of them have mini-solar systems (like Jupiter and Saturn) capable of supporting life because enough heat is generated by the BD to allow liquid water and photosynthesis based on infrared frequencies? Then perhaps we'll find that our kind of life, based on visible light spectrum photosynthesis, is the rare oddity and infrared based life far more common.  \n\nSince these mini-solar systems and planets are a stone's throw away, they can be reached without exotic warp drives or hyperspace. Simple solar sails, laser sails or nuclear rockets will do just fine. Exploration missions can visit and return in a matter of years, instead of centuries or millennium. Interstellar \"empires\" and \"federations\" can be created using slower than light space travel. Maybe Capt. Kirk and Obi Wan Kenobi wouldn't be impressed, but we’ll be half way to Alpha Centauri.\n \nThen what?\n \nWe seed the universe with our kind.\n \nA solar sail about the size of Colorado (and being only one carbon atom thick) can use the pressure of sunlight alone to accelerate a payload to between 0.01c to 0.1c.  Deceleration can be achieved by the pressure of sunlight from the destination star.  No expensive fuel or engines needed for this cheap and slow approach.  So it would take decades or centuries to reach a nearby star, what’s the hurry?  The payload would consist of millions of frozen embryos that are thawed out and brought to term in a artificial wombs. The first generation of colonists would be raised by android “mom” and “dad” analogues programmed to care for, protect, educate and nurture the children (“watched over by machines of loving grace”). After establishing a colony, the space ship utilizes local asteroid resources to build more solar sail ships and payloads, sending them off to more stars where the process is repeated over and over again... \n \n... until we are a galactic species immune to extinction.\n \nThat’s the wonderful thing about doubling.  Take one probe and double it only 19 times and you have over a million probes spreading throughout the galaxy.  Once established, a system of colonies can create a communication network exchanging the only commodities that can be transported economically over interstellar distances: information and knowledge.  \n \nThis doubling effect also works in the early stages of space colonization.  Send a semi-autonomous 3D printer to the asteroid belt to mine local resources and create a million more 3D printers after only 19 iterations.  Then change their programming to begin construction of space factories and infrastructure – all controlled by only a few thousand humans of which only a few dozen are actually in space.  Do the same on the surface of Mars to create habitable enclaves before the first colonists even arrive.  Do that in the Venusian atmosphere and create vast structures made out of carbon nanotubes while making the place habitable.\n \nNow if only we can create a successful Sci-fi series based on these ideas...\n \n\n \n",
  "gilded": 0,
  "score": 101,
  "removal_reason": null,
  "approved_by": null,
  "created_utc": 1388236616.0,
  "is_self": true,
  "stickied": false,
  "edited": 1388236840.0,
  "distinguished": null,
  "permalink": "https://www.reddit.com/r/Futurology/comments/1tvhtc/the_plan/?ref=search_posts",
  "banned_by": null,
  "from_id": null,
  "likes": null,
  "_underscore_names": null,
  "num_reports": null,
  "link_flair_css_class": "text",
  "_info_url": "https://api.reddit.com/api/info/",
  "id": "1tvhtc",
  "archived": true,
  "secure_media": null,
  "from_kind": null,
  "saved": false,
  "domain": "self.Futurology",
  "ups": 101,
  "suggested_sort": null,
  "quarantine": false,
  "over_18": false,
  "hide_score": false,
  "url": "https://www.reddit.com/r/Futurology/comments/1tvhtc/the_plan/",
  "subreddit_id": "t5_2t7no",
  "_params": {},
  "_comments": null,
  "_replaced_more": false,
  "_comments_by_id": {},
  "user_reports": [],
  "media_embed": {},
  "created": 1388236616.0,
  "author_flair_text": null,
  "visited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It may be disappointing that the recent Chinese rover is the first  human activity on the Moon in more than forty years.  But it is not unusual, or in retrospect unexpected.  It follows historical patterns.</p>\n\n<p>The first pattern is the inevitable time delay between exploration and colonization.  At the turn of the (last) century, the race for the poles was the Victorian equivalent of our race for the moon. Once the flags of Britain, Norway, etc. had been planted at the south pole, national prestige was satisfied.  Afterwards, nobody bothered much with Antarctica for about another half century, until the first international geophysical year (1959). Since then, the continent has been studded with permanently manned scientific bases and weather stations.</p>\n\n<p>But nobody has bothered to try to colonize Antarctica on a large scale. Primarily because it is a crappy place to live. Yet it is far more inviting and cheaper/easier to colonize (and to get to) than the moon or Mars. If history is any guide, about a half century after the Apollo program (within the next ten to twenty years) look for permanently manned stations in orbit, on the moon and maybe on Mars. The ISS is the first of these stations.  But don&#39;t expect massive colonization anytime soon. Our species simply won&#39;t move anywhere in large numbers that we can&#39;t walk around outside in shirt sleeves for at least part of the year. </p>\n\n<p>The second pattern is that government funded exploration (Ferdinand and Isabella paying for Columbus’ voyages, Jefferson sending Lewis and Clark westward, etc.) is always followed by true colonization being performed by private enterprise (the conquistadors, the Massachusetts Bay company, settlers travelling the Oregon trail, Dutch East India Company, railroads spanning the west, etc.).  In fact, the early colonization efforts in the Americas were the work of the world’s first stock holder corporations.  Planetary Resources, Inc. (asteroid mining) and SpaceX (private space launches) are just the first corporations being formed to colonize and exploit the “New World” of the Solar System. Which means we won’t be colonizing planets.</p>\n\n<p>Screw planets.</p>\n\n<p>The near term future of manned colonization of space is the asteroid belt.  Instead of Mars, we should colonize Ceres in order to establish a logistical base for asteroid prospecting and mining. Ceres has no significant gravity well to overcome and lots of water for life and fuel. </p>\n\n<p><a href=\"http://www.pagef30.com/2009/04/why-ceres-might-be-better-location-for.html\">http://www.pagef30.com/2009/04/why-ceres-might-be-better-location-for.html</a></p>\n\n<p>So instead of Star Fleet starting human colonies on the surfaces of planets, we&#39;ll have the Weyland-Yutani Corporation contracting out the space equivalent of oil rig and crab fishing work - extremely dirty and dangerous work with a high death rate. Work that makes investor back home extremely wealthy, mankind more prosperous and the workers making a small fortune with each service contract (if they live long enough to return to Earth to spend their money). Maybe we&#39;ll have the occasional scientific base established on Mars or floating in the atmosphere of Venus, but they&#39;ll be no bigger than a current Antarctic base and be nothing more than a PR stunt.</p>\n\n<p>So forget about the bright, shiny and clean Enterprise, our future in space is the dirty, gritty and dangerous Nostromo.</p>\n\n<p>Eventually, the wealth generated by asteroid mining will create the resources and infrastructure needed to colonize the planets.  But how to create a shirt sleeve environment that people will actually want to move to?  We should just start &quot;small&quot; and just para-terraform just the 4 mile deep Valles Marineris. It&#39;s depth would allow us to sustain (with some biological or industrial maintenance and replenishment) a sufficiently thick and breathable atmosphere. The colonists can treat the rest of Mars like we treat the Himalayas. At 2,500 miles long and 360 miles wide, it&#39;s area is 900,000 square miles (about the size of Alaska and Texas combined, more than enough room for any conceivable initial colonization effort). Cities could be carved into the canyon walls like pueblos. The colonists would then proceed with the terraforming of the rest of the planet.  Electrical cables can be strung across the canyon opening creating an artificial magnetic field that would shield colonists and life on the valley floor from cosmic radiation.</p>\n\n<p>If we become tunnel dwellers on Mars, we can live in floating cities on Venus. The upper reaches of the thick, heavy carbon dioxide atmosphere of Venus are Earth-like in terms of pressure and temperature.  Dirigibles filled with a breathable oxygen-nitrogen atmosphere would be buoyant – just like cloud city in Star Wars. We just got to protect the city&#39;s external skin from all that sulfuric acid in the Venusian atmosphere. Factories in the floating city can extract carbon dioxide from the thick atmosphere to produce carbon based nano-structures which can be used to build even more cities or floating solar screens to block sunlight. Eventually, the dense, hot Venusian atmosphere can be rendered into habitable structures and sun screens.  Centuries later we can walk on the surface of Venus without being crushed and fried.</p>\n\n<p>If the asteroid miners are going to have dangerous work and high death rates, planetary colonists won&#39;t be coming home at all. As Buzz Aldrin pointed out, manned colonization of the solar system SHOULD be one way for the same reasons that the Pilgrims knew they were never going back to England and settlers travelling the Oregon Trail (with many dying along the way) were never going back East. Manned travel to Mars only makes sense if you plan on it being a one-way trip.</p>\n\n<p>Once an industrial infrastructure is established in the asteroid belt and colonies established on Mars and Venus, we can push outward to the Jovian worlds, Kuiper Belt and Oort Cloud.  There we can establish hundreds of terraformed and para-terraformed planets, moons, asteroids, Kuiper Belt objects (which the former planet Pluto is now classified as), Oort cloud planetoids and comets, and moons orbiting nearby brown dwarfs (worlds half way in size between Jupiter and the Sun).  </p>\n\n<p>Once we have established an industrial zone in the asteroid belt, colonized/terraformed Mars, Venus and the moons of Jupiter and Saturn, where to next?  Ad astra?</p>\n\n<p>Maybe we won&#39;t have to make giant leaps to actual stars. Maybe we can take small steps to brown dwarfs between the stars. Who knows, there may be dozens of BDs between the stars for every visible star:</p>\n\n<p><a href=\"http://nextbigfuture.com/2009/11/could-nasa-wide-infrared-survey.html\">http://nextbigfuture.com/2009/11/could-nasa-wide-infrared-survey.html</a></p>\n\n<p>&quot;The other headline would be the discovery of a brown dwarf that is even closer to Earth than the nearest star, the Alpha Centauri system at 4.3 light-years. Brown dwarfs are objects that form along with stars but do not have enough mass to trigger or sustain nuclear fusion. They are so cool and dim very little is known about their distribution in the galaxy&quot;</p>\n\n<p>and:</p>\n\n<p><a href=\"http://www.scifi.com/sfw/issue183/labnotes.html\">http://www.scifi.com/sfw/issue183/labnotes.html</a></p>\n\n<p>&quot;What if space is littered with these failed stars, scattered between the bright ones like a stellar Polynesia, making interstellar travel a series of short hops, rather than a single gigantic one? What if a simple fusion reactor carried just enough fuel to push a spacecraft to our solar system&#39;s Planet X in reasonable time? What if it could refuel there, harvesting just enough hydrogen or deuterium or helium to limp along to another dark neighbor, and another, and another? Granted, it would take a long, long time to get to Alpha Centauri that way, and probably a much, much longer time to find a planet somewhere that looked even remotely like our rain- and sun-drenched Earth. But given the likelihood of tidally warmed moons, and the obvious possibilities for life there, we may just find that the cold, dark spaces are where most of the action is anyway.&quot;</p>\n\n<p>There may be dozens or hundreds of mini-solar systems between Sol and Alpha Centauri. With the discovery of brown dwarfs, free floating planets between the stars, and extra-solar planetoids like Sedna, future space explorers may find plenty to keep them occupied in our own solar neighborhood for centuries to come. While not the galaxy spanning empires and federations of science fiction, it would be enough for our species to explore far into the future.</p>\n\n<p>What if Brown Dwarfs turn out to be scattered by the dozens or hundreds in the space between the stars?  And what if most of them have mini-solar systems (like Jupiter and Saturn) capable of supporting life because enough heat is generated by the BD to allow liquid water and photosynthesis based on infrared frequencies? Then perhaps we&#39;ll find that our kind of life, based on visible light spectrum photosynthesis, is the rare oddity and infrared based life far more common.  </p>\n\n<p>Since these mini-solar systems and planets are a stone&#39;s throw away, they can be reached without exotic warp drives or hyperspace. Simple solar sails, laser sails or nuclear rockets will do just fine. Exploration missions can visit and return in a matter of years, instead of centuries or millennium. Interstellar &quot;empires&quot; and &quot;federations&quot; can be created using slower than light space travel. Maybe Capt. Kirk and Obi Wan Kenobi wouldn&#39;t be impressed, but we’ll be half way to Alpha Centauri.</p>\n\n<p>Then what?</p>\n\n<p>We seed the universe with our kind.</p>\n\n<p>A solar sail about the size of Colorado (and being only one carbon atom thick) can use the pressure of sunlight alone to accelerate a payload to between 0.01c to 0.1c.  Deceleration can be achieved by the pressure of sunlight from the destination star.  No expensive fuel or engines needed for this cheap and slow approach.  So it would take decades or centuries to reach a nearby star, what’s the hurry?  The payload would consist of millions of frozen embryos that are thawed out and brought to term in a artificial wombs. The first generation of colonists would be raised by android “mom” and “dad” analogues programmed to care for, protect, educate and nurture the children (“watched over by machines of loving grace”). After establishing a colony, the space ship utilizes local asteroid resources to build more solar sail ships and payloads, sending them off to more stars where the process is repeated over and over again... </p>\n\n<p>... until we are a galactic species immune to extinction.</p>\n\n<p>That’s the wonderful thing about doubling.  Take one probe and double it only 19 times and you have over a million probes spreading throughout the galaxy.  Once established, a system of colonies can create a communication network exchanging the only commodities that can be transported economically over interstellar distances: information and knowledge.  </p>\n\n<p>This doubling effect also works in the early stages of space colonization.  Send a semi-autonomous 3D printer to the asteroid belt to mine local resources and create a million more 3D printers after only 19 iterations.  Then change their programming to begin construction of space factories and infrastructure – all controlled by only a few thousand humans of which only a few dozen are actually in space.  Do the same on the surface of Mars to create habitable enclaves before the first colonists even arrive.  Do that in the Venusian atmosphere and create vast structures made out of carbon nanotubes while making the place habitable.</p>\n\n<p>Now if only we can create a successful Sci-fi series based on these ideas...</p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "_comment_sort": null,
  "report_reasons": null,
  "name": "t3_1tvhtc",
  "from": null,
  "hidden": false,
  "clicked": false,
  "media": null,
  "json_dict": null,
  "_api_link": "https://api.reddit.com/r/Futurology/comments/1tvhtc/the_plan/?ref=search_posts",
  "secure_media_embed": {},
  "mod_reports": [],
  "_orphaned": {},
  "_uniq": null,
  "num_comments": 22,
  "link_flair_text": "text",
  "title": "The Plan",
  "_has_fetched": true,
  "author_flair_css_class": null,
  "thumbnail": "self"
}