{
  "selftext": "my site mostly documents my upcoming legal case where I'm trying to sue the government and expose top political figures / the police / government for corruption for the development and use of military surveillance and weapons on the public, including the star wars / strategic defense initiative. this platform is made up of energy weapons powerful enough to dustify a building and precise enough to target a human to remotely control their brain and perform electronic assaults/murders, all from space and huge ground based phased array antennas pointed directly over the United States and other countries. Many whistleblowers who worked within the DOD/CIA/US DOJ like Dr. Robert Duncan and Mark Phillips and Dr. Fred Bell and more confirm it's existence and use against American citizens. This weapon was used on me to perform warrantless surveillance during a major US Department of Justice investigation in Oregon and upon attempting to blow the whistle, they used the directed energy capability to try to kill me, and I have since been targeted for 6 years. I have compiled a website with all the best evidence I could find (not including my personal case evidence in it's entirety, but enough for you to read some basic medical records, etc) during my personal investigation and I seek now to find an attorney to help me sue for injuries and governmental abuse (I have confirmed brain injury and neuro-muscular injury from the weapon, including Chronic Traumatic Encephalopathy, and illness that cannot be cured because it's the result of multiple repetitive injuries inflicted upon me over thousands of hours of abuse with directed energy).\n\nMy website with the details, media, videos, and audio and many other credible links to resources is http://www.obamasweapon.com/\n\nThanks and I hope Reddit users spread the word and invite people to visit my site so we can get the word out!\n\nSample of some awesome stuff you'll find on my website. This sample written by DOD/CIA/US DOJ whistleblower Dr. Robert Duncan, who designed remote surveillance technology for the government:\n\nPatent on remote brain reading/manipulation, by Robert Malech DOD contractor from 1974, deployed in all radar/satellites by 1976: http://www.oregonstatehospital.net/d/patents/malech_patent_remote_brainwave_signal_reading_and_manipulation_3951134_1974.pdf\n\nHere is secret #1 that has been suppressed by the forces of ignorance in the government. There was a patent that I will keep referring to throughout this book because of the importance of the work. It is published in the appendix. In 1974, Robert Malech, an employee of Dorn & Margolin Inc., a major defense subcontractor in radar design now owned by EDO Corporation an even larger all defense contractor in electronic warfare, invented a fairly simple radar device that could read whole brain electrical activity at a large distance . It has the major advantages of no wires and full brain electrical activity analysis, not just points on the skull surface. He discovered and perfected a way to use some simple electromagnetic oscillations anywhere from 100Mhz to 40 Ghz to read brainwaves by \"illuminating\" the brain and its electrical conductance then reading the return signal. The imaging method observes the changes of frequency resonances, amplitude, and phase which represent the states of neuron depolarization throughout the brain.\n\nSecret #2. But more profoundly, he discovered that he could influence brain waves if precisely timed with a return training signal. He had no idea that at this moment in history, he had accidentally destroyed democracy as we envision it to be. The military and surveillance community immediately picked up on the patent and within two years had reprogrammed their communications and surveillance satellites and terrestrial phased arrays with the new concepts. The rapid deployment of this technology occurred because it only required software changes in already existing radar, imaging, and communications' terrestrial dishes and satellites. Many additional spy satellites have been launched since to bolster the system. So in 1976, on the bicentennial of this great nation, a system called TAMI was born. TAMI is an acronym for \"Thought Amplifier and Mind Interface\". A more invasive \"Big Brother\" technology came about before George Orwell's prediction of 1984.\n\nSecret #3. Stealth RADAR techniques were first recorded by observing the Russian bombardment of the U.S. embassy in Moscow with microwaves. Using high powered steered phased arrays and focused directed energy from two sources next to each other, one can create a nearly undetectable \"scalar\" wave, or destructive interference at the point of interest. With just a minor energy interaction, the interfering beams bounce back with strong signal to noise ratio to be resolved at the sources again. This allows for any imaging technique to be done from extremely large distances. In effect, it makes distance irrelevant to the detection feature, be it RADAR, MRI, or ESR imaging.\n\n At the same time, the Russians had discovered and were developing similar capabilities. This accelerated the secret arms race that continues to this day. The research and capabilities have come a long way in the last 30 years. Even if one didn't have direct access to the knowledge of surveillance capabilities, one could project out in time 30 years knowing technology developments increase at an exponential rate. At that time the military demonstrated the capability of reading automobile license plates from satellite images.\n\n In order to cover up and not draw attention to mind reading radar, the whole field of psychic phenomena and paranormal psychology was invented to deceive the civilian populations of what was occurring. The Russian's showed their hand when they started bombarding the U.S. embassy in Moscow with microwaves in the late 60's, and then with the 7 Russian Wood Pecker transmitters that began operation in 1976 pointed at the U.S.\n\n Unfortunately, due to the nature of this new weapon, many human minds are needed to create the database of specific brain data necessary to increase the effectiveness on a larger and larger population. These are referred to as the \"Cataloguing and Cloning operations\". In this context, cloning does not refer to human cloning, but EEG cloning. Many have misunderstood this fact and then it was popularized by the T.V. series \"X-Files\". These cloning operations are what plague the human race today as every country feels the need to have this weapon that requires torturing and killing many people of their own populations to develop.\n\n EEG cloning means to copy someone else's brainwaves onto another person. The discovery made by Robert Malech allows this to be done wirelessly anywhere in the world. A new military division emerged called The Psychic Warfare Unit initially stationed in the Pentagon but most likely it was rolled into the Psychological Operations, Electronic Warfare, and Informational Warfare Units. Initially this became a great intelligence gathering tool. Psychically spying into other people's minds was an incredible feat.\n\n I don't use the term EEG cloning much because it refers only to the special case of observing a targets mind. That is only one aspect of the technology. Malech discovered he could influence brain waves just as easily as reading them. So at the other extreme, a psychic warrior can EEG clone his brainwaves onto a target. This is symbolized in the movie \"The Matrix\" where the agents take over random citizens bodies while in pursuit of the heroes. The correct terminology to describe everything in between the two extremes is EEG heterodyning. Heterodyning is an engineering term which means to mix signals. So EEG cloning is just a special case of EEG heterodyning.\n\n EEG cyber hive mind is another term used for EEG heterodyning for non-weapons use experiments. These are collectives of people who share one common set of brain waves. They jokingly refer to the process of forcing someone into a collective as \"Borging\" them, a reference to the evil cyborg civilization from Star Trek. They are studying both the long term effects of being in this kind of collective mind configuration and how to use it to control, spy through, disable, or kill a target. They also are studying communication and organization without spy gadgets of any kind for synchronized missions.\n\n The emerging field which intersects at the physics of psychology is called \"psychophysics\". The dynamics of the mind are well described from neuroscience reductionism. Artificial neural networks have been around for over half a century. But the new challenge is to map exactly the subjective experiences of consciousness to the physics of organic intelligences informational signal processing including biochemical and electromagnetic. The word \"Psychophysics\" has additional connotations that are quite appropriate in the way that this field has evolved in the secret labs around the world. The tools of psychophysicists are called psychotronics. It is this area of research that has given rise to all the conspiracy theories on the New World Order psychoterrorists, secret societies involvement, mind control and satanic cults. Mind control weapons are the holy grail of the ultimate weapon and has given birth to the world's most notorious, sociopathic scientists which in turn have spawned a generation of the most intense human suffering for weapons testing efficacy the people of this planet have ever endured.\n\nThe First Documented use of Mind Reading RADAR\n\n In order to reduce the effects from the bombardment of the U.S. embassy in Moscow with microwaves, they put up microwave screens on the windows of the building. Oddly enough, this actually had the opposite effect of increasing the microwave intensity inside. The only way this can happen is if interferometry was being used on the embassy. If you block a path of the interfering / heterodyning wave fronts, you can lessen the destructive interference pattern thereby increasing the measurable energy. This was the first documented use of so called \"scalar weapons\".\n\n ...\n\nElectron Spin Resonance (ESR)\n\n This is the secret sauce that the conspiracy kills to keep secret. Notice that there are no ESR machines in hospitals. Why? Because it would become immediately obvious how easy it is to read body electricity from RADAR, i.e. brain waves at a distance. The basic concept is simple and very analogous to the way Magnetic Resonance Imaging works. It works on manipulating spin and gyro frequency of electrons.\n\nElectron Spin Polarity Resonance (EPR)\n\n In this imaging technique the spin polarity is measured by flipping it which adds or subtracts energy from the system. Energy must be conserved so a photon is given off if it goes to a lower energy spin state. It is \"heated\" during the movement to a higher energy state prepping it for a synchronized transition back to a lower energy state. The body's electricity is modulated into delayed state transitions because of the local electric field variations. This return signal is processed and the very high signal to noise EEG patterns are extracted. The sensitivity is truly \"science fiction\" like. Even a single nerve or neuron firing can be picked up individually. This gives new meaning to Signal Intelligence.\n\nMagnetic Resonance Imaging (MRI)\n\n Very similar to the way magnetic imaging works with the spin of the nuclei of atoms with their magnetic moments.\n\n ...\n\nMillimeter wave, Infra-red and Visible Wavelength Satellite Imaging\n\n This topic is self explanatory. Everyone has seen the incredible detailed infrared imaging capabilities of the military. They can see heat signatures through walls. What do haunted houses, ghosts, alien abductions, and the Bermuda Triangle have in common? Remember how the air becomes electrified before a haunting by the appearance of a poltergeist in movies inspired by this weapons testing on the public? We've busted our ghost in the machine! Remember how planes would be downed in the Bermuda Triangle because their compass needles and instruments would go haywire? Those were directed energy attacks from the Puerto Rico Radar field built in 1959. Remember all the shows about cars stalling and radio stations flipping right before an alien abduction scenario? These are all the same RADAR tricks but with varying degrees of lethality. These tricks are all done by the same technology and the usual criminals in the bowls of the beast.\n\n ...\n\nMore on the site. All confirmed stuff. Verified true.",
  "gilded": 0,
  "score": 18,
  "removal_reason": null,
  "approved_by": null,
  "created_utc": 1401443898.0,
  "is_self": true,
  "stickied": false,
  "edited": 1401440830.0,
  "distinguished": null,
  "permalink": "https://www.reddit.com/r/conspiracy/comments/26v0r5/large_collection_of_media_on_star_wars_directed/?ref=search_posts",
  "banned_by": null,
  "from_id": null,
  "likes": null,
  "_underscore_names": null,
  "num_reports": null,
  "link_flair_css_class": null,
  "_info_url": "https://api.reddit.com/api/info/",
  "id": "26v0r5",
  "archived": true,
  "secure_media": null,
  "from_kind": null,
  "saved": false,
  "domain": "self.conspiracy",
  "ups": 18,
  "suggested_sort": null,
  "quarantine": false,
  "over_18": false,
  "hide_score": false,
  "url": "https://www.reddit.com/r/conspiracy/comments/26v0r5/large_collection_of_media_on_star_wars_directed/",
  "subreddit_id": "t5_2qh4r",
  "_params": {},
  "_comments": null,
  "_replaced_more": false,
  "_comments_by_id": {},
  "user_reports": [],
  "media_embed": {},
  "created": 1401443898.0,
  "author_flair_text": null,
  "visited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>my site mostly documents my upcoming legal case where I&#39;m trying to sue the government and expose top political figures / the police / government for corruption for the development and use of military surveillance and weapons on the public, including the star wars / strategic defense initiative. this platform is made up of energy weapons powerful enough to dustify a building and precise enough to target a human to remotely control their brain and perform electronic assaults/murders, all from space and huge ground based phased array antennas pointed directly over the United States and other countries. Many whistleblowers who worked within the DOD/CIA/US DOJ like Dr. Robert Duncan and Mark Phillips and Dr. Fred Bell and more confirm it&#39;s existence and use against American citizens. This weapon was used on me to perform warrantless surveillance during a major US Department of Justice investigation in Oregon and upon attempting to blow the whistle, they used the directed energy capability to try to kill me, and I have since been targeted for 6 years. I have compiled a website with all the best evidence I could find (not including my personal case evidence in it&#39;s entirety, but enough for you to read some basic medical records, etc) during my personal investigation and I seek now to find an attorney to help me sue for injuries and governmental abuse (I have confirmed brain injury and neuro-muscular injury from the weapon, including Chronic Traumatic Encephalopathy, and illness that cannot be cured because it&#39;s the result of multiple repetitive injuries inflicted upon me over thousands of hours of abuse with directed energy).</p>\n\n<p>My website with the details, media, videos, and audio and many other credible links to resources is <a href=\"http://www.obamasweapon.com/\">http://www.obamasweapon.com/</a></p>\n\n<p>Thanks and I hope Reddit users spread the word and invite people to visit my site so we can get the word out!</p>\n\n<p>Sample of some awesome stuff you&#39;ll find on my website. This sample written by DOD/CIA/US DOJ whistleblower Dr. Robert Duncan, who designed remote surveillance technology for the government:</p>\n\n<p>Patent on remote brain reading/manipulation, by Robert Malech DOD contractor from 1974, deployed in all radar/satellites by 1976: <a href=\"http://www.oregonstatehospital.net/d/patents/malech_patent_remote_brainwave_signal_reading_and_manipulation_3951134_1974.pdf\">http://www.oregonstatehospital.net/d/patents/malech_patent_remote_brainwave_signal_reading_and_manipulation_3951134_1974.pdf</a></p>\n\n<p>Here is secret #1 that has been suppressed by the forces of ignorance in the government. There was a patent that I will keep referring to throughout this book because of the importance of the work. It is published in the appendix. In 1974, Robert Malech, an employee of Dorn &amp; Margolin Inc., a major defense subcontractor in radar design now owned by EDO Corporation an even larger all defense contractor in electronic warfare, invented a fairly simple radar device that could read whole brain electrical activity at a large distance . It has the major advantages of no wires and full brain electrical activity analysis, not just points on the skull surface. He discovered and perfected a way to use some simple electromagnetic oscillations anywhere from 100Mhz to 40 Ghz to read brainwaves by &quot;illuminating&quot; the brain and its electrical conductance then reading the return signal. The imaging method observes the changes of frequency resonances, amplitude, and phase which represent the states of neuron depolarization throughout the brain.</p>\n\n<p>Secret #2. But more profoundly, he discovered that he could influence brain waves if precisely timed with a return training signal. He had no idea that at this moment in history, he had accidentally destroyed democracy as we envision it to be. The military and surveillance community immediately picked up on the patent and within two years had reprogrammed their communications and surveillance satellites and terrestrial phased arrays with the new concepts. The rapid deployment of this technology occurred because it only required software changes in already existing radar, imaging, and communications&#39; terrestrial dishes and satellites. Many additional spy satellites have been launched since to bolster the system. So in 1976, on the bicentennial of this great nation, a system called TAMI was born. TAMI is an acronym for &quot;Thought Amplifier and Mind Interface&quot;. A more invasive &quot;Big Brother&quot; technology came about before George Orwell&#39;s prediction of 1984.</p>\n\n<p>Secret #3. Stealth RADAR techniques were first recorded by observing the Russian bombardment of the U.S. embassy in Moscow with microwaves. Using high powered steered phased arrays and focused directed energy from two sources next to each other, one can create a nearly undetectable &quot;scalar&quot; wave, or destructive interference at the point of interest. With just a minor energy interaction, the interfering beams bounce back with strong signal to noise ratio to be resolved at the sources again. This allows for any imaging technique to be done from extremely large distances. In effect, it makes distance irrelevant to the detection feature, be it RADAR, MRI, or ESR imaging.</p>\n\n<p>At the same time, the Russians had discovered and were developing similar capabilities. This accelerated the secret arms race that continues to this day. The research and capabilities have come a long way in the last 30 years. Even if one didn&#39;t have direct access to the knowledge of surveillance capabilities, one could project out in time 30 years knowing technology developments increase at an exponential rate. At that time the military demonstrated the capability of reading automobile license plates from satellite images.</p>\n\n<p>In order to cover up and not draw attention to mind reading radar, the whole field of psychic phenomena and paranormal psychology was invented to deceive the civilian populations of what was occurring. The Russian&#39;s showed their hand when they started bombarding the U.S. embassy in Moscow with microwaves in the late 60&#39;s, and then with the 7 Russian Wood Pecker transmitters that began operation in 1976 pointed at the U.S.</p>\n\n<p>Unfortunately, due to the nature of this new weapon, many human minds are needed to create the database of specific brain data necessary to increase the effectiveness on a larger and larger population. These are referred to as the &quot;Cataloguing and Cloning operations&quot;. In this context, cloning does not refer to human cloning, but EEG cloning. Many have misunderstood this fact and then it was popularized by the T.V. series &quot;X-Files&quot;. These cloning operations are what plague the human race today as every country feels the need to have this weapon that requires torturing and killing many people of their own populations to develop.</p>\n\n<p>EEG cloning means to copy someone else&#39;s brainwaves onto another person. The discovery made by Robert Malech allows this to be done wirelessly anywhere in the world. A new military division emerged called The Psychic Warfare Unit initially stationed in the Pentagon but most likely it was rolled into the Psychological Operations, Electronic Warfare, and Informational Warfare Units. Initially this became a great intelligence gathering tool. Psychically spying into other people&#39;s minds was an incredible feat.</p>\n\n<p>I don&#39;t use the term EEG cloning much because it refers only to the special case of observing a targets mind. That is only one aspect of the technology. Malech discovered he could influence brain waves just as easily as reading them. So at the other extreme, a psychic warrior can EEG clone his brainwaves onto a target. This is symbolized in the movie &quot;The Matrix&quot; where the agents take over random citizens bodies while in pursuit of the heroes. The correct terminology to describe everything in between the two extremes is EEG heterodyning. Heterodyning is an engineering term which means to mix signals. So EEG cloning is just a special case of EEG heterodyning.</p>\n\n<p>EEG cyber hive mind is another term used for EEG heterodyning for non-weapons use experiments. These are collectives of people who share one common set of brain waves. They jokingly refer to the process of forcing someone into a collective as &quot;Borging&quot; them, a reference to the evil cyborg civilization from Star Trek. They are studying both the long term effects of being in this kind of collective mind configuration and how to use it to control, spy through, disable, or kill a target. They also are studying communication and organization without spy gadgets of any kind for synchronized missions.</p>\n\n<p>The emerging field which intersects at the physics of psychology is called &quot;psychophysics&quot;. The dynamics of the mind are well described from neuroscience reductionism. Artificial neural networks have been around for over half a century. But the new challenge is to map exactly the subjective experiences of consciousness to the physics of organic intelligences informational signal processing including biochemical and electromagnetic. The word &quot;Psychophysics&quot; has additional connotations that are quite appropriate in the way that this field has evolved in the secret labs around the world. The tools of psychophysicists are called psychotronics. It is this area of research that has given rise to all the conspiracy theories on the New World Order psychoterrorists, secret societies involvement, mind control and satanic cults. Mind control weapons are the holy grail of the ultimate weapon and has given birth to the world&#39;s most notorious, sociopathic scientists which in turn have spawned a generation of the most intense human suffering for weapons testing efficacy the people of this planet have ever endured.</p>\n\n<p>The First Documented use of Mind Reading RADAR</p>\n\n<p>In order to reduce the effects from the bombardment of the U.S. embassy in Moscow with microwaves, they put up microwave screens on the windows of the building. Oddly enough, this actually had the opposite effect of increasing the microwave intensity inside. The only way this can happen is if interferometry was being used on the embassy. If you block a path of the interfering / heterodyning wave fronts, you can lessen the destructive interference pattern thereby increasing the measurable energy. This was the first documented use of so called &quot;scalar weapons&quot;.</p>\n\n<p>...</p>\n\n<p>Electron Spin Resonance (ESR)</p>\n\n<p>This is the secret sauce that the conspiracy kills to keep secret. Notice that there are no ESR machines in hospitals. Why? Because it would become immediately obvious how easy it is to read body electricity from RADAR, i.e. brain waves at a distance. The basic concept is simple and very analogous to the way Magnetic Resonance Imaging works. It works on manipulating spin and gyro frequency of electrons.</p>\n\n<p>Electron Spin Polarity Resonance (EPR)</p>\n\n<p>In this imaging technique the spin polarity is measured by flipping it which adds or subtracts energy from the system. Energy must be conserved so a photon is given off if it goes to a lower energy spin state. It is &quot;heated&quot; during the movement to a higher energy state prepping it for a synchronized transition back to a lower energy state. The body&#39;s electricity is modulated into delayed state transitions because of the local electric field variations. This return signal is processed and the very high signal to noise EEG patterns are extracted. The sensitivity is truly &quot;science fiction&quot; like. Even a single nerve or neuron firing can be picked up individually. This gives new meaning to Signal Intelligence.</p>\n\n<p>Magnetic Resonance Imaging (MRI)</p>\n\n<p>Very similar to the way magnetic imaging works with the spin of the nuclei of atoms with their magnetic moments.</p>\n\n<p>...</p>\n\n<p>Millimeter wave, Infra-red and Visible Wavelength Satellite Imaging</p>\n\n<p>This topic is self explanatory. Everyone has seen the incredible detailed infrared imaging capabilities of the military. They can see heat signatures through walls. What do haunted houses, ghosts, alien abductions, and the Bermuda Triangle have in common? Remember how the air becomes electrified before a haunting by the appearance of a poltergeist in movies inspired by this weapons testing on the public? We&#39;ve busted our ghost in the machine! Remember how planes would be downed in the Bermuda Triangle because their compass needles and instruments would go haywire? Those were directed energy attacks from the Puerto Rico Radar field built in 1959. Remember all the shows about cars stalling and radio stations flipping right before an alien abduction scenario? These are all the same RADAR tricks but with varying degrees of lethality. These tricks are all done by the same technology and the usual criminals in the bowls of the beast.</p>\n\n<p>...</p>\n\n<p>More on the site. All confirmed stuff. Verified true.</p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "_comment_sort": null,
  "report_reasons": null,
  "name": "t3_26v0r5",
  "from": null,
  "hidden": false,
  "clicked": false,
  "media": null,
  "json_dict": null,
  "_api_link": "https://api.reddit.com/r/conspiracy/comments/26v0r5/large_collection_of_media_on_star_wars_directed/?ref=search_posts",
  "secure_media_embed": {},
  "mod_reports": [],
  "_orphaned": {},
  "_uniq": null,
  "num_comments": 5,
  "link_flair_text": null,
  "title": "large collection of media on star wars directed energy weapon being used to attack people and perform secret surveillance",
  "_has_fetched": true,
  "author_flair_css_class": null,
  "thumbnail": "self"
}