{
  "selftext": "**Introduction**\n\nI have been researching aspects of our species existence for quite some time. I reached some of my older conclusions as an atheist. Due to certain explanations and experiences given to me, I no longer consider myself the naive zealot that I used to be. I would currently describe myself as an exploring psychonaut, with a belief system based off 'agnostic spiritual pantheism'.\n\nBefore I commence, I would like to declare that I believe religion and spirituality (noumenality) to be very different. With this in mind, I would like to share an update of my own observations on life so far. It's quite a 'lengthy' read, however please sit back, relax, open your mind to my freethinking information and enjoy. I welcome your opinions, and I invite you to present your own ideas concerning the following subjects... \n\n**| MEGO STRATEGIES | INDIVIDUALITY | THE SOURCE | NEURONS | THE BRAIN | DMT | NARCOTICS | PSYCHEDELICS | MEDITATION | PPT | PSYCHONAUT | DEATH | CONSCIOUSNESS | REALMS | HIGHER DIMENSION | DIMENSION | MEGO CAGING | MEGO TAMING | MEGO | ADVANCED MAMMALS | NOUMENALITY | RELIGIONS | CULTS | SOCIETIES | MANKIND |**\n\n~\n\n**HUMANS: Taming the MEGO**\n\n~\n\n**MANKIND:** Objectively considering my agnostic research and utilizing evidence across the 'psychonautical board', I have concluded that it is logical (and necessary) to separate an individual human (and certain other mammals) into three '**tethered**' parts...\n\n* **MAN** (*The Mammalian Being*) - The primitive self | Ego aligns itself with man | '**MEGO**' (mammalian ego)\n\n* **HUMAN**  (*The Connected Being*) - The overlapping self | In Latin, Homo means man and Humus 'Born of the Earth' | A region for discovering and experiencing life | **Where the '[MAN](http://www.reddit.com/r/Psychonaut/comments/2a8mid/what_did_you_experience_your_1st_time_doing_magic/ciskn93)' and the 'SOUL' meet.**\n\n* **METAMEGO** (*The Dimensional Being*) - The noumenal self | 'Soul/Spiritual' | A higher form of 'existence'.\n\nOther aspects of my research have concluded the following...\n\n~\n\n**RELIGIONS / CULTS / SOCIETIES:** Can act as an organised franchise system for human control. They strategically promote a very limited knowledge of the higher dimensional 'energy'. They can demand the strict practice of their own 'megotistical' rules. Humans are required to conform to their basic understandings. False incentives include, further advanced knowledge and full access to the higher dimension. As punishment for subordination, followers are warned, that knowledge of being, and of the spiritual destination, will be violently removed or denied to them.\n\n**NOUMENALITY:** Faith, belief or experience of a higher dimensional construct/reality. Desires access to open and non-conforming research. Very compatible with the higher echelons of the psychonaut community. \n\n~\n\n**ADVANCED MAMMALS:** These types appear to have had (and still have) their natural evolution 'tinkered' with. My research in this area is still ongoing and therefore undecided. Man (within the 'framework' of evolution) is an enigma. They appear to have originated from an intelligent hybrid design.\n\n**MEGO:** (Mammalian Ego) An important mechanism of the MAN. Ego demands and desires. It can be selfish and cruel! It's core 'primitive' purpose is to allow our mammalian vessel to survive! | [**'MAN'**](http://youtu.be/WfGMYdalClU)\n\n[**Eckhart Tolle**](https://www.youtube.com/watch?v=bImdyQn43s8) describes it well, however he unfortunately [**confuses the ego with the mind**](https://www.youtube.com/watch?v=2kv0XhIbTYs). He doesn't associate it with a 'separate' mammalian being. I believe that man (and therefore mego) are a part of our intelligent human hybrid creation.\n\n**MEGO TAMING:** The process of reducing the influence of the mego...\n\nIn combination with other **PPTs** (see below), this can also help prevent a 'bad psychedelic trip'.  Mego taming affects the 'flexibility' of the tethered soul. The increased 'elasticity' of the spiritual tether allows you to comfortably travel further into the 'higher dimension'. \n\n*Are bad trips inevitable?* [**Click Here for more information**](http://www.reddit.com/r/Psychonaut/comments/2hvp2k/bad_trips_mego_taming_and_the_story_of_sam_harris/)\n\nOn the other side of the 'spectrum', taming can also help integrate a destructive mego-centric human into society.\n\n**MEGO CAGING:** The process of removing or restraining a severely ambushed human/mammal. The mego-centric/mego dominated being, has to have been unresponsive to mego taming. It is usually the last resort (jail) and is primarily for safety purposes.\n\n~\n\n**DIMENSION:** An alternative reality and not a hallucinated reality. Currently, science can only analyze our own area of existence. Experimentation and analysis of other dimensions, can be performed only by Human consciousness. YOU ARE the only scientific apparatus available. Science confuses the concept by applying non applicable methods of evaluation. \n\nAn analogy would be:- Spanish farmers who had never seen the ocean, requesting proof off Christopher Columbus that he had indeed landed in America and contacted Native American Indians. Because it is a subjective journey, the only valid proof would be subjecting the farmer to the actual journey themselves. Otherwise everything else is invalid.\n\nScience doesn't yet fully recognize that psychonauts and shamans have each experienced the same journey and have interacted with the same entities.  At best, science refers to it as a 'shared hallucination'. At worst, just simply delusional!\n\n**HIGHER DIMENSION (HD):** An actual place which a metamego CAN re-visit. The direction from where our true self came. I feel this dimension has multiple layers to explore. The first being the neumenal realm.\n\n**THE HD REALMS**: Most hallucinations and 'psychedelic trips' take place within the lower realms aka 'The Neumenal'. Many [**trip reports**](http://www.shroomery.org/6255/Trip-Reports) cover experiences within this area. The 'MEGO' is incompatible with the higher dimension. There is an actual 'firewall' which prevents all 'MEGO'S' proceeding too far within the noumenal realm. Partial separation of beings (ego death) must occur for the METAMOGO to advance. This is often described as a [**Level 5+ Trip**](http://www.shroomery.org/73/Level-5/ru) and above.\n\n**CONSCIOUSNESS:** An area for ALL aspects of self to observe and interact with this dimension. A place where a human experiences the NOW. Psychologists and other academics enjoy breaking this area into sub sections and categories.\n\n**DEATH:** There are two types... \n\n* 1.) **Spiritual Reunion** is the separation of the higher being only. The spiritual tether is completely sheared and the 'soul' becomes free. This process bypasses the lower realms of the higher dimension. The spiritual self arrives at an unknown final location. However, the mammalian being continues to survive. Mego helps keep the body/vessel alive for as long as possible. This can be quite traumatic for other people to witness. Family members can suffer greatly through their everyday interaction and experience with this form of 'human'.\n\n* 2.) **Re-Birth / Re-Born** is the TOTAL separation of all three beings. The spiritual 'shearing' happens as described above. However, the mammalian tethering is also completely sheared. This 'lower being' either returns to an unknown dimension, a lower dimension, or it is re-hosted within this dimension. The mammalian vessel ceases to survive. Under appropriate and relatively normal circumstances, this transition should be celebrated.\n\nPersonal moments/memories can continue with the beings.\n\n~\n\n**PSYCHONAUT:** An individual who attempts to understand the conscious aspect of a human being. Some are actual explorers of being and therefore rely on the methods below.\n\n**PPT's:** 'Psychonautical Propulsion Techniques' - These allow you to travel further into the HD. The preparations or practices which help calm the mego and make it feel safe. Other techniques can increase the flexibility of the spiritual tethering, thereby producing a longer, more distant journey. \n\nOne example of a PPT, is comfortably (using candles and suitable music) relax in a hot shallow bath whilst subjecting yourself to the influence of a psychedelic.\n\n**MEDITATION:** A natural PPT for producing the chemicals necessary for parting the dimensional being from the mammalian being. A process of taming an ego and enlightening the soul. Takes practice and experience.\n\n**PSYCHEDELICS:** Are MEGOLYTIC - they help dissolve the mammalian ego. 'Psychs' offer a quicker process of separation but do have their own drawbacks (especially regarding the mego). The most promising discovery to date, is [**the DMT molecule**](https://www.youtube.com/watch?v=xJoZt4pck-U). It is frequently documented that DMT has the unique ability to 'propel' the soul into the 'middle' realms of the noumenal.\n\n**NARCOTICS:** Some compounds in certain doses reduce the influential 'MEGO', while [**most**](http://i.imgur.com/RjGyN2Q.jpg) have the opposite effect. For this reason, it is not recommended to mix any narcotic (inc alcohol) with a psychedelic. Doing so, will effect the separation of both beings, it will restrict the spiritual tethering and it will impede the overall journey, hence the expression 'bad trip'.\n\n**DMT/SALVIA:** This psychedelic appears to work quickly and powerfully on the dimensional being. Some psychonauts have reported [almost instant separation](https://www.youtube.com/watch?v=RNeDypj9rws). Under certain personal Earth settings, 'deemsters' have reported extremely flexible spiritual tethering within this new environment. Some have even experienced just seconds of 'travel' leading up to the elusive and distant 'breakthrough' area. Many people report that 'distant' sections of this new dimension appear more 'real' than our own. Some users have also experienced advanced non-verbal communications with caring, jovial entities.\n\n~\n\n**THE BRAIN:** A biological 'CPU' which operates using specific chemical compounds and electrical frequencies. The memory capacity (RAM) of a brain is zero. However, the brains ability to interface, not only with the body, but with an elusive dimensional 'energy' (**The Source**), is utterly incredible!\n\nMemories, moments, experiences and more, are somehow stored (source) and accessed (DPU) 'externally' through being and dimension.\n\n**NEURONS:** The neurons in our brain, are integral to our human experience... Is this the gateway/interface to where the elusive energy/dimension/source resides? Is the crystalline structure of DNA (within the neuron) acting as an antenna? Is the DNA interacting with the electricity that flows through? What do we not understand about electricity? - So many questions...\n\n**THE SOURCE:** An enigma which is somehow connected with dimension... A psychonauts ultimate quest is to discover and understand 'the source'. Within spirituality, the source is often referred to as The Akashic Records.\n\n**INDIVIDUALITY:** All character traits are achieved by utilizing the BRAIN to access and process a combination of BEING and SOURCE (BBS). It is a very complex system which I have foolishly attempted to simplify below...\n\n<>BODY<>BRAIN<>BEING<>SOURCE?\n\nExample...\n\n* Intelligence is how *efficiently* the brain **processes** information (via the beings) directly from source.\n* Recall is how *quickly* the brain **accesses** information (via the beings) directly from source.\n* Emotion is a **combination** but includes the body and a complex feedback loop.\n* Personality is a **complex combination** of all individual human traits and emotions.\n\nAll of the above must operate at an incredible speed.\n\n~\n\n**MEGO STRATEGIES:** In order to prevent true spiritual discovery, man and mego unfortunately need to manipulate and suppress humanity...\n\nMego primarily uses a defensive strategy. The strategy mainly revolves around the implementation of paranoia and the division of knowledge.\n\nThe attacking strategy concerns the careful control of evolution or 'enlightenment'. This sometimes requires the occasional regression of humanity. Evoking circumstances which herd humans towards relative primitivity. \n\nMany control systems are in place (religion, science, law, governance etc). And these systems are carefully monitored, maintained and enforced. It's all pretty amazing really! \n\nHere are some examples...\n\n**| [Fear of Attack](http://youtu.be/eur2GM-9C_s) | [Fear of Hell](https://www.youtube.com/watch?v=LkaH3hEmV3M) | [Fear of Judgement](http://youtu.be/wSOQcPJslJQ) | [Fear of Man Itself](http://youtu.be/PezlFNTGWv4) |**\n\n**| [Greed & Destruction](http://www.theguardian.com/environment/2014/sep/29/earth-lost-50-wildlife-in-40-years-wwf) | [Dominance over Others](https://www.youtube.com/watch?v=q7pzg9xpAOE) |**\n\nMore examples soon...\n\n~\n\n**MY OPINION:** For humanities sake, I feel it is of paramount importance that psychedelic research and spirituality becomes more prominent than religious and scientific zealotry. I feel strongly that future civilizations will benefit greatly when this current area of discovery isn't so taboo! \n\nThe fact that psychedelics are antisocial and illegal for the majority of humans, is evidence enough, that the MEGO is trying it's absolute hardest to survive and dominate over our dimensional being. Humanities natural evolution is being manipulated. The repercussions are causing severe hardship for the majority of our species and it is also detrimental to other life on this planet. If measures are not put in place, then the 'Battle of Being' could eventually impact the planet itself.\n\nFuture religious leaders, political decision makers and people of power, should require stringent testing on their overall humanity and being. More appropriate types should be applauded for their meditational and psychedelic experience. They should also be admired for their universal noumenal insight. \n\nThe ability to choose any of humanities directions, should be denied to all 'weighted' humans who are in favor of MEGODOM. Their ability to punish and control humanities dimensional being (in whatever way possible) should be removed! The regressive actions of a 'mego-leader', will prove that they and their 'group,' are primitively motivated by 'megotistical' desires. Any leader(s) failing this important scrutiny, should simply be deemed unfit for purpose! \n\n~\n\n**CONCLUSION:** MEGO is firmly in control of this dimension. Megotistical sociopaths should not be trusted with human and spiritual privileges. To this day, there exists an ancient battle between the beings.\n\nI hope you appreciate that my knowledge above, is a culmination of what I consider the best theories mixed in with a few new ideas. \n\nI hope you can benefit others with the information and maybe yourself.\n\nI will periodically update this post with more information and links.\n\nhttps://justpaste.it/tamingthemego",
  "gilded": 0,
  "score": 66,
  "removal_reason": null,
  "approved_by": null,
  "created_utc": 1411390690.0,
  "is_self": true,
  "stickied": false,
  "edited": 1425034758.0,
  "distinguished": null,
  "permalink": "https://www.reddit.com/r/Psychonaut/comments/2h4ain/humans_taming_the_mego_mammalian_ego/?ref=search_posts",
  "banned_by": null,
  "from_id": null,
  "likes": null,
  "_underscore_names": null,
  "num_reports": null,
  "link_flair_css_class": null,
  "_info_url": "https://api.reddit.com/api/info/",
  "id": "2h4ain",
  "archived": true,
  "secure_media": null,
  "from_kind": null,
  "saved": false,
  "domain": "self.Psychonaut",
  "ups": 66,
  "suggested_sort": null,
  "quarantine": false,
  "over_18": false,
  "hide_score": false,
  "url": "https://www.reddit.com/r/Psychonaut/comments/2h4ain/humans_taming_the_mego_mammalian_ego/",
  "subreddit_id": "t5_2qplv",
  "_params": {},
  "_comments": null,
  "_replaced_more": false,
  "_comments_by_id": {},
  "user_reports": [],
  "media_embed": {},
  "created": 1411390690.0,
  "author_flair_text": "& Hold On Tight",
  "visited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Introduction</strong></p>\n\n<p>I have been researching aspects of our species existence for quite some time. I reached some of my older conclusions as an atheist. Due to certain explanations and experiences given to me, I no longer consider myself the naive zealot that I used to be. I would currently describe myself as an exploring psychonaut, with a belief system based off &#39;agnostic spiritual pantheism&#39;.</p>\n\n<p>Before I commence, I would like to declare that I believe religion and spirituality (noumenality) to be very different. With this in mind, I would like to share an update of my own observations on life so far. It&#39;s quite a &#39;lengthy&#39; read, however please sit back, relax, open your mind to my freethinking information and enjoy. I welcome your opinions, and I invite you to present your own ideas concerning the following subjects... </p>\n\n<p><strong>| MEGO STRATEGIES | INDIVIDUALITY | THE SOURCE | NEURONS | THE BRAIN | DMT | NARCOTICS | PSYCHEDELICS | MEDITATION | PPT | PSYCHONAUT | DEATH | CONSCIOUSNESS | REALMS | HIGHER DIMENSION | DIMENSION | MEGO CAGING | MEGO TAMING | MEGO | ADVANCED MAMMALS | NOUMENALITY | RELIGIONS | CULTS | SOCIETIES | MANKIND |</strong></p>\n\n<p>~</p>\n\n<p><strong>HUMANS: Taming the MEGO</strong></p>\n\n<p>~</p>\n\n<p><strong>MANKIND:</strong> Objectively considering my agnostic research and utilizing evidence across the &#39;psychonautical board&#39;, I have concluded that it is logical (and necessary) to separate an individual human (and certain other mammals) into three &#39;<strong>tethered</strong>&#39; parts...</p>\n\n<ul>\n<li><p><strong>MAN</strong> (<em>The Mammalian Being</em>) - The primitive self | Ego aligns itself with man | &#39;<strong>MEGO</strong>&#39; (mammalian ego)</p></li>\n<li><p><strong>HUMAN</strong>  (<em>The Connected Being</em>) - The overlapping self | In Latin, Homo means man and Humus &#39;Born of the Earth&#39; | A region for discovering and experiencing life | <strong>Where the &#39;<a href=\"http://www.reddit.com/r/Psychonaut/comments/2a8mid/what_did_you_experience_your_1st_time_doing_magic/ciskn93\">MAN</a>&#39; and the &#39;SOUL&#39; meet.</strong></p></li>\n<li><p><strong>METAMEGO</strong> (<em>The Dimensional Being</em>) - The noumenal self | &#39;Soul/Spiritual&#39; | A higher form of &#39;existence&#39;.</p></li>\n</ul>\n\n<p>Other aspects of my research have concluded the following...</p>\n\n<p>~</p>\n\n<p><strong>RELIGIONS / CULTS / SOCIETIES:</strong> Can act as an organised franchise system for human control. They strategically promote a very limited knowledge of the higher dimensional &#39;energy&#39;. They can demand the strict practice of their own &#39;megotistical&#39; rules. Humans are required to conform to their basic understandings. False incentives include, further advanced knowledge and full access to the higher dimension. As punishment for subordination, followers are warned, that knowledge of being, and of the spiritual destination, will be violently removed or denied to them.</p>\n\n<p><strong>NOUMENALITY:</strong> Faith, belief or experience of a higher dimensional construct/reality. Desires access to open and non-conforming research. Very compatible with the higher echelons of the psychonaut community. </p>\n\n<p>~</p>\n\n<p><strong>ADVANCED MAMMALS:</strong> These types appear to have had (and still have) their natural evolution &#39;tinkered&#39; with. My research in this area is still ongoing and therefore undecided. Man (within the &#39;framework&#39; of evolution) is an enigma. They appear to have originated from an intelligent hybrid design.</p>\n\n<p><strong>MEGO:</strong> (Mammalian Ego) An important mechanism of the MAN. Ego demands and desires. It can be selfish and cruel! It&#39;s core &#39;primitive&#39; purpose is to allow our mammalian vessel to survive! | <a href=\"http://youtu.be/WfGMYdalClU\"><strong>&#39;MAN&#39;</strong></a></p>\n\n<p><a href=\"https://www.youtube.com/watch?v=bImdyQn43s8\"><strong>Eckhart Tolle</strong></a> describes it well, however he unfortunately <a href=\"https://www.youtube.com/watch?v=2kv0XhIbTYs\"><strong>confuses the ego with the mind</strong></a>. He doesn&#39;t associate it with a &#39;separate&#39; mammalian being. I believe that man (and therefore mego) are a part of our intelligent human hybrid creation.</p>\n\n<p><strong>MEGO TAMING:</strong> The process of reducing the influence of the mego...</p>\n\n<p>In combination with other <strong>PPTs</strong> (see below), this can also help prevent a &#39;bad psychedelic trip&#39;.  Mego taming affects the &#39;flexibility&#39; of the tethered soul. The increased &#39;elasticity&#39; of the spiritual tether allows you to comfortably travel further into the &#39;higher dimension&#39;. </p>\n\n<p><em>Are bad trips inevitable?</em> <a href=\"http://www.reddit.com/r/Psychonaut/comments/2hvp2k/bad_trips_mego_taming_and_the_story_of_sam_harris/\"><strong>Click Here for more information</strong></a></p>\n\n<p>On the other side of the &#39;spectrum&#39;, taming can also help integrate a destructive mego-centric human into society.</p>\n\n<p><strong>MEGO CAGING:</strong> The process of removing or restraining a severely ambushed human/mammal. The mego-centric/mego dominated being, has to have been unresponsive to mego taming. It is usually the last resort (jail) and is primarily for safety purposes.</p>\n\n<p>~</p>\n\n<p><strong>DIMENSION:</strong> An alternative reality and not a hallucinated reality. Currently, science can only analyze our own area of existence. Experimentation and analysis of other dimensions, can be performed only by Human consciousness. YOU ARE the only scientific apparatus available. Science confuses the concept by applying non applicable methods of evaluation. </p>\n\n<p>An analogy would be:- Spanish farmers who had never seen the ocean, requesting proof off Christopher Columbus that he had indeed landed in America and contacted Native American Indians. Because it is a subjective journey, the only valid proof would be subjecting the farmer to the actual journey themselves. Otherwise everything else is invalid.</p>\n\n<p>Science doesn&#39;t yet fully recognize that psychonauts and shamans have each experienced the same journey and have interacted with the same entities.  At best, science refers to it as a &#39;shared hallucination&#39;. At worst, just simply delusional!</p>\n\n<p><strong>HIGHER DIMENSION (HD):</strong> An actual place which a metamego CAN re-visit. The direction from where our true self came. I feel this dimension has multiple layers to explore. The first being the neumenal realm.</p>\n\n<p><strong>THE HD REALMS</strong>: Most hallucinations and &#39;psychedelic trips&#39; take place within the lower realms aka &#39;The Neumenal&#39;. Many <a href=\"http://www.shroomery.org/6255/Trip-Reports\"><strong>trip reports</strong></a> cover experiences within this area. The &#39;MEGO&#39; is incompatible with the higher dimension. There is an actual &#39;firewall&#39; which prevents all &#39;MEGO&#39;S&#39; proceeding too far within the noumenal realm. Partial separation of beings (ego death) must occur for the METAMOGO to advance. This is often described as a <a href=\"http://www.shroomery.org/73/Level-5/ru\"><strong>Level 5+ Trip</strong></a> and above.</p>\n\n<p><strong>CONSCIOUSNESS:</strong> An area for ALL aspects of self to observe and interact with this dimension. A place where a human experiences the NOW. Psychologists and other academics enjoy breaking this area into sub sections and categories.</p>\n\n<p><strong>DEATH:</strong> There are two types... </p>\n\n<ul>\n<li><p>1.) <strong>Spiritual Reunion</strong> is the separation of the higher being only. The spiritual tether is completely sheared and the &#39;soul&#39; becomes free. This process bypasses the lower realms of the higher dimension. The spiritual self arrives at an unknown final location. However, the mammalian being continues to survive. Mego helps keep the body/vessel alive for as long as possible. This can be quite traumatic for other people to witness. Family members can suffer greatly through their everyday interaction and experience with this form of &#39;human&#39;.</p></li>\n<li><p>2.) <strong>Re-Birth / Re-Born</strong> is the TOTAL separation of all three beings. The spiritual &#39;shearing&#39; happens as described above. However, the mammalian tethering is also completely sheared. This &#39;lower being&#39; either returns to an unknown dimension, a lower dimension, or it is re-hosted within this dimension. The mammalian vessel ceases to survive. Under appropriate and relatively normal circumstances, this transition should be celebrated.</p></li>\n</ul>\n\n<p>Personal moments/memories can continue with the beings.</p>\n\n<p>~</p>\n\n<p><strong>PSYCHONAUT:</strong> An individual who attempts to understand the conscious aspect of a human being. Some are actual explorers of being and therefore rely on the methods below.</p>\n\n<p><strong>PPT&#39;s:</strong> &#39;Psychonautical Propulsion Techniques&#39; - These allow you to travel further into the HD. The preparations or practices which help calm the mego and make it feel safe. Other techniques can increase the flexibility of the spiritual tethering, thereby producing a longer, more distant journey. </p>\n\n<p>One example of a PPT, is comfortably (using candles and suitable music) relax in a hot shallow bath whilst subjecting yourself to the influence of a psychedelic.</p>\n\n<p><strong>MEDITATION:</strong> A natural PPT for producing the chemicals necessary for parting the dimensional being from the mammalian being. A process of taming an ego and enlightening the soul. Takes practice and experience.</p>\n\n<p><strong>PSYCHEDELICS:</strong> Are MEGOLYTIC - they help dissolve the mammalian ego. &#39;Psychs&#39; offer a quicker process of separation but do have their own drawbacks (especially regarding the mego). The most promising discovery to date, is <a href=\"https://www.youtube.com/watch?v=xJoZt4pck-U\"><strong>the DMT molecule</strong></a>. It is frequently documented that DMT has the unique ability to &#39;propel&#39; the soul into the &#39;middle&#39; realms of the noumenal.</p>\n\n<p><strong>NARCOTICS:</strong> Some compounds in certain doses reduce the influential &#39;MEGO&#39;, while <a href=\"http://i.imgur.com/RjGyN2Q.jpg\"><strong>most</strong></a> have the opposite effect. For this reason, it is not recommended to mix any narcotic (inc alcohol) with a psychedelic. Doing so, will effect the separation of both beings, it will restrict the spiritual tethering and it will impede the overall journey, hence the expression &#39;bad trip&#39;.</p>\n\n<p><strong>DMT/SALVIA:</strong> This psychedelic appears to work quickly and powerfully on the dimensional being. Some psychonauts have reported <a href=\"https://www.youtube.com/watch?v=RNeDypj9rws\">almost instant separation</a>. Under certain personal Earth settings, &#39;deemsters&#39; have reported extremely flexible spiritual tethering within this new environment. Some have even experienced just seconds of &#39;travel&#39; leading up to the elusive and distant &#39;breakthrough&#39; area. Many people report that &#39;distant&#39; sections of this new dimension appear more &#39;real&#39; than our own. Some users have also experienced advanced non-verbal communications with caring, jovial entities.</p>\n\n<p>~</p>\n\n<p><strong>THE BRAIN:</strong> A biological &#39;CPU&#39; which operates using specific chemical compounds and electrical frequencies. The memory capacity (RAM) of a brain is zero. However, the brains ability to interface, not only with the body, but with an elusive dimensional &#39;energy&#39; (<strong>The Source</strong>), is utterly incredible!</p>\n\n<p>Memories, moments, experiences and more, are somehow stored (source) and accessed (DPU) &#39;externally&#39; through being and dimension.</p>\n\n<p><strong>NEURONS:</strong> The neurons in our brain, are integral to our human experience... Is this the gateway/interface to where the elusive energy/dimension/source resides? Is the crystalline structure of DNA (within the neuron) acting as an antenna? Is the DNA interacting with the electricity that flows through? What do we not understand about electricity? - So many questions...</p>\n\n<p><strong>THE SOURCE:</strong> An enigma which is somehow connected with dimension... A psychonauts ultimate quest is to discover and understand &#39;the source&#39;. Within spirituality, the source is often referred to as The Akashic Records.</p>\n\n<p><strong>INDIVIDUALITY:</strong> All character traits are achieved by utilizing the BRAIN to access and process a combination of BEING and SOURCE (BBS). It is a very complex system which I have foolishly attempted to simplify below...</p>\n\n<p>&lt;&gt;BODY&lt;&gt;BRAIN&lt;&gt;BEING&lt;&gt;SOURCE?</p>\n\n<p>Example...</p>\n\n<ul>\n<li>Intelligence is how <em>efficiently</em> the brain <strong>processes</strong> information (via the beings) directly from source.</li>\n<li>Recall is how <em>quickly</em> the brain <strong>accesses</strong> information (via the beings) directly from source.</li>\n<li>Emotion is a <strong>combination</strong> but includes the body and a complex feedback loop.</li>\n<li>Personality is a <strong>complex combination</strong> of all individual human traits and emotions.</li>\n</ul>\n\n<p>All of the above must operate at an incredible speed.</p>\n\n<p>~</p>\n\n<p><strong>MEGO STRATEGIES:</strong> In order to prevent true spiritual discovery, man and mego unfortunately need to manipulate and suppress humanity...</p>\n\n<p>Mego primarily uses a defensive strategy. The strategy mainly revolves around the implementation of paranoia and the division of knowledge.</p>\n\n<p>The attacking strategy concerns the careful control of evolution or &#39;enlightenment&#39;. This sometimes requires the occasional regression of humanity. Evoking circumstances which herd humans towards relative primitivity. </p>\n\n<p>Many control systems are in place (religion, science, law, governance etc). And these systems are carefully monitored, maintained and enforced. It&#39;s all pretty amazing really! </p>\n\n<p>Here are some examples...</p>\n\n<p><strong>| <a href=\"http://youtu.be/eur2GM-9C_s\">Fear of Attack</a> | <a href=\"https://www.youtube.com/watch?v=LkaH3hEmV3M\">Fear of Hell</a> | <a href=\"http://youtu.be/wSOQcPJslJQ\">Fear of Judgement</a> | <a href=\"http://youtu.be/PezlFNTGWv4\">Fear of Man Itself</a> |</strong></p>\n\n<p><strong>| <a href=\"http://www.theguardian.com/environment/2014/sep/29/earth-lost-50-wildlife-in-40-years-wwf\">Greed &amp; Destruction</a> | <a href=\"https://www.youtube.com/watch?v=q7pzg9xpAOE\">Dominance over Others</a> |</strong></p>\n\n<p>More examples soon...</p>\n\n<p>~</p>\n\n<p><strong>MY OPINION:</strong> For humanities sake, I feel it is of paramount importance that psychedelic research and spirituality becomes more prominent than religious and scientific zealotry. I feel strongly that future civilizations will benefit greatly when this current area of discovery isn&#39;t so taboo! </p>\n\n<p>The fact that psychedelics are antisocial and illegal for the majority of humans, is evidence enough, that the MEGO is trying it&#39;s absolute hardest to survive and dominate over our dimensional being. Humanities natural evolution is being manipulated. The repercussions are causing severe hardship for the majority of our species and it is also detrimental to other life on this planet. If measures are not put in place, then the &#39;Battle of Being&#39; could eventually impact the planet itself.</p>\n\n<p>Future religious leaders, political decision makers and people of power, should require stringent testing on their overall humanity and being. More appropriate types should be applauded for their meditational and psychedelic experience. They should also be admired for their universal noumenal insight. </p>\n\n<p>The ability to choose any of humanities directions, should be denied to all &#39;weighted&#39; humans who are in favor of MEGODOM. Their ability to punish and control humanities dimensional being (in whatever way possible) should be removed! The regressive actions of a &#39;mego-leader&#39;, will prove that they and their &#39;group,&#39; are primitively motivated by &#39;megotistical&#39; desires. Any leader(s) failing this important scrutiny, should simply be deemed unfit for purpose! </p>\n\n<p>~</p>\n\n<p><strong>CONCLUSION:</strong> MEGO is firmly in control of this dimension. Megotistical sociopaths should not be trusted with human and spiritual privileges. To this day, there exists an ancient battle between the beings.</p>\n\n<p>I hope you appreciate that my knowledge above, is a culmination of what I consider the best theories mixed in with a few new ideas. </p>\n\n<p>I hope you can benefit others with the information and maybe yourself.</p>\n\n<p>I will periodically update this post with more information and links.</p>\n\n<p><a href=\"https://justpaste.it/tamingthemego\">https://justpaste.it/tamingthemego</a></p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "_comment_sort": null,
  "report_reasons": null,
  "name": "t3_2h4ain",
  "from": null,
  "hidden": false,
  "clicked": false,
  "media": null,
  "json_dict": null,
  "_api_link": "https://api.reddit.com/r/Psychonaut/comments/2h4ain/humans_taming_the_mego_mammalian_ego/?ref=search_posts",
  "secure_media_embed": {},
  "mod_reports": [],
  "_orphaned": {},
  "_uniq": null,
  "num_comments": 124,
  "link_flair_text": null,
  "title": "Humans: Taming the MEGO (Mammalian Ego)",
  "_has_fetched": true,
  "author_flair_css_class": "",
  "thumbnail": "self"
}