{
  "selftext": "**EDIT**: Added a few more on the suggestion of others.\n\n**EDIT 2** I've decided to keep adding systems I happen to come across in the future to this list. \n\nSystems that seem to specialize in ship related parts and services:\n\n* **Vequess** - Kraken Shield Specialists \"Fly with the confidence of Kraken protection.\"\n\n* **Heget** - Devin Armor Specialists \"When a Ship isn't tough enough.\"\n\n* **Epsilon Hydri** - Drive tuning specialists - Draftworks Incorporated. \"To the limit - and beyond!\"\n\n* **Cockaigne** - Drive Performance Specialists (DPS) \"For the ultimate performance.\"\n\n* **Run** - Allen Flight Dynamics corporation \"Upgrade your controls to the perfect system.\"\n\n* **LTT 135** - JetForce Dynamics \"Getting you there with the power of air.\"\n\n* **Psi Octantis** - LURP Ship Systems \"Our range is everywhere.\"\n\n* **Eurybia** - Devastator & Sons \"Guaranteed devastation.\"\n\n* **Tau-1 Eridani** - Kinematic Armaments \"You want guns. We've got guns.\"\n\n* **Myrbat** - Blitz Weapon Stores \"All Calibres, all power ratings, one store!\"\n\n* **Thule** - Dead-Eye Defence Systems \"Power and laser tech for missions large and small.\"\n\n* **PLX 695** - In Depth Protection \"Countermeasures and military grade electronic warfare suites for those close encounters.\"\n\n* **Carcinus** - Auger Vision corporation. \"Specialist sensors for specialist jobs.\"\n\n* **Zeaex** - Fergate Plexi \"Get a clear view with Ferngate.\"\n\n* **Wolf 1323** - Hazardous Filtration Modules corporation \"Better and cleaner environments for your ship.\"\n\n* **Stafkarl** - Kelly Shipyards \"Every ship comes to us.\"\n\n* **LHS 1650 - Last Chance - funeral specialists \"We take care of you after the end.\"**\n\n\n\n\nThese will probably remain mere flavor text forever. But it would be great if these were to become relevant with future updates: \n\n* **LTT 606** - KD-Cox Spray Specialist \"For that personal look\"\n\n* **Euryale** - Colonial Drones corporation \"Affordable drone technology for all.\"\n\n* **LTT 911** - Callaghan Firearms corporation \"The most powerful handguns in the universe.\"\n\n* **Summerland** - Darkwater Inc. \"Keeping watch and keeping you safe\"\n\n* **DC-64 139** - Davies Station Services corporation \"Doing the impossible, one thing at a time.\"\n\n* **Chup Kamui** - Frost & King Transport \"We'll get it there\"\n\n* **70 Ophiuchi** - Lightspeed Accommodation \"Putting up with you for the night - or your money back!\"\n\n* **Pethes** - Bar Low Clothing consortium \"For the real you.\"\n\n* **Veroa** - Grant's \"Your spacewear - all in one place (onesie our speciality!)\"\n\n* **NLTT 9949** - Consolidated Plasma Corp. \"We fight fire with fire. Hotter Fire\"\n\n\n\nI'll file these under 'Other':\n\n* **Shinigami** - Magda are more famous for their stores and home delivery network but also control a number of key agricultural systems within the Empire. \"Low prices, high quality. All for you.\"\n\n* **Aztlan** - This favoured system is home to the central offices for the Doonnellan Healthcare, providers of healthcare throughout the Empire. \"Pamper and protect\"\n\n* **Olwain** - Cygnian Dream Entertainment \"Where the party never ends...\"\n\n* **Minerva** - Brewer Corp \"Looking down on worlds since 3100.\"\n\n* **CD-73 12** - Castro Management Group \"We bend over backwards, so you don't have to.\"\n\n* **Apam Napat** - JB Tax Accountants \"No numbers too real or imaginary.\"\n\n* **Te Uira** - Evans Computation Co-operative \"We're there when life is shaped like a pear.\n\n* **Munfayl** - CryMed Healthcare Systems \"Healthcare is our life as much as it is yours.\"\n\n* **Exigus** - Grant Academics \"We make learning easy.\"\n\n* **CD-70 1960** - J-Atack Fine Art Studios \"Traditional or modern, but always exquisite.\"\n\n* **Bolg** - ARG Explorer Ventures corporation \"Seeing far and seeing true.\"\n\n* **Artume** - Houlden Harmonics \"For that authentic sound.\"\n\nCredit to /u/Leprekawn for\n\n* **Baldr** - Gayan Melodies \"Music tailored for your needs\"\n\n\n\n\nAnd finally various flavor text-ed systems, some may be considered points of interest for curious Commanders:\n\n\n\n* **CD-73 253** - CD-73 253 is best known for the garbage world of Tarlak. Purchased by United Sanitec in 3284, it quickly became a major dumping ground for its sector of space. The population is mostly bonded corporate employees, a high percentage of which are refugees from Villist.\n\n* **Brohman** - Brohman was once a tourist destination for game hunters but with the extinction of the Jumbxta the prosperity evaporated. Villist Transfers grew from the planet's rebirth and came to dominate the Galactic network. The rebuild from the 'Battle of Villist' has drawn many craftsman and traders from around the galaxy.\n\n* **Gyton's Hope** - Gyton's Home was one of the first offoworld colonies to be established, and has since become a producer of high-tech goods, from fusion reactors and atmospheric processors to heavy weapons and shields.\n\n* **Kappa Fornacis** - This once quiet agricultural system has recently become known for the production of Onion Head.\n\n* **Kokimudji** - A trinary system which includes a brown dwarf star. It has a modest sized population whose favorite pastime is a local daily show called 'Tim's Adventures'. Visitors to the system rarely comprehend what the locals find so great about the show. The system supports a mixed industrial and extraction economy.\n\n* **Walka** - A  trinary system supporting extraction and industrial concerns. This system is governed by a brutal dictatorship and isn't the most welcoming place for traders.\n\n* **Lwalama** - A mildly complex system which includes three brown dwarfs. A single outdoor world supports a large population and agricultural economy. Industrial facilities can also be found here. Although generally a well ordered system a significant criminal element does exist.\n\n* **Prism** - Chione was a pleasant pastoral moon until the prism system was seized by the Loren ' Lineage' (an Imperial family distantly related to the ruling Duval Dynasty) in 3297. The system remains unstable at this time and traders are advised to proceed with caution.\n\n* **Saffron** - Last chip shop for 37 light years.\n\n* **Aymifa** - One of many Imperial Worlds that were terraformed during the last major Imperial expansion between 2950-3150, and there are numerous fine examples of architecture of he period.\n\nCredit to /u/Lockwert for\n\n* **Frog** - Named by mistake, this system is well known for its cybernetics.\n\nCredit to /u/CMDR_Puls_Ibmer for\n\n* **Van Maanen's Star** - This system was given to the Guardians of the Free Spirit religious sect by the Federation in 2480. They believe in maximum hardship and live underground on several of the inner planets of the system. It is forbidden by Federal Law to enter the system without the permission of the Guardians.\n\nand\n\n* **Zaonce** - This planet is tedious\n\nCredit to /u/unusually_typical for\n\n* **Eotienses** - Senator Denton Patreus has his home in this system.\n\n\n* **51 Arietis** - The prospecting team that discovered the system recognised the wealth inherent in its biospheres and sold the system claim to its current owner Hippoc Bioceuticals, for an exorbitant fee. The system is now a galactic centre for biological research and exports a wide range of hig-spec bio, chemical, and medical rpoducts. Due to the sensitive nature and value of the research being carried out, entry required a permit, and business is only conducted with trusted couriers.\n\n* **BD+24 543** - Know colloquially as 'Exec Central', this system hosts the regional headquarters of several companies and corporations who work in close collaboration under the name 'The Proteus Collective'. Unlike most corporate systems, there is rumored to be a lucrative trade in illegal goods, many high-tech. 'Unofficial' smuggling is not tolerated: termination is the only penalty.\n\n* **Wolf 1301** - One of the scrag ends of the galaxy.\n\n* **Toci** - a Centre for bio-industrial research. Rumored to have a thriving black market.\n\n* **Anlave** - High population outdoor world. Former Federation Navy headquarters.\n\n* **Nuakea** - This system became famous after Fozard Entertainment's release of their extensive back cataloge in 3298. \"150 years of entertainment.\"\n\n* **Cemiess** - The  system relies heavily on slavery to maintain the luxurious lifestyles of the very wealthy elite. Most live on the great plantations, common throughout the Imperial Worlds. The citie house the workers for the service industries and the more exotic entertainments.\n\n* **Facece** - Well Known Imperial Navy Base. Most Imperial naval administration is done on Topaz, and there are several outdoor training camps across the surface. Senator Anders Blain is the senator for this system and enjoys relative autonomy.\n\n* **Nat9481** - A young blue star with resource-rich plants, the discovery of this wealthy star system was named by Commander Dan Jameson with friend Nick Lindsey during a failed system jump.\n\n* **Eulexia** - A system with a single habitable Earth-like moon, Eurydice, in orbit about the ringed gas giant Tiamoia. it was discoverd by the Wagar expedition in 3264. The moon is designated as a site of exceptional beauty.\n\n* **Ross 128** - Prisoners are housed in underground cell complexes, and set to do manual mining work. Visitors are allowed, but an entry permit must first be obtained. There is a reputed to be a seedier side to the colony whereby lonely visitors may enter without a permit while the guards turn a blind eye for a fee, but this is always denied.\n\n* **Reddot** - The Reddot system is named after its red dwarf star. Other than Motherlode and Whit's Station, there is little in the system of worth or interest. It is reasonably close to Imperial and Federation space but not resource-rich enough to receive much in the way of interest from the governments, which of course makes it a prime place for pirates and other criminals to hang out in. It is alos quite close to a number of resource rich systems that are ripe for raiding.\n\n* **Fawaol** - Outdoor jungle world. Tourism and agriculture.\n\n* **Liabeze** - The deep and highly mechanised Imperial mines are renowned for their efficiency at ore extraction. Slavery is also important for the routine supervision of the machinery in the unpleasant mining environment.\n\n* **Delkar** - A small but successful Federal system. Several small corporate security firms are based here, offering data encryption consultancy services and private communication support.\n\n* **Atfero** - Senator Denton Patreus favors this system with his patronage..\n\n* **Zelano** - Senator Denton Patreus favors this system with his patronage..\n\n* **Burcasses** - Senator Denton Patreus favors this system with his patronage..\n\n* **Kitae** - A dangerous system which has seen the start of many pirates' careers. It's planetary system is comprised of a complex trinary planets which supports an industrial economy and a modest population.\n\n* **Phiagre** - System most famous for the giant Verrix. Stevenson is the home world of the hardy beast of burden now found throughout human space, especially on the emerging worlds of the outer rim.\n\n* **Momus Reach** - A disgraced ex-judge's retirement nest egg where he breeds the rare Bog Spaniel. Famed for its inability to hunt through water. it makes such lifelike duck calls that some interesting cross breeds are now being researched.\n\n* **B'Titus** - The end of the universe, or so the tone deaf inhabitants thought. They've turned this system into what they consider the party capital, celebrating each new day with a song and a jig. Visitor are routinely issued with earplugs to drown out the screeching.\n",
  "gilded": 1,
  "score": 98,
  "removal_reason": null,
  "approved_by": null,
  "created_utc": 1419733142.0,
  "is_self": true,
  "stickied": false,
  "edited": 1420972901.0,
  "distinguished": null,
  "permalink": "https://www.reddit.com/r/EliteDangerous/comments/2qkzqw/i_decided_to_spend_a_few_hours_searching_the/?ref=search_posts",
  "banned_by": null,
  "from_id": null,
  "likes": null,
  "_underscore_names": null,
  "num_reports": null,
  "link_flair_css_class": null,
  "_info_url": "https://api.reddit.com/api/info/",
  "id": "2qkzqw",
  "archived": true,
  "secure_media": null,
  "from_kind": null,
  "saved": false,
  "domain": "self.EliteDangerous",
  "ups": 98,
  "suggested_sort": null,
  "quarantine": false,
  "over_18": false,
  "hide_score": false,
  "url": "https://www.reddit.com/r/EliteDangerous/comments/2qkzqw/i_decided_to_spend_a_few_hours_searching_the/",
  "subreddit_id": "t5_2vi60",
  "_params": {},
  "_comments": null,
  "_replaced_more": false,
  "_comments_by_id": {},
  "user_reports": [],
  "media_embed": {},
  "created": 1419733142.0,
  "author_flair_text": null,
  "visited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>EDIT</strong>: Added a few more on the suggestion of others.</p>\n\n<p><strong>EDIT 2</strong> I&#39;ve decided to keep adding systems I happen to come across in the future to this list. </p>\n\n<p>Systems that seem to specialize in ship related parts and services:</p>\n\n<ul>\n<li><p><strong>Vequess</strong> - Kraken Shield Specialists &quot;Fly with the confidence of Kraken protection.&quot;</p></li>\n<li><p><strong>Heget</strong> - Devin Armor Specialists &quot;When a Ship isn&#39;t tough enough.&quot;</p></li>\n<li><p><strong>Epsilon Hydri</strong> - Drive tuning specialists - Draftworks Incorporated. &quot;To the limit - and beyond!&quot;</p></li>\n<li><p><strong>Cockaigne</strong> - Drive Performance Specialists (DPS) &quot;For the ultimate performance.&quot;</p></li>\n<li><p><strong>Run</strong> - Allen Flight Dynamics corporation &quot;Upgrade your controls to the perfect system.&quot;</p></li>\n<li><p><strong>LTT 135</strong> - JetForce Dynamics &quot;Getting you there with the power of air.&quot;</p></li>\n<li><p><strong>Psi Octantis</strong> - LURP Ship Systems &quot;Our range is everywhere.&quot;</p></li>\n<li><p><strong>Eurybia</strong> - Devastator &amp; Sons &quot;Guaranteed devastation.&quot;</p></li>\n<li><p><strong>Tau-1 Eridani</strong> - Kinematic Armaments &quot;You want guns. We&#39;ve got guns.&quot;</p></li>\n<li><p><strong>Myrbat</strong> - Blitz Weapon Stores &quot;All Calibres, all power ratings, one store!&quot;</p></li>\n<li><p><strong>Thule</strong> - Dead-Eye Defence Systems &quot;Power and laser tech for missions large and small.&quot;</p></li>\n<li><p><strong>PLX 695</strong> - In Depth Protection &quot;Countermeasures and military grade electronic warfare suites for those close encounters.&quot;</p></li>\n<li><p><strong>Carcinus</strong> - Auger Vision corporation. &quot;Specialist sensors for specialist jobs.&quot;</p></li>\n<li><p><strong>Zeaex</strong> - Fergate Plexi &quot;Get a clear view with Ferngate.&quot;</p></li>\n<li><p><strong>Wolf 1323</strong> - Hazardous Filtration Modules corporation &quot;Better and cleaner environments for your ship.&quot;</p></li>\n<li><p><strong>Stafkarl</strong> - Kelly Shipyards &quot;Every ship comes to us.&quot;</p></li>\n<li><p><strong>LHS 1650 - Last Chance - funeral specialists &quot;We take care of you after the end.&quot;</strong></p></li>\n</ul>\n\n<p>These will probably remain mere flavor text forever. But it would be great if these were to become relevant with future updates: </p>\n\n<ul>\n<li><p><strong>LTT 606</strong> - KD-Cox Spray Specialist &quot;For that personal look&quot;</p></li>\n<li><p><strong>Euryale</strong> - Colonial Drones corporation &quot;Affordable drone technology for all.&quot;</p></li>\n<li><p><strong>LTT 911</strong> - Callaghan Firearms corporation &quot;The most powerful handguns in the universe.&quot;</p></li>\n<li><p><strong>Summerland</strong> - Darkwater Inc. &quot;Keeping watch and keeping you safe&quot;</p></li>\n<li><p><strong>DC-64 139</strong> - Davies Station Services corporation &quot;Doing the impossible, one thing at a time.&quot;</p></li>\n<li><p><strong>Chup Kamui</strong> - Frost &amp; King Transport &quot;We&#39;ll get it there&quot;</p></li>\n<li><p><strong>70 Ophiuchi</strong> - Lightspeed Accommodation &quot;Putting up with you for the night - or your money back!&quot;</p></li>\n<li><p><strong>Pethes</strong> - Bar Low Clothing consortium &quot;For the real you.&quot;</p></li>\n<li><p><strong>Veroa</strong> - Grant&#39;s &quot;Your spacewear - all in one place (onesie our speciality!)&quot;</p></li>\n<li><p><strong>NLTT 9949</strong> - Consolidated Plasma Corp. &quot;We fight fire with fire. Hotter Fire&quot;</p></li>\n</ul>\n\n<p>I&#39;ll file these under &#39;Other&#39;:</p>\n\n<ul>\n<li><p><strong>Shinigami</strong> - Magda are more famous for their stores and home delivery network but also control a number of key agricultural systems within the Empire. &quot;Low prices, high quality. All for you.&quot;</p></li>\n<li><p><strong>Aztlan</strong> - This favoured system is home to the central offices for the Doonnellan Healthcare, providers of healthcare throughout the Empire. &quot;Pamper and protect&quot;</p></li>\n<li><p><strong>Olwain</strong> - Cygnian Dream Entertainment &quot;Where the party never ends...&quot;</p></li>\n<li><p><strong>Minerva</strong> - Brewer Corp &quot;Looking down on worlds since 3100.&quot;</p></li>\n<li><p><strong>CD-73 12</strong> - Castro Management Group &quot;We bend over backwards, so you don&#39;t have to.&quot;</p></li>\n<li><p><strong>Apam Napat</strong> - JB Tax Accountants &quot;No numbers too real or imaginary.&quot;</p></li>\n<li><p><strong>Te Uira</strong> - Evans Computation Co-operative &quot;We&#39;re there when life is shaped like a pear.</p></li>\n<li><p><strong>Munfayl</strong> - CryMed Healthcare Systems &quot;Healthcare is our life as much as it is yours.&quot;</p></li>\n<li><p><strong>Exigus</strong> - Grant Academics &quot;We make learning easy.&quot;</p></li>\n<li><p><strong>CD-70 1960</strong> - J-Atack Fine Art Studios &quot;Traditional or modern, but always exquisite.&quot;</p></li>\n<li><p><strong>Bolg</strong> - ARG Explorer Ventures corporation &quot;Seeing far and seeing true.&quot;</p></li>\n<li><p><strong>Artume</strong> - Houlden Harmonics &quot;For that authentic sound.&quot;</p></li>\n</ul>\n\n<p>Credit to <a href=\"/u/Leprekawn\">/u/Leprekawn</a> for</p>\n\n<ul>\n<li><strong>Baldr</strong> - Gayan Melodies &quot;Music tailored for your needs&quot;</li>\n</ul>\n\n<p>And finally various flavor text-ed systems, some may be considered points of interest for curious Commanders:</p>\n\n<ul>\n<li><p><strong>CD-73 253</strong> - CD-73 253 is best known for the garbage world of Tarlak. Purchased by United Sanitec in 3284, it quickly became a major dumping ground for its sector of space. The population is mostly bonded corporate employees, a high percentage of which are refugees from Villist.</p></li>\n<li><p><strong>Brohman</strong> - Brohman was once a tourist destination for game hunters but with the extinction of the Jumbxta the prosperity evaporated. Villist Transfers grew from the planet&#39;s rebirth and came to dominate the Galactic network. The rebuild from the &#39;Battle of Villist&#39; has drawn many craftsman and traders from around the galaxy.</p></li>\n<li><p><strong>Gyton&#39;s Hope</strong> - Gyton&#39;s Home was one of the first offoworld colonies to be established, and has since become a producer of high-tech goods, from fusion reactors and atmospheric processors to heavy weapons and shields.</p></li>\n<li><p><strong>Kappa Fornacis</strong> - This once quiet agricultural system has recently become known for the production of Onion Head.</p></li>\n<li><p><strong>Kokimudji</strong> - A trinary system which includes a brown dwarf star. It has a modest sized population whose favorite pastime is a local daily show called &#39;Tim&#39;s Adventures&#39;. Visitors to the system rarely comprehend what the locals find so great about the show. The system supports a mixed industrial and extraction economy.</p></li>\n<li><p><strong>Walka</strong> - A  trinary system supporting extraction and industrial concerns. This system is governed by a brutal dictatorship and isn&#39;t the most welcoming place for traders.</p></li>\n<li><p><strong>Lwalama</strong> - A mildly complex system which includes three brown dwarfs. A single outdoor world supports a large population and agricultural economy. Industrial facilities can also be found here. Although generally a well ordered system a significant criminal element does exist.</p></li>\n<li><p><strong>Prism</strong> - Chione was a pleasant pastoral moon until the prism system was seized by the Loren &#39; Lineage&#39; (an Imperial family distantly related to the ruling Duval Dynasty) in 3297. The system remains unstable at this time and traders are advised to proceed with caution.</p></li>\n<li><p><strong>Saffron</strong> - Last chip shop for 37 light years.</p></li>\n<li><p><strong>Aymifa</strong> - One of many Imperial Worlds that were terraformed during the last major Imperial expansion between 2950-3150, and there are numerous fine examples of architecture of he period.</p></li>\n</ul>\n\n<p>Credit to <a href=\"/u/Lockwert\">/u/Lockwert</a> for</p>\n\n<ul>\n<li><strong>Frog</strong> - Named by mistake, this system is well known for its cybernetics.</li>\n</ul>\n\n<p>Credit to <a href=\"/u/CMDR_Puls_Ibmer\">/u/CMDR_Puls_Ibmer</a> for</p>\n\n<ul>\n<li><strong>Van Maanen&#39;s Star</strong> - This system was given to the Guardians of the Free Spirit religious sect by the Federation in 2480. They believe in maximum hardship and live underground on several of the inner planets of the system. It is forbidden by Federal Law to enter the system without the permission of the Guardians.</li>\n</ul>\n\n<p>and</p>\n\n<ul>\n<li><strong>Zaonce</strong> - This planet is tedious</li>\n</ul>\n\n<p>Credit to <a href=\"/u/unusually_typical\">/u/unusually_typical</a> for</p>\n\n<ul>\n<li><p><strong>Eotienses</strong> - Senator Denton Patreus has his home in this system.</p></li>\n<li><p><strong>51 Arietis</strong> - The prospecting team that discovered the system recognised the wealth inherent in its biospheres and sold the system claim to its current owner Hippoc Bioceuticals, for an exorbitant fee. The system is now a galactic centre for biological research and exports a wide range of hig-spec bio, chemical, and medical rpoducts. Due to the sensitive nature and value of the research being carried out, entry required a permit, and business is only conducted with trusted couriers.</p></li>\n<li><p><strong>BD+24 543</strong> - Know colloquially as &#39;Exec Central&#39;, this system hosts the regional headquarters of several companies and corporations who work in close collaboration under the name &#39;The Proteus Collective&#39;. Unlike most corporate systems, there is rumored to be a lucrative trade in illegal goods, many high-tech. &#39;Unofficial&#39; smuggling is not tolerated: termination is the only penalty.</p></li>\n<li><p><strong>Wolf 1301</strong> - One of the scrag ends of the galaxy.</p></li>\n<li><p><strong>Toci</strong> - a Centre for bio-industrial research. Rumored to have a thriving black market.</p></li>\n<li><p><strong>Anlave</strong> - High population outdoor world. Former Federation Navy headquarters.</p></li>\n<li><p><strong>Nuakea</strong> - This system became famous after Fozard Entertainment&#39;s release of their extensive back cataloge in 3298. &quot;150 years of entertainment.&quot;</p></li>\n<li><p><strong>Cemiess</strong> - The  system relies heavily on slavery to maintain the luxurious lifestyles of the very wealthy elite. Most live on the great plantations, common throughout the Imperial Worlds. The citie house the workers for the service industries and the more exotic entertainments.</p></li>\n<li><p><strong>Facece</strong> - Well Known Imperial Navy Base. Most Imperial naval administration is done on Topaz, and there are several outdoor training camps across the surface. Senator Anders Blain is the senator for this system and enjoys relative autonomy.</p></li>\n<li><p><strong>Nat9481</strong> - A young blue star with resource-rich plants, the discovery of this wealthy star system was named by Commander Dan Jameson with friend Nick Lindsey during a failed system jump.</p></li>\n<li><p><strong>Eulexia</strong> - A system with a single habitable Earth-like moon, Eurydice, in orbit about the ringed gas giant Tiamoia. it was discoverd by the Wagar expedition in 3264. The moon is designated as a site of exceptional beauty.</p></li>\n<li><p><strong>Ross 128</strong> - Prisoners are housed in underground cell complexes, and set to do manual mining work. Visitors are allowed, but an entry permit must first be obtained. There is a reputed to be a seedier side to the colony whereby lonely visitors may enter without a permit while the guards turn a blind eye for a fee, but this is always denied.</p></li>\n<li><p><strong>Reddot</strong> - The Reddot system is named after its red dwarf star. Other than Motherlode and Whit&#39;s Station, there is little in the system of worth or interest. It is reasonably close to Imperial and Federation space but not resource-rich enough to receive much in the way of interest from the governments, which of course makes it a prime place for pirates and other criminals to hang out in. It is alos quite close to a number of resource rich systems that are ripe for raiding.</p></li>\n<li><p><strong>Fawaol</strong> - Outdoor jungle world. Tourism and agriculture.</p></li>\n<li><p><strong>Liabeze</strong> - The deep and highly mechanised Imperial mines are renowned for their efficiency at ore extraction. Slavery is also important for the routine supervision of the machinery in the unpleasant mining environment.</p></li>\n<li><p><strong>Delkar</strong> - A small but successful Federal system. Several small corporate security firms are based here, offering data encryption consultancy services and private communication support.</p></li>\n<li><p><strong>Atfero</strong> - Senator Denton Patreus favors this system with his patronage..</p></li>\n<li><p><strong>Zelano</strong> - Senator Denton Patreus favors this system with his patronage..</p></li>\n<li><p><strong>Burcasses</strong> - Senator Denton Patreus favors this system with his patronage..</p></li>\n<li><p><strong>Kitae</strong> - A dangerous system which has seen the start of many pirates&#39; careers. It&#39;s planetary system is comprised of a complex trinary planets which supports an industrial economy and a modest population.</p></li>\n<li><p><strong>Phiagre</strong> - System most famous for the giant Verrix. Stevenson is the home world of the hardy beast of burden now found throughout human space, especially on the emerging worlds of the outer rim.</p></li>\n<li><p><strong>Momus Reach</strong> - A disgraced ex-judge&#39;s retirement nest egg where he breeds the rare Bog Spaniel. Famed for its inability to hunt through water. it makes such lifelike duck calls that some interesting cross breeds are now being researched.</p></li>\n<li><p><strong>B&#39;Titus</strong> - The end of the universe, or so the tone deaf inhabitants thought. They&#39;ve turned this system into what they consider the party capital, celebrating each new day with a song and a jig. Visitor are routinely issued with earplugs to drown out the screeching.</p></li>\n</ul>\n</div><!-- SC_ON -->",
  "downs": 0,
  "_comment_sort": null,
  "report_reasons": null,
  "name": "t3_2qkzqw",
  "from": null,
  "hidden": false,
  "clicked": false,
  "media": null,
  "json_dict": null,
  "_api_link": "https://api.reddit.com/r/EliteDangerous/comments/2qkzqw/i_decided_to_spend_a_few_hours_searching_the/?ref=search_posts",
  "secure_media_embed": {},
  "mod_reports": [],
  "_orphaned": {},
  "_uniq": null,
  "num_comments": 40,
  "link_flair_text": null,
  "title": "I decided to spend a few hours searching the galaxy map for special systems and points of interest. Here's what I found.",
  "_has_fetched": true,
  "author_flair_css_class": null,
  "thumbnail": "self"
}