{
  "downs": 0,
  "mod_reports": [],
  "secure_media_embed": {},
  "_info_url": "https://api.reddit.com/api/info/",
  "gilded": 0,
  "num_comments": 654,
  "_orphaned": {},
  "hidden": false,
  "ups": 1385,
  "url": "https://www.reddit.com/r/magicTCG/comments/3m2ltv/channel_fireball_buries_article_critical_of/",
  "_has_fetched": true,
  "quarantine": false,
  "name": "t3_3m2ltv",
  "user_reports": [],
  "saved": false,
  "permalink": "https://www.reddit.com/r/magicTCG/comments/3m2ltv/channel_fireball_buries_article_critical_of/?ref=search_posts",
  "over_18": false,
  "is_self": true,
  "_params": {},
  "thumbnail": "",
  "created_utc": 1443019795.0,
  "_replaced_more": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>On the 21st of September Channel Fireball published an article by Paulo Vitor Damo da Rosa entitled &quot;<a href=\"http://www.channelfireball.com/articles/everything-thats-wrong-with-battle-for-zendikar/\">Everything That’s Wrong with Battle for Zendikar</a>&quot;.  This article generated a lot of discussion on reddit, with an <a href=\"https://www.reddit.com/r/magicTCG/comments/3lwcaa/everything_thats_wrong_with_battle_for_zendikar/\">eight hundred comment thread discussing it</a>.  Publishing this article was an interesting, and admirable, decision given that the sale of Magic cards is (presumably) Channel Fireball&#39;s primary source of income.  Airing Paulo&#39;s negative (but completely civil and eloquently reasoned) opinion suggested that Channel Fireball was willing to prioritise honest criticism over self serving hype.  Their subsequent actions have seriously undermined this impression.</p>\n\n<p>The most obvious part of this about-face was publishing an article by Travis Woo entitled &quot;<a href=\"http://www.channelfireball.com/articles/8-reasons-to-be-excited-about-battle-for-zendikar/\">8 Reasons to Be Excited About Battle for Zendikar</a>&quot; the day after Paulo&#39;s article.  Presenting different perspectives is not unreasonable but the speed of this response, and the fact that it makes no mention of Paulo&#39;s article, suggests damage control. </p>\n\n<p>More duplicitous, however, were the actions deemphasising Paulo&#39;s article.  Firstly the date of the article&#39;s publication was changed to September 16th, almost certainly in order to move it off the front page of Channel Fireball&#39;s website without drawing further attention.  The article was actually published on September 21st, as is obvious when the comments are examined: there are over a hundred comments, all from September 21st or later.  Further evidence is in the date it was listed by <a href=\"http://www.readmtg.com/channelfireball/everything-thats-wrong-with-battle-for-zendikar/\">this aggregator</a>.  In addition all reference to the article was scoured from Channel Fireball&#39;s twitter (<a href=\"http://imgur.com/jpayJl4\">before</a>, from cache, and <a href=\"https://twitter.com/ChannelFireball\">current</a>) and presumably facebook (at the very least there is no link to it on Channel Fireball&#39;s facebook currently).</p>\n\n<p>These actions combined suggest a serious intent to limit the spread of the article whilst avoiding any appearance of doing so.  The editing of the publication date feels particularly concerning to me in its dishonesty.  The public response to the article was generally on the spectrum from civil disagreement to positive; so that seems unlikely to be the cause of this action.  The implication, then, is that someone above the day to day article process stepped in to kill the article when they read it.  This could potentially be someone higher up at Channel Fireball or even someone at Wizards of the Coast exerting influence.</p>\n\n<p>The upshot of this is that it will be very difficult to trust Channel Fireball for honest reviews in the future.  Presumably the next negative article won&#39;t be published and then hidden, instead it will never be published at all.  Perhaps it is naive to expect honesty from a vested interest but Paulo&#39;s article suggested it was possible.  Channel Fireball&#39;s subsequent actions imply otherwise.  It is difficult to know how to respond to this, given that Channel Fireball is likely doing clumsily what others do slickly.  You can end up punishing poorly disguised dishonestly rather than the well hidden variety.  Perhaps this can simply serve as a reminder that honest criticism may well be a secondary consideration to selling Magic and staying on the good side of Wizards of the Coast, not only for Channel Fireball but for many sites.</p>\n</div><!-- SC_ON -->",
  "subreddit_id": "t5_2qn5f",
  "archived": false,
  "domain": "self.magicTCG",
  "clicked": false,
  "score": 1385,
  "id": "3m2ltv",
  "stickied": false,
  "media_embed": {},
  "visited": false,
  "selftext": "On the 21st of September Channel Fireball published an article by Paulo Vitor Damo da Rosa entitled \"[Everything That’s Wrong with Battle for Zendikar]( http://www.channelfireball.com/articles/everything-thats-wrong-with-battle-for-zendikar/)\".  This article generated a lot of discussion on reddit, with an [eight hundred comment thread discussing it]( https://www.reddit.com/r/magicTCG/comments/3lwcaa/everything_thats_wrong_with_battle_for_zendikar/).  Publishing this article was an interesting, and admirable, decision given that the sale of Magic cards is (presumably) Channel Fireball's primary source of income.  Airing Paulo's negative (but completely civil and eloquently reasoned) opinion suggested that Channel Fireball was willing to prioritise honest criticism over self serving hype.  Their subsequent actions have seriously undermined this impression.\n\nThe most obvious part of this about-face was publishing an article by Travis Woo entitled \"[8 Reasons to Be Excited About Battle for Zendikar]( http://www.channelfireball.com/articles/8-reasons-to-be-excited-about-battle-for-zendikar/)\" the day after Paulo's article.  Presenting different perspectives is not unreasonable but the speed of this response, and the fact that it makes no mention of Paulo's article, suggests damage control. \n\nMore duplicitous, however, were the actions deemphasising Paulo's article.  Firstly the date of the article's publication was changed to September 16th, almost certainly in order to move it off the front page of Channel Fireball's website without drawing further attention.  The article was actually published on September 21st, as is obvious when the comments are examined: there are over a hundred comments, all from September 21st or later.  Further evidence is in the date it was listed by [this aggregator]( http://www.readmtg.com/channelfireball/everything-thats-wrong-with-battle-for-zendikar/).  In addition all reference to the article was scoured from Channel Fireball's twitter ([before]( http://imgur.com/jpayJl4), from cache, and [current]( https://twitter.com/ChannelFireball)) and presumably facebook (at the very least there is no link to it on Channel Fireball's facebook currently).\n\nThese actions combined suggest a serious intent to limit the spread of the article whilst avoiding any appearance of doing so.  The editing of the publication date feels particularly concerning to me in its dishonesty.  The public response to the article was generally on the spectrum from civil disagreement to positive; so that seems unlikely to be the cause of this action.  The implication, then, is that someone above the day to day article process stepped in to kill the article when they read it.  This could potentially be someone higher up at Channel Fireball or even someone at Wizards of the Coast exerting influence.\n\nThe upshot of this is that it will be very difficult to trust Channel Fireball for honest reviews in the future.  Presumably the next negative article won't be published and then hidden, instead it will never be published at all.  Perhaps it is naive to expect honesty from a vested interest but Paulo's article suggested it was possible.  Channel Fireball's subsequent actions imply otherwise.  It is difficult to know how to respond to this, given that Channel Fireball is likely doing clumsily what others do slickly.  You can end up punishing poorly disguised dishonestly rather than the well hidden variety.  Perhaps this can simply serve as a reminder that honest criticism may well be a secondary consideration to selling Magic and staying on the good side of Wizards of the Coast, not only for Channel Fireball but for many sites.\n",
  "hide_score": false,
  "_api_link": "https://api.reddit.com/r/magicTCG/comments/3m2ltv/channel_fireball_buries_article_critical_of/?ref=search_posts",
  "locked": false,
  "edited": 1443019965.0,
  "title": "Channel Fireball buries article critical of Battle for Zendikar",
  "created": 1443023395.0,
  "_comments_by_id": {}
}