{
  "downs": 0,
  "mod_reports": [],
  "secure_media_embed": {},
  "_info_url": "https://api.reddit.com/api/info/",
  "gilded": 1,
  "num_comments": 40,
  "_orphaned": {},
  "hidden": false,
  "ups": 21,
  "url": "https://www.reddit.com/r/USMCboot/comments/3c7xsi/ocs_retrospective_from_a_2015_plcseniorsnrotc/",
  "_has_fetched": true,
  "quarantine": false,
  "name": "t3_3c7xsi",
  "author_flair_text": "Boot",
  "user_reports": [],
  "saved": false,
  "permalink": "https://www.reddit.com/r/USMCboot/comments/3c7xsi/ocs_retrospective_from_a_2015_plcseniorsnrotc/?ref=search_posts",
  "over_18": false,
  "is_self": true,
  "_params": {},
  "thumbnail": "self",
  "created_utc": 1436126941.0,
  "_replaced_more": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Two days ago, I graduated from the combined PLC-Seniors/NROTC 6 week program at OCS (Lima Co, 4th Plt). The intent of this writing is to provide a detailed and accurate retelling of the experience to give future candidates an idea of what to expect. I won&#39;t give any information that could provide an unfair advantage, so any future candidates looking for descriptions of the tasks in the LRCs or SULEs, for example, you&#39;re out of luck. That said, this is also to help preserve my own memories of the training (the first 3 weeks or so are already a blur to me, partly due to suppression, mostly because they were so fast-paced), so it will be a detailed narration and not just a list of major events.</p>\n\n<p>Week 1: </p>\n\n<p>If flying, you&#39;ll arrive at Ronald Reagan National Airport and go to a cordoned off terminal to sit and wait for the troop handlers (a few SNCOs and NCOs from H&amp;amp;S Company). Don&#39;t worry about getting lost. You&#39;ll see a bunch of other twentysomething kids in polo shirts, khaki pants, and dress shoes with GI seabags and tactical backpacks all heading the same way. The troop handlers will call roll, put you into lines, and stuff you onto white buses for the hour long ride to Quantico. Few people, if at all, will be talking. Honestly, you could cut the tension with a butter knife. However, there was really no reason at this point to be nervous. Week 1 consists of moving into the barracks (either Graham or Skinner Hall), paperwork, medical examinations, gear issue, paperwork, marking/organizing said gear, getting your head completely buzzed, small/large bag issue, paperwork, and waiting in long lines. I would honestly have to say that Week 1 was the worst week of OCS because of all the waiting around. The only time that the monotony was broken was for the initial PFT (in which I ran a 19/100/20:35) and the intro to table PT (running around the PT table doing arm circles, high knees, butt kicks, etc.). By pick-up day we were all ready for the training to just start already. </p>\n\n<p>Pick-up is on Friday. The troop handlers march you to Yeckel Hall (the classrooms), the CO gives you a speech on what he expects out of you as candidates (teamwork, resilience, physical and moral courage, integrity, etc), and the Company Commander marches your platoon staff out of the back room. He&#39;ll instruct the Platoon Sergeants and Sergeant Instructors to take charge of their platoons and carry out the training schedule and the fun begins. The SIs will scream at you to get out of the classroom and outside, pick up your packs (which will be staged out there beforehand), and run back to the barracks in formation. They&#39;ll be blasting you nonstop, but as long as you&#39;re moving fast and sounding off you&#39;ll be fine. Back in the barracks they&#39;ll assign you to your racks, you&#39;ll dump all issued gear out of your main packs so they can take inventory, and for the most part it&#39;s just games (holding main packs out in front, over your heads, etc. Just don&#39;t be a bitch.)</p>\n\n<p>Rifle issue is Saturday. The rifles are M16A4s with the carry handle, despite your Mickey Mouse towels having the RCO on the outline for the upper receiver. Memorize your rifle&#39;s serial number now; you will need to know it for inspections later on. You&#39;ll also be issued cleaning gear that goes in the buttstock (there&#39;s a little door on the back that opens up). It&#39;s trash, for the most part. Prior to OCS, I bought a steel brush and a boresnake and they paid big dividends when I wasn&#39;t struggling to use the shitty metal brush or barrel brush.</p>\n\n<p>On Sunday you&#39;ll run a buddy pair assault course just to get familiar with going from condition 4 to 3, to 1, back to 4, etc and the concept of fire and maneuver.</p>\n\n<p>Week 2:</p>\n\n<p>The general daily schedule is as follows.</p>\n\n<p>0300-0400: Wake up and study/prep gear</p>\n\n<p>0500: Lights</p>\n\n<p>0550: PT</p>\n\n<p>0715: Chow</p>\n\n<p>0800: Class</p>\n\n<p>1100: Chow</p>\n\n<p>1200: Class</p>\n\n<p>1430: Drill or Commander&#39;s Time</p>\n\n<p>1700: Chow</p>\n\n<p>1800: Drill or Commander&#39;s Time</p>\n\n<p>2000: Hygiene/prayer</p>\n\n<p>2100: Lights out</p>\n\n<p>2110: Allowed out of the racks to hygiene, mark gear, study, do pull-ups</p>\n\n<p>The platoon will be organized into admin squads and fire teams by last name alphabetical order. Candidate company commander, company executive officer, company first sergeant, and company gunnery sergeant are chosen by the company staff and posted a few days in advance. Candidate platoon commander, platoon sergeant, platoon guide, and squad leaders are chosen by the platoon staff and posted the night before billet rotation (every 2 days). Fire team leaders are chosen by the squad leaders. For Weeks 2 and 3, however, the actual platoon staff will be running things, and it sucks because that involves getting counted down, holding packs over your heads or straight out in front of you, running and touching trees, or just yelling &quot;Aye, aye, Staff Sergeant!&quot; 5-6 times in a row. Your voices will likely be hoarse. One of the days during platoon commander&#39;s time, you&#39;ll have to do a self-introduction in which you talk about yourself for 2 minutes. The criteria was pretty much your name, where you&#39;re from, what school you go to, if you have family who served, why you want to be an officer of Marines, what MOS you hope to get, and who inspires you as a leader.</p>\n\n<p>The first graded event was the initial comprehensive exam which covers all the subjects that PLC Juniors or your first 3 years of NROTC should have taught you. I say &quot;should&quot; because there were many things I straight-up did not know. One of the themes of the exams throughout the course that I found truly puzzling and annoying was that several questions were on extremely minute details and several were complete no-brainers.</p>\n\n<p>Week 3:</p>\n\n<p>This week includes the night land nav prac app and test where you&#39;re given a brief class and then sent out on the course. I CANNOT overstate how dark it is out there. You can be standing literally 2 feet from your box and not see it, so this is a skill you need to make sure you have down pat before you leave. You&#39;re not allowed to use any light source, so what many of us did was buy neon yellow index cards, wrap them in clear packing tape, and write our azimuths and distances on that with sharpie. I hit all 4 of my points correctly, but many people only got 2 or 3 of their points. ENSURE that your compass is secure in your pouch before reporting to an evaluator! Many people failed a point or two because of that, and you can only miss one and still pass.</p>\n\n<p>One of the days is a 6 mile hump beginning at like 0300, and for the rest of the day you&#39;re running through the Combat Course (the one and only time you actually go through the infamous and highly overrated Quigley) in fire teams. This day was a lot of fun. The instructors aren&#39;t blasting you, you&#39;re firing blanks from your M16, going over, under, or through various obstacles, etc. However, this will be the beginning of the breakdown of your feet. I was lucky not to get any blisters this day, but others were not so fortunate. There IS a reason why your small and large bag issues include items such as moleskin, body glide, and antibiotic ointment. Use them. You should also be changing your socks at any given opportunity if your feet have gotten wet. Cellulitis is no joke and two candidates in my platoon were on light duty using crutches because of it at two different points during the course. </p>\n\n<p>The last day of the week will involve the LRC test. There is no prac app for this so you need to be familiar with what&#39;s generally expected. You don&#39;t need to give a full-blown operations order but you do need to hit every wicket. I got points docked for not explicitly saying stuff like Fire Support Plan even though there wasn&#39;t one. Be loud, have good command presence, delegate tasks, assign security, and have everyone moving quickly. You shouldn&#39;t ever be silent for more than a few seconds at a time during this. You almost certainly will &quot;fail&quot; the task, but you&#39;ll pass if you demonstrated solid leadership ability. Following this, you&#39;ll hump out to the field where you&#39;ll do SULE prac app for a few hours. If you are at all shaky on leading a squad through a SULE, volunteer to be squad leader on one of the run-throughs. It will help you in the end. Following the SULE prac app, you&#39;ll go back to the barracks to clean your gear, shower, get changed, and do your first peer evals. Your platoon staff will tell you what they expect on the evals, but what I will say is this: do not rank someone as unfavorable based on one-off mistakes or how they performed during LRC or SULE. It&#39;s for the entire grading period of those first two weeks. Secondly, do not put things like loyalty or integrity as negative traits unless they really deserve it, or you will fuck them over.</p>\n\n<p>First event of week 3 is the intro to the E-course. You won&#39;t run through the full thing at full speed this time, but you will be tired because you just did an O-course run-through beforehand. I had pneumonia this day so I got to learn the E-course and fail it during the first timed run at the end of the week. PT one of these days will be rifle and log PT where you actually get to work out your upper body for once. Biggest thing for this is don&#39;t be a bitch and make faces or noises of weakness. You&#39;ll also do a night appreciation course where you move through a simulated foreign country as a squad. Again, cannot overstate how dark it is, but pay attention to your formations and what direction you need to be facing for security during halts. PT another morning is the 4 mile individual hump, which has replaced the 12 mile hump. You have to finish in under like 67 minutes to pass, which is completely possible despite the shitty hills. I suck at humps and I made it so it&#39;s not an event to sweat. However, I also got my worst blisters during this so there&#39;s that.</p>\n\n<p>Saturday morning was the timed E-course, and following that is the platoon sergeant&#39;s inspection. Hope you prepared a good set of cammies and boots the night before because you will basically only have time to clean your rifle right before it, and it WILL need to be cleaned after that E-course.</p>\n\n<p>First liberty is at the end of this week, and it is oh-so sweet. It starts at about 1500 Saturday and ends at 1900 Sunday (be back on base at least an hour early). Yeah, you have to wear proper civilian attire or &quot;candidate camouflage&quot; as we called it (polo, khakis, dress shoes), but you finally have the chance to pig out on whatever food you want. I probably ate about 3500 calories that Saturday.</p>\n\n<p>Week 4:</p>\n\n<p>The platoon staff begins to back off here. They won&#39;t be counting you down or making you hold packs unless you really fuck up, but you do need to be moving with speed and intensity. That means if you&#39;re a billet holder you need to be on your A-game delegating tasks and maintaining accountability. </p>\n\n<p>First event this week is the tested E-course. You have to be faster than 43 minutes. Ours was actually cut short and postponed to a later date because 25 people in the company went down as heat casualties. That was fun when I was about 4 minutes from the finish. You also have the tactics written exam, which many of us regarded as the second hardest written exam, right behind the history exam. You have the timed CFT, for which all I can say is make sure your partner is of equal or lesser weight. </p>\n\n<p>Statistically speaking, the hardest event this week was the written history test. 80% of the company failed and the Colonel had the entire company retake it at a later date. </p>\n\n<p>There will be another FEX in which you do SULE prac app. By this point you should be proficient at the conduct of a SULE, or at least have an idea of what you&#39;re going to do when you&#39;re up being evaluated. Your squad should work out SOPs such as which fire team is going to pull security, which will do PCCs and PCIs, and which will make the terrain model. We also designated a permanent pace counter and nav man who only rotated when it was their turn to be squad leader. This hugely benefited us during the graded SULEs.</p>\n\n<p>Friday is the 9 mile hump and SULE II. Most candidates regarded this as both the best and worst day of the training cycle. You will be tired and hungry, your feet will be soaked and hurt like never before, the tasks during many of the SULEs will hurt, and you&#39;ll be hiking everywhere (though with just an assault pack and camelbak plus your rifle). However, you&#39;re traveling on your own, eating when you need to, and running what feel like legit combat operations. Same tips that I gave about LRC apply here. Demonstrate solid command presence, make decisions quickly, don’t lose your composure. The day ends with the second and final round of peer evals. Again, don&#39;t just grade people based on how they performed or put out for you during SULE.</p>\n\n<p>Saturday will be the platoon commander&#39;s inspection and your second liberty. Eat a ton, but don&#39;t overindulge.</p>\n\n<p>(continued in comments)</p>\n</div><!-- SC_ON -->",
  "author_flair_css_class": "",
  "subreddit_id": "t5_2xmbn",
  "archived": false,
  "domain": "self.USMCboot",
  "clicked": false,
  "score": 21,
  "id": "3c7xsi",
  "stickied": false,
  "media_embed": {},
  "visited": false,
  "selftext": "Two days ago, I graduated from the combined PLC-Seniors/NROTC 6 week program at OCS (Lima Co, 4th Plt). The intent of this writing is to provide a detailed and accurate retelling of the experience to give future candidates an idea of what to expect. I won't give any information that could provide an unfair advantage, so any future candidates looking for descriptions of the tasks in the LRCs or SULEs, for example, you're out of luck. That said, this is also to help preserve my own memories of the training (the first 3 weeks or so are already a blur to me, partly due to suppression, mostly because they were so fast-paced), so it will be a detailed narration and not just a list of major events.\n\nWeek 1: \n\nIf flying, you'll arrive at Ronald Reagan National Airport and go to a cordoned off terminal to sit and wait for the troop handlers (a few SNCOs and NCOs from H&amp;amp;S Company). Don't worry about getting lost. You'll see a bunch of other twentysomething kids in polo shirts, khaki pants, and dress shoes with GI seabags and tactical backpacks all heading the same way. The troop handlers will call roll, put you into lines, and stuff you onto white buses for the hour long ride to Quantico. Few people, if at all, will be talking. Honestly, you could cut the tension with a butter knife. However, there was really no reason at this point to be nervous. Week 1 consists of moving into the barracks (either Graham or Skinner Hall), paperwork, medical examinations, gear issue, paperwork, marking/organizing said gear, getting your head completely buzzed, small/large bag issue, paperwork, and waiting in long lines. I would honestly have to say that Week 1 was the worst week of OCS because of all the waiting around. The only time that the monotony was broken was for the initial PFT (in which I ran a 19/100/20:35) and the intro to table PT (running around the PT table doing arm circles, high knees, butt kicks, etc.). By pick-up day we were all ready for the training to just start already. \n\nPick-up is on Friday. The troop handlers march you to Yeckel Hall (the classrooms), the CO gives you a speech on what he expects out of you as candidates (teamwork, resilience, physical and moral courage, integrity, etc), and the Company Commander marches your platoon staff out of the back room. He'll instruct the Platoon Sergeants and Sergeant Instructors to take charge of their platoons and carry out the training schedule and the fun begins. The SIs will scream at you to get out of the classroom and outside, pick up your packs (which will be staged out there beforehand), and run back to the barracks in formation. They'll be blasting you nonstop, but as long as you're moving fast and sounding off you'll be fine. Back in the barracks they'll assign you to your racks, you'll dump all issued gear out of your main packs so they can take inventory, and for the most part it's just games (holding main packs out in front, over your heads, etc. Just don't be a bitch.)\n\nRifle issue is Saturday. The rifles are M16A4s with the carry handle, despite your Mickey Mouse towels having the RCO on the outline for the upper receiver. Memorize your rifle's serial number now; you will need to know it for inspections later on. You'll also be issued cleaning gear that goes in the buttstock (there's a little door on the back that opens up). It's trash, for the most part. Prior to OCS, I bought a steel brush and a boresnake and they paid big dividends when I wasn't struggling to use the shitty metal brush or barrel brush.\n\nOn Sunday you'll run a buddy pair assault course just to get familiar with going from condition 4 to 3, to 1, back to 4, etc and the concept of fire and maneuver.\n\nWeek 2:\n\nThe general daily schedule is as follows.\n\n0300-0400: Wake up and study/prep gear\n\n0500: Lights\n\n0550: PT\n\n0715: Chow\n\n0800: Class\n\n1100: Chow\n\n1200: Class\n\n1430: Drill or Commander's Time\n\n1700: Chow\n\n1800: Drill or Commander's Time\n\n2000: Hygiene/prayer\n\n2100: Lights out\n\n2110: Allowed out of the racks to hygiene, mark gear, study, do pull-ups\n\nThe platoon will be organized into admin squads and fire teams by last name alphabetical order. Candidate company commander, company executive officer, company first sergeant, and company gunnery sergeant are chosen by the company staff and posted a few days in advance. Candidate platoon commander, platoon sergeant, platoon guide, and squad leaders are chosen by the platoon staff and posted the night before billet rotation (every 2 days). Fire team leaders are chosen by the squad leaders. For Weeks 2 and 3, however, the actual platoon staff will be running things, and it sucks because that involves getting counted down, holding packs over your heads or straight out in front of you, running and touching trees, or just yelling \"Aye, aye, Staff Sergeant!\" 5-6 times in a row. Your voices will likely be hoarse. One of the days during platoon commander's time, you'll have to do a self-introduction in which you talk about yourself for 2 minutes. The criteria was pretty much your name, where you're from, what school you go to, if you have family who served, why you want to be an officer of Marines, what MOS you hope to get, and who inspires you as a leader.\n\nThe first graded event was the initial comprehensive exam which covers all the subjects that PLC Juniors or your first 3 years of NROTC should have taught you. I say \"should\" because there were many things I straight-up did not know. One of the themes of the exams throughout the course that I found truly puzzling and annoying was that several questions were on extremely minute details and several were complete no-brainers.\n\nWeek 3:\n\nThis week includes the night land nav prac app and test where you're given a brief class and then sent out on the course. I CANNOT overstate how dark it is out there. You can be standing literally 2 feet from your box and not see it, so this is a skill you need to make sure you have down pat before you leave. You're not allowed to use any light source, so what many of us did was buy neon yellow index cards, wrap them in clear packing tape, and write our azimuths and distances on that with sharpie. I hit all 4 of my points correctly, but many people only got 2 or 3 of their points. ENSURE that your compass is secure in your pouch before reporting to an evaluator! Many people failed a point or two because of that, and you can only miss one and still pass.\n\nOne of the days is a 6 mile hump beginning at like 0300, and for the rest of the day you're running through the Combat Course (the one and only time you actually go through the infamous and highly overrated Quigley) in fire teams. This day was a lot of fun. The instructors aren't blasting you, you're firing blanks from your M16, going over, under, or through various obstacles, etc. However, this will be the beginning of the breakdown of your feet. I was lucky not to get any blisters this day, but others were not so fortunate. There IS a reason why your small and large bag issues include items such as moleskin, body glide, and antibiotic ointment. Use them. You should also be changing your socks at any given opportunity if your feet have gotten wet. Cellulitis is no joke and two candidates in my platoon were on light duty using crutches because of it at two different points during the course. \n\nThe last day of the week will involve the LRC test. There is no prac app for this so you need to be familiar with what's generally expected. You don't need to give a full-blown operations order but you do need to hit every wicket. I got points docked for not explicitly saying stuff like Fire Support Plan even though there wasn't one. Be loud, have good command presence, delegate tasks, assign security, and have everyone moving quickly. You shouldn't ever be silent for more than a few seconds at a time during this. You almost certainly will \"fail\" the task, but you'll pass if you demonstrated solid leadership ability. Following this, you'll hump out to the field where you'll do SULE prac app for a few hours. If you are at all shaky on leading a squad through a SULE, volunteer to be squad leader on one of the run-throughs. It will help you in the end. Following the SULE prac app, you'll go back to the barracks to clean your gear, shower, get changed, and do your first peer evals. Your platoon staff will tell you what they expect on the evals, but what I will say is this: do not rank someone as unfavorable based on one-off mistakes or how they performed during LRC or SULE. It's for the entire grading period of those first two weeks. Secondly, do not put things like loyalty or integrity as negative traits unless they really deserve it, or you will fuck them over.\n\nFirst event of week 3 is the intro to the E-course. You won't run through the full thing at full speed this time, but you will be tired because you just did an O-course run-through beforehand. I had pneumonia this day so I got to learn the E-course and fail it during the first timed run at the end of the week. PT one of these days will be rifle and log PT where you actually get to work out your upper body for once. Biggest thing for this is don't be a bitch and make faces or noises of weakness. You'll also do a night appreciation course where you move through a simulated foreign country as a squad. Again, cannot overstate how dark it is, but pay attention to your formations and what direction you need to be facing for security during halts. PT another morning is the 4 mile individual hump, which has replaced the 12 mile hump. You have to finish in under like 67 minutes to pass, which is completely possible despite the shitty hills. I suck at humps and I made it so it's not an event to sweat. However, I also got my worst blisters during this so there's that.\n\nSaturday morning was the timed E-course, and following that is the platoon sergeant's inspection. Hope you prepared a good set of cammies and boots the night before because you will basically only have time to clean your rifle right before it, and it WILL need to be cleaned after that E-course.\n\nFirst liberty is at the end of this week, and it is oh-so sweet. It starts at about 1500 Saturday and ends at 1900 Sunday (be back on base at least an hour early). Yeah, you have to wear proper civilian attire or \"candidate camouflage\" as we called it (polo, khakis, dress shoes), but you finally have the chance to pig out on whatever food you want. I probably ate about 3500 calories that Saturday.\n\nWeek 4:\n\nThe platoon staff begins to back off here. They won't be counting you down or making you hold packs unless you really fuck up, but you do need to be moving with speed and intensity. That means if you're a billet holder you need to be on your A-game delegating tasks and maintaining accountability. \n\nFirst event this week is the tested E-course. You have to be faster than 43 minutes. Ours was actually cut short and postponed to a later date because 25 people in the company went down as heat casualties. That was fun when I was about 4 minutes from the finish. You also have the tactics written exam, which many of us regarded as the second hardest written exam, right behind the history exam. You have the timed CFT, for which all I can say is make sure your partner is of equal or lesser weight. \n\nStatistically speaking, the hardest event this week was the written history test. 80% of the company failed and the Colonel had the entire company retake it at a later date. \n\nThere will be another FEX in which you do SULE prac app. By this point you should be proficient at the conduct of a SULE, or at least have an idea of what you're going to do when you're up being evaluated. Your squad should work out SOPs such as which fire team is going to pull security, which will do PCCs and PCIs, and which will make the terrain model. We also designated a permanent pace counter and nav man who only rotated when it was their turn to be squad leader. This hugely benefited us during the graded SULEs.\n\nFriday is the 9 mile hump and SULE II. Most candidates regarded this as both the best and worst day of the training cycle. You will be tired and hungry, your feet will be soaked and hurt like never before, the tasks during many of the SULEs will hurt, and you'll be hiking everywhere (though with just an assault pack and camelbak plus your rifle). However, you're traveling on your own, eating when you need to, and running what feel like legit combat operations. Same tips that I gave about LRC apply here. Demonstrate solid command presence, make decisions quickly, don’t lose your composure. The day ends with the second and final round of peer evals. Again, don't just grade people based on how they performed or put out for you during SULE.\n\nSaturday will be the platoon commander's inspection and your second liberty. Eat a ton, but don't overindulge.\n\n(continued in comments)",
  "hide_score": false,
  "_api_link": "https://api.reddit.com/r/USMCboot/comments/3c7xsi/ocs_retrospective_from_a_2015_plcseniorsnrotc/?ref=search_posts",
  "locked": false,
  "edited": 1436551033.0,
  "title": "OCS retrospective from a 2015 PLC-Seniors/NROTC graduate.",
  "created": 1436126941.0,
  "_comments_by_id": {}
}