{
  "clicked": false,
  "_replaced_more": false,
  "archived": true,
  "num_comments": 1,
  "created": 1329421314.0,
  "saved": false,
  "selftext": "Verified, Proof in OP\n\n2 - 16 - 12\n\n[http://www.reddit.com/r/IAmA/comments/psact/iaman_industrial_robot_programmer_ama/](http://www.reddit.com/r/IAmA/comments/psact/iaman_industrial_robot_programmer_ama/)\n\nQuestions | Answers\n:--|:--\nDoes your code adhere to the Asimovs Laws of Robotics? | Nope. The robots I program are completely oblivious to the world around them. They do exactly what I tell them to do, regardless of what is in the way. \nI've been around engineers my whole life. My dad is a civil engineer, and I have seen him upset and dissatisfied with the jobs and positions he has held with his firms, due to the lack of variety and having to sit in an office all day. I have a high interest in science and maths, and keep good grades in those classes. I have been told by several people that I would make a good engineer, and I know that I probably would fit in well as one. However, I cannot stand repition of work or doing the exact same thing every day, like sitting at a desk for hours on end. How much variation is there in your day to day work? Does each project you work on present a different working situation? TL;DR How much variation is there in the day to day work? | Tons of it! No two projects are the same (unless we're working on a build-to-print repeat project, but that's rare.) Each job has it's own unique challenges, and I'm constantly doing new things, trying out new technology, or thinking outside of the box just to get it done. I honestly recommend this career path to anybody even slightly interested in science and technology. Robots are cheaper than they've ever been, so there are a lot being deployed right now. Tons of opportunity.\nHow much do you make?| The industry average for somebody with my skills and experience is $60k-$75k, which is on par with other engineering jobs. The real money is in controls. As a private contractor, a controls engineer can make well in excess of $100k if they're good.\nWhat's the average American wage??? | About $42k\nIn the movie \"Dave\" (http://www.imdb.com/title/tt0106673/) there is a scene where the protagonist, acting as president, places his arms into some mechanical contraption, and then controls a giant pair of industrial robot arms by moving his own in the desired manner. Is this for real? How does it work? Who uses it? What's your end of the deal? | Those robots were real, but the controls are not. Thats a pair of FANUC robots (the kind I program) While I believe it may be technically possible to do something like that, there are too many safety guidelines that would prevent somebody from putting it in a factory. The robots are only allowed to move in predictable, pre-programmed paths. If a human is behind the wheel, their speeds are reduced to 250mm/sec. Top speed is typically 2000mm/sec.\nSkyNet. How close are we? | closer to the brains of it than most people think. however the mechanical side has serious limitations. You would be surprised how massive a robot needs to be to lift even 50kg. It also needs to be anchored to the ground and connected to a 16kva 480v power supply. (That's a lot of juice.) God help us all if we ever develop a small scale fusion reactor.\nLuckily, once we give them the brains we can ask them to develop body. Unfortunately they will hide a death ray in their design. | Tell me about it. We're running out of room in the warehouse for all the death rays we keep finding on these bastards.\nI studied comp sci & now I'm 1 semester away from completing my bachelor's. While I still enjoy programming, other engineering disciplines have always interested me. How could someone with my background get into this industry? | If you're unable to get an entry level position with a comp sci degree alone, I would recommend taking a few continuing education courses to build up the resume. I don't know how they do it in Germany, but in the US we have local colleges that offer night classes for PLC programming and industrial electrical engineering. Where I am (midwest US) just seeing that somebody has PLC programming experience on their resume is enough for us to consider hiring them on the spot, regardless of their educational background. There is a shortage of good PLC guys. Most of what we do is learned on the job anyway. We look for potential in new hires more so than experience and education. The only time formal education really matters for us is when we're hiring mechanical engineers to design machines.\nactually I'm from the US; I'm just doing an exchange year in Germany. But at any rate, it's good to know that I'm not limited to just what I studied (which isn't bad, but I have other interests too). I'll definitely look into taking some classes at a community college or maybe through some other institution. I do have another question, if you dont mind my asking: Is the manufacturing base in the US really growing again? I've always heard nothing but bad news when it comes to industry/manufacturing in the US (e.g. \"Oh you Americans have no industry. You'll see, China will take over. blahblahblah\"). | It definitely is. The people in the news business are really only in the bad news business. Manufacturing is the only sector of the economy to report growth every month since the summer of 2009. We've also added more jobs than anybody else. The reason that's happening is because China's economic success was built on the backs of their cheap laborers. However that's had the side effect of creating a higher standard of living over there, which in turn increases the cost of labor. And the unstable price of petroleum has made both raw materials and shipping more expensive. As labor, materials and shipping costs start to rise, the advantage to off shoring diminishes. For some manufacturers, that advantage completely disappears if you factor in quality assurance. Cheaper automation and higher quality manufacturing is what's bringing industry back to the states. It's not coming back as fast as it left, and much of it will still stay over there. However what is coming back is the quality goods manufacturing that people can be proud of.\nIs there a standard for the interop of industrial robot components? | Yes and no. There are a lot of standards, but not everyone adheres to the same ones. There is no standard syntax for programming, as each manufacturer uses it's own language. Some even use more than one language on the same robot, like FANUC. There's a very basic scripting language, and then a more advanced Pascal-like language. WRT communication, there are industry standards such as ModBus, ProfiBus, Ethernet/IP, and so forth. We also still use RS-232 serial communications a lot. Electrical components and controls mostly adhere to 24 volts DC, with the occasional high voltage DC or AC component thrown in there to make it interesting for the electrician. Among the 24VDC stuff, there's also a split between sinking and sourcing components, which causes headaches. Most of the industry uses sourcing components (PNP), but there are still some hold outs. The japanese use primarily sinking (NPN), but they also happen to make a lot of automation equipment.\nwhat techniques do you use when programming your robots? neural networks, digital image processing...? | It's actually very simple programming. A complex program may only have about 300 lines in it. Most robots are usually programmed in a sequence of operations, from start to finish, with no deviation from that routine. When vision is used, it only returns numbers back to the robot. Usually it's on offset location telling the robot where the part is, and how it needs to orient itself to pick it up. The real challenge is in the motion. You need to program the path as efficiently as possible to reduce the cycle time and reduce wear on the robot itself. This is not an intuitive process. For example, sometimes to get the robot to cycle faster, you need to make it move slower so it can spend more time moving at a constant speed, and less time accelerating and decelerating. You also need to avoid making big changes in the orientation of the arm, because that takes up time.\nEver program a vacuum bot to suck your dick? | no, but I did make a simulation on my computer that we'll just call \"Dildo Bot\"\nDo you hate profibus as well? Die, Siemens, die. | Yes, which is why we don't use it. It's Ethernet/IP all the way in our shop. I'm not a huge Allen Bradley fan, but there's no escaping them in this industry.\nis arduino used in the industrial robot world? http://en.wikipedia.org/wiki/Arduino | No, it's not. Arduino is primarily a 5V control system, and 5V controls have been phased out since the 70s. Too much noise in the lines when you have long wire runs, especially on analog signals. I love me some Arduino, though. I have a few project ideas I've been kicking around, but haven't had time for.\na hypothetical ... I buy used books and sell them on amazon and ebay. I need a robot that can pickup a book, motor over to a bookshelf and put the book on the shelf. Then later on the robot has to do the reverse. Find its way to the bookshelf, scan for the book ( maybe there is an rfid tag on the book. Or it might remember exactly where it placed the book. ), pull the book from the shelf then bring it to the packing station. What hardware and software components would you use to build such a robot? | I'd probably do it as a fixed gantry robot as opposed to an autonomous robot, because it's easier to program. I prefer Yaskawa servo motors for motion applications, and their motion controller is also capable of being used as a PLC. RFID wouldn't be good in this application because the books would be so close together. I'd probably go with using 2D barcodes and a cognex machine vision camera to identify the books. The obvious challenges to this application would be the varying sizes and weights of the books, and also whether or not humans would be putting books on the shelf as well. It'd be easy enough to have the robot catalog all the locations of the books itself, but if anything moved I could see it getting complicated. A solution to that may be to have the robot put the books in \"bins\", but that would increase the amount of space needed.\nWhat are the three laws of robotics? | Asimov never had to make any brake pads with his robots, so here are MY three rules: 1: Don't do any work until you receive the down payment 2: Always know where the E-STOP button is. 3: Never take your eye of a robot if you aren't holding the teach pendant.\nI worked with a Fanuc robot in a steel mill, and I can confirm numbers 2 and 3. Though if you're not holding the teach pendant, just stay out of the damn cell.| Though if you're not holding the teach pendant, just stay out of the damn cell. You'd be amazed at how hard it is for some people to understand that.\nHow many human jobs will be scrapped in the next 3-5 years? | Hard to say. What I can tell you is that I have not personally eliminated anyone's job in the last two years. Every project I have worked on in that time has been new production capacity. Back in the 70s, skilled welders and tradesmen were indeed losing their jobs to robots. However those jobs have long since been lost and will not be coming back, because the robots do it better, faster and more consistently than a human ever could. Nowadays, the people who lose their job to a robot are doing menial, repetitive, and often times dangerous work that requires no specific skill. One of the few jobs that I actually did replace was a die press operator. If you've never seen an industrial die press, take a look at this. More often than not, these people are hired labor from temp agencies. Union workers in these roles are very rare outside of the automotive industry. Also, people tend to forget about all of the other jobs in manufacturing that will never get replaced by a robot. This includes maintenance personnel, support staff, suppliers, vendors, contractors, truck drivers, and many more. These are jobs that would go away if a factory had to close because it couldn't compete with foreign manufacturers. These are also much higher paying jobs.\nThanks for the thoughtful answer. i once checked out a manufacturing temp job that involved molten metal and promptly declined, i can identify with the benefits of reducing danger. but are there truly no numbers to be found on the plans of phasing in robotic labor? | I don't know if there are, but I imagine that's something that's hard to predict. There are so many factors that combine to make automation more cost effective than human labor, and they're changing all the time. What's cheaper to do by hand today, could be cheaper to do with a robot in a few years.\nI have a few questions: Do you often find yourself explaining to people the difference between a computer, a RC device, and a robot? I feel that I find myself doing that more than I would like too. There are major differences. Do you prefer Fanuc robots, or do you use a wide variety in your daily work? Do you see any industry trends in robot selection (ie articulating arms, SCARA, etc.)? Can you describe what you mean by controls engineering? Are you talking about creating control systems for manufacturing systems using microcontrollers or PLCs? Or are you talking about system controls as in as combination of computers, PLCs, and other off the shelf controllers? Maybe both or a hybrid. For reference. I am a Mechanical/Manufacturing Engineer at a small business making proprietary blast gauges for the United States military. Previously, I was Process Engineer at a Contract Electronics Manufacturer. | Do you often find yourself explaining to people the difference between a computer, a RC device, and a robot? I feel that I find myself doing that more than I would like too. There are major differences. Actually I most often find myself explaining that the robots do not think for themselves. For some reason people have a hard time comprehending that these are just dumb machines with a bunch of motors on them that turn to the angles I tell them to in a specific sequence. Do you prefer Fanuc robots, or do you use a wide variety in your daily work? Do you see any industry trends in robot selection (ie articulating arms, SCARA, etc.)?  I prefer FANUC because that's what I have the most experience in. We're also an exclusive integrator for them, so I haven't had the chance to use any other brand of bot. From what I understand, ABB, Kuka and Motoman are pretty similar in capabilities. We also work with gantry robots in the plastics industry for removing product from molding machines. Companies like Wittmann and Yushin have a lock on that application.  Can you describe what you mean by controls engineering? Are you talking about creating control systems for manufacturing systems using microcontrollers or PLCs? Or are you talking about system controls as in as combination of computers, PLCs, and other off the shelf controllers? Maybe both or a hybrid. When we refer to controls engineering in the office, we're talking about all of the behind the scenes work that ties all this mechanical stuff together. This includes, but is not limited to: PLCs, HMIs, electrical engineering, and motion controls. For reference. I am a Mechanical/Manufacturing Engineer at a small business making proprietary blast gauges for the United States military. Previously, I was Process Engineer at a Contract Electronics Manufacturer. That sounds cool. Are those the blast disc things they use on Mythbusters all the time?\nWhat's the most interesting project you've worked on to date? | Robot related, it's been one of the projects I've just finished up. Most robot workcells have a specific sequence of operation. Meaning that the robot goes from point A to point B to point C and back again. I tend to like the jobs that stray from that description. On this last project, the robot was moving product around in the workcell. It had to be capable of picking up product from any one of 27 different locations, and placing it again in any of those same spots. There was no defined sequence, and the robot had to be able to go between any two points without a collision. If I was going to write a specific path for the robot to take between all of the possible combinations of beginning and end points, I would have had to write 702 different subroutines. Instead I figured out a way to define a set of rules for the robot based on where it was, and where it had to go. In the end it worked flawlessly. The most interesting non-robot project I've worked on is definitely the 400 watt CO2 CNC laser cutter that I helped design. It used high power linear motors (think mag lev trains) and moved at speeds of over 4 meters per second while cutting. You can't go anywhere today to get a gantry laser system that can move that fast. When people want speed, they use a galvo head. The problem with galvo heads is that you can't deliver air to the cutting point. The ultimate kicker though is that the customer wanted it to be even faster, which is just physically impossible. So even though it was an amazing piece of kit, the customer still wasn't happy.\nI wager a guess given the speed and strength the laser, that they were cutting a very thin piece of carbon steel... BTW that is freaky fast! I wonder how they could loading the machine, in order to have a need to cut that fast... | Actually we were cutting a laminated mylar film. The air assist was required to keep it from catching on fire. It was a couple of years ago, so I forget the specifics, but I think we ended up needing to cut something like 175 linear feet every 18 seconds. It was actually a very complex pattern with a lot of direction changes in it. Most of that raw grunt was used to speed up out of sharp corners.\nThats pretty interesting...Do you remember who made the Laser source?| Synrad. Although in my opinion, Coherent makes a better laser.\nWhat \"language\" do you use?| On fanuc, there are two programming languages. TPP (Teach Pendant Programming) is a basic scripting language and can accomplish about 99% of what you would ever need to do with a robot. KAREL is a language that's loosely based on Pascal and is a little more powerful and advanced. I've only had to resort to using it a few times. On the controls side, there's the ubiquitous G-Code that is used on nearly every CNC controller out there. That's a good one to know. Then there's also PLCs which use something called ladder logic. Most ladder logic is the same, with slight variations between manufacturers.\nHow hard would it be for a C programmer to become proficient in TPP or KAREL? | Not hard at all. I picked up TPP right away. KAREL was much harder, but my first time using it I managed to do what I needed to do in three days time. It's a little hard to wrap your head around the syntax at first, but if you have C experience, it should be easy. Better if you know Pascal.\nIts kind of funny you talk about mechanical engineering and control theory. I have a BS in ME and I'm about to graduate with an MSME in Control Systems and Dynamics. I have to say control jobs, at least where I am in Silicon Valley, that are entry level are few and far in between. Tips? | Move to the midwest or east coast. Seriously. Most of the work we do is midwest/east coast. That's just where most of the factories are. Next week I'm in St. Louis, and the week after that I'm in Jersey. I haven't gone any further west than Omaha. It may also have something to do with Solyndra folding. A lot of skilled automation people were released into the job market in SoCal when that happened. I got to play around a bit with ABB robots (the classic orange arm variety) in high school, it was pretty fun. For us it was mostly plotting waypoints and such. How far does your work go beyond that?\nWhich are your favorite products? | Most of my time is spent doing motion programming (plotting waypoints and such) however most of my brainpower is spent writing logic. Usually it's the \"recovery\" routine on the robot that requires the most work. If a robot is stopped for whatever reason, our goal is to program it so that all an operator has to do to get it started up again is push reset and start. So that robot has to be able to recover itself from any location in the workcell. In all the time I've been doing this, no two robots have used the same recovery routine. My favorite manufacturers are FANUC (obviously); Maple Systems HMI screens; Yaskawa for servos; Allen Bradley for PLCs, relays, buttons and switches; PIAB and FiPA for vacuum products; and Misumi for random components. If you've never heard of Misumi, I recommend checking them out. It's like the McMaster-Carr of automation. And if you haven't heard of McMaster-Carr, check them out too.\nDo you think robots and humans can ever learn to coexist?| More so than they already do? Probably not. I usually laugh when people talk about robot butlers or household robots. The amount of safety red tape I have to wade through just to integrate a tiny robot like this is still monumental.\nIn a robot-killing contest between you and will smith who would win? | Me, because I know where the robot is plugged in.\nWhat about computer engineering? Is that a good degree to go into too? | Potentially, but most of what I do leans more towards electrical and mechanical engineering than anything else.\nCool IamA. I'd like more IamA's from professionals. What technologies/innovations are you most excited about in the future? | I'm most excited by what machine vision has been able to do for our industry, and I think that there's still a massive amount of untapped potential for innovation in that field. All I need is an encoder wheel and a camera to locate and track randomly oriented parts on a moving conveyor belt. An average setup like that can cost less than $10k minus the robot. Before vision tracking, people needed to use feeder bowls (if their parts could even be fed) which will cost $25k at a minimum, and it can only be used with one specific part. A vision system can adapt. I'm also really keen on linear motors. I've gotten to work with them once, and they're nothing short of amazing.\nhave you made something you can stick your penis in yet or are we light years away from that kind of technology? | FANUC makes a robot called the [M-20iA](http://www.fanucrobotics.com/file-repository/DataSheets/Robots/M-20iA-Series.pdf) (<- PDF). It has a hollow wrist with a 65mm opening on it. If you're brave enough to let a piece of equipment that can move at 2 meters a second near your junk, let me know.\nSo how many years do we figure are left before we can all kick our feet up and have robots doing all manual labour? | It's unlikely to happen. I don't see domestic robots being capable of doing much more than vacuuming the floor or bringing somebody drinks. As for industrial manual labor, we'll reach a \"peak\" scenario where every job that can possibly be automated will be, and the only ones left will require a human's intuition and interpretation to do.\nSo... I'd pretty much NEED an engineering degree to do your job, wouldn't I? What if I were to have a completely unrelated bachelors, 5-10 years of computer program experience, as well as experience building CNC machines, would that be enough?| kaydub, I didn't have an engineering degree when I got into this. I was just lucky that my unintentional career path led me here. Your best bet is to look for a job with an Automation Integrator, Systems Integrator or Custom Machine Builder doing anything you can. When I started out, it was just simple mechanical assembly. That kind of job is low paying, but doesn't require much experience. If you can turn a wrench, you're in. But every opportunity I had to prove my abilities, I took advantage of. Eventually my boss recognized my potential and sent me off to get training. The rest is history.\n\n\n\nEdit: Well, that's my first table. Any feedback is welcome.\n",
  "mod_reports": [],
  "secure_media_embed": {},
  "author_flair_css_class": "tabler",
  "edited": true,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Verified, Proof in OP</p>\n\n<p>2 - 16 - 12</p>\n\n<p><a href=\"http://www.reddit.com/r/IAmA/comments/psact/iaman_industrial_robot_programmer_ama/\">http://www.reddit.com/r/IAmA/comments/psact/iaman_industrial_robot_programmer_ama/</a></p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Questions</th>\n<th align=\"left\">Answers</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">Does your code adhere to the Asimovs Laws of Robotics?</td>\n<td align=\"left\">Nope. The robots I program are completely oblivious to the world around them. They do exactly what I tell them to do, regardless of what is in the way.</td>\n</tr>\n<tr>\n<td align=\"left\">I&#39;ve been around engineers my whole life. My dad is a civil engineer, and I have seen him upset and dissatisfied with the jobs and positions he has held with his firms, due to the lack of variety and having to sit in an office all day. I have a high interest in science and maths, and keep good grades in those classes. I have been told by several people that I would make a good engineer, and I know that I probably would fit in well as one. However, I cannot stand repition of work or doing the exact same thing every day, like sitting at a desk for hours on end. How much variation is there in your day to day work? Does each project you work on present a different working situation? TL;DR How much variation is there in the day to day work?</td>\n<td align=\"left\">Tons of it! No two projects are the same (unless we&#39;re working on a build-to-print repeat project, but that&#39;s rare.) Each job has it&#39;s own unique challenges, and I&#39;m constantly doing new things, trying out new technology, or thinking outside of the box just to get it done. I honestly recommend this career path to anybody even slightly interested in science and technology. Robots are cheaper than they&#39;ve ever been, so there are a lot being deployed right now. Tons of opportunity.</td>\n</tr>\n<tr>\n<td align=\"left\">How much do you make?</td>\n<td align=\"left\">The industry average for somebody with my skills and experience is $60k-$75k, which is on par with other engineering jobs. The real money is in controls. As a private contractor, a controls engineer can make well in excess of $100k if they&#39;re good.</td>\n</tr>\n<tr>\n<td align=\"left\">What&#39;s the average American wage???</td>\n<td align=\"left\">About $42k</td>\n</tr>\n<tr>\n<td align=\"left\">In the movie &quot;Dave&quot; (<a href=\"http://www.imdb.com/title/tt0106673/\">http://www.imdb.com/title/tt0106673/</a>) there is a scene where the protagonist, acting as president, places his arms into some mechanical contraption, and then controls a giant pair of industrial robot arms by moving his own in the desired manner. Is this for real? How does it work? Who uses it? What&#39;s your end of the deal?</td>\n<td align=\"left\">Those robots were real, but the controls are not. Thats a pair of FANUC robots (the kind I program) While I believe it may be technically possible to do something like that, there are too many safety guidelines that would prevent somebody from putting it in a factory. The robots are only allowed to move in predictable, pre-programmed paths. If a human is behind the wheel, their speeds are reduced to 250mm/sec. Top speed is typically 2000mm/sec.</td>\n</tr>\n<tr>\n<td align=\"left\">SkyNet. How close are we?</td>\n<td align=\"left\">closer to the brains of it than most people think. however the mechanical side has serious limitations. You would be surprised how massive a robot needs to be to lift even 50kg. It also needs to be anchored to the ground and connected to a 16kva 480v power supply. (That&#39;s a lot of juice.) God help us all if we ever develop a small scale fusion reactor.</td>\n</tr>\n<tr>\n<td align=\"left\">Luckily, once we give them the brains we can ask them to develop body. Unfortunately they will hide a death ray in their design.</td>\n<td align=\"left\">Tell me about it. We&#39;re running out of room in the warehouse for all the death rays we keep finding on these bastards.</td>\n</tr>\n<tr>\n<td align=\"left\">I studied comp sci &amp; now I&#39;m 1 semester away from completing my bachelor&#39;s. While I still enjoy programming, other engineering disciplines have always interested me. How could someone with my background get into this industry?</td>\n<td align=\"left\">If you&#39;re unable to get an entry level position with a comp sci degree alone, I would recommend taking a few continuing education courses to build up the resume. I don&#39;t know how they do it in Germany, but in the US we have local colleges that offer night classes for PLC programming and industrial electrical engineering. Where I am (midwest US) just seeing that somebody has PLC programming experience on their resume is enough for us to consider hiring them on the spot, regardless of their educational background. There is a shortage of good PLC guys. Most of what we do is learned on the job anyway. We look for potential in new hires more so than experience and education. The only time formal education really matters for us is when we&#39;re hiring mechanical engineers to design machines.</td>\n</tr>\n<tr>\n<td align=\"left\">actually I&#39;m from the US; I&#39;m just doing an exchange year in Germany. But at any rate, it&#39;s good to know that I&#39;m not limited to just what I studied (which isn&#39;t bad, but I have other interests too). I&#39;ll definitely look into taking some classes at a community college or maybe through some other institution. I do have another question, if you dont mind my asking: Is the manufacturing base in the US really growing again? I&#39;ve always heard nothing but bad news when it comes to industry/manufacturing in the US (e.g. &quot;Oh you Americans have no industry. You&#39;ll see, China will take over. blahblahblah&quot;).</td>\n<td align=\"left\">It definitely is. The people in the news business are really only in the bad news business. Manufacturing is the only sector of the economy to report growth every month since the summer of 2009. We&#39;ve also added more jobs than anybody else. The reason that&#39;s happening is because China&#39;s economic success was built on the backs of their cheap laborers. However that&#39;s had the side effect of creating a higher standard of living over there, which in turn increases the cost of labor. And the unstable price of petroleum has made both raw materials and shipping more expensive. As labor, materials and shipping costs start to rise, the advantage to off shoring diminishes. For some manufacturers, that advantage completely disappears if you factor in quality assurance. Cheaper automation and higher quality manufacturing is what&#39;s bringing industry back to the states. It&#39;s not coming back as fast as it left, and much of it will still stay over there. However what is coming back is the quality goods manufacturing that people can be proud of.</td>\n</tr>\n<tr>\n<td align=\"left\">Is there a standard for the interop of industrial robot components?</td>\n<td align=\"left\">Yes and no. There are a lot of standards, but not everyone adheres to the same ones. There is no standard syntax for programming, as each manufacturer uses it&#39;s own language. Some even use more than one language on the same robot, like FANUC. There&#39;s a very basic scripting language, and then a more advanced Pascal-like language. WRT communication, there are industry standards such as ModBus, ProfiBus, Ethernet/IP, and so forth. We also still use RS-232 serial communications a lot. Electrical components and controls mostly adhere to 24 volts DC, with the occasional high voltage DC or AC component thrown in there to make it interesting for the electrician. Among the 24VDC stuff, there&#39;s also a split between sinking and sourcing components, which causes headaches. Most of the industry uses sourcing components (PNP), but there are still some hold outs. The japanese use primarily sinking (NPN), but they also happen to make a lot of automation equipment.</td>\n</tr>\n<tr>\n<td align=\"left\">what techniques do you use when programming your robots? neural networks, digital image processing...?</td>\n<td align=\"left\">It&#39;s actually very simple programming. A complex program may only have about 300 lines in it. Most robots are usually programmed in a sequence of operations, from start to finish, with no deviation from that routine. When vision is used, it only returns numbers back to the robot. Usually it&#39;s on offset location telling the robot where the part is, and how it needs to orient itself to pick it up. The real challenge is in the motion. You need to program the path as efficiently as possible to reduce the cycle time and reduce wear on the robot itself. This is not an intuitive process. For example, sometimes to get the robot to cycle faster, you need to make it move slower so it can spend more time moving at a constant speed, and less time accelerating and decelerating. You also need to avoid making big changes in the orientation of the arm, because that takes up time.</td>\n</tr>\n<tr>\n<td align=\"left\">Ever program a vacuum bot to suck your dick?</td>\n<td align=\"left\">no, but I did make a simulation on my computer that we&#39;ll just call &quot;Dildo Bot&quot;</td>\n</tr>\n<tr>\n<td align=\"left\">Do you hate profibus as well? Die, Siemens, die.</td>\n<td align=\"left\">Yes, which is why we don&#39;t use it. It&#39;s Ethernet/IP all the way in our shop. I&#39;m not a huge Allen Bradley fan, but there&#39;s no escaping them in this industry.</td>\n</tr>\n<tr>\n<td align=\"left\">is arduino used in the industrial robot world? <a href=\"http://en.wikipedia.org/wiki/Arduino\">http://en.wikipedia.org/wiki/Arduino</a></td>\n<td align=\"left\">No, it&#39;s not. Arduino is primarily a 5V control system, and 5V controls have been phased out since the 70s. Too much noise in the lines when you have long wire runs, especially on analog signals. I love me some Arduino, though. I have a few project ideas I&#39;ve been kicking around, but haven&#39;t had time for.</td>\n</tr>\n<tr>\n<td align=\"left\">a hypothetical ... I buy used books and sell them on amazon and ebay. I need a robot that can pickup a book, motor over to a bookshelf and put the book on the shelf. Then later on the robot has to do the reverse. Find its way to the bookshelf, scan for the book ( maybe there is an rfid tag on the book. Or it might remember exactly where it placed the book. ), pull the book from the shelf then bring it to the packing station. What hardware and software components would you use to build such a robot?</td>\n<td align=\"left\">I&#39;d probably do it as a fixed gantry robot as opposed to an autonomous robot, because it&#39;s easier to program. I prefer Yaskawa servo motors for motion applications, and their motion controller is also capable of being used as a PLC. RFID wouldn&#39;t be good in this application because the books would be so close together. I&#39;d probably go with using 2D barcodes and a cognex machine vision camera to identify the books. The obvious challenges to this application would be the varying sizes and weights of the books, and also whether or not humans would be putting books on the shelf as well. It&#39;d be easy enough to have the robot catalog all the locations of the books itself, but if anything moved I could see it getting complicated. A solution to that may be to have the robot put the books in &quot;bins&quot;, but that would increase the amount of space needed.</td>\n</tr>\n<tr>\n<td align=\"left\">What are the three laws of robotics?</td>\n<td align=\"left\">Asimov never had to make any brake pads with his robots, so here are MY three rules: 1: Don&#39;t do any work until you receive the down payment 2: Always know where the E-STOP button is. 3: Never take your eye of a robot if you aren&#39;t holding the teach pendant.</td>\n</tr>\n<tr>\n<td align=\"left\">I worked with a Fanuc robot in a steel mill, and I can confirm numbers 2 and 3. Though if you&#39;re not holding the teach pendant, just stay out of the damn cell.</td>\n<td align=\"left\">Though if you&#39;re not holding the teach pendant, just stay out of the damn cell. You&#39;d be amazed at how hard it is for some people to understand that.</td>\n</tr>\n<tr>\n<td align=\"left\">How many human jobs will be scrapped in the next 3-5 years?</td>\n<td align=\"left\">Hard to say. What I can tell you is that I have not personally eliminated anyone&#39;s job in the last two years. Every project I have worked on in that time has been new production capacity. Back in the 70s, skilled welders and tradesmen were indeed losing their jobs to robots. However those jobs have long since been lost and will not be coming back, because the robots do it better, faster and more consistently than a human ever could. Nowadays, the people who lose their job to a robot are doing menial, repetitive, and often times dangerous work that requires no specific skill. One of the few jobs that I actually did replace was a die press operator. If you&#39;ve never seen an industrial die press, take a look at this. More often than not, these people are hired labor from temp agencies. Union workers in these roles are very rare outside of the automotive industry. Also, people tend to forget about all of the other jobs in manufacturing that will never get replaced by a robot. This includes maintenance personnel, support staff, suppliers, vendors, contractors, truck drivers, and many more. These are jobs that would go away if a factory had to close because it couldn&#39;t compete with foreign manufacturers. These are also much higher paying jobs.</td>\n</tr>\n<tr>\n<td align=\"left\">Thanks for the thoughtful answer. i once checked out a manufacturing temp job that involved molten metal and promptly declined, i can identify with the benefits of reducing danger. but are there truly no numbers to be found on the plans of phasing in robotic labor?</td>\n<td align=\"left\">I don&#39;t know if there are, but I imagine that&#39;s something that&#39;s hard to predict. There are so many factors that combine to make automation more cost effective than human labor, and they&#39;re changing all the time. What&#39;s cheaper to do by hand today, could be cheaper to do with a robot in a few years.</td>\n</tr>\n<tr>\n<td align=\"left\">I have a few questions: Do you often find yourself explaining to people the difference between a computer, a RC device, and a robot? I feel that I find myself doing that more than I would like too. There are major differences. Do you prefer Fanuc robots, or do you use a wide variety in your daily work? Do you see any industry trends in robot selection (ie articulating arms, SCARA, etc.)? Can you describe what you mean by controls engineering? Are you talking about creating control systems for manufacturing systems using microcontrollers or PLCs? Or are you talking about system controls as in as combination of computers, PLCs, and other off the shelf controllers? Maybe both or a hybrid. For reference. I am a Mechanical/Manufacturing Engineer at a small business making proprietary blast gauges for the United States military. Previously, I was Process Engineer at a Contract Electronics Manufacturer.</td>\n<td align=\"left\">Do you often find yourself explaining to people the difference between a computer, a RC device, and a robot? I feel that I find myself doing that more than I would like too. There are major differences. Actually I most often find myself explaining that the robots do not think for themselves. For some reason people have a hard time comprehending that these are just dumb machines with a bunch of motors on them that turn to the angles I tell them to in a specific sequence. Do you prefer Fanuc robots, or do you use a wide variety in your daily work? Do you see any industry trends in robot selection (ie articulating arms, SCARA, etc.)?  I prefer FANUC because that&#39;s what I have the most experience in. We&#39;re also an exclusive integrator for them, so I haven&#39;t had the chance to use any other brand of bot. From what I understand, ABB, Kuka and Motoman are pretty similar in capabilities. We also work with gantry robots in the plastics industry for removing product from molding machines. Companies like Wittmann and Yushin have a lock on that application.  Can you describe what you mean by controls engineering? Are you talking about creating control systems for manufacturing systems using microcontrollers or PLCs? Or are you talking about system controls as in as combination of computers, PLCs, and other off the shelf controllers? Maybe both or a hybrid. When we refer to controls engineering in the office, we&#39;re talking about all of the behind the scenes work that ties all this mechanical stuff together. This includes, but is not limited to: PLCs, HMIs, electrical engineering, and motion controls. For reference. I am a Mechanical/Manufacturing Engineer at a small business making proprietary blast gauges for the United States military. Previously, I was Process Engineer at a Contract Electronics Manufacturer. That sounds cool. Are those the blast disc things they use on Mythbusters all the time?</td>\n</tr>\n<tr>\n<td align=\"left\">What&#39;s the most interesting project you&#39;ve worked on to date?</td>\n<td align=\"left\">Robot related, it&#39;s been one of the projects I&#39;ve just finished up. Most robot workcells have a specific sequence of operation. Meaning that the robot goes from point A to point B to point C and back again. I tend to like the jobs that stray from that description. On this last project, the robot was moving product around in the workcell. It had to be capable of picking up product from any one of 27 different locations, and placing it again in any of those same spots. There was no defined sequence, and the robot had to be able to go between any two points without a collision. If I was going to write a specific path for the robot to take between all of the possible combinations of beginning and end points, I would have had to write 702 different subroutines. Instead I figured out a way to define a set of rules for the robot based on where it was, and where it had to go. In the end it worked flawlessly. The most interesting non-robot project I&#39;ve worked on is definitely the 400 watt CO2 CNC laser cutter that I helped design. It used high power linear motors (think mag lev trains) and moved at speeds of over 4 meters per second while cutting. You can&#39;t go anywhere today to get a gantry laser system that can move that fast. When people want speed, they use a galvo head. The problem with galvo heads is that you can&#39;t deliver air to the cutting point. The ultimate kicker though is that the customer wanted it to be even faster, which is just physically impossible. So even though it was an amazing piece of kit, the customer still wasn&#39;t happy.</td>\n</tr>\n<tr>\n<td align=\"left\">I wager a guess given the speed and strength the laser, that they were cutting a very thin piece of carbon steel... BTW that is freaky fast! I wonder how they could loading the machine, in order to have a need to cut that fast...</td>\n<td align=\"left\">Actually we were cutting a laminated mylar film. The air assist was required to keep it from catching on fire. It was a couple of years ago, so I forget the specifics, but I think we ended up needing to cut something like 175 linear feet every 18 seconds. It was actually a very complex pattern with a lot of direction changes in it. Most of that raw grunt was used to speed up out of sharp corners.</td>\n</tr>\n<tr>\n<td align=\"left\">Thats pretty interesting...Do you remember who made the Laser source?</td>\n<td align=\"left\">Synrad. Although in my opinion, Coherent makes a better laser.</td>\n</tr>\n<tr>\n<td align=\"left\">What &quot;language&quot; do you use?</td>\n<td align=\"left\">On fanuc, there are two programming languages. TPP (Teach Pendant Programming) is a basic scripting language and can accomplish about 99% of what you would ever need to do with a robot. KAREL is a language that&#39;s loosely based on Pascal and is a little more powerful and advanced. I&#39;ve only had to resort to using it a few times. On the controls side, there&#39;s the ubiquitous G-Code that is used on nearly every CNC controller out there. That&#39;s a good one to know. Then there&#39;s also PLCs which use something called ladder logic. Most ladder logic is the same, with slight variations between manufacturers.</td>\n</tr>\n<tr>\n<td align=\"left\">How hard would it be for a C programmer to become proficient in TPP or KAREL?</td>\n<td align=\"left\">Not hard at all. I picked up TPP right away. KAREL was much harder, but my first time using it I managed to do what I needed to do in three days time. It&#39;s a little hard to wrap your head around the syntax at first, but if you have C experience, it should be easy. Better if you know Pascal.</td>\n</tr>\n<tr>\n<td align=\"left\">Its kind of funny you talk about mechanical engineering and control theory. I have a BS in ME and I&#39;m about to graduate with an MSME in Control Systems and Dynamics. I have to say control jobs, at least where I am in Silicon Valley, that are entry level are few and far in between. Tips?</td>\n<td align=\"left\">Move to the midwest or east coast. Seriously. Most of the work we do is midwest/east coast. That&#39;s just where most of the factories are. Next week I&#39;m in St. Louis, and the week after that I&#39;m in Jersey. I haven&#39;t gone any further west than Omaha. It may also have something to do with Solyndra folding. A lot of skilled automation people were released into the job market in SoCal when that happened. I got to play around a bit with ABB robots (the classic orange arm variety) in high school, it was pretty fun. For us it was mostly plotting waypoints and such. How far does your work go beyond that?</td>\n</tr>\n<tr>\n<td align=\"left\">Which are your favorite products?</td>\n<td align=\"left\">Most of my time is spent doing motion programming (plotting waypoints and such) however most of my brainpower is spent writing logic. Usually it&#39;s the &quot;recovery&quot; routine on the robot that requires the most work. If a robot is stopped for whatever reason, our goal is to program it so that all an operator has to do to get it started up again is push reset and start. So that robot has to be able to recover itself from any location in the workcell. In all the time I&#39;ve been doing this, no two robots have used the same recovery routine. My favorite manufacturers are FANUC (obviously); Maple Systems HMI screens; Yaskawa for servos; Allen Bradley for PLCs, relays, buttons and switches; PIAB and FiPA for vacuum products; and Misumi for random components. If you&#39;ve never heard of Misumi, I recommend checking them out. It&#39;s like the McMaster-Carr of automation. And if you haven&#39;t heard of McMaster-Carr, check them out too.</td>\n</tr>\n<tr>\n<td align=\"left\">Do you think robots and humans can ever learn to coexist?</td>\n<td align=\"left\">More so than they already do? Probably not. I usually laugh when people talk about robot butlers or household robots. The amount of safety red tape I have to wade through just to integrate a tiny robot like this is still monumental.</td>\n</tr>\n<tr>\n<td align=\"left\">In a robot-killing contest between you and will smith who would win?</td>\n<td align=\"left\">Me, because I know where the robot is plugged in.</td>\n</tr>\n<tr>\n<td align=\"left\">What about computer engineering? Is that a good degree to go into too?</td>\n<td align=\"left\">Potentially, but most of what I do leans more towards electrical and mechanical engineering than anything else.</td>\n</tr>\n<tr>\n<td align=\"left\">Cool IamA. I&#39;d like more IamA&#39;s from professionals. What technologies/innovations are you most excited about in the future?</td>\n<td align=\"left\">I&#39;m most excited by what machine vision has been able to do for our industry, and I think that there&#39;s still a massive amount of untapped potential for innovation in that field. All I need is an encoder wheel and a camera to locate and track randomly oriented parts on a moving conveyor belt. An average setup like that can cost less than $10k minus the robot. Before vision tracking, people needed to use feeder bowls (if their parts could even be fed) which will cost $25k at a minimum, and it can only be used with one specific part. A vision system can adapt. I&#39;m also really keen on linear motors. I&#39;ve gotten to work with them once, and they&#39;re nothing short of amazing.</td>\n</tr>\n<tr>\n<td align=\"left\">have you made something you can stick your penis in yet or are we light years away from that kind of technology?</td>\n<td align=\"left\">FANUC makes a robot called the <a href=\"http://www.fanucrobotics.com/file-repository/DataSheets/Robots/M-20iA-Series.pdf\">M-20iA</a> (&lt;- PDF). It has a hollow wrist with a 65mm opening on it. If you&#39;re brave enough to let a piece of equipment that can move at 2 meters a second near your junk, let me know.</td>\n</tr>\n<tr>\n<td align=\"left\">So how many years do we figure are left before we can all kick our feet up and have robots doing all manual labour?</td>\n<td align=\"left\">It&#39;s unlikely to happen. I don&#39;t see domestic robots being capable of doing much more than vacuuming the floor or bringing somebody drinks. As for industrial manual labor, we&#39;ll reach a &quot;peak&quot; scenario where every job that can possibly be automated will be, and the only ones left will require a human&#39;s intuition and interpretation to do.</td>\n</tr>\n<tr>\n<td align=\"left\">So... I&#39;d pretty much NEED an engineering degree to do your job, wouldn&#39;t I? What if I were to have a completely unrelated bachelors, 5-10 years of computer program experience, as well as experience building CNC machines, would that be enough?</td>\n<td align=\"left\">kaydub, I didn&#39;t have an engineering degree when I got into this. I was just lucky that my unintentional career path led me here. Your best bet is to look for a job with an Automation Integrator, Systems Integrator or Custom Machine Builder doing anything you can. When I started out, it was just simple mechanical assembly. That kind of job is low paying, but doesn&#39;t require much experience. If you can turn a wrench, you&#39;re in. But every opportunity I had to prove my abilities, I took advantage of. Eventually my boss recognized my potential and sent me off to get training. The rest is history.</td>\n</tr>\n</tbody></table>\n\n<p>Edit: Well, that&#39;s my first table. Any feedback is welcome.</p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "user_reports": [],
  "author_flair_text": "",
  "over_18": false,
  "score": 19,
  "stickied": false,
  "domain": "self.tabled",
  "is_self": true,
  "hidden": false,
  "_orphaned": {},
  "_api_link": "https://api.reddit.com/r/tabled/comments/pspu4/ima_industrial_robot_programmer_tabled/?ref=search_posts",
  "_comments_by_id": {},
  "visited": false,
  "thumbnail": "",
  "_has_fetched": true,
  "gilded": 0,
  "hide_score": false,
  "_info_url": "https://api.reddit.com/api/info/",
  "created_utc": 1329417714.0,
  "subreddit_id": "t5_2tkmw",
  "id": "pspu4",
  "_params": {},
  "media_embed": {},
  "name": "t3_pspu4",
  "quarantine": false,
  "permalink": "https://www.reddit.com/r/tabled/comments/pspu4/ima_industrial_robot_programmer_tabled/?ref=search_posts",
  "ups": 19,
  "url": "https://www.reddit.com/r/tabled/comments/pspu4/ima_industrial_robot_programmer_tabled/",
  "title": "[IMA] Industrial Robot Programmer Tabled"
}