{
  "selftext": "I've been working as an electrician for a large locomotive manufacturer for the last two years, working solely on freight. I figure a few of you may be interested in what goes into building a train.\n\n*I'll take a moment here to apologise for the lack of quality/quantity of the photos. I had to take them on the sly as I'm not sure if it's entirely acceptable.*\n\n[This is the underframe](http://i.imgur.com/3CcYN.jpg), upside down for the moment. This is the spine and the hub of the loco, all cables running between cabs run through ducting on the underside, and all air and water pipes do the same. These are all pre-fixed and all harnesses run through before proceeding down the line.\n\nOnce the work on the underside of the underframe is complete, it is flipped, the [engine and compressor](http://i.imgur.com/HAVys.jpg) are fitted, and the rest of the loco is built around it.\n\nThis starts at the rear of the loco with the [rad (radiator) cab](http://i.imgur.com/ukIsS.jpg), named as such due to the massive radiator that serves as [its roof](http://i.imgur.com/EhSwB.jpg). This cab also contains the main air compressor, the massive radiator fans, and a [cabinet](http://i.imgur.com/xZAUX.jpg) containing the breaker and contactors for each.\n\nWhile this is connected, we move closer to the front and mount the [inverter and filter cab](http://i.imgur.com/aYe6g.jpg). The inverter converts the DC voltage of the batteries into an AC voltage to kick the [alternator](http://i.imgur.com/sFhpx.jpg) over, starting the engine. The [filter cab](http://i.imgur.com/HC33S.jpg) houses a blower motor that feeds cooling air down into the inverter, as well as acting as a junction box between the inverter and the [dynamic brake](http://i.imgur.com/V1tGJ.jpg).\n\nNext, the [vesti (vestibule) cab](http://i.imgur.com/hDekz.jpg) is fitted and welded to the inverter/filter cab. This section contains the [amenities](http://i.imgur.com/muHYf.jpg), the air conditioning, and a [cabinet](http://i.imgur.com/y6zJw.jpg) containing the programmable logic controller (PLC), a rudimentary black (orange) box, receivers, and GPS modules. Almost all of the cables run through the underframe terminate here for the PLC, the brain of the loco. On the sides of the vesti cab are the brake rack (pneumatic), and the comms rack (coaxial).\n\nThe [alternator cab](http://i.imgur.com/RE47w.jpg) is fitted next, basically a cover for the already mounted alternator, containing the changeover switch, and a resistor bank for the lights.\n\nOnce all of the cables are run through the conduit below the engine to various speed, temperature and level sensors, the [engine cab](http://i.imgur.com/bcsdE.jpg) can go on. Similar deal, just a cover for the engine.\n\nShock absorbing mounts are fitted to the deck, and the [op (operator) cab](http://i.imgur.com/4t2Ck.jpg) [(internal)](http://i.imgur.com/XI143.jpg) is lifted on top. All wiring is connected through plugs under the vesti cab floor, back to the PLC. Then everything is sealed and set.\n\nWhen everything above the underframe is complete, the loco is weighed, and lifted onto its [bogeys](http://i.imgur.com/sKy1l.jpg). Each loco sits on its [pivot point](http://i.imgur.com/fagOg.jpg) on two bogies, and each bogey contains three independant electrically driven traction motors. A team of us climb into [the pit](http://i.imgur.com/KfnZI.jpg) and connect the traction motors while the fitters hook up the air hoses and pneumatic struts. The loco is then weighed again and gauged (check dimensions by running it through a template).\n\nWe sent the QA crack team through the [near finished loco](http://i.imgur.com/y5rBY.jpg) to find any incomplete or incorrect items, and send it out to the cage for testing. Once that's done it is sent to the paint shop to get itself all prettied up.\n\nThen it's just a matter of fitting light globes, insulating shields behind the alt cab doors, and fitting the [batteries](http://i.imgur.com/cJ36m.jpg). We give it a final pre-delivery check, the customer inspects it, and it's shunted out the door.\n\nThe whole cycle takes about 6-8 days. There is a lot more involved than just what is written here, I only really have a knowledge of the electrical side, and even then if I put every step, we would be here for hours. But if you have any questions about the process I will be happy to answer what I can, and will endeavor to find out off someone else what I can't. I'll just be in [my office](http://i.imgur.com/vPQnh.jpg).",
  "gilded": 0,
  "score": 45,
  "removal_reason": null,
  "approved_by": null,
  "created_utc": 1349392636.0,
  "is_self": true,
  "stickied": false,
  "edited": 1349398601.0,
  "distinguished": null,
  "permalink": "https://www.reddit.com/r/trains/comments/10yldk/the_manufacturing_process_of_a_dieselelectric/?ref=search_posts",
  "banned_by": null,
  "from_id": null,
  "likes": null,
  "_underscore_names": null,
  "num_reports": null,
  "link_flair_css_class": null,
  "_info_url": "https://api.reddit.com/api/info/",
  "id": "10yldk",
  "archived": true,
  "secure_media": null,
  "from_kind": null,
  "saved": false,
  "domain": "self.trains",
  "ups": 45,
  "suggested_sort": null,
  "quarantine": false,
  "over_18": false,
  "hide_score": false,
  "url": "https://www.reddit.com/r/trains/comments/10yldk/the_manufacturing_process_of_a_dieselelectric/",
  "subreddit_id": "t5_2qlps",
  "_params": {},
  "_comments": null,
  "_replaced_more": false,
  "_comments_by_id": {},
  "user_reports": [],
  "media_embed": {},
  "created": 1349392636.0,
  "author_flair_text": null,
  "visited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been working as an electrician for a large locomotive manufacturer for the last two years, working solely on freight. I figure a few of you may be interested in what goes into building a train.</p>\n\n<p><em>I&#39;ll take a moment here to apologise for the lack of quality/quantity of the photos. I had to take them on the sly as I&#39;m not sure if it&#39;s entirely acceptable.</em></p>\n\n<p><a href=\"http://i.imgur.com/3CcYN.jpg\">This is the underframe</a>, upside down for the moment. This is the spine and the hub of the loco, all cables running between cabs run through ducting on the underside, and all air and water pipes do the same. These are all pre-fixed and all harnesses run through before proceeding down the line.</p>\n\n<p>Once the work on the underside of the underframe is complete, it is flipped, the <a href=\"http://i.imgur.com/HAVys.jpg\">engine and compressor</a> are fitted, and the rest of the loco is built around it.</p>\n\n<p>This starts at the rear of the loco with the <a href=\"http://i.imgur.com/ukIsS.jpg\">rad (radiator) cab</a>, named as such due to the massive radiator that serves as <a href=\"http://i.imgur.com/EhSwB.jpg\">its roof</a>. This cab also contains the main air compressor, the massive radiator fans, and a <a href=\"http://i.imgur.com/xZAUX.jpg\">cabinet</a> containing the breaker and contactors for each.</p>\n\n<p>While this is connected, we move closer to the front and mount the <a href=\"http://i.imgur.com/aYe6g.jpg\">inverter and filter cab</a>. The inverter converts the DC voltage of the batteries into an AC voltage to kick the <a href=\"http://i.imgur.com/sFhpx.jpg\">alternator</a> over, starting the engine. The <a href=\"http://i.imgur.com/HC33S.jpg\">filter cab</a> houses a blower motor that feeds cooling air down into the inverter, as well as acting as a junction box between the inverter and the <a href=\"http://i.imgur.com/V1tGJ.jpg\">dynamic brake</a>.</p>\n\n<p>Next, the <a href=\"http://i.imgur.com/hDekz.jpg\">vesti (vestibule) cab</a> is fitted and welded to the inverter/filter cab. This section contains the <a href=\"http://i.imgur.com/muHYf.jpg\">amenities</a>, the air conditioning, and a <a href=\"http://i.imgur.com/y6zJw.jpg\">cabinet</a> containing the programmable logic controller (PLC), a rudimentary black (orange) box, receivers, and GPS modules. Almost all of the cables run through the underframe terminate here for the PLC, the brain of the loco. On the sides of the vesti cab are the brake rack (pneumatic), and the comms rack (coaxial).</p>\n\n<p>The <a href=\"http://i.imgur.com/RE47w.jpg\">alternator cab</a> is fitted next, basically a cover for the already mounted alternator, containing the changeover switch, and a resistor bank for the lights.</p>\n\n<p>Once all of the cables are run through the conduit below the engine to various speed, temperature and level sensors, the <a href=\"http://i.imgur.com/bcsdE.jpg\">engine cab</a> can go on. Similar deal, just a cover for the engine.</p>\n\n<p>Shock absorbing mounts are fitted to the deck, and the <a href=\"http://i.imgur.com/4t2Ck.jpg\">op (operator) cab</a> <a href=\"http://i.imgur.com/XI143.jpg\">(internal)</a> is lifted on top. All wiring is connected through plugs under the vesti cab floor, back to the PLC. Then everything is sealed and set.</p>\n\n<p>When everything above the underframe is complete, the loco is weighed, and lifted onto its <a href=\"http://i.imgur.com/sKy1l.jpg\">bogeys</a>. Each loco sits on its <a href=\"http://i.imgur.com/fagOg.jpg\">pivot point</a> on two bogies, and each bogey contains three independant electrically driven traction motors. A team of us climb into <a href=\"http://i.imgur.com/KfnZI.jpg\">the pit</a> and connect the traction motors while the fitters hook up the air hoses and pneumatic struts. The loco is then weighed again and gauged (check dimensions by running it through a template).</p>\n\n<p>We sent the QA crack team through the <a href=\"http://i.imgur.com/y5rBY.jpg\">near finished loco</a> to find any incomplete or incorrect items, and send it out to the cage for testing. Once that&#39;s done it is sent to the paint shop to get itself all prettied up.</p>\n\n<p>Then it&#39;s just a matter of fitting light globes, insulating shields behind the alt cab doors, and fitting the <a href=\"http://i.imgur.com/cJ36m.jpg\">batteries</a>. We give it a final pre-delivery check, the customer inspects it, and it&#39;s shunted out the door.</p>\n\n<p>The whole cycle takes about 6-8 days. There is a lot more involved than just what is written here, I only really have a knowledge of the electrical side, and even then if I put every step, we would be here for hours. But if you have any questions about the process I will be happy to answer what I can, and will endeavor to find out off someone else what I can&#39;t. I&#39;ll just be in <a href=\"http://i.imgur.com/vPQnh.jpg\">my office</a>.</p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "_comment_sort": null,
  "report_reasons": null,
  "name": "t3_10yldk",
  "from": null,
  "hidden": false,
  "clicked": false,
  "media": null,
  "json_dict": null,
  "_api_link": "https://api.reddit.com/r/trains/comments/10yldk/the_manufacturing_process_of_a_dieselelectric/?ref=search_posts",
  "secure_media_embed": {},
  "mod_reports": [],
  "_orphaned": {},
  "_uniq": null,
  "num_comments": 24,
  "link_flair_text": null,
  "title": "The manufacturing process of a diesel/electric locomotive.",
  "_has_fetched": true,
  "author_flair_css_class": null,
  "thumbnail": "self"
}