{
  "clicked": false,
  "_replaced_more": false,
  "archived": true,
  "num_comments": 0,
  "created": 1360367152.0,
  "saved": false,
  "selftext": "**Verified?** *(This bot cannot verify AMAs just yet)*\n\n**Date:** 2013-02-07\n\n**[Link to submission](http://www.reddit.com/r/IAmA/comments/182dzd/)** (*Has self-text*)\n\n**[Link to my post](http://www.reddit.com/r/IAmA/comments/182dzd/tabledresser/c8bvdmt)**\n\n\n\nQuestions|Answers\n:--|:--\n[So, exactly *how much* of a pain in the ass is it to keep up with Facebook's constant changes?](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8az0rc?context=5)|Well, it's obviously the biggest challenge in the project. Facebook's code is insane. Not just the fact that they change design and layout so frequently, but their underlying code is a mangled, obfuscated mess of callbacks and asynchronous loading.  What is perhaps most challenging is that they are constantly testing features and changes, so not everyone sees the same thing. So I may fix something on my account, but find that it fails for 5% of users, and I don't know why. Then it turns out that they are actually seeing a *different* feature than me. That makes it nearly impossible to create features that work for everyone, consistently, all the time.\n |I've brainstormed a lot of ways to help ease this pain, but so far not much has worked. I've resorted to giving users the ability to easily scrape their screen and post the HTML for me to examine. It's not perfect, but at least then I can see what they see. \n[Do you think they deliberately obfuscate it? They obviously hire some pretty talented people, so it can't be sloppy coding, right?](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8az7f6?context=5)|Definitely deliberate. I think it's to minimize code size and also to prevent tampering and finding of security holes. It's pretty common to obfuscate javascript. \n[What are your favorite and least favorite features of Facebook?](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8az4as?context=5)|Favorite: Maybe photo sharing. It's incredibly convenient, and we've never really seen anything like it. It's so easy to see pics from family and friends, and I love that.\n |Least Favorite: Too many to list! :) I don't like how locked down they are, providing very little customization. I also don't like their security and privacy options. I want more control. For example, I want to be able to turn off comments on posts. I don't want my \"Likes\" to be broadcast to all my friends in the ticker. I don't want Facebook hiding posts from me. All that. I wish they had a more open API and I could build a custom client that avoided all that mess. \n[^This . Can we disable that broadcast of my \"likes\" ](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b5lht?context=5)|Nope, there is no way to do it. Which IMO is a terrible privacy violation.\n[How confident are you that Facebook will not attempt, at some point in the future,  to restrict the use of third party apps such as Social Fixer?](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8az44d?context=5)|Well, they can try, but they will fail. There is nothing they can do to prevent me from running a script in MY browser when using THEIR site. It's just outside the scope of their influence. They can't even detect that it's running.\n |It does seem like they do their best to lock it down as tight as possible. There are a number of hoops I have to jump through. They send custom headers that can break extensions, prevent any of their pages from being loaded in an iframe, etc. They throw new things at me every few months. \n[Why do you suppose they're so opposed to Social Fixer? Reddit's admins haven't demonstrated the same opposition to RES. ](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b7ic9?context=5)|I'm not sure they are opposed to Social Fixer. Why do you think they are?\n |I think the Facebook culture is a little arrogant, perhaps influenced by Zuck himself. \n[I can't tell you how much more enjoyable FB is for me when I don't have to read about the NRA, the Superbowl, and the myriad of other nonsense I was subjected to before. My question: Are you in need of someone to have your baby??? ](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b0h5h?context=5)|Lol. Not currently, no. My wife has done a great job of that 3 times already ;) \n[My god man, three kids, a job and an awesome app?  Can I borrow some of your stamina?](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8blyt5?context=5)|I wish I had more stamina! I do the best I can. And actually 2 kids now, my middle son died 5 years ago. :( \n[I share and link to your site any time a friend complains about some new (or old\\) facebook feature. I've otherwise forgotten about many of the annoyances until I see a post about it. Good news is more and more of my friends use the program!](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8azax8?context=5)|I wish I could \"Like\" posts here. It would be easier than saying \"Thanks\" repeatedly ;) \n[You can upvote posts... :\\)](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8azpqm?context=5)|True. but users can't see that it was me who did it, like \"hey dude, I acknowledged what you said! Righteous!\" \n[Just referred a friend to the SF website, did get the comment that it looks complicated so perhaps you could create a clean looking Home page instead of using the Features page ;\\)](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b0dip?context=5)|Yup, that's in my short-term plans! \n[Love your program, Matt! In fact I've posted it on Reddit before to about 1000 upvotes!](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b10ut?context=5)|Not really. If it happens, it happens. I won't worry about it, and I'll continue trying to play nicely and not demonize FB.\n[My question - are you worried about encountering the problems the other \"fixers\" have had in terms of being sued and barred from Facebook? ](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b10ut?context=5)|I appreciate your comment from the other big thread ;) \n[What TV shows do you watch? Have you ever been to Comicon? Do you have any tattoos? Etc.? ](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b44x1?context=5)|Those are kind of personal questions, aren't they?\n |Ha.\n |I don't watch TV at all. Well, except for SNL when I actually catch it.\n |I have never been to any kind of *con.\n |I have one tattoo on my shoulder. \n[Now we know why reditors didn't bother asking those questions.](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b6gu0?context=5)|Heh. Do you want more details? :) \n[You're not missing much. I went to the NY Comicon this year, and while it was a little exciting, I was ready to go home after approximately 2 hours. :P.](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b9abh?context=5)|My tattoo says \"Kevin\" in Kanji script, the name of my little boy who died of congenital heart disease at age 2.5.  [Link to KevinMatthewKruse.com](http://KevinMatthewKruse.com)\n[Matt, Why does Facebook HIDE posts? I get that we are the commodity and all, but if Joe is posting about his widget collection, what is FB's gain in hiding it from me?](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b09h2?context=5)|They gain because by limiting exposure, they can then get people to PAY to reach all their friends and fans.\n[So you're suggesting Facebook is hoping people will pay money to share their vacation pictures with more of their friends?](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8bcvv9?context=5)|Yes, that's exactly what they are hoping. I don't think it will work, but apparently the idea of Pages paying to promote posts has been working well. That's where the real money is. \n[How can I pay to reach all posts? I haven't seen that feature yet, that's why I ask. I wouldn't pay though.](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b296g?context=5)|You can't pay to see all posts made. You can only pay when posting, to reach more people. Most Pages can do this now, but it's still an experiment for users. Not everyone has that capability yet, AFAIK. \n[Hey Matt, big fan of your work. About the hiding post thing. I have a lot of lists for all my friends and business profiles (the businesses that have a normal profile instead of a page\\) and I also add pages to my interest lists (yeah, I spend too much time there, I know\\), so my question is, even thought I have these specific lists and I can click on them and I actually see stuff that I don't see in newsfeed, am I still missing posts and updates? Actually I should have just asqued if they hide things only from the newsfeed or specific lists too?](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8bg883?context=5)|AFAIK, posts in interest lists are not filtered, so you see everything. But it's hard to know for sure, and that can change at any time, of course. \n[How many hours a week do you spend working on Social Fixer?](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8az2gc?context=5)|I would say at least an hour a day when I'm just doing normal maintenance mode. When I'm working hard on a new release, I'll probably spend 10-15 hours a week.\n[Developer and a PM? Is that common?](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8bcvea?context=5)|Not typically, afaik. I am a \"technical PM\", along with another co-PM. It works well in our specific situation.\n[Why don't you just work for fb? ;\\) ](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8az5ku?context=5)|Well, I did apply. I did their little pre-interview programming challenge, and went through an interview. They declined to do an on-site interview, which I think is in part because I disagreed with their javascript guru about the way some things should be done and I didn't kiss his ass and tell him how awesome facebook was and how desperate I was to work there. In fact, I wasn't sure I even wanted to work there. I just wanted them to offer me a job! :)\n |I had previously applied at Google and they made me several offers to try to get me to move to Mountain View. It didn't work out, but if I were really considering working for a tech giant, I would rather work for Google than Facebook. I think.  \n[You have a wife and kids.  Working at G would kill you.  It's great for people who are willing to have zero life outside work, but you're not that level of nerd.  You're human still.](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8bpn7e?context=5)|Yeah, that was my conclusion. Fantastic as a single 20-something, not much of a match for a family man. Which is how I view myself more than anything else. \n[Do you have any plans to make a \"social fixer\" for Google+?](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8azodq?context=5)|Right now, none. When I build, my script makes a backup copy. Someday I hope to understand Git. maybe.\n[How big is your current code base? ](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8azodq?context=5)|File size? 456kb. Pretty big, actually. I've considered minimizing it.\n[How do you test your application and all of its functionality? Unit tests? Different browsers versions?](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8azodq?context=5)|I manually test, and I have a great group of beta testers and support team. I have no formalized testing. Not enough time. \n[How do you deal with the faster release schedule of Firefox?](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8azodq?context=5)|I registered BetterGooglePlus.com, with that intent. Not enough time.\n[If Facebook liked what you're doing and offered to buy it outright from you, would you sell it? if so, how much would you sell it for?  I've always wondered if this is even a goal that third-party developers have in mind.](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b0b06?context=5)|Yes, I would sell it for a price. I don't know how much. $500,000? Or more? Less? It would have to be enough to make a huge difference for my family. That's not my goal, actually, because I think there is a 0.00% chance of that happening. My goal is to make a great product, have my name be associated with good software and integrity, so that I can launch future projects with greater success. It's not a get-rich-quick model, but I'm not a get-rich-quick kind of guy.  \n[Sorry if this has been mentioned. What else have you written? What other projects can we look forward to on the future?](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b70ty?context=5)|I've written lots of things in the past. I had a Perl stats program called MKStats that was popular long before the big guys got in the game. I eventually sold it.  I had a Perl CGI calendar program called CalendarScript that was pretty popular back in the day. I ended up selling that, too.  I have a web site at [Link to JavascriptToolbox.co](http://JavascriptToolbox.co) that is now really out of date, but it's where I published lots of free javascript tools. You can find more stuff at my site - [Link to MattKruse.co](http://MattKruse.co) and my \"About\" page: [Link to SocialFixer.com](http://SocialFixer.com/about.php)\n |Future projects are all tightly under wraps, of course. But they will definitely involve time travel, neon lights, and rabbits. Obviously.\n |(I'm actually far too busy to be planning much else right now, but I *do* have ideas I want to explore. Maybe when I get free time...)\n[Were you a nerd, growing up? Would your wife agree with your answer? \\[btw: In my book, nerd is not a pejorative term\\].](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8az4b3?context=5)|Nerd? Yes, pretty much. I think. I was pretty shy, and got interested in computers in 2nd grade and kind of stuck with it. I was never the kind of nerd that played D&D or read comic books or watched Star Trek or read lots of books (I hated reading). I mostly loved to build things, and the computer was my outlet. My wife would agree with me, and still thinks I am a nerd, of course ;) \n[, I'd like to say that your Friend Tracker (showing people that unfriend me\\) sometimes depresses me. But I still leave it on.  How are you? ](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b05j7?context=5)|Don't let it get you down. Sometimes it's for the best.  I'm good. A little overwhelmed. But good :) \n[I do want to know what kind of tools you use, and which ones you don't recommend for this kind of extensions. Also, assuming you are a full time developer, what are your main prog languages?](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8az2ar?context=5)|I wrote a blog post about this topic a while ago: [Link to socialfixer.com](http://socialfixer.com/blog/2012/06/08/6-awesome-tools-i-use-to-develop-social-fixer) One tool I forgot to include is Directory Monitor, an awesome utility that listens for file changes in a directory and executes a script. I use it to auto-build my extension when I make changes.\n |In my regular day job, I'm a Java developer. I much prefer javascript, but hey, something has to pay the bills. \n[For what reason do you prefer JS? Doesn't the scope piss you off?](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8azbr3?context=5)|The scope doesn't piss me off at all. It makes total sense when you understand it, and I can look at code and easily see the scope chain (usually). I've been coding js since it came out, so my mind kind of thinks that way. More traditional languages like Java annoy me. \n[*Also, do feel that the donations cover your time and costs?  *Do you think that the donation method of software development works?](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8azc5t?context=5)|It does work, as long as the expectation is not to get rich. It takes a different set of life priorities to make it work.\n[I split my 'facebooking' time between my phone and home laptop (well, and work laptop too\\). But just have social fixer installed on the home one. This discourages me from reading at work and on the phone (probably a good thing!\\) because I know I'll just be 'double-reading' it when I look at it at home (to clear it, just to make sure I haven't missed anything\\).  Is there any possibility of having a solution which would allow me to 'clear' from multiple browsers, using a common database? (in the cloud?\\) Obviously, for this to also work for the phone, an Android app would be necessary. Any plans for something like that as well?](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8azj4m?context=5)|Yes! This has been in my head for a long time, but as of now I don't have the time or resources to implement it. There are a lot of security concerns as well, and I am really cautious about providing a service that could potentially risk user data being stolen off my server.  I solve this problem by using DropBox. I run Firefox Portable from my Dropbox directory, so if I mark things as read from work, I go home and start up firefox from the dropbox directory and everything is just as I left it. It works great! \n[What if you use a Base64 encoded JSON data in a private Note?  Assuming it is possible for SF to write/edit a note.](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b171v?context=5)|I went down that road, not practical. I can't use the API to read/write a note, so I would need to screen-scrape, which leaves a vital functional being very fragile to their UI redesigns. Also, I would need to wait for the response from FB to get the prefs, which would delay loading.  \n[Isn't it possible to create an entry in the library which the extension uses, no matter which browser is run?](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8azwyt?context=5)|What do you mean by \"library\"?\n[If you could create your own social networking website, what would it be like? How would it differ from facebook?](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8az4fr?context=5)|It would be more open and customizable. See my answer about Diaspora. It would be like that :) \n[Will this make me able to block pages like \"only 90's kids will understand\" and \"1 000 000 likes and my dad will stop using drugs\"?!](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b1iip?context=5)|Well, you can block by keyword, so if you can came up with a phrase to block those things, then YES!\n |Upvote if you like this reply. Downvote if you want kittens to die.\n[To follow up, do they seem to come out with 'obscured' code, for the sake of making it difficult to do the type of thing you're doing?](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8az5sv?context=5)|I don't know if that's their intent, but yes, it's obfuscated and terribly difficult to understand. \n[Well, this is a pleasant surprise. Thank you very much, Matt, for your hard work!  Despite the fact that the work you do is essentially free, I have no doubt you've had your fair share of oddball messages coming your way from the entitled masses, especially during recent versions when the Tab-Enter requirement was introduced. Would you care to quote some of the more memorable tweets, messages or comments with us? ](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b02ml?context=5)|>Please GET OFF my facebook page with your greedy,money grubbing requests for your assine, unsolicted advertisements for your help. If you are on my facebook page in any shape or form I will contact the Wisconsin Attorney General with your bullshit. Please Fxxx OFF and GO AWAY. Thanks, AxxxOLE. Your exactly wrong about communicating using the internet.\n[People still use facebook?  When is this coming out for Myspace?](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b1yve?context=5)|Zuckerberg beat me to it. He created Better MySpace. \n[Hi Matt, thanks for doing this AMA. I've not previously heard of your extension, and currently use one called \"SocialReviver,\" primarily to make that my chat partners cannot see when I have read their messages. Does your extension offer this? If so, why should I switch to yours? Thanks!](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b10gy?context=5)|SocialReviver is very good, and the developer is great! I've emailed him a number of times to discuss tech details.  Social Fixer does not do that, but I hope to add it at some point. The two should actually work together just fine, as long as you turn off the chat options in SFX. \n[Have you had any legal problems with facebook? Thanks for such a great tool =\\) ](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8az4ve?context=5)|Yes, but minor. The extension used to be called Better Facebook, and they didn't like the name. I got a cease and desist letter from them, talked to their lawyers, and went through a big name change.  See: [Link to betterfacebook.net](http://betterfacebook.net/blog/blog/2011/10/03/better-facebook-is-getting-a-name-change-soon/)\n |Other than that, no issues with them at all. They know I exist, but have remained largely silent. \n[ off let me say, I love your addon.  There is only one thing that bothers me about it and maybe I just can't find the option to fix it. Since I have installed your addon, the ticker will randomly jump up to previous posts when I try to highlight something in it. It is extremely annoying and I was wondering if you were aware of this or if there is an option to fix it. I use Firefox and would love a fix! Can you help me out?  Also: Is there anyway to block out peoples stupid picture posts? I don't mind seeing pictures that they have uploaded through their camera, but the memes and sayings have got to stop! Is there a way to filter these out?](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8azy98?context=5)|1) I've never seen that. Does it stop when you disable Social Fixer? 2) If I could create a \"stupid filter\" I would be rich! :) \n[Three times now I have felt inspired to PayPal you some money. Do you make enough to make sure you never get too discouraged and drop this project? God forbid if you ever do. I would seriously think about quitting FB.](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8azabm?context=5)|I make enough to pay the bills and to help me do extra things with my family that I maybe wouldn't otherwise. I'm currently trying to save up enough money to finish my basement, and this side income helps.\n |Is it worth it? Well, I couldn't live on it, for sure. It's not a job replacement (yet). Sometimes it does get so overwhelming that I wonder if it's worth it, but I carry on because in the end, it's a pretty cool project. \n[Do you feel that Facebook makes changes deliberately to try to stop the extension from working? Why might that be?  Nice idea to have an AMA, by the way. This is probably the most-used extension I've ever had in my ten years or so of computing.](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8az764?context=5)|I think it would be a bit of hubris for me to think they intentionally target me. I'm an ant to them. I think they intentionally try to stop dangerous apps and extensions from working. They try to make it difficult for someone to accidentally install a browser extension that hijacks their facebook and steals their info. That is a GOOD thing, but it makes my life more difficult, too. \n[Yeah, you're probably right. I still feel like SF contains stuff FB should have implemented themselves a long time ago, though. Then again, we're able to hide things that make them money, so I guess it makes sense.](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8azyla?context=5)|Aside from the hiding, I agree. They would be smart to copy some of the features, IMO. Easy wins. In some cases, it seems they have (reply to comments, etc)\n[MOBILE VERSION? WHEN?!?! - lol, thanks for the effort making FB usable. ](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8az98t?context=5)|I'd love to, but I just don't have time. I've considered a Kickstarter campaign to raise enough money to hire someone to build it on my behalf. But right now, I just don't have enough bandwidth. \n[What is upcoming in the next couple of month ? Even if I like Social Fixer and I use it, I do not see a lot of people using it, any plans on advertising it ?](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8azmym?context=5)|Modify the code so Mozilla accepts it into their add-on directory again.\n |Improve the capability and user-friendliness of filtering.\n |I try to promote Social Fixer as much as possible, but I don't know about real advertising, since it's a free product. I tried to put an ad on Facebook itself to see what it could do, but they rejected it, saying I could no advertise on their site. Bummer. \n[How did you get into this profession? Is it a good career to go into?](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8azfyg?context=5)|I started on computers in 2nd grade, with Apple IIe's at my grade school. I was doing \"hi-res\" graphics patterns a few years later, and programming simple graphical games by early high school. Computer Science was the natural direction for me, so I didn't really question. Went to college, and they happened to get the internet in 1993 - pretty early by most standards. So I got involved in internet stuff right away. I've always had a normal \"stable\" job, but I've also always had side projects.\n |Yes, it's a good career! Computers won't be going away any time soon ;) \n[*happened to get the internet in 1993.*  Matt Krause, fingering people since 1993.  Its a joke only old people get and I don't get to tell it anymore.](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b091q?context=5)|Lol! Yes, I did my share of fingering.\n[I'm not asking for support, but maybe with your insight into how the FB code works you can answer this question...](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b0i4f?context=5)|Yes, they are intentionally switching you, because they think they know better. They are catering to the below-average user who might have switched on accident, and they assume you want to go back to the filtered feed that they think will be most interesting to you.\n[Why is it so difficult for FB to remember I want to view \"most recent\" posts? Correcting this is the primary reason I installed your extension. I've dabbled in web development and this seems like such a straightforward thing. Are they intentionally switching me back to \"Most popular\" 2-3 times a day?](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b0i4f?context=5)|Yes, it's annoying ;) \n[Ever thought about going open source?](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8azvms?context=5)|Yes, but: 1) The source is already visible, of course 2) I don't want to open up the code to changes from other developers who may not share my values. Someone could insert code that hijacks the browser or steals user info, for example. I cannot let that happen. That is probably the main reason why I cannot open up the code for contributions from others. I will always respect my users' privacy and security concerns above all else.  3) Besides, I can't find too many people who know enough about this stuff to actually do it ;) \n[It just occured to me that I should tag @Social Fixer in these posts as well instead of just socialfixer.com, to send them to the facebook site as well. Would Matt see those posts as well? (not totally clear on facebook privacy settings as usual\\)](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b0ujf?context=5)|If they are public, I can see them, but I won't get notified. Every so often I do a scan of public posts mentioning Social Fixer, just to see what people are saying. [Link to www.facebook.com](http://www.facebook.com/search.php?q=%22social%20fixer%22&type=eposts)\n[Well you could always make Google report to you about this: Link to www.google.com.](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b15y4?context=5)|Yes, I already get alerts from Google as well. But they can't see into Facebook. \n[Link to openstatussearch.co They use Graph's API. If you use that API too, you could automize it, amiright?](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8blwhx?context=5)|It's not possible to use the Graph API without being an official Facebook \"App\", which I am not. Nor can I be, since I would be violating some of their terms. \n[Isn't making Facebook better basically just polishing a turd *really* hard? ](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b1q9d?context=5)|Yes. But a lot of people really, really seem to want that turd. \n[To be fair, I tend to think of Facebook a lot like taking a good look at my shit before flushing. Also, props to you for responding in spite of my being a novelty. You're a pretty cool guy. ](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b1wpr?context=5)|S/guy/turd/\n[One question.  When did you come up with the idea for Social Fixer, were you like screw this crappy layout I am going to make my own better Facebook?](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b012g?context=5)|It started in late 2009, and my primary motivation to begin with was that I was annoyed that the same posts I've already read came up each time I opened the page. I wanted to clear out the things I've already seen so I could more easily pay attention to the new stuff. That was feature #1, and it grew from there... \n[If facebook makes maintaining Social Fixer impossible, do you have a dream project you'd like to do instead?](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8azlf7?context=5)|I actually have a number of ideas, but I won't list them here. My to-do list is always much longer than I ever have time to do. Coming up with ideas is never the problem. Finding time to do them always is :) \n[Has facebook approached you at all concerning your application?  If they were to offer, would you accept?  How do you make a living?](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b2k7i?context=5)|These are all already answered, but I'll summarize ;) 1) Yes 2) Almost 3) Probably Not 4) Creating Java webapps.\n[Any plans to allow people to hide Suggested Events on the event listing page? Those things are annoying; I'm just trying to see MY upcoming events, not all of this bullshit across the country that a friend I barely know is attending and you think I'd enjoy. Fuck off, Facebook.](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b2mms?context=5)|You already can! Click the gear in the upper right and choose to hide suggested events. This is a built-in feature of FB.\n |Don't feel dumb if you didn't know it was there, I just found it after looking at the page :) \n[Hey man, thanks for what you do!](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b0t86?context=5)|Not much, but that's happened naturally anyway. I've lost a lot of my interest in it because of all the idiocy I see here. Also, the way it broadcasts every move to your friends in the ticker. If I Like a public post or comment on a George Takei picture, all my friends might see it. I think that's obnoxious, so I don't interact nearly as much as I used to.\n[Has doing this killed your enjoyment of using Facebook personally/recreationally?](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b0t86?context=5)|In general, I've lost all desire to make people think I'm cool by posting witty remarks or pretending to make myself look awesome. And that seems to be 90% of what Facebook is these days. It makes me vomit.  \n[How have you avoided the troubles of getting banned/reported dangerous, like FBPurity has to deal with?](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b0ccq?context=5)|It seems to me that FBPurity is confrontational and wants to challenge FB by barely complying with their rules. Instead, I try not to badger FB or talk badly about them. They are great people, building something truly amazing. And Social Fixer wouldn't exist without their great work. They're not perfect, but neither am I. I don't want to demonize them.\n |I also know that some Facebook employees use Social Fixer. So maybe that helps ;) \n[What kind of weird results have you seen as a result of Facebok A/B testing? Obviously you are at their mercy of their design, and sometimes they decide to give 1% of people something random to test.](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b2e5q?context=5)|This is one of the most frustrating parts of development. I will get a report from a user that feature X is broken, but I can't reproduce it in any browser or in any account. Often they have a test version, and it breaks something temporarily, and I can't put in code to fix it. Or maybe I am in a test group and I assume that everyone has the same code as me, so I write code to fix it and it doesn't work for anyone else.\n |It's like programming with my eyes closed. I have to make the best guesses I can, and try to write robust code that will work in the most generic way possible. And when it does fail, try not to fail in a way that breaks things.\n |It's a considerable challenge. If Facebook were a stable site with code that wasn't so insane, I could have done much with this by now. \n[I'm surprised most of the questions I've read so far are actually about your work and not some random nonsense ( I find it fun most of the times, don't get me wrong \\).](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b4mvp?context=5)|Ooh, fun! It would be hard to recommend something without context, but I'll tell you what has meaning to me, and therefore what I might recommend.\n[I guess it's a sign you're doing something right! =\\)](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b4mvp?context=5)|Godel, Escher, Bach: This book is still very relevant, IMO, and it's really a challenge to the way many people thing. I love how it blends music, art, and math into a beautiful philosophy about how the universe works. For me, this book put into words many of the random thoughts I had swirling around in my head already, and helped me take a step beyond that state of mental chaos into an understanding of the world that is fundamental to me now. It's one of the few books I've kept after reading it.\n[Since I don't know your work I'll give it a shot: If you had to recommend a book and an album to a stranger what would they be ?](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b4mvp?context=5)|Album: Hmm, music is so personal, isn't it? I love so many different kinds of music and could recommend so many varied albums, but I will always love Enya: Watermark. Some may call it cheesy, but I find it relaxing and very enjoyable even after many listenings. \n[Matt, you've made Facebook a much more usable, less frustrating experience for me.  I can't thank you enough for that.  ...I could certainly still express my appreciation more in terms of donations.  I have not yet, but I will.  What is features do you most desire to implement but are unable to for whatever reason?](http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8azo6a?context=5)|There are a lot of things I can't implement because I can't interact with the Facebook API itself. I would love to be able to better track comments and flag when there is new content to be followed up on. I would like a better comment management system, allowing pages to interact better with their audience. I'd like to be able to get an unfiltered feed, and ever do server-side sorting and filtering, rather than all in the browser. So much potential...\n\n\n*Last updated: 2013-02-12 23:00 UTC*\n\n*This post was generated by a robot! Send all complaints to [epsy](/message/compose/?to=epsy).*\n\n",
  "mod_reports": [],
  "secure_media_embed": {},
  "author_flair_css_class": "tabler",
  "edited": 1360710117.0,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Verified?</strong> <em>(This bot cannot verify AMAs just yet)</em></p>\n\n<p><strong>Date:</strong> 2013-02-07</p>\n\n<p><strong><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/\">Link to submission</a></strong> (<em>Has self-text</em>)</p>\n\n<p><strong><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/tabledresser/c8bvdmt\">Link to my post</a></strong></p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Questions</th>\n<th align=\"left\">Answers</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8az0rc?context=5\">So, exactly <em>how much</em> of a pain in the ass is it to keep up with Facebook&#39;s constant changes?</a></td>\n<td align=\"left\">Well, it&#39;s obviously the biggest challenge in the project. Facebook&#39;s code is insane. Not just the fact that they change design and layout so frequently, but their underlying code is a mangled, obfuscated mess of callbacks and asynchronous loading.  What is perhaps most challenging is that they are constantly testing features and changes, so not everyone sees the same thing. So I may fix something on my account, but find that it fails for 5% of users, and I don&#39;t know why. Then it turns out that they are actually seeing a <em>different</em> feature than me. That makes it nearly impossible to create features that work for everyone, consistently, all the time.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I&#39;ve brainstormed a lot of ways to help ease this pain, but so far not much has worked. I&#39;ve resorted to giving users the ability to easily scrape their screen and post the HTML for me to examine. It&#39;s not perfect, but at least then I can see what they see.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8az7f6?context=5\">Do you think they deliberately obfuscate it? They obviously hire some pretty talented people, so it can&#39;t be sloppy coding, right?</a></td>\n<td align=\"left\">Definitely deliberate. I think it&#39;s to minimize code size and also to prevent tampering and finding of security holes. It&#39;s pretty common to obfuscate javascript.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8az4as?context=5\">What are your favorite and least favorite features of Facebook?</a></td>\n<td align=\"left\">Favorite: Maybe photo sharing. It&#39;s incredibly convenient, and we&#39;ve never really seen anything like it. It&#39;s so easy to see pics from family and friends, and I love that.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Least Favorite: Too many to list! :) I don&#39;t like how locked down they are, providing very little customization. I also don&#39;t like their security and privacy options. I want more control. For example, I want to be able to turn off comments on posts. I don&#39;t want my &quot;Likes&quot; to be broadcast to all my friends in the ticker. I don&#39;t want Facebook hiding posts from me. All that. I wish they had a more open API and I could build a custom client that avoided all that mess.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b5lht?context=5\"><sup>This</sup> . Can we disable that broadcast of my &quot;likes&quot; </a></td>\n<td align=\"left\">Nope, there is no way to do it. Which IMO is a terrible privacy violation.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8az44d?context=5\">How confident are you that Facebook will not attempt, at some point in the future,  to restrict the use of third party apps such as Social Fixer?</a></td>\n<td align=\"left\">Well, they can try, but they will fail. There is nothing they can do to prevent me from running a script in MY browser when using THEIR site. It&#39;s just outside the scope of their influence. They can&#39;t even detect that it&#39;s running.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">It does seem like they do their best to lock it down as tight as possible. There are a number of hoops I have to jump through. They send custom headers that can break extensions, prevent any of their pages from being loaded in an iframe, etc. They throw new things at me every few months.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b7ic9?context=5\">Why do you suppose they&#39;re so opposed to Social Fixer? Reddit&#39;s admins haven&#39;t demonstrated the same opposition to RES. </a></td>\n<td align=\"left\">I&#39;m not sure they are opposed to Social Fixer. Why do you think they are?</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I think the Facebook culture is a little arrogant, perhaps influenced by Zuck himself.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b0h5h?context=5\">I can&#39;t tell you how much more enjoyable FB is for me when I don&#39;t have to read about the NRA, the Superbowl, and the myriad of other nonsense I was subjected to before. My question: Are you in need of someone to have your baby??? </a></td>\n<td align=\"left\">Lol. Not currently, no. My wife has done a great job of that 3 times already ;)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8blyt5?context=5\">My god man, three kids, a job and an awesome app?  Can I borrow some of your stamina?</a></td>\n<td align=\"left\">I wish I had more stamina! I do the best I can. And actually 2 kids now, my middle son died 5 years ago. :(</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8azax8?context=5\">I share and link to your site any time a friend complains about some new (or old) facebook feature. I&#39;ve otherwise forgotten about many of the annoyances until I see a post about it. Good news is more and more of my friends use the program!</a></td>\n<td align=\"left\">I wish I could &quot;Like&quot; posts here. It would be easier than saying &quot;Thanks&quot; repeatedly ;)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8azpqm?context=5\">You can upvote posts... :)</a></td>\n<td align=\"left\">True. but users can&#39;t see that it was me who did it, like &quot;hey dude, I acknowledged what you said! Righteous!&quot;</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b0dip?context=5\">Just referred a friend to the SF website, did get the comment that it looks complicated so perhaps you could create a clean looking Home page instead of using the Features page ;)</a></td>\n<td align=\"left\">Yup, that&#39;s in my short-term plans!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b10ut?context=5\">Love your program, Matt! In fact I&#39;ve posted it on Reddit before to about 1000 upvotes!</a></td>\n<td align=\"left\">Not really. If it happens, it happens. I won&#39;t worry about it, and I&#39;ll continue trying to play nicely and not demonize FB.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b10ut?context=5\">My question - are you worried about encountering the problems the other &quot;fixers&quot; have had in terms of being sued and barred from Facebook? </a></td>\n<td align=\"left\">I appreciate your comment from the other big thread ;)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b44x1?context=5\">What TV shows do you watch? Have you ever been to Comicon? Do you have any tattoos? Etc.? </a></td>\n<td align=\"left\">Those are kind of personal questions, aren&#39;t they?</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Ha.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I don&#39;t watch TV at all. Well, except for SNL when I actually catch it.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I have never been to any kind of *con.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I have one tattoo on my shoulder.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b6gu0?context=5\">Now we know why reditors didn&#39;t bother asking those questions.</a></td>\n<td align=\"left\">Heh. Do you want more details? :)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b9abh?context=5\">You&#39;re not missing much. I went to the NY Comicon this year, and while it was a little exciting, I was ready to go home after approximately 2 hours. :P.</a></td>\n<td align=\"left\">My tattoo says &quot;Kevin&quot; in Kanji script, the name of my little boy who died of congenital heart disease at age 2.5.  <a href=\"http://KevinMatthewKruse.com\">Link to KevinMatthewKruse.com</a></td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b09h2?context=5\">Matt, Why does Facebook HIDE posts? I get that we are the commodity and all, but if Joe is posting about his widget collection, what is FB&#39;s gain in hiding it from me?</a></td>\n<td align=\"left\">They gain because by limiting exposure, they can then get people to PAY to reach all their friends and fans.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8bcvv9?context=5\">So you&#39;re suggesting Facebook is hoping people will pay money to share their vacation pictures with more of their friends?</a></td>\n<td align=\"left\">Yes, that&#39;s exactly what they are hoping. I don&#39;t think it will work, but apparently the idea of Pages paying to promote posts has been working well. That&#39;s where the real money is.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b296g?context=5\">How can I pay to reach all posts? I haven&#39;t seen that feature yet, that&#39;s why I ask. I wouldn&#39;t pay though.</a></td>\n<td align=\"left\">You can&#39;t pay to see all posts made. You can only pay when posting, to reach more people. Most Pages can do this now, but it&#39;s still an experiment for users. Not everyone has that capability yet, AFAIK.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8bg883?context=5\">Hey Matt, big fan of your work. About the hiding post thing. I have a lot of lists for all my friends and business profiles (the businesses that have a normal profile instead of a page) and I also add pages to my interest lists (yeah, I spend too much time there, I know), so my question is, even thought I have these specific lists and I can click on them and I actually see stuff that I don&#39;t see in newsfeed, am I still missing posts and updates? Actually I should have just asqued if they hide things only from the newsfeed or specific lists too?</a></td>\n<td align=\"left\">AFAIK, posts in interest lists are not filtered, so you see everything. But it&#39;s hard to know for sure, and that can change at any time, of course.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8az2gc?context=5\">How many hours a week do you spend working on Social Fixer?</a></td>\n<td align=\"left\">I would say at least an hour a day when I&#39;m just doing normal maintenance mode. When I&#39;m working hard on a new release, I&#39;ll probably spend 10-15 hours a week.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8bcvea?context=5\">Developer and a PM? Is that common?</a></td>\n<td align=\"left\">Not typically, afaik. I am a &quot;technical PM&quot;, along with another co-PM. It works well in our specific situation.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8az5ku?context=5\">Why don&#39;t you just work for fb? ;) </a></td>\n<td align=\"left\">Well, I did apply. I did their little pre-interview programming challenge, and went through an interview. They declined to do an on-site interview, which I think is in part because I disagreed with their javascript guru about the way some things should be done and I didn&#39;t kiss his ass and tell him how awesome facebook was and how desperate I was to work there. In fact, I wasn&#39;t sure I even wanted to work there. I just wanted them to offer me a job! :)</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I had previously applied at Google and they made me several offers to try to get me to move to Mountain View. It didn&#39;t work out, but if I were really considering working for a tech giant, I would rather work for Google than Facebook. I think.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8bpn7e?context=5\">You have a wife and kids.  Working at G would kill you.  It&#39;s great for people who are willing to have zero life outside work, but you&#39;re not that level of nerd.  You&#39;re human still.</a></td>\n<td align=\"left\">Yeah, that was my conclusion. Fantastic as a single 20-something, not much of a match for a family man. Which is how I view myself more than anything else.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8azodq?context=5\">Do you have any plans to make a &quot;social fixer&quot; for Google+?</a></td>\n<td align=\"left\">Right now, none. When I build, my script makes a backup copy. Someday I hope to understand Git. maybe.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8azodq?context=5\">How big is your current code base? </a></td>\n<td align=\"left\">File size? 456kb. Pretty big, actually. I&#39;ve considered minimizing it.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8azodq?context=5\">How do you test your application and all of its functionality? Unit tests? Different browsers versions?</a></td>\n<td align=\"left\">I manually test, and I have a great group of beta testers and support team. I have no formalized testing. Not enough time.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8azodq?context=5\">How do you deal with the faster release schedule of Firefox?</a></td>\n<td align=\"left\">I registered BetterGooglePlus.com, with that intent. Not enough time.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b0b06?context=5\">If Facebook liked what you&#39;re doing and offered to buy it outright from you, would you sell it? if so, how much would you sell it for?  I&#39;ve always wondered if this is even a goal that third-party developers have in mind.</a></td>\n<td align=\"left\">Yes, I would sell it for a price. I don&#39;t know how much. $500,000? Or more? Less? It would have to be enough to make a huge difference for my family. That&#39;s not my goal, actually, because I think there is a 0.00% chance of that happening. My goal is to make a great product, have my name be associated with good software and integrity, so that I can launch future projects with greater success. It&#39;s not a get-rich-quick model, but I&#39;m not a get-rich-quick kind of guy.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b70ty?context=5\">Sorry if this has been mentioned. What else have you written? What other projects can we look forward to on the future?</a></td>\n<td align=\"left\">I&#39;ve written lots of things in the past. I had a Perl stats program called MKStats that was popular long before the big guys got in the game. I eventually sold it.  I had a Perl CGI calendar program called CalendarScript that was pretty popular back in the day. I ended up selling that, too.  I have a web site at <a href=\"http://JavascriptToolbox.co\">Link to JavascriptToolbox.co</a> that is now really out of date, but it&#39;s where I published lots of free javascript tools. You can find more stuff at my site - <a href=\"http://MattKruse.co\">Link to MattKruse.co</a> and my &quot;About&quot; page: <a href=\"http://SocialFixer.com/about.php\">Link to SocialFixer.com</a></td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Future projects are all tightly under wraps, of course. But they will definitely involve time travel, neon lights, and rabbits. Obviously.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">(I&#39;m actually far too busy to be planning much else right now, but I <em>do</em> have ideas I want to explore. Maybe when I get free time...)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8az4b3?context=5\">Were you a nerd, growing up? Would your wife agree with your answer? [btw: In my book, nerd is not a pejorative term].</a></td>\n<td align=\"left\">Nerd? Yes, pretty much. I think. I was pretty shy, and got interested in computers in 2nd grade and kind of stuck with it. I was never the kind of nerd that played D&amp;D or read comic books or watched Star Trek or read lots of books (I hated reading). I mostly loved to build things, and the computer was my outlet. My wife would agree with me, and still thinks I am a nerd, of course ;)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b05j7?context=5\">, I&#39;d like to say that your Friend Tracker (showing people that unfriend me) sometimes depresses me. But I still leave it on.  How are you? </a></td>\n<td align=\"left\">Don&#39;t let it get you down. Sometimes it&#39;s for the best.  I&#39;m good. A little overwhelmed. But good :)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8az2ar?context=5\">I do want to know what kind of tools you use, and which ones you don&#39;t recommend for this kind of extensions. Also, assuming you are a full time developer, what are your main prog languages?</a></td>\n<td align=\"left\">I wrote a blog post about this topic a while ago: <a href=\"http://socialfixer.com/blog/2012/06/08/6-awesome-tools-i-use-to-develop-social-fixer\">Link to socialfixer.com</a> One tool I forgot to include is Directory Monitor, an awesome utility that listens for file changes in a directory and executes a script. I use it to auto-build my extension when I make changes.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">In my regular day job, I&#39;m a Java developer. I much prefer javascript, but hey, something has to pay the bills.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8azbr3?context=5\">For what reason do you prefer JS? Doesn&#39;t the scope piss you off?</a></td>\n<td align=\"left\">The scope doesn&#39;t piss me off at all. It makes total sense when you understand it, and I can look at code and easily see the scope chain (usually). I&#39;ve been coding js since it came out, so my mind kind of thinks that way. More traditional languages like Java annoy me.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8azc5t?context=5\">*Also, do feel that the donations cover your time and costs?  *Do you think that the donation method of software development works?</a></td>\n<td align=\"left\">It does work, as long as the expectation is not to get rich. It takes a different set of life priorities to make it work.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8azj4m?context=5\">I split my &#39;facebooking&#39; time between my phone and home laptop (well, and work laptop too). But just have social fixer installed on the home one. This discourages me from reading at work and on the phone (probably a good thing!) because I know I&#39;ll just be &#39;double-reading&#39; it when I look at it at home (to clear it, just to make sure I haven&#39;t missed anything).  Is there any possibility of having a solution which would allow me to &#39;clear&#39; from multiple browsers, using a common database? (in the cloud?) Obviously, for this to also work for the phone, an Android app would be necessary. Any plans for something like that as well?</a></td>\n<td align=\"left\">Yes! This has been in my head for a long time, but as of now I don&#39;t have the time or resources to implement it. There are a lot of security concerns as well, and I am really cautious about providing a service that could potentially risk user data being stolen off my server.  I solve this problem by using DropBox. I run Firefox Portable from my Dropbox directory, so if I mark things as read from work, I go home and start up firefox from the dropbox directory and everything is just as I left it. It works great!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b171v?context=5\">What if you use a Base64 encoded JSON data in a private Note?  Assuming it is possible for SF to write/edit a note.</a></td>\n<td align=\"left\">I went down that road, not practical. I can&#39;t use the API to read/write a note, so I would need to screen-scrape, which leaves a vital functional being very fragile to their UI redesigns. Also, I would need to wait for the response from FB to get the prefs, which would delay loading.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8azwyt?context=5\">Isn&#39;t it possible to create an entry in the library which the extension uses, no matter which browser is run?</a></td>\n<td align=\"left\">What do you mean by &quot;library&quot;?</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8az4fr?context=5\">If you could create your own social networking website, what would it be like? How would it differ from facebook?</a></td>\n<td align=\"left\">It would be more open and customizable. See my answer about Diaspora. It would be like that :)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b1iip?context=5\">Will this make me able to block pages like &quot;only 90&#39;s kids will understand&quot; and &quot;1 000 000 likes and my dad will stop using drugs&quot;?!</a></td>\n<td align=\"left\">Well, you can block by keyword, so if you can came up with a phrase to block those things, then YES!</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Upvote if you like this reply. Downvote if you want kittens to die.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8az5sv?context=5\">To follow up, do they seem to come out with &#39;obscured&#39; code, for the sake of making it difficult to do the type of thing you&#39;re doing?</a></td>\n<td align=\"left\">I don&#39;t know if that&#39;s their intent, but yes, it&#39;s obfuscated and terribly difficult to understand.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b02ml?context=5\">Well, this is a pleasant surprise. Thank you very much, Matt, for your hard work!  Despite the fact that the work you do is essentially free, I have no doubt you&#39;ve had your fair share of oddball messages coming your way from the entitled masses, especially during recent versions when the Tab-Enter requirement was introduced. Would you care to quote some of the more memorable tweets, messages or comments with us? </a></td>\n<td align=\"left\">&gt;Please GET OFF my facebook page with your greedy,money grubbing requests for your assine, unsolicted advertisements for your help. If you are on my facebook page in any shape or form I will contact the Wisconsin Attorney General with your bullshit. Please Fxxx OFF and GO AWAY. Thanks, AxxxOLE. Your exactly wrong about communicating using the internet.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b1yve?context=5\">People still use facebook?  When is this coming out for Myspace?</a></td>\n<td align=\"left\">Zuckerberg beat me to it. He created Better MySpace.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b10gy?context=5\">Hi Matt, thanks for doing this AMA. I&#39;ve not previously heard of your extension, and currently use one called &quot;SocialReviver,&quot; primarily to make that my chat partners cannot see when I have read their messages. Does your extension offer this? If so, why should I switch to yours? Thanks!</a></td>\n<td align=\"left\">SocialReviver is very good, and the developer is great! I&#39;ve emailed him a number of times to discuss tech details.  Social Fixer does not do that, but I hope to add it at some point. The two should actually work together just fine, as long as you turn off the chat options in SFX.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8az4ve?context=5\">Have you had any legal problems with facebook? Thanks for such a great tool =) </a></td>\n<td align=\"left\">Yes, but minor. The extension used to be called Better Facebook, and they didn&#39;t like the name. I got a cease and desist letter from them, talked to their lawyers, and went through a big name change.  See: <a href=\"http://betterfacebook.net/blog/blog/2011/10/03/better-facebook-is-getting-a-name-change-soon/\">Link to betterfacebook.net</a></td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Other than that, no issues with them at all. They know I exist, but have remained largely silent.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8azy98?context=5\"> off let me say, I love your addon.  There is only one thing that bothers me about it and maybe I just can&#39;t find the option to fix it. Since I have installed your addon, the ticker will randomly jump up to previous posts when I try to highlight something in it. It is extremely annoying and I was wondering if you were aware of this or if there is an option to fix it. I use Firefox and would love a fix! Can you help me out?  Also: Is there anyway to block out peoples stupid picture posts? I don&#39;t mind seeing pictures that they have uploaded through their camera, but the memes and sayings have got to stop! Is there a way to filter these out?</a></td>\n<td align=\"left\">1) I&#39;ve never seen that. Does it stop when you disable Social Fixer? 2) If I could create a &quot;stupid filter&quot; I would be rich! :)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8azabm?context=5\">Three times now I have felt inspired to PayPal you some money. Do you make enough to make sure you never get too discouraged and drop this project? God forbid if you ever do. I would seriously think about quitting FB.</a></td>\n<td align=\"left\">I make enough to pay the bills and to help me do extra things with my family that I maybe wouldn&#39;t otherwise. I&#39;m currently trying to save up enough money to finish my basement, and this side income helps.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Is it worth it? Well, I couldn&#39;t live on it, for sure. It&#39;s not a job replacement (yet). Sometimes it does get so overwhelming that I wonder if it&#39;s worth it, but I carry on because in the end, it&#39;s a pretty cool project.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8az764?context=5\">Do you feel that Facebook makes changes deliberately to try to stop the extension from working? Why might that be?  Nice idea to have an AMA, by the way. This is probably the most-used extension I&#39;ve ever had in my ten years or so of computing.</a></td>\n<td align=\"left\">I think it would be a bit of hubris for me to think they intentionally target me. I&#39;m an ant to them. I think they intentionally try to stop dangerous apps and extensions from working. They try to make it difficult for someone to accidentally install a browser extension that hijacks their facebook and steals their info. That is a GOOD thing, but it makes my life more difficult, too.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8azyla?context=5\">Yeah, you&#39;re probably right. I still feel like SF contains stuff FB should have implemented themselves a long time ago, though. Then again, we&#39;re able to hide things that make them money, so I guess it makes sense.</a></td>\n<td align=\"left\">Aside from the hiding, I agree. They would be smart to copy some of the features, IMO. Easy wins. In some cases, it seems they have (reply to comments, etc)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8az98t?context=5\">MOBILE VERSION? WHEN?!?! - lol, thanks for the effort making FB usable. </a></td>\n<td align=\"left\">I&#39;d love to, but I just don&#39;t have time. I&#39;ve considered a Kickstarter campaign to raise enough money to hire someone to build it on my behalf. But right now, I just don&#39;t have enough bandwidth.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8azmym?context=5\">What is upcoming in the next couple of month ? Even if I like Social Fixer and I use it, I do not see a lot of people using it, any plans on advertising it ?</a></td>\n<td align=\"left\">Modify the code so Mozilla accepts it into their add-on directory again.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Improve the capability and user-friendliness of filtering.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I try to promote Social Fixer as much as possible, but I don&#39;t know about real advertising, since it&#39;s a free product. I tried to put an ad on Facebook itself to see what it could do, but they rejected it, saying I could no advertise on their site. Bummer.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8azfyg?context=5\">How did you get into this profession? Is it a good career to go into?</a></td>\n<td align=\"left\">I started on computers in 2nd grade, with Apple IIe&#39;s at my grade school. I was doing &quot;hi-res&quot; graphics patterns a few years later, and programming simple graphical games by early high school. Computer Science was the natural direction for me, so I didn&#39;t really question. Went to college, and they happened to get the internet in 1993 - pretty early by most standards. So I got involved in internet stuff right away. I&#39;ve always had a normal &quot;stable&quot; job, but I&#39;ve also always had side projects.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Yes, it&#39;s a good career! Computers won&#39;t be going away any time soon ;)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b091q?context=5\"><em>happened to get the internet in 1993.</em>  Matt Krause, fingering people since 1993.  Its a joke only old people get and I don&#39;t get to tell it anymore.</a></td>\n<td align=\"left\">Lol! Yes, I did my share of fingering.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b0i4f?context=5\">I&#39;m not asking for support, but maybe with your insight into how the FB code works you can answer this question...</a></td>\n<td align=\"left\">Yes, they are intentionally switching you, because they think they know better. They are catering to the below-average user who might have switched on accident, and they assume you want to go back to the filtered feed that they think will be most interesting to you.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b0i4f?context=5\">Why is it so difficult for FB to remember I want to view &quot;most recent&quot; posts? Correcting this is the primary reason I installed your extension. I&#39;ve dabbled in web development and this seems like such a straightforward thing. Are they intentionally switching me back to &quot;Most popular&quot; 2-3 times a day?</a></td>\n<td align=\"left\">Yes, it&#39;s annoying ;)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8azvms?context=5\">Ever thought about going open source?</a></td>\n<td align=\"left\">Yes, but: 1) The source is already visible, of course 2) I don&#39;t want to open up the code to changes from other developers who may not share my values. Someone could insert code that hijacks the browser or steals user info, for example. I cannot let that happen. That is probably the main reason why I cannot open up the code for contributions from others. I will always respect my users&#39; privacy and security concerns above all else.  3) Besides, I can&#39;t find too many people who know enough about this stuff to actually do it ;)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b0ujf?context=5\">It just occured to me that I should tag @Social Fixer in these posts as well instead of just socialfixer.com, to send them to the facebook site as well. Would Matt see those posts as well? (not totally clear on facebook privacy settings as usual)</a></td>\n<td align=\"left\">If they are public, I can see them, but I won&#39;t get notified. Every so often I do a scan of public posts mentioning Social Fixer, just to see what people are saying. <a href=\"http://www.facebook.com/search.php?q=%22social%20fixer%22&amp;type=eposts\">Link to www.facebook.com</a></td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b15y4?context=5\">Well you could always make Google report to you about this: Link to www.google.com.</a></td>\n<td align=\"left\">Yes, I already get alerts from Google as well. But they can&#39;t see into Facebook.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8blwhx?context=5\">Link to openstatussearch.co They use Graph&#39;s API. If you use that API too, you could automize it, amiright?</a></td>\n<td align=\"left\">It&#39;s not possible to use the Graph API without being an official Facebook &quot;App&quot;, which I am not. Nor can I be, since I would be violating some of their terms.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b1q9d?context=5\">Isn&#39;t making Facebook better basically just polishing a turd <em>really</em> hard? </a></td>\n<td align=\"left\">Yes. But a lot of people really, really seem to want that turd.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b1wpr?context=5\">To be fair, I tend to think of Facebook a lot like taking a good look at my shit before flushing. Also, props to you for responding in spite of my being a novelty. You&#39;re a pretty cool guy. </a></td>\n<td align=\"left\">S/guy/turd/</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b012g?context=5\">One question.  When did you come up with the idea for Social Fixer, were you like screw this crappy layout I am going to make my own better Facebook?</a></td>\n<td align=\"left\">It started in late 2009, and my primary motivation to begin with was that I was annoyed that the same posts I&#39;ve already read came up each time I opened the page. I wanted to clear out the things I&#39;ve already seen so I could more easily pay attention to the new stuff. That was feature #1, and it grew from there...</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8azlf7?context=5\">If facebook makes maintaining Social Fixer impossible, do you have a dream project you&#39;d like to do instead?</a></td>\n<td align=\"left\">I actually have a number of ideas, but I won&#39;t list them here. My to-do list is always much longer than I ever have time to do. Coming up with ideas is never the problem. Finding time to do them always is :)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b2k7i?context=5\">Has facebook approached you at all concerning your application?  If they were to offer, would you accept?  How do you make a living?</a></td>\n<td align=\"left\">These are all already answered, but I&#39;ll summarize ;) 1) Yes 2) Almost 3) Probably Not 4) Creating Java webapps.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b2mms?context=5\">Any plans to allow people to hide Suggested Events on the event listing page? Those things are annoying; I&#39;m just trying to see MY upcoming events, not all of this bullshit across the country that a friend I barely know is attending and you think I&#39;d enjoy. Fuck off, Facebook.</a></td>\n<td align=\"left\">You already can! Click the gear in the upper right and choose to hide suggested events. This is a built-in feature of FB.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Don&#39;t feel dumb if you didn&#39;t know it was there, I just found it after looking at the page :)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b0t86?context=5\">Hey man, thanks for what you do!</a></td>\n<td align=\"left\">Not much, but that&#39;s happened naturally anyway. I&#39;ve lost a lot of my interest in it because of all the idiocy I see here. Also, the way it broadcasts every move to your friends in the ticker. If I Like a public post or comment on a George Takei picture, all my friends might see it. I think that&#39;s obnoxious, so I don&#39;t interact nearly as much as I used to.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b0t86?context=5\">Has doing this killed your enjoyment of using Facebook personally/recreationally?</a></td>\n<td align=\"left\">In general, I&#39;ve lost all desire to make people think I&#39;m cool by posting witty remarks or pretending to make myself look awesome. And that seems to be 90% of what Facebook is these days. It makes me vomit.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b0ccq?context=5\">How have you avoided the troubles of getting banned/reported dangerous, like FBPurity has to deal with?</a></td>\n<td align=\"left\">It seems to me that FBPurity is confrontational and wants to challenge FB by barely complying with their rules. Instead, I try not to badger FB or talk badly about them. They are great people, building something truly amazing. And Social Fixer wouldn&#39;t exist without their great work. They&#39;re not perfect, but neither am I. I don&#39;t want to demonize them.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I also know that some Facebook employees use Social Fixer. So maybe that helps ;)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b2e5q?context=5\">What kind of weird results have you seen as a result of Facebok A/B testing? Obviously you are at their mercy of their design, and sometimes they decide to give 1% of people something random to test.</a></td>\n<td align=\"left\">This is one of the most frustrating parts of development. I will get a report from a user that feature X is broken, but I can&#39;t reproduce it in any browser or in any account. Often they have a test version, and it breaks something temporarily, and I can&#39;t put in code to fix it. Or maybe I am in a test group and I assume that everyone has the same code as me, so I write code to fix it and it doesn&#39;t work for anyone else.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">It&#39;s like programming with my eyes closed. I have to make the best guesses I can, and try to write robust code that will work in the most generic way possible. And when it does fail, try not to fail in a way that breaks things.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">It&#39;s a considerable challenge. If Facebook were a stable site with code that wasn&#39;t so insane, I could have done much with this by now.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b4mvp?context=5\">I&#39;m surprised most of the questions I&#39;ve read so far are actually about your work and not some random nonsense ( I find it fun most of the times, don&#39;t get me wrong ).</a></td>\n<td align=\"left\">Ooh, fun! It would be hard to recommend something without context, but I&#39;ll tell you what has meaning to me, and therefore what I might recommend.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b4mvp?context=5\">I guess it&#39;s a sign you&#39;re doing something right! =)</a></td>\n<td align=\"left\">Godel, Escher, Bach: This book is still very relevant, IMO, and it&#39;s really a challenge to the way many people thing. I love how it blends music, art, and math into a beautiful philosophy about how the universe works. For me, this book put into words many of the random thoughts I had swirling around in my head already, and helped me take a step beyond that state of mental chaos into an understanding of the world that is fundamental to me now. It&#39;s one of the few books I&#39;ve kept after reading it.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8b4mvp?context=5\">Since I don&#39;t know your work I&#39;ll give it a shot: If you had to recommend a book and an album to a stranger what would they be ?</a></td>\n<td align=\"left\">Album: Hmm, music is so personal, isn&#39;t it? I love so many different kinds of music and could recommend so many varied albums, but I will always love Enya: Watermark. Some may call it cheesy, but I find it relaxing and very enjoyable even after many listenings.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/182dzd/i_am_the_creator_of_social_fixer_a_popular/c8azo6a?context=5\">Matt, you&#39;ve made Facebook a much more usable, less frustrating experience for me.  I can&#39;t thank you enough for that.  ...I could certainly still express my appreciation more in terms of donations.  I have not yet, but I will.  What is features do you most desire to implement but are unable to for whatever reason?</a></td>\n<td align=\"left\">There are a lot of things I can&#39;t implement because I can&#39;t interact with the Facebook API itself. I would love to be able to better track comments and flag when there is new content to be followed up on. I would like a better comment management system, allowing pages to interact better with their audience. I&#39;d like to be able to get an unfiltered feed, and ever do server-side sorting and filtering, rather than all in the browser. So much potential...</td>\n</tr>\n</tbody></table>\n\n<p><em>Last updated: 2013-02-12 23:00 UTC</em></p>\n\n<p><em>This post was generated by a robot! Send all complaints to <a href=\"/message/compose/?to=epsy\">epsy</a>.</em></p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "user_reports": [],
  "author_flair_text": "",
  "over_18": false,
  "score": 6,
  "stickied": false,
  "domain": "self.tabled",
  "is_self": true,
  "hidden": false,
  "_orphaned": {},
  "_api_link": "https://api.reddit.com/r/tabled/comments/185ve8/table_iama_i_am_the_creator_of_social_fixer_a/?ref=search_posts",
  "_comments_by_id": {},
  "visited": false,
  "thumbnail": "",
  "_has_fetched": true,
  "gilded": 0,
  "hide_score": false,
  "_info_url": "https://api.reddit.com/api/info/",
  "created_utc": 1360367152.0,
  "subreddit_id": "t5_2tkmw",
  "id": "185ve8",
  "_params": {},
  "media_embed": {},
  "name": "t3_185ve8",
  "quarantine": false,
  "permalink": "https://www.reddit.com/r/tabled/comments/185ve8/table_iama_i_am_the_creator_of_social_fixer_a/?ref=search_posts",
  "ups": 6,
  "url": "https://www.reddit.com/r/tabled/comments/185ve8/table_iama_i_am_the_creator_of_social_fixer_a/",
  "title": "[Table] IAmA: I am the creator of Social Fixer, a popular RES-like browser extension that customizes Facebook.  AMA!"
}