{
  "clicked": false,
  "_replaced_more": false,
  "archived": true,
  "num_comments": 112,
  "created": 1373522762.0,
  "saved": false,
  "selftext": "First off, I apologize for the largely empty SOTA. I dicked it all up like a moron. In a way you le redditors can understand, I friendzoned you all. I'm not too proud to admit when I fuck up, and I’m working to actually try and fix things that broke after Testival. Also fuck you I’m still new to this shit.\n\nThis is going to be a long one, because everyone knows post length is directly related to penis length, and PGL whipped his out first.There’s a lot of information you guys deserve that I haven’t been providing for the last week or two, and you should really hear it from me instead of scrouging through various forums to get it\n\nC.R.E.A.M.\n\nI’m going to get this out of the way first. Financially we're finally to the point where I need to ask people to contribute. We’ve been welping things pretty much since I took over, and the wallets are finally worn out.\n\nOf course, TEST isn’t relying entirely on enterprising individuals to bear the extra burden. We have a few plans in motion that should hopefully pull us up by our bootstraps and prepare us for the next few months’ worth of doing things. Additionally, Packetninja has a few monkies working on pounding out a new TEST finances application - he's a bit busy being poor to do it himself. More transparency will arrive as soon as they're done (which I'm sure will be conveniently timed to occur when we're no longer poor, unintentionally).\n\nLong term we’re still looking alright, but war isn’t meant to be easy or cheap; that said, I want more than anything to keep you guys flying spaceships, fighting, and having fun – that’s why we subscribe, right?\n\nIn fact, half of the reimbursement queue was taken care of just today.\n\nIf you would like to contribute your cash or energy to help the alliance financial situation, details will be kept in this thread (https://forum.please...ove-and-beyond/ ). Additionally, watch for further news posts with details about things like war bond programs.\n\nSpeaking of war...\n\nWAR\n\nPAST\n\nWhen the CFC first launched their invasion, I warned you all that it would be a long drawn-out war, and so far that’s been pretty much true. It’s shown us some of our own strengths, and taught us where we need to improve. The announcement helped us garner the support of a hell of a lot of people across EVE. Our strength in 1-SMEB was legendary, and inspired both fear and respect in alliances all over the game, but Goons throwing themselves on our swords was a great reason for many groups to come get a piece of the action.\n\nThe CFC thought we would be weakened, softened, and ripe for killing after our skirmishes in Delve – and they just happened to be in the market for a new home. And yet here we are weeks later only short about 10 systems. A far cry from the last time Goons led a war and swept through a region in roughly a week.\n\nMeanwhile, the CFC propaganda engine tried to claim I had burned our relationships across the galaxy, in reality the CFC were the only group entirely unwilling to work with us. Pretty much.\n\nWe currently have the N3 living in Hophib, Fountain, and nearby Aridia. They almost foam at the mouth at the thought of killing CFC, and we’ve given them a good chance to do it. We also have various smaller groups on our side nearby, and we have allies staged to harass much of CFC territory and access – we even have a relationship with 401K as they break down structures and fleets in the north. We initially worked with BL as well, out of a mutual distaste for Goons; unfortunately for us, BL’s desire for cash and killmails finally led them to drop out of the war, and go back to killing Revenants and otherwise elite-pvping against anyone with a spaceship.\n\nPRESENT\n\nBy now you’ve seen Beffah’s military update, the first in what will hopefully be somewhat frequent rolling status updates by various leadership and FCs. Maybe you’ve attended one of her military specific Q&As, or posted in one of the Q&A forum threads. There’s a professional, god-like, legendary N3 update cross-posted on our forums as well.\n\nInitially, the CFC rolled through northern Fountain as we took our time moving to Karan. They cut a deal with Sort Dragon for the remaining o7m8 stations and sov, killing at least one supercap build belonging to someone TEST promised wouldn’t die to our hands – Sort Dragon wanted to screw us for a while, and finally had his shot. It seems like the CFC were almost taking credit S2N Citizens/Nulli Legio heist, until they saw how mad it made everyone. I think the total damage count was a stolen 400b ISK and 211 systems left sov-less, forcing the N3 to fly home and fix things.\nOnce we moved to Karan, things got VERY exciting. We’ve managed to put up an incredible defense against the brute force of thousands of northmen. Currently, the CFC holds a whopping TEN systems in Fountain. Embarassing, almost.\n\nShit, I didn’t even know z9pp existed until we lost 27 carriers there.\n\nIf you look at that map link, you’ll notice that all of the o7m8 systems save 4-EP were safely returned to TEST control. I guess this means that technically the CFC has lost more stations in this war than we have, but they did also drop a new green dong in 4-ep and may even move there still.\n\nThe stunning infiltration of N3 and the subsequent loss of their space knocked them out of the war… for a whole 18 hours. They, with the help of PL (and I think a little from TEST), crunched through a mind-blowing 211 systems in a day (at a rate of 9 minutes per station, or something silly). Even the goon propaganda machine was knocked for a loop, and what began as all but taking credit eventually turned into thinly veiled attempts to suck PL’s dick (shameless plug of my response and twitter). During these hours, the CFC (clearly high on smug) put 20 Fountain systems into reinforce – only to cower at home as we saved 19 the next day.\n\nWe’ve since lost Z9PP, but not after an absolutely immense fight for the system. TEST is a young alliance, all said and done, and we made a few rookie mistakes with fleet coordination and watching clocks. We were saved when a CCP typo knocked the server offline for a brief intermission, just long enough to let us escape and shovel thousands of goon rage-posts onto the EVE-O forums. I won’t sugar coat it, that was a hell of a fun fight, but it could’ve meant the end of TEST capfleets for weeks, or maybe months. Everyone in leadership learned a little, though, and hopefully we won’t let such a sacrifice happen again… or at least we’ll save it for something actually important. I was there for half of Z9PP, but I can’t do a proper recap in a post that’s already 1200 words long. Here’s the Manfred Sidious one (warning, smug triggers: TMC link)\n\nFUTURE\n\nLately we’ve been timing a lot of stuff for AUTZ due to the dominance of our side’s combined strength in the wee hours of the night. We don’t have toomany moontime FCs, but under the leadership of people like Canaris Roshaak and Progodlegend, our combined TEST/N3 fleets have had great success pushing back against the CFC. As PGL said, things aren’t PERFECT, but we are pretty dominant. I almost wish I was unemployed so I could go on these fleets every night… almost.\n\nSome of you have expressed interests in joining the alternative fleetcomps our allies fly. To that end, I can happily say right now that we’ve worked some technical problems out, and there will be a lot more mixed-alliance Rokh/Domi/Goku/Talwar fleets, and potentially some new compositions coming up soon (not megathrons, though, that’s a bad idea).\n\nOn our end, you absolutely need to get your proper ships for our doctrines. Realistically, you should be able to have a ship available for every major doctrine we use. In case you forgot, make sure you have ships for\n\n· Rokhtrine\n· Foxcats\n· ECM support fleet (blackbird supremacy)\n· ShieldOracleFleet (as mentioned in the Beffah mil update, more coming soon)\n· Bombers\n· Talwars\n· … and hell, dust off the Ahacs too.\n\nNewer pilots should prioritize ECM fleet blackbirds, talwars, maybe bombers. Older pilots should have enough SP to be useful in at least a few of those comps – remember, Logi is always baller status. We're not adding a new battleship doctrine yet, but we are looking at dozens of options for fleetcomp improvements and changes.\n\nAdditionally, I'm currently working with various leadership groups to make sure everyone is trying to improve together as best we can. If you feel I need to pay more attention to your specific bunch of nerdlets, let me know – otherwise, rest assured that I and the rest of leadership are working very hard to improve areas of TEST you guys have been talking about in a negative light.\n\nBut if we’re going to continue enjoying the hell out of this war, everyone in TEST has to want it. We need to be intensely focused, we need to be as strong as possible, we ALL need to give this war 100%.\n\nSimply put, this war is unlike anything TEST has ever done. It’s going to take more effort, more time and energy, more coordination and communication than we’ve ever had to pull together. We’re showing how we can play with the established powerbloc alliances, and we need to make sure we’re operating at a proper level. The alternative is packing everything up and finding somewhere to take an EVEcation for a few weeks, and TEST deserves far better than being kicked out of our home just yet, and we’ve all put too much in to quit now. I’ve seen TEST perform far better, I know TEST can fight far stronger, we all know we can do much more than we have been over the last few days.\n\nFCs, give me your talents. Logistics, give me your persistence. Recon, give me your eyes. Leadership, give me your voices. Mentors, give me your patience. TEST, give me your strength and dedication, and we ABSOLUTELY CAN win this war.\n\nWe’ve blunted the CFC’s edge even by half-assing a lot of things during their invasion. Outside of EU time, the CFC has been reduced to shooting structures in bombers and wulfpax – and they still rarely have the balls to use caps. Remember, when the goons are too afraid to undock, it’s a victory for TEST and Fountain defense.\n\nIf you can do more than just X up for fleets, please join the various interest groups that need more bodies (Logistics, Recon, FC groups, anything). Most of their recruitment posts can be founs here.\n\nWe need to stop their constant harassment, instead of letting it proceed unopposed. This requires FCs, coordination, and a hell of a lot of fights. Kill their cowardfleet bombers and their backup frigfleets. And when the big fights need to happen, give me the famous TEST 3 or 4 full fleets of on-doctrine ships. You’re demanding that we clean up the Fountain invasion and start pushing north; if you give me the power to do so, we can make it happen.\n\nNARRATIVE\n\nSome people want some kind of story, some reason to log in. But it’s pretty simple, really.\n\nFirst, stating the obvious, the CFC has decided they deserve our space more than we do. They want to remove us from our home, for the sake of having a little extra cash.\n\nWE WILL return the favor.\n\nThe CFC have been kind enough to give us the opportunity to drive them off push them right out of nullsec, and WE WILL NOT LET IT GO TO WASTE. As I said earlier, we aren’t the only people who have a reason to kill the CFC, and Goons know full well their empire will not survive against our full strength. This is why they metagame and try to drive us apart. They’ve never faced a fight like this, and after trying to provoke us, they resorted to throwing the first punch in order to try and knock us out as quickly as possible.\n\nTHE GOONS HAVE STARTED THIS WAR, BUT IT WILL ONLY END WHEN WE STOP FIGHTING. If you give up now, it’s over way too soon - and I'M NOT DONE WITH TEST YET.\n\nThat’s all the reason I need to continue dumping my energy into TEST, that’s all the reason you should need to log in and murder CFC fleets with me. Trust me to continue doing the right thing, even when – ESPECIALLY when I make mistakes. Volunteer to help take the load off stressed mid-tier leadership. Join fleets constantly, or make your own. There's always something or someone to kill.\n\nLet’s break apart these invaders and push them straight through Cloud Ring, Fade, Pure Blind, Deklein and VFK, and all the way back out to lowsec on the other side. ",
  "mod_reports": [],
  "secure_media_embed": {},
  "edited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First off, I apologize for the largely empty SOTA. I dicked it all up like a moron. In a way you le redditors can understand, I friendzoned you all. I&#39;m not too proud to admit when I fuck up, and I’m working to actually try and fix things that broke after Testival. Also fuck you I’m still new to this shit.</p>\n\n<p>This is going to be a long one, because everyone knows post length is directly related to penis length, and PGL whipped his out first.There’s a lot of information you guys deserve that I haven’t been providing for the last week or two, and you should really hear it from me instead of scrouging through various forums to get it</p>\n\n<p>C.R.E.A.M.</p>\n\n<p>I’m going to get this out of the way first. Financially we&#39;re finally to the point where I need to ask people to contribute. We’ve been welping things pretty much since I took over, and the wallets are finally worn out.</p>\n\n<p>Of course, TEST isn’t relying entirely on enterprising individuals to bear the extra burden. We have a few plans in motion that should hopefully pull us up by our bootstraps and prepare us for the next few months’ worth of doing things. Additionally, Packetninja has a few monkies working on pounding out a new TEST finances application - he&#39;s a bit busy being poor to do it himself. More transparency will arrive as soon as they&#39;re done (which I&#39;m sure will be conveniently timed to occur when we&#39;re no longer poor, unintentionally).</p>\n\n<p>Long term we’re still looking alright, but war isn’t meant to be easy or cheap; that said, I want more than anything to keep you guys flying spaceships, fighting, and having fun – that’s why we subscribe, right?</p>\n\n<p>In fact, half of the reimbursement queue was taken care of just today.</p>\n\n<p>If you would like to contribute your cash or energy to help the alliance financial situation, details will be kept in this thread (<a href=\"https://forum.please...ove-and-beyond/\">https://forum.please...ove-and-beyond/</a> ). Additionally, watch for further news posts with details about things like war bond programs.</p>\n\n<p>Speaking of war...</p>\n\n<p>WAR</p>\n\n<p>PAST</p>\n\n<p>When the CFC first launched their invasion, I warned you all that it would be a long drawn-out war, and so far that’s been pretty much true. It’s shown us some of our own strengths, and taught us where we need to improve. The announcement helped us garner the support of a hell of a lot of people across EVE. Our strength in 1-SMEB was legendary, and inspired both fear and respect in alliances all over the game, but Goons throwing themselves on our swords was a great reason for many groups to come get a piece of the action.</p>\n\n<p>The CFC thought we would be weakened, softened, and ripe for killing after our skirmishes in Delve – and they just happened to be in the market for a new home. And yet here we are weeks later only short about 10 systems. A far cry from the last time Goons led a war and swept through a region in roughly a week.</p>\n\n<p>Meanwhile, the CFC propaganda engine tried to claim I had burned our relationships across the galaxy, in reality the CFC were the only group entirely unwilling to work with us. Pretty much.</p>\n\n<p>We currently have the N3 living in Hophib, Fountain, and nearby Aridia. They almost foam at the mouth at the thought of killing CFC, and we’ve given them a good chance to do it. We also have various smaller groups on our side nearby, and we have allies staged to harass much of CFC territory and access – we even have a relationship with 401K as they break down structures and fleets in the north. We initially worked with BL as well, out of a mutual distaste for Goons; unfortunately for us, BL’s desire for cash and killmails finally led them to drop out of the war, and go back to killing Revenants and otherwise elite-pvping against anyone with a spaceship.</p>\n\n<p>PRESENT</p>\n\n<p>By now you’ve seen Beffah’s military update, the first in what will hopefully be somewhat frequent rolling status updates by various leadership and FCs. Maybe you’ve attended one of her military specific Q&amp;As, or posted in one of the Q&amp;A forum threads. There’s a professional, god-like, legendary N3 update cross-posted on our forums as well.</p>\n\n<p>Initially, the CFC rolled through northern Fountain as we took our time moving to Karan. They cut a deal with Sort Dragon for the remaining o7m8 stations and sov, killing at least one supercap build belonging to someone TEST promised wouldn’t die to our hands – Sort Dragon wanted to screw us for a while, and finally had his shot. It seems like the CFC were almost taking credit S2N Citizens/Nulli Legio heist, until they saw how mad it made everyone. I think the total damage count was a stolen 400b ISK and 211 systems left sov-less, forcing the N3 to fly home and fix things.\nOnce we moved to Karan, things got VERY exciting. We’ve managed to put up an incredible defense against the brute force of thousands of northmen. Currently, the CFC holds a whopping TEN systems in Fountain. Embarassing, almost.</p>\n\n<p>Shit, I didn’t even know z9pp existed until we lost 27 carriers there.</p>\n\n<p>If you look at that map link, you’ll notice that all of the o7m8 systems save 4-EP were safely returned to TEST control. I guess this means that technically the CFC has lost more stations in this war than we have, but they did also drop a new green dong in 4-ep and may even move there still.</p>\n\n<p>The stunning infiltration of N3 and the subsequent loss of their space knocked them out of the war… for a whole 18 hours. They, with the help of PL (and I think a little from TEST), crunched through a mind-blowing 211 systems in a day (at a rate of 9 minutes per station, or something silly). Even the goon propaganda machine was knocked for a loop, and what began as all but taking credit eventually turned into thinly veiled attempts to suck PL’s dick (shameless plug of my response and twitter). During these hours, the CFC (clearly high on smug) put 20 Fountain systems into reinforce – only to cower at home as we saved 19 the next day.</p>\n\n<p>We’ve since lost Z9PP, but not after an absolutely immense fight for the system. TEST is a young alliance, all said and done, and we made a few rookie mistakes with fleet coordination and watching clocks. We were saved when a CCP typo knocked the server offline for a brief intermission, just long enough to let us escape and shovel thousands of goon rage-posts onto the EVE-O forums. I won’t sugar coat it, that was a hell of a fun fight, but it could’ve meant the end of TEST capfleets for weeks, or maybe months. Everyone in leadership learned a little, though, and hopefully we won’t let such a sacrifice happen again… or at least we’ll save it for something actually important. I was there for half of Z9PP, but I can’t do a proper recap in a post that’s already 1200 words long. Here’s the Manfred Sidious one (warning, smug triggers: TMC link)</p>\n\n<p>FUTURE</p>\n\n<p>Lately we’ve been timing a lot of stuff for AUTZ due to the dominance of our side’s combined strength in the wee hours of the night. We don’t have toomany moontime FCs, but under the leadership of people like Canaris Roshaak and Progodlegend, our combined TEST/N3 fleets have had great success pushing back against the CFC. As PGL said, things aren’t PERFECT, but we are pretty dominant. I almost wish I was unemployed so I could go on these fleets every night… almost.</p>\n\n<p>Some of you have expressed interests in joining the alternative fleetcomps our allies fly. To that end, I can happily say right now that we’ve worked some technical problems out, and there will be a lot more mixed-alliance Rokh/Domi/Goku/Talwar fleets, and potentially some new compositions coming up soon (not megathrons, though, that’s a bad idea).</p>\n\n<p>On our end, you absolutely need to get your proper ships for our doctrines. Realistically, you should be able to have a ship available for every major doctrine we use. In case you forgot, make sure you have ships for</p>\n\n<p>· Rokhtrine\n· Foxcats\n· ECM support fleet (blackbird supremacy)\n· ShieldOracleFleet (as mentioned in the Beffah mil update, more coming soon)\n· Bombers\n· Talwars\n· … and hell, dust off the Ahacs too.</p>\n\n<p>Newer pilots should prioritize ECM fleet blackbirds, talwars, maybe bombers. Older pilots should have enough SP to be useful in at least a few of those comps – remember, Logi is always baller status. We&#39;re not adding a new battleship doctrine yet, but we are looking at dozens of options for fleetcomp improvements and changes.</p>\n\n<p>Additionally, I&#39;m currently working with various leadership groups to make sure everyone is trying to improve together as best we can. If you feel I need to pay more attention to your specific bunch of nerdlets, let me know – otherwise, rest assured that I and the rest of leadership are working very hard to improve areas of TEST you guys have been talking about in a negative light.</p>\n\n<p>But if we’re going to continue enjoying the hell out of this war, everyone in TEST has to want it. We need to be intensely focused, we need to be as strong as possible, we ALL need to give this war 100%.</p>\n\n<p>Simply put, this war is unlike anything TEST has ever done. It’s going to take more effort, more time and energy, more coordination and communication than we’ve ever had to pull together. We’re showing how we can play with the established powerbloc alliances, and we need to make sure we’re operating at a proper level. The alternative is packing everything up and finding somewhere to take an EVEcation for a few weeks, and TEST deserves far better than being kicked out of our home just yet, and we’ve all put too much in to quit now. I’ve seen TEST perform far better, I know TEST can fight far stronger, we all know we can do much more than we have been over the last few days.</p>\n\n<p>FCs, give me your talents. Logistics, give me your persistence. Recon, give me your eyes. Leadership, give me your voices. Mentors, give me your patience. TEST, give me your strength and dedication, and we ABSOLUTELY CAN win this war.</p>\n\n<p>We’ve blunted the CFC’s edge even by half-assing a lot of things during their invasion. Outside of EU time, the CFC has been reduced to shooting structures in bombers and wulfpax – and they still rarely have the balls to use caps. Remember, when the goons are too afraid to undock, it’s a victory for TEST and Fountain defense.</p>\n\n<p>If you can do more than just X up for fleets, please join the various interest groups that need more bodies (Logistics, Recon, FC groups, anything). Most of their recruitment posts can be founs here.</p>\n\n<p>We need to stop their constant harassment, instead of letting it proceed unopposed. This requires FCs, coordination, and a hell of a lot of fights. Kill their cowardfleet bombers and their backup frigfleets. And when the big fights need to happen, give me the famous TEST 3 or 4 full fleets of on-doctrine ships. You’re demanding that we clean up the Fountain invasion and start pushing north; if you give me the power to do so, we can make it happen.</p>\n\n<p>NARRATIVE</p>\n\n<p>Some people want some kind of story, some reason to log in. But it’s pretty simple, really.</p>\n\n<p>First, stating the obvious, the CFC has decided they deserve our space more than we do. They want to remove us from our home, for the sake of having a little extra cash.</p>\n\n<p>WE WILL return the favor.</p>\n\n<p>The CFC have been kind enough to give us the opportunity to drive them off push them right out of nullsec, and WE WILL NOT LET IT GO TO WASTE. As I said earlier, we aren’t the only people who have a reason to kill the CFC, and Goons know full well their empire will not survive against our full strength. This is why they metagame and try to drive us apart. They’ve never faced a fight like this, and after trying to provoke us, they resorted to throwing the first punch in order to try and knock us out as quickly as possible.</p>\n\n<p>THE GOONS HAVE STARTED THIS WAR, BUT IT WILL ONLY END WHEN WE STOP FIGHTING. If you give up now, it’s over way too soon - and I&#39;M NOT DONE WITH TEST YET.</p>\n\n<p>That’s all the reason I need to continue dumping my energy into TEST, that’s all the reason you should need to log in and murder CFC fleets with me. Trust me to continue doing the right thing, even when – ESPECIALLY when I make mistakes. Volunteer to help take the load off stressed mid-tier leadership. Join fleets constantly, or make your own. There&#39;s always something or someone to kill.</p>\n\n<p>Let’s break apart these invaders and push them straight through Cloud Ring, Fade, Pure Blind, Deklein and VFK, and all the way back out to lowsec on the other side. </p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "user_reports": [],
  "over_18": false,
  "score": 79,
  "stickied": false,
  "domain": "self.Eve",
  "is_self": true,
  "hidden": false,
  "_orphaned": {},
  "_api_link": "https://api.reddit.com/r/Eve/comments/1i28n5/test_war_update_redone/?ref=search_posts",
  "_comments_by_id": {},
  "visited": false,
  "thumbnail": "",
  "_has_fetched": true,
  "gilded": 0,
  "hide_score": false,
  "_info_url": "https://api.reddit.com/api/info/",
  "created_utc": 1373522762.0,
  "subreddit_id": "t5_2qil9",
  "id": "1i28n5",
  "_params": {},
  "media_embed": {},
  "name": "t3_1i28n5",
  "quarantine": false,
  "permalink": "https://www.reddit.com/r/Eve/comments/1i28n5/test_war_update_redone/?ref=search_posts",
  "ups": 79,
  "url": "https://www.reddit.com/r/Eve/comments/1i28n5/test_war_update_redone/",
  "title": "test war Update (redone)"
}