{
  "downs": 0,
  "mod_reports": [],
  "secure_media_embed": {},
  "_info_url": "https://api.reddit.com/api/info/",
  "gilded": 1,
  "num_comments": 326,
  "_orphaned": {},
  "hidden": false,
  "ups": 1118,
  "url": "https://www.reddit.com/r/fatpeoplestories/comments/24vc7l/chibiham_juicy_me_the_calvary_chapter_17/",
  "_has_fetched": true,
  "quarantine": false,
  "name": "t3_24vc7l",
  "author_flair_text": "Feeling depressed that Reddit is dying. Luv you all.",
  "user_reports": [],
  "saved": false,
  "permalink": "https://www.reddit.com/r/fatpeoplestories/comments/24vc7l/chibiham_juicy_me_the_calvary_chapter_17/?ref=search_posts",
  "over_18": false,
  "is_self": true,
  "_params": {},
  "thumbnail": "self",
  "created_utc": 1399390358.0,
  "_replaced_more": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We are getting close to the end of the story. What more can I say?</p>\n\n<p><strong>Current Recipes:</strong><br/>\n<a href=\"http://i.imgur.com/CYzEPyc\">Miso soup</a>, <a href=\"http://i.imgur.com/jeUSrl2\">Potato Salad</a>, <a href=\"http://i.imgur.com/fOI4kLl\">Yakisoba</a>, <a href=\"http://i.imgur.com/skz1IJR\">Okonomiyaki</a>, <a href=\"http://i.imgur.com/qpdrUdV.png\">Yakitori</a>, <a href=\"http://i.imgur.com/dFK2zM5\">Nikujaga</a>, <a href=\"http://i.imgur.com/z5DqLzv.png\">Tako-yaki</a>, <a href=\"http://i.imgur.com/TrCPOrw.png\">Goya Chanpuru</a>          </p>\n\n<p><strong>Back Issues</strong><br/>\n<a href=\"http://www.reddit.com/r/fatpeoplestories/comments/2214cv/chibiham_juicy_and_me_preface/\">Preface</a>, <a href=\"http://www.reddit.com/r/fatpeoplestories/comments/222374/chibiham_juicy_and_me_yokoso_chapter_1/\">Chapter 1</a>, <a href=\"http://www.reddit.com/r/fatpeoplestories/comments/227ebf/chibiham_juicy_and_me_lazy_ham_chapter_2/\">Chapter 2</a>, \n<a href=\"http://www.reddit.com/r/fatpeoplestories/comments/229seg/chapter_3_high_fashion_ham_chapter_3/\">Chapter 3</a>, <a href=\"http://www.reddit.com/r/fatpeoplestories/comments/22cscv/chibiham_juicy_and_me_picky_eating_will_make_you/\">Chapter 4</a>, <a href=\"http://www.reddit.com/r/fatpeoplestories/comments/22iszt/chibiham_juicy_me_japanese_bathroom_chapter_5/\">Chapter 5</a>, <a href=\"http://www.reddit.com/r/fatpeoplestories/comments/22m8u1/chibiham_juicy_me_all_clean_chapter_6/\">Chapter 6</a>, <a href=\"http://www.reddit.com/r/fatpeoplestories/comments/22q03e/chibiham_juicy_me_mama_and_the_kimono_part_7/\">Chapter 7</a>, <a href=\"http://www.reddit.com/r/fatpeoplestories/comments/22uqi3/chibiham_juicy_me_versus_mama_chapter_8/\">Chapter 8</a>, <a href=\"http://www.reddit.com/r/fatpeoplestories/comments/235325/chibiham_juicy_me_boys_boys_boys_chapter_9/\">Chapter 9</a>, <a href=\"http://www.reddit.com/r/fatpeoplestories/comments/23b0c5/chibiham_juicy_me_the_anklet_chapter_10/\">Chapter 10</a>, <a href=\"http://www.reddit.com/r/fatpeoplestories/comments/23gldw/chibiham_juicy_me_geisha_in_the_closet_chapter_11/\">Chapter 11</a>, <a href=\"http://www.reddit.com/r/fatpeoplestories/comments/23mx3w/chibiham_juicy_me_too_conbini_chapter_12/\">Chapter 12</a>, <a href=\"http://redd.it/245t3x\">Chapter 13</a>, <a href=\"http://redd.it/24aguv\">Chapter 14</a>, <a href=\"http://redd.it/24j4rb\">Chapter 15</a>, <a href=\"http://redd.it/24ot3e\">Chapter 16</a><br/>\n<a href=\"https://i.imgur.com/suc4MPz.jpg\">Mini Story 1</a>, <a href=\"http://i.imgur.com/XOX9xH4.jpg\">Mini Story 2</a>, <a href=\"http://i.imgur.com/3WOn3NL.png\">Mini Story 3</a>, <a href=\"http://redd.it/24pxvd\">Mini Story 4</a>     </p>\n\n<p><strong>Chibiham, Juicy &amp; Me: The Cavalry (Chapter 17)</strong>     </p>\n\n<p>It was nearing the time Chibiham had planned to go home. Chibiham only had five days or so before she would have to board the big metal bird and flap her way back to Tennessee.<br/>\nIt was around that time that Mama surprised us all with an announcement that in the evening we would all go to a special place for dinner – an <em>okiya</em>, or geisha teahouse, with real geisha and a full-course Japanese meal. <a href=\"http://i.imgur.com/Z6xsYdI\">You can imagine how Chibiham reacted</a>.      </p>\n\n<p>There, she told us, we were going to perform the two dances we had learned over the past three weeks for everyone. Who was everyone? Mama explained that Papa and a few of Mama&#39;s friends would be there. “After all,” she explained, “what is the point of learning to dance like a geisha if you have nowhere to show it off?”     </p>\n\n<p>Mama took us into another room and showed us that she had purchased for all of us a brightly-colored <em>kappore</em> costume in Asakusa. She even had one made in Chibiham&#39;s size. We oohed and ahhed and thanked Mama for the gifts. I knew she would make me use it for a long while after this.<br/>\nAnd then Mama turned to Chibiham. “You have come a long way,” she told her. “You&#39;ve become quite mature. Look at you, kneeling <em>seiza</em> like that. You haven&#39;t even asked for sweets this past week, and you have learned to say please and thank you and apologize like a real geisha.”<br/>\nIt was more than that – Chibiham was no longer smelly or sweaty like she used to be, she did her hair and makeup nicely as Mama had taught her. And most of all (at least in terms of FPS....)<br/>\n“I think you have even lost weight,” Mama giggled.<br/>\nChibiham&#39;s face lit up for a moment. “Can you tell?” and then suddenly, as if someone had blown out a candle, that joy was gone.<br/>\n“I think you will become a great geisha, Chibiham. So I had this made for you,” and with that, Mama pulled out another long, thin package, and opened it. It was a beautiful <em>furisode</em> in bright, vibrant colors. <a href=\"http://i.imgur.com/STIxxKm\">And it was made to Chibiham&#39;s measurements</a>.<br/>\nChibiham was dumbfounded. It was a kimono, just like she had always wanted. While Chibiham gushed over the item, Mama had gone to the closet and pulled out a number of other pretty items – hair pins, <em>obi</em> belt decorations and a long <em>uchi-kake</em>, which is like a fancy jacket. She put them all on Chibiham for a nice girly fashion show.<br/>\n“Look at how pretty you have become, Chibiham! Just like a real geisha.” Mama said to her.<br/>\nChibiham took pictures with Mama and Juicy and myself, asking if she could keep the clothing on until the evening. Mama turned her down, telling her how the kimono was not practical, especially with the heavy <em>uchikake</em> jacket, but that they would practice for an hour from now on so that she could get a feel for the dress.     </p>\n\n<p>Chibiham bounced about all day feeling like a million dollars. She imitated Mama&#39;s every move and didn&#39;t complain anymore when Mama told her to make this or that or clean this or that.     </p>\n\n<p>In the afternoon, just before we had planned to leave, I was looking for Chibiham. I found her by my computer. “Chibiham, let&#39;s go,” I called to her. <a href=\"http://i.imgur.com/v8nw1zx\">But when I went into the room, she looked cross</a>.<br/>\n“What are you doing, Chibiham?” I asked her.<br/>\n“Nothing. Just checking my facebook,” she replied, still sullen. She quickly turned the computer off. “Let me get my stuff together.”<br/>\nShe shuffled around the room and I told her to meet us downstairs in five, but there had been a noticeable change in her demeanor since the morning.     </p>\n\n<p>Chibiham was quiet in the taxi as Mama explained how we had a room set up of us in which we could change and do our makeup. We would perform the <em>Ume wa Saita</em> geisha song first because it took the most amount of time to prepare for, and then <em>Kappore</em> later because it would let us drink and jump around in our clothing after we got drunk.<br/>\nInside the <em>Okiya</em>, Mama&#39;s friends greeted us. They lead us all inside to a room with big mirrors, makeup all set up, and pretty <em>geiko</em>-in-training waiting to do our hair for us! <a href=\"http://i.imgur.com/LDeTBAs\">Since Chibiham had such short hair, the girls had brought in a wig for her</a>.<br/>\nChibiham sat at her mirror and took out the geisha picture that Mama had given her when she just arrived. She asked the <em>geiko</em>, “can you make me look like this?”<br/>\nThe pretty geiko smiled at her. “Just like that? Okay!” and the makeup began.     </p>\n\n<p>A couple hours went by. In the waiting room, we got all dressed in our complicated <em>furisode</em> clothing (Juicy and I were just wearing costumes borrowed from Mama) with pale white makeup. Chibiham had to practice dancing in her heavy wig, so she went into a different room with more space.<br/>\nEventually Juicy came into the room to tell us that the guests had all arrived, and that we would start in a few minutes. Juicy and I went into the practice room next door to tell Chibiham.<br/>\nAnd oh, Chibiham.<br/>\nThere she was, <a href=\"http://i.imgur.com/X21mHG0\">sprawled out in the middle of the floor, surrounded in candy wrappers and covered in chocolate</a>.<br/>\nHer makeup was not only ruined, but the white face paint had run down the front of her beautiful new kimono and dripped onto the brocade <em>uchi-kake</em> Mama had borrowed for her.<br/>\nShe was in tears.     </p>\n\n<p>“Chibiham...” I was in shock and didn&#39;t know what to say.     </p>\n\n<p>Chibiham grew suddenly angry. “What! What is it! I&#39;m allowed to eat whatever I want, whenever I want! Why do you look at me like that? You think you&#39;re better than me, don&#39;t you!! Trying to make me into something I&#39;m not! Well screw you guys! You&#39;ve been tricking me all this time, haven&#39;t you! Trying to turn me anorexic like you! I&#39;m not stupid!!” and she continued to rant, using all sorts of untranslatable expletives. Suddenly that loud, high-pitched yell I had heard back in the airport when she first arrived came rushing back. It echoed through the hall as she berated me, berated Mama and Juicy. We were all out to get her, she said.<br/>\n“You tricked me into coming here! I hate all of you! I hate Mama, I hate Juicy, and I hate you most of all, Paprika!”     </p>\n\n<p>She fell over in a dramatic flop and bawled again like a six-year-old.<br/>\nThe <em>geiko</em> peeked in from the halls. Juicy peeked in from behind the <em>fusuma</em>.<br/>\nAnd then, the <em>fusuma</em> opened.     </p>\n\n<p><a href=\"http://i.imgur.com/k4CBgSg\">There, at the table now visible after sliding open the paper door, sat Chibiham&#39;s parents</a>. My aunt and uncle. They were red in the face, speechless.<br/>\nAfter a long moment, Auntie finally blurted out, “Chibiham.”     </p>\n\n<p>Chibiham had her mouth gaping wide as she stared back at her parents.<br/>\n“What are you guys doing here?”<br/>\n“Chibiham, I have never in my life-” Auntie was at a loss for words.<br/>\nUncle was not. He stormed over to her. “Chibiham! Get up! How could you act like this! In front of all these people!”<br/>\nChibiham grew angry. “You don&#39;t understand! It&#39;s all Paprika&#39;s fault! She&#39;s been making fun of me since I got here! She&#39;s been starving me the whole time and it&#39;s like abuse, I tell you, they call me fat constantly! They&#39;ve been really mean, and you don&#39;t know what it&#39;s like!”<br/>\n“You apologize right now, or so help me-!!” Auntie scolded.<br/>\n<a href=\"http://i.imgur.com/Qr7e84N\">Chibiham began bawling again</a>. “How could you all gang up on my like this! You&#39;re all so mean!”<br/>\nAnd with wrappers flying, Chibiham bumbled to her feet and stormed out of the room as best she could.<br/>\nAuntie turned red-faced to face Papa, who was sitting next to her at the table. “I honestly don&#39;t know what to say. Has she been acting like this the whole time?”<br/>\nI nodded at her. “She hasn&#39;t had an outburst like that for a while, but... pretty much.”<br/>\n“Why didn&#39;t you tell me?” Auntie did ask.<br/>\n“I tried to, but...”<br/>\nJuicy&#39;s father, Papa, laughed. “Don&#39;t be silly. What would you have done from Tennessee? It isn&#39;t your responsibility to apologize for your adult children.  You entrusted her to us, so she is our responsibility.” The English-speaking businessman understood every word that had been tossed around.<br/>\nI asked the question most pressing. “What are you guys doing here?”<br/>\n<a href=\"http://i.imgur.com/QzNp8NI\">Juicy raised her hand</a>. “I invited them,” she explained.<br/>\nApparently, Auntie and Uncle had been watching Chibiham&#39;s adventures on Facebook, and messaged Juicy (who had been tagged in the photographs) a thank-you message. They struck up a conversation, and had decided to come to Japan for the last few days and surprise Chibiham. They wanted to see all the fun that Chibiham was gushing about for themselves.<br/>\n“You knew they were coming?” I gasped.<br/>\nJuicy nodded. “It was a surprise!” she smiled. She was very good at keeping secrets. <em>Not saying is a flower</em>, goes the saying in Japanese, and Juicy was surely the brightest flower of them all.        </p>\n\n<p>Now Chibiham had made a fool of herself in front of the whole family and her own. I trudged after her in order to fix the mess.     </p>\n\n<p><strong><a href=\"http://redd.it/251y7j\">To be continued</a>...</strong><br/>\n<em>Hey, thank you so much for the gold!</em></p>\n</div><!-- SC_ON -->",
  "author_flair_css_class": "",
  "subreddit_id": "t5_2vzax",
  "archived": true,
  "domain": "self.fatpeoplestories",
  "clicked": false,
  "score": 1118,
  "id": "24vc7l",
  "stickied": false,
  "media_embed": {},
  "visited": false,
  "selftext": "We are getting close to the end of the story. What more can I say?\n\n\n**Current Recipes:**     \n[Miso soup](http://i.imgur.com/CYzEPyc), [Potato Salad](http://i.imgur.com/jeUSrl2), [Yakisoba](http://i.imgur.com/fOI4kLl), [Okonomiyaki](http://i.imgur.com/skz1IJR), [Yakitori](http://i.imgur.com/qpdrUdV.png), [Nikujaga](http://i.imgur.com/dFK2zM5), [Tako-yaki](http://i.imgur.com/z5DqLzv.png), [Goya Chanpuru](http://i.imgur.com/TrCPOrw.png)          \n                              \n**Back Issues**     \n[Preface](http://www.reddit.com/r/fatpeoplestories/comments/2214cv/chibiham_juicy_and_me_preface/), [Chapter 1](http://www.reddit.com/r/fatpeoplestories/comments/222374/chibiham_juicy_and_me_yokoso_chapter_1/), [Chapter 2](http://www.reddit.com/r/fatpeoplestories/comments/227ebf/chibiham_juicy_and_me_lazy_ham_chapter_2/), \n[Chapter 3](http://www.reddit.com/r/fatpeoplestories/comments/229seg/chapter_3_high_fashion_ham_chapter_3/), [Chapter 4](http://www.reddit.com/r/fatpeoplestories/comments/22cscv/chibiham_juicy_and_me_picky_eating_will_make_you/), [Chapter 5](http://www.reddit.com/r/fatpeoplestories/comments/22iszt/chibiham_juicy_me_japanese_bathroom_chapter_5/), [Chapter 6](http://www.reddit.com/r/fatpeoplestories/comments/22m8u1/chibiham_juicy_me_all_clean_chapter_6/), [Chapter 7](http://www.reddit.com/r/fatpeoplestories/comments/22q03e/chibiham_juicy_me_mama_and_the_kimono_part_7/), [Chapter 8](http://www.reddit.com/r/fatpeoplestories/comments/22uqi3/chibiham_juicy_me_versus_mama_chapter_8/), [Chapter 9](http://www.reddit.com/r/fatpeoplestories/comments/235325/chibiham_juicy_me_boys_boys_boys_chapter_9/), [Chapter 10](http://www.reddit.com/r/fatpeoplestories/comments/23b0c5/chibiham_juicy_me_the_anklet_chapter_10/), [Chapter 11](http://www.reddit.com/r/fatpeoplestories/comments/23gldw/chibiham_juicy_me_geisha_in_the_closet_chapter_11/), [Chapter 12](http://www.reddit.com/r/fatpeoplestories/comments/23mx3w/chibiham_juicy_me_too_conbini_chapter_12/), [Chapter 13](http://redd.it/245t3x), [Chapter 14](http://redd.it/24aguv), [Chapter 15](http://redd.it/24j4rb), [Chapter 16](http://redd.it/24ot3e)      \n[Mini Story 1](https://i.imgur.com/suc4MPz.jpg), [Mini Story 2](http://i.imgur.com/XOX9xH4.jpg), [Mini Story 3] (http://i.imgur.com/3WOn3NL.png), [Mini Story 4](http://redd.it/24pxvd)     \n     \n     \n**Chibiham, Juicy & Me: The Cavalry (Chapter 17)**     \n    \n     \nIt was nearing the time Chibiham had planned to go home. Chibiham only had five days or so before she would have to board the big metal bird and flap her way back to Tennessee.      \nIt was around that time that Mama surprised us all with an announcement that in the evening we would all go to a special place for dinner – an *okiya*, or geisha teahouse, with real geisha and a full-course Japanese meal. [You can imagine how Chibiham reacted](http://i.imgur.com/Z6xsYdI).      \n     \nThere, she told us, we were going to perform the two dances we had learned over the past three weeks for everyone. Who was everyone? Mama explained that Papa and a few of Mama's friends would be there. “After all,” she explained, “what is the point of learning to dance like a geisha if you have nowhere to show it off?”     \n     \nMama took us into another room and showed us that she had purchased for all of us a brightly-colored *kappore* costume in Asakusa. She even had one made in Chibiham's size. We oohed and ahhed and thanked Mama for the gifts. I knew she would make me use it for a long while after this.     \nAnd then Mama turned to Chibiham. “You have come a long way,” she told her. “You've become quite mature. Look at you, kneeling *seiza* like that. You haven't even asked for sweets this past week, and you have learned to say please and thank you and apologize like a real geisha.”     \nIt was more than that – Chibiham was no longer smelly or sweaty like she used to be, she did her hair and makeup nicely as Mama had taught her. And most of all (at least in terms of FPS....)     \n“I think you have even lost weight,” Mama giggled.     \nChibiham's face lit up for a moment. “Can you tell?” and then suddenly, as if someone had blown out a candle, that joy was gone.     \n“I think you will become a great geisha, Chibiham. So I had this made for you,” and with that, Mama pulled out another long, thin package, and opened it. It was a beautiful *furisode* in bright, vibrant colors. [And it was made to Chibiham's measurements](http://i.imgur.com/STIxxKm).     \nChibiham was dumbfounded. It was a kimono, just like she had always wanted. While Chibiham gushed over the item, Mama had gone to the closet and pulled out a number of other pretty items – hair pins, *obi* belt decorations and a long *uchi-kake*, which is like a fancy jacket. She put them all on Chibiham for a nice girly fashion show.     \n“Look at how pretty you have become, Chibiham! Just like a real geisha.” Mama said to her.     \nChibiham took pictures with Mama and Juicy and myself, asking if she could keep the clothing on until the evening. Mama turned her down, telling her how the kimono was not practical, especially with the heavy *uchikake* jacket, but that they would practice for an hour from now on so that she could get a feel for the dress.     \n     \nChibiham bounced about all day feeling like a million dollars. She imitated Mama's every move and didn't complain anymore when Mama told her to make this or that or clean this or that.     \n     \nIn the afternoon, just before we had planned to leave, I was looking for Chibiham. I found her by my computer. “Chibiham, let's go,” I called to her. [But when I went into the room, she looked cross](http://i.imgur.com/v8nw1zx).     \n“What are you doing, Chibiham?” I asked her.     \n“Nothing. Just checking my facebook,” she replied, still sullen. She quickly turned the computer off. “Let me get my stuff together.”     \nShe shuffled around the room and I told her to meet us downstairs in five, but there had been a noticeable change in her demeanor since the morning.     \n     \nChibiham was quiet in the taxi as Mama explained how we had a room set up of us in which we could change and do our makeup. We would perform the *Ume wa Saita* geisha song first because it took the most amount of time to prepare for, and then *Kappore* later because it would let us drink and jump around in our clothing after we got drunk.       \nInside the *Okiya*, Mama's friends greeted us. They lead us all inside to a room with big mirrors, makeup all set up, and pretty *geiko*-in-training waiting to do our hair for us! [Since Chibiham had such short hair, the girls had brought in a wig for her](http://i.imgur.com/LDeTBAs).     \nChibiham sat at her mirror and took out the geisha picture that Mama had given her when she just arrived. She asked the *geiko*, “can you make me look like this?”     \nThe pretty geiko smiled at her. “Just like that? Okay!” and the makeup began.     \n         \nA couple hours went by. In the waiting room, we got all dressed in our complicated *furisode* clothing (Juicy and I were just wearing costumes borrowed from Mama) with pale white makeup. Chibiham had to practice dancing in her heavy wig, so she went into a different room with more space.     \nEventually Juicy came into the room to tell us that the guests had all arrived, and that we would start in a few minutes. Juicy and I went into the practice room next door to tell Chibiham.     \nAnd oh, Chibiham.     \nThere she was, [sprawled out in the middle of the floor, surrounded in candy wrappers and covered in chocolate](http://i.imgur.com/X21mHG0).     \nHer makeup was not only ruined, but the white face paint had run down the front of her beautiful new kimono and dripped onto the brocade *uchi-kake* Mama had borrowed for her.     \nShe was in tears.     \n     \n“Chibiham...” I was in shock and didn't know what to say.     \n     \nChibiham grew suddenly angry. “What! What is it! I'm allowed to eat whatever I want, whenever I want! Why do you look at me like that? You think you're better than me, don't you!! Trying to make me into something I'm not! Well screw you guys! You've been tricking me all this time, haven't you! Trying to turn me anorexic like you! I'm not stupid!!” and she continued to rant, using all sorts of untranslatable expletives. Suddenly that loud, high-pitched yell I had heard back in the airport when she first arrived came rushing back. It echoed through the hall as she berated me, berated Mama and Juicy. We were all out to get her, she said.     \n“You tricked me into coming here! I hate all of you! I hate Mama, I hate Juicy, and I hate you most of all, Paprika!”     \n     \nShe fell over in a dramatic flop and bawled again like a six-year-old.     \nThe *geiko* peeked in from the halls. Juicy peeked in from behind the *fusuma*.     \nAnd then, the *fusuma* opened.     \n     \n[There, at the table now visible after sliding open the paper door, sat Chibiham's parents](http://i.imgur.com/k4CBgSg). My aunt and uncle. They were red in the face, speechless.     \nAfter a long moment, Auntie finally blurted out, “Chibiham.”     \n     \nChibiham had her mouth gaping wide as she stared back at her parents.     \n“What are you guys doing here?”     \n“Chibiham, I have never in my life-” Auntie was at a loss for words.     \nUncle was not. He stormed over to her. “Chibiham! Get up! How could you act like this! In front of all these people!”     \nChibiham grew angry. “You don't understand! It's all Paprika's fault! She's been making fun of me since I got here! She's been starving me the whole time and it's like abuse, I tell you, they call me fat constantly! They've been really mean, and you don't know what it's like!”     \n“You apologize right now, or so help me-!!” Auntie scolded.     \n[Chibiham began bawling again](http://i.imgur.com/Qr7e84N). “How could you all gang up on my like this! You're all so mean!”     \nAnd with wrappers flying, Chibiham bumbled to her feet and stormed out of the room as best she could.     \nAuntie turned red-faced to face Papa, who was sitting next to her at the table. “I honestly don't know what to say. Has she been acting like this the whole time?”     \nI nodded at her. “She hasn't had an outburst like that for a while, but... pretty much.”     \n“Why didn't you tell me?” Auntie did ask.    \n“I tried to, but...”     \nJuicy's father, Papa, laughed. “Don't be silly. What would you have done from Tennessee? It isn't your responsibility to apologize for your adult children.  You entrusted her to us, so she is our responsibility.” The English-speaking businessman understood every word that had been tossed around.     \nI asked the question most pressing. “What are you guys doing here?”     \n[Juicy raised her hand](http://i.imgur.com/QzNp8NI). “I invited them,” she explained.     \nApparently, Auntie and Uncle had been watching Chibiham's adventures on Facebook, and messaged Juicy (who had been tagged in the photographs) a thank-you message. They struck up a conversation, and had decided to come to Japan for the last few days and surprise Chibiham. They wanted to see all the fun that Chibiham was gushing about for themselves.     \n“You knew they were coming?” I gasped.     \nJuicy nodded. “It was a surprise!” she smiled. She was very good at keeping secrets. *Not saying is a flower*, goes the saying in Japanese, and Juicy was surely the brightest flower of them all.        \n     \nNow Chibiham had made a fool of herself in front of the whole family and her own. I trudged after her in order to fix the mess.     \n      \n              \n**[To be continued](http://redd.it/251y7j)...**      \n*Hey, thank you so much for the gold!*",
  "hide_score": false,
  "_api_link": "https://api.reddit.com/r/fatpeoplestories/comments/24vc7l/chibiham_juicy_me_the_calvary_chapter_17/?ref=search_posts",
  "locked": false,
  "edited": 1399567941.0,
  "title": "Chibiham, Juicy & Me: The Calvary (Chapter 17)",
  "created": 1399393958.0,
  "_comments_by_id": {}
}