{
  "clicked": false,
  "_replaced_more": false,
  "archived": true,
  "post_hint": "self",
  "num_comments": 350,
  "created": 1423081472.0,
  "saved": false,
  "selftext": "There are only three basic components you need in order to put together your own 5.1, 6.1 or 7.1 surround system (a Receiver, some Speakers and a Subwoofer). The sum of these recommended separate parts will easily outperform 99% of even the most expensive [HTiB solutions](http://amzn.to/1m6a8yP) and standalone components have far more features and futureproofing. \n\n\nPick a budget above $500 and assemble your perfect system. If you don't think you can afford a good system right away consider starting with a 5.1 receiver and only two speakers for a basic 2.0 or add a sub and run a 2.1, you can always add onto it as funds become available. [This Build-up Post](http://redd.it/23d9ny) can help with that.\n\n___\n\n**{5.1 vs 7.1 Note:}** Your room makes this determination. If the room you are in doesn't have ~6 feet behind your seating positions you are likely not going to fit a 7.1 and should stick to 5.1\n\n**{.1}** This simply means a subwoofer. Since it isn't a full range channel they just indicate it as .1, some newer receivers claim .2 like 5.2, 7.2.. As far as I know that just means there are two ports. The same result could be accomplished with a Y splitter on a normal 5.1 or 7.1 receiver.\n\n**{MultiEQ, Audyssey, Room Correction}** These are features/programs that receivers come with to \"fix\" lousy speakers in lousy rooms. It uses a microphone to try and detect speaker size, distance, frequency cutoff, reverb delay, etc etc etc.. It can sometimes be a help in oddly shaped or echoy rooms OR with mis-matched/bad speakers. Running it on hardware you like or have never used may change the fundamental sound signature of your speakers so I recommend trying it with and without the room corrections and see what you like best.\n\n.\n\n---\n\n**Surround Receivers**-------\n\n---\n\n.\n\nI am going to link to the whole line of receivers by each brand. Look for the cheapest unit that fits all your needs (# of HDMI inputs, 5.1 or 7.1, Legacy inputs, Airplay, etc) Remember to Ignore wattage and stick to the brands listed below or message me if you find a good deal. Don't be afraid to look at last years models, most times very few changes occur and only a few \"*smart*\" features or HDMI ports are added.\n\n.\n\n-#-|Item------------------|Description - - - - - - - - - - - - - - - - - - - - -|Cheapest|\n:----|:----|:----|:----\n1 | [Denon](http://goo.gl/gKag39)| This is my most preferred brand. They are very clean looking, have amazing sound quality and some *little* features I like. Preset buttons and 1/2db volume increments make me happy. Affordability for beginners.  | [5.1](http://amzn.to/16nwMCm)--[7.1](http://amzn.to/1eBQR8m)\n2 | [Marantz](http://goo.gl/1SYNDU)|  Featuring the only \"slim\" line of receivers on the market and absolutely state of the art UI and remote features. Amazing reliability and great support. BUT you will be paying extra for these features.  | [5.1](http://amzn.to/1ezAOWo)--[7.1](http://amzn.to/1Dy1u6B)\n3 | [Yamaha](http://goo.gl/wx9ers)|  Sporting a remarkable amount of different receivers you will have to do some sorting. They have good sound quality and TONS of inputs including legacy but tend to have a confusing setup and remote layout.   | [5.1](http://www.amazon.com/gp/product/B00B981F38)--[7.1](http://amzn.to/1aiLXZq)\n4 | [Onkyo](http://goo.gl/dptehC)|  Normally higher on my recommended lists some Onkyo AVR's have been plagued with recent design flaws and overheating issues. Still I can't fault everything they make so read reviews and choose wisely. | [5.1](http://amzn.to/1eBSyTc)--[7.1](http://amzn.to/1qxocW7)\n5 | [Pioneer](http://goo.gl/Q2vzy2)| The Polk of receivers. They work and can be found at a bargain but since the [Pioneer Elite](http://goo.gl/bN2qJb) line exists they tend to leave a ton of features off these entry level AVR's. That just means you can get them cheap.| [5.1](http://amzn.to/U2l3Ti)--[7.1](http://amzn.to/1mxWZDG)\n6 | [Harmon/Kardon](http://goo.gl/1G0dd9)| Stylish but I can't find anything to love about H/K. They \"work\" but don't DO *anything* better than anybody else. You can usually find these at brick and Mortar Stores which means price matching heaven. | [5.1](http://amzn.to/1j2Ivu0)--[7.1](http://www.amazon.com/Harman-Kardon-AVR-2650-Discontinued/dp/B0054N9RQQ)\n.\nAs a one off [Emotiva](https://emotiva.com/products/receivers/fusion-8100) has pushed out the Fusion 8100. Only 65wpc and missing some of the \"fancy\" features this affordable and \"SLIM\" unit has full pre-outs and is 7.2 compatible.\n\n---\n\n**Subwoofers**-------\n\n---\n\n.\n\nMost times a subwoofer can outlast a surround setup and move to your next one, so get the right one. If your room is small you can likely stick to a smaller sub (8-10\"). If you have a larger room you want a larger sub (12\"+). If your room is Massive [a *few* small subs](http://www.audioholics.com/subwoofer-setup/multiple-subwoofer-setup-calibration-1) may be the key to rumbley bliss.\n\n.\n\nPrice--|Item------------------|Description - - - - - - - - - - - - - - - - - - - - -|\n:----|:----|:----|\n$130 | [MartinLogan Dynamo 300](http://amzn.to/1aepjEP)| Martin Logan is known for their higher end loudspeakers and they don't disappoint when it comes to their subwoofers. The smallest sub on this list it still manages to pack a decent punch. Great for small to medium rooms. [Z Review!](http://youtu.be/xYy9-kY5Am4)\n$140 | [Dayton Sub-1000](http://amzn.to/1gfQqQw)| This is the most popular sub for starter 5.1 systems. This is as cheap as I would ever go on a 10\" and for most medium sized rooms this is more than enough to fill in the lows.\n$200 | [BIC America F12](http://amzn.to/UWPJ5N)| The most popular sub on the internet. The best reviews, the best performance per dollar, killer looks and did I mention it is a monster? Just go peak at some reviews and I won't need to say anymore.\n$200 | [Dayton Sub-1500](http://amzn.to/16zimQt)| YOU DON'T KNOW BIG.. until you have owned a 15\" subwoofer. This monster is big and angry and will not \"blend in\" with the furniture. This thing IS furniture. The WAF is very low on this. Very low.\n$250 | [Fluance DB-150](http://amzn.to/1kpY0Om)| Known for some of the best home-brew home theater speakers these subs match the surprising quality levels Fluance is known for and are some of the prettiest.\n$360 | [HSU-STF2](http://www.hsuresearch.com/products/stf-2.html)| Dr Hsu is a badass. He showed up at the NYaudioshow with a busted old Onkyo and RadioShack speaker wire. And he killed it with his budget subs.\n$500 | [SVS SB1000](http://amzn.to/19ShxCA)| SVS is *THE* brand for subs. You either have an SVS or you can't afford one. Also this is one of their CHEAPEST offerings. Also the box is as small as the 8\" MartinLogan above!\n$700+| [PowerSoundAudio](http://www.powersoundaudio.com/collections/subwoofers)| Remember America? Yeah these subwoofers are made there. These are no holds barred murder boxes. Buy at your own risk. That is all.\n\n.\n\n---\n\n**Bookshelf Speakers**-------\n\n---\n\n.\n\nI am making a personal guarantee that all the speakers below will be very good. They each have their strong suits but in the end it comes down to personal preference. Most of these are sold in pairs and not all have a matching center. If a matching center is not available you can use an additional bookshelf or roll the dice and just get a very good center, MTM or LCR from another manufacturer. Consider these your Front Left, Right and center OR Front and Rear.\n\n.\n\nPrice/pr|Item------------------|Description - - - - - - - - - - - - - - - - - - - - -|Review--|\n:----|:----|:----|:----|:----|:----|:----|:----|:----|:----|:----|:----|:----|:----|:----|:----|:----|:----|:----|:----\n$40 | [Micca Covo-s](http://amzn.to/1DGrE7t)| Tiny, coaxial, speaker. Do not try and get these for a big room. These are the \"I need a tiny ass speaker\" speaker. If Bose has offerings you like, grab these instead and a substantial subwoofer but a bigger speakers will sound better. Almost always. |[Review](http://youtu.be/ymk35MofhFA)\n$70 | [Dayton B652-AIR](http://amzn.to/1Dy5fc9)| I have replaced the standard B652's with the Air revision because they are just that good. Crisp highs and the cheapest Air Motion Tweeter Speaker in the World. Will definitely fill a room on a budget. |[Review](http://youtu.be/mm48FftVR5A)\n$80 | [Micca MB42x](http://amzn.to/188rnsc)| [Matching Center](http://amzn.to/1sQInQc) These are the speakers you are going to buy. They are small, sound great and even put out low end all on their own. I have clocked them at over 100db when powered properly and they LOOK GOOD which is rare in the cheap speaker biz. |[Review](http://youtu.be/tCCNXl4I5U4)\n$130 | [Pioneer BS22](http://amzn.to/YWjTFc)| [Matching Center](http://amzn.to/TRuija) These are the cheapest set of *Designer* speakers. They sound  Warm, Deep, Forgiving and are Smooth jazz masters. They also have a [Tower Variants](http://amzn.to/UWLqaF) if you want more low end. |[Review](http://youtu.be/pvutosKXUTM)\n$130 | [Fluance SX6](http://amzn.to/1DFDL4H)| [Matching Black Only Center](http://amzn.to/1xhcKPR) Fluance makes some of the most surprisingly good cheap Home Theater gear out there. These speakers are no exception. They look good, sound GREAT. Almost too good. |[Review](http://youtu.be/heo66YtJO1w)\n$140 | [Yamaha NS4690](http://amzn.to/1zzeXuH)| While not the usual size you expect a bookshelf to be, if you want loud party music or explosion capable speakers, these are your fronts. Nothing matches these for a center so you are going to have to search a bit. or use one of the other centers linked here. |[Review](http://youtu.be/Ez05YLveZTE)\n$160 | [Teac L-H265b](http://amzn.to/1oovsaK)| The most impressive speaker experience I have had in a long time. In a small/medium room these are REAL hard to beat. Don't quite produce enough low end to do a large room but in 5 of these and a sub you will certainly get the chills. |[Review](http://youtu.be/aiDoZybQ_48)\n$170 | [Infinity P163](http://amzn.to/1nmkqv4)| SOLD EACH.. [Matching Center](http://amzn.to/1yfknt7) With a large array of models the Infinity Primus line has been around for a while. It also gets overlooked a lot. Many people swear by them. I tend to agree so they are a worthwhile addition to these lists. [Tower Variant](http://amzn.to/1jqiyWR)  |[Review]()\n$200 | [Bic America FH-65B](http://amzn.to/1axEmG9)| SOLD EACH.. [Matching Center](http://amzn.to/1aU8o74) These are severe home theater speakers. Designed to accurately portray explosions, people screaming and tornado's with precision. Set these up and have your face melted off.  [Tower Variant](http://amzn.to/KYkSVw) |[Review](http://youtu.be/vWy5oX99Gk4)\n$240 | [Klipsch RB-41](http://amzn.to/1aiOliL)| [Matching Center](http://amzn.to/Wb9g7k) Klipsch Reference series speakers spoil you a bit. Once you have heard them it is hard to go back to anything else. But they are an acquired taste. Try them out in a BB or anywhere else you can. [Tower Variant](http://amzn.to/1ezDPWM). |[Review]()\n$300 | [Chane A1rx-c](http://www.chanemusiccinema.com/chane-loudspeakers/A1rx-c)| Not your average ~~bear~~ Speaker. The Chane lineup is a no holds bard testament to engineering over marketing. Where word of mouth is what propels this brand. [Matching Center](http://www.chanemusiccinema.com/chane-loudspeakers/A2rx-c) and a [Tower Variant](http://www.chanemusiccinema.com/chane-loudspeakers/A3rx-c)|[Review]()\n\n.\n\n**My full list of recommended Tower Speakers is located in another post [here](http://redd.it/2t0r3f)**\n\n.\n\n---\n\n**Dedicated Rear Channel Speakers**-------\n\n---\n\n.\n\nThese speakers are specifically made to be invisible. Not visually invisibly, audibly unlocatable is a better description. To throw sound in multiple directions so when something plays in the rear channel you can't define its location. You can't do much with these bi/di-pole speakers except use them as rear channels in 5, 6 and 7.1 setups. A worthwhile upgrade in most cases and don't worry about \"matching\" your rear speakers to the fronts as timbre has very little to do with off phase rears.\n\nPrice/pr|Item------------------|Description - - - - - - - - - - - - - - - - - - - - -|\n:----|:----|:----\n$40 | [Micca Covo-s](http://amzn.to/1DGrE7t)| Tiny, coaxial, speaker. They do not have any mounting port so if you get these for rear duty prepare to screw them into a set of [brackets](http://amzn.to/1DyU9Ud) to mount them properly. [Review](http://youtu.be/ymk35MofhFA)\n$100 | [Polk OWM3](http://amzn.to/1lRheKK)|  While not Di or Bi-pole these OWM's are practically flat. They have built in mounts for corners or \"On Wall\" positioning and are an affordable option. Come in Black or White\n$120 | [Fluance AVBP2](http://amzn.to/1c4BeFH)| The cheapest truly Di-pole speaker you can buy. Usable for 5.1 or 7.1 applications in small rooms. Large rooms see the XPBP's Below \n$170 | [Klipsch S10](http://amzn.to/1gxxFbf)| While not part of their THX line these are sure to make some of the loudest noise of the group. Boom, smash WOOSH!  \n$200 | [Fluance XLBP](http://amzn.to/19mWp6M)| The big brother of the AVBP2's these can handle large rooms and may be more balanced with big front speakers. \n$240 | [Bic America PL-66](http://amzn.to/1j4V4Ep)| Probably the biggest of the dedicated rears. These employ a passive radiator that keeps port noise down to 0.\n$400 | [Polk FXi A4](http://amzn.to/KYos1N)| Designed to match polks larger series of speakers (which doesn't matter) it is just nice to see a full sized speaker with Di-pole tweeters available\n\n.\n\n\n---\n\n**Additional Requirements**-------\n\n---\n\n.\n\nYou will be needing some [speaker wire](http://amzn.to/1sboc1V), Either 16 or 14 may be used in most scenarios where longer runs or larger speakers are used. Make sure you search for 100% copper or Oxygen free speaker wire! \n\n[Here is my video explaining how to strip and Terminate Speaker wire](http://youtu.be/WEimPBW37IA)\n\nThis wire is used for all channels so buy enough to run everywhere and hide the wires along moulding and around door frames. You may also need a [Wire Stripper](http://amzn.to/1czRkml) if you don't already have one and I recommend you pick up some [Banana Clips](http://amzn.to/1m1wbqY) to make your life so much easier when connecting everything. A [single RCA](http://amzn.to/Sm1DaE) wire for your subwoofer is also needed and finally try not to overpay for [HDMI cables](http://amzn.to/1aUfKaA).\n\nQuestions, Comments please leave them below. I do read all of them.\n\n",
  "mod_reports": [],
  "secure_media_embed": {},
  "edited": 1444182840.0,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There are only three basic components you need in order to put together your own 5.1, 6.1 or 7.1 surround system (a Receiver, some Speakers and a Subwoofer). The sum of these recommended separate parts will easily outperform 99% of even the most expensive <a href=\"http://amzn.to/1m6a8yP\">HTiB solutions</a> and standalone components have far more features and futureproofing. </p>\n\n<p>Pick a budget above $500 and assemble your perfect system. If you don&#39;t think you can afford a good system right away consider starting with a 5.1 receiver and only two speakers for a basic 2.0 or add a sub and run a 2.1, you can always add onto it as funds become available. <a href=\"http://redd.it/23d9ny\">This Build-up Post</a> can help with that.</p>\n\n<hr/>\n\n<p><strong>{5.1 vs 7.1 Note:}</strong> Your room makes this determination. If the room you are in doesn&#39;t have ~6 feet behind your seating positions you are likely not going to fit a 7.1 and should stick to 5.1</p>\n\n<p><strong>{.1}</strong> This simply means a subwoofer. Since it isn&#39;t a full range channel they just indicate it as .1, some newer receivers claim .2 like 5.2, 7.2.. As far as I know that just means there are two ports. The same result could be accomplished with a Y splitter on a normal 5.1 or 7.1 receiver.</p>\n\n<p><strong>{MultiEQ, Audyssey, Room Correction}</strong> These are features/programs that receivers come with to &quot;fix&quot; lousy speakers in lousy rooms. It uses a microphone to try and detect speaker size, distance, frequency cutoff, reverb delay, etc etc etc.. It can sometimes be a help in oddly shaped or echoy rooms OR with mis-matched/bad speakers. Running it on hardware you like or have never used may change the fundamental sound signature of your speakers so I recommend trying it with and without the room corrections and see what you like best.</p>\n\n<p>.</p>\n\n<hr/>\n\n<p><strong>Surround Receivers</strong>-------</p>\n\n<hr/>\n\n<p>.</p>\n\n<p>I am going to link to the whole line of receivers by each brand. Look for the cheapest unit that fits all your needs (# of HDMI inputs, 5.1 or 7.1, Legacy inputs, Airplay, etc) Remember to Ignore wattage and stick to the brands listed below or message me if you find a good deal. Don&#39;t be afraid to look at last years models, most times very few changes occur and only a few &quot;<em>smart</em>&quot; features or HDMI ports are added.</p>\n\n<p>.</p>\n\n<table><thead>\n<tr>\n<th align=\"left\">-#-</th>\n<th align=\"left\">Item------------------</th>\n<th align=\"left\">Description - - - - - - - - - - - - - - - - - - - - -</th>\n<th align=\"left\">Cheapest</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">1</td>\n<td align=\"left\"><a href=\"http://goo.gl/gKag39\">Denon</a></td>\n<td align=\"left\">This is my most preferred brand. They are very clean looking, have amazing sound quality and some <em>little</em> features I like. Preset buttons and 1/2db volume increments make me happy. Affordability for beginners.</td>\n<td align=\"left\"><a href=\"http://amzn.to/16nwMCm\">5.1</a>--<a href=\"http://amzn.to/1eBQR8m\">7.1</a></td>\n</tr>\n<tr>\n<td align=\"left\">2</td>\n<td align=\"left\"><a href=\"http://goo.gl/1SYNDU\">Marantz</a></td>\n<td align=\"left\">Featuring the only &quot;slim&quot; line of receivers on the market and absolutely state of the art UI and remote features. Amazing reliability and great support. BUT you will be paying extra for these features.</td>\n<td align=\"left\"><a href=\"http://amzn.to/1ezAOWo\">5.1</a>--<a href=\"http://amzn.to/1Dy1u6B\">7.1</a></td>\n</tr>\n<tr>\n<td align=\"left\">3</td>\n<td align=\"left\"><a href=\"http://goo.gl/wx9ers\">Yamaha</a></td>\n<td align=\"left\">Sporting a remarkable amount of different receivers you will have to do some sorting. They have good sound quality and TONS of inputs including legacy but tend to have a confusing setup and remote layout.</td>\n<td align=\"left\"><a href=\"http://www.amazon.com/gp/product/B00B981F38\">5.1</a>--<a href=\"http://amzn.to/1aiLXZq\">7.1</a></td>\n</tr>\n<tr>\n<td align=\"left\">4</td>\n<td align=\"left\"><a href=\"http://goo.gl/dptehC\">Onkyo</a></td>\n<td align=\"left\">Normally higher on my recommended lists some Onkyo AVR&#39;s have been plagued with recent design flaws and overheating issues. Still I can&#39;t fault everything they make so read reviews and choose wisely.</td>\n<td align=\"left\"><a href=\"http://amzn.to/1eBSyTc\">5.1</a>--<a href=\"http://amzn.to/1qxocW7\">7.1</a></td>\n</tr>\n<tr>\n<td align=\"left\">5</td>\n<td align=\"left\"><a href=\"http://goo.gl/Q2vzy2\">Pioneer</a></td>\n<td align=\"left\">The Polk of receivers. They work and can be found at a bargain but since the <a href=\"http://goo.gl/bN2qJb\">Pioneer Elite</a> line exists they tend to leave a ton of features off these entry level AVR&#39;s. That just means you can get them cheap.</td>\n<td align=\"left\"><a href=\"http://amzn.to/U2l3Ti\">5.1</a>--<a href=\"http://amzn.to/1mxWZDG\">7.1</a></td>\n</tr>\n<tr>\n<td align=\"left\">6</td>\n<td align=\"left\"><a href=\"http://goo.gl/1G0dd9\">Harmon/Kardon</a></td>\n<td align=\"left\">Stylish but I can&#39;t find anything to love about H/K. They &quot;work&quot; but don&#39;t DO <em>anything</em> better than anybody else. You can usually find these at brick and Mortar Stores which means price matching heaven.</td>\n<td align=\"left\"><a href=\"http://amzn.to/1j2Ivu0\">5.1</a>--<a href=\"http://www.amazon.com/Harman-Kardon-AVR-2650-Discontinued/dp/B0054N9RQQ\">7.1</a></td>\n</tr>\n</tbody></table>\n\n<p>.\nAs a one off <a href=\"https://emotiva.com/products/receivers/fusion-8100\">Emotiva</a> has pushed out the Fusion 8100. Only 65wpc and missing some of the &quot;fancy&quot; features this affordable and &quot;SLIM&quot; unit has full pre-outs and is 7.2 compatible.</p>\n\n<hr/>\n\n<p><strong>Subwoofers</strong>-------</p>\n\n<hr/>\n\n<p>.</p>\n\n<p>Most times a subwoofer can outlast a surround setup and move to your next one, so get the right one. If your room is small you can likely stick to a smaller sub (8-10&quot;). If you have a larger room you want a larger sub (12&quot;+). If your room is Massive <a href=\"http://www.audioholics.com/subwoofer-setup/multiple-subwoofer-setup-calibration-1\">a <em>few</em> small subs</a> may be the key to rumbley bliss.</p>\n\n<p>.</p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Price--</th>\n<th align=\"left\">Item------------------</th>\n<th align=\"left\">Description - - - - - - - - - - - - - - - - - - - - -</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">$130</td>\n<td align=\"left\"><a href=\"http://amzn.to/1aepjEP\">MartinLogan Dynamo 300</a></td>\n<td align=\"left\">Martin Logan is known for their higher end loudspeakers and they don&#39;t disappoint when it comes to their subwoofers. The smallest sub on this list it still manages to pack a decent punch. Great for small to medium rooms. <a href=\"http://youtu.be/xYy9-kY5Am4\">Z Review!</a></td>\n</tr>\n<tr>\n<td align=\"left\">$140</td>\n<td align=\"left\"><a href=\"http://amzn.to/1gfQqQw\">Dayton Sub-1000</a></td>\n<td align=\"left\">This is the most popular sub for starter 5.1 systems. This is as cheap as I would ever go on a 10&quot; and for most medium sized rooms this is more than enough to fill in the lows.</td>\n</tr>\n<tr>\n<td align=\"left\">$200</td>\n<td align=\"left\"><a href=\"http://amzn.to/UWPJ5N\">BIC America F12</a></td>\n<td align=\"left\">The most popular sub on the internet. The best reviews, the best performance per dollar, killer looks and did I mention it is a monster? Just go peak at some reviews and I won&#39;t need to say anymore.</td>\n</tr>\n<tr>\n<td align=\"left\">$200</td>\n<td align=\"left\"><a href=\"http://amzn.to/16zimQt\">Dayton Sub-1500</a></td>\n<td align=\"left\">YOU DON&#39;T KNOW BIG.. until you have owned a 15&quot; subwoofer. This monster is big and angry and will not &quot;blend in&quot; with the furniture. This thing IS furniture. The WAF is very low on this. Very low.</td>\n</tr>\n<tr>\n<td align=\"left\">$250</td>\n<td align=\"left\"><a href=\"http://amzn.to/1kpY0Om\">Fluance DB-150</a></td>\n<td align=\"left\">Known for some of the best home-brew home theater speakers these subs match the surprising quality levels Fluance is known for and are some of the prettiest.</td>\n</tr>\n<tr>\n<td align=\"left\">$360</td>\n<td align=\"left\"><a href=\"http://www.hsuresearch.com/products/stf-2.html\">HSU-STF2</a></td>\n<td align=\"left\">Dr Hsu is a badass. He showed up at the NYaudioshow with a busted old Onkyo and RadioShack speaker wire. And he killed it with his budget subs.</td>\n</tr>\n<tr>\n<td align=\"left\">$500</td>\n<td align=\"left\"><a href=\"http://amzn.to/19ShxCA\">SVS SB1000</a></td>\n<td align=\"left\">SVS is <em>THE</em> brand for subs. You either have an SVS or you can&#39;t afford one. Also this is one of their CHEAPEST offerings. Also the box is as small as the 8&quot; MartinLogan above!</td>\n</tr>\n<tr>\n<td align=\"left\">$700+</td>\n<td align=\"left\"><a href=\"http://www.powersoundaudio.com/collections/subwoofers\">PowerSoundAudio</a></td>\n<td align=\"left\">Remember America? Yeah these subwoofers are made there. These are no holds barred murder boxes. Buy at your own risk. That is all.</td>\n</tr>\n</tbody></table>\n\n<p>.</p>\n\n<hr/>\n\n<p><strong>Bookshelf Speakers</strong>-------</p>\n\n<hr/>\n\n<p>.</p>\n\n<p>I am making a personal guarantee that all the speakers below will be very good. They each have their strong suits but in the end it comes down to personal preference. Most of these are sold in pairs and not all have a matching center. If a matching center is not available you can use an additional bookshelf or roll the dice and just get a very good center, MTM or LCR from another manufacturer. Consider these your Front Left, Right and center OR Front and Rear.</p>\n\n<p>.</p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Price/pr</th>\n<th align=\"left\">Item------------------</th>\n<th align=\"left\">Description - - - - - - - - - - - - - - - - - - - - -</th>\n<th align=\"left\">Review--</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">$40</td>\n<td align=\"left\"><a href=\"http://amzn.to/1DGrE7t\">Micca Covo-s</a></td>\n<td align=\"left\">Tiny, coaxial, speaker. Do not try and get these for a big room. These are the &quot;I need a tiny ass speaker&quot; speaker. If Bose has offerings you like, grab these instead and a substantial subwoofer but a bigger speakers will sound better. Almost always.</td>\n<td align=\"left\"><a href=\"http://youtu.be/ymk35MofhFA\">Review</a></td>\n</tr>\n<tr>\n<td align=\"left\">$70</td>\n<td align=\"left\"><a href=\"http://amzn.to/1Dy5fc9\">Dayton B652-AIR</a></td>\n<td align=\"left\">I have replaced the standard B652&#39;s with the Air revision because they are just that good. Crisp highs and the cheapest Air Motion Tweeter Speaker in the World. Will definitely fill a room on a budget.</td>\n<td align=\"left\"><a href=\"http://youtu.be/mm48FftVR5A\">Review</a></td>\n</tr>\n<tr>\n<td align=\"left\">$80</td>\n<td align=\"left\"><a href=\"http://amzn.to/188rnsc\">Micca MB42x</a></td>\n<td align=\"left\"><a href=\"http://amzn.to/1sQInQc\">Matching Center</a> These are the speakers you are going to buy. They are small, sound great and even put out low end all on their own. I have clocked them at over 100db when powered properly and they LOOK GOOD which is rare in the cheap speaker biz.</td>\n<td align=\"left\"><a href=\"http://youtu.be/tCCNXl4I5U4\">Review</a></td>\n</tr>\n<tr>\n<td align=\"left\">$130</td>\n<td align=\"left\"><a href=\"http://amzn.to/YWjTFc\">Pioneer BS22</a></td>\n<td align=\"left\"><a href=\"http://amzn.to/TRuija\">Matching Center</a> These are the cheapest set of <em>Designer</em> speakers. They sound  Warm, Deep, Forgiving and are Smooth jazz masters. They also have a <a href=\"http://amzn.to/UWLqaF\">Tower Variants</a> if you want more low end.</td>\n<td align=\"left\"><a href=\"http://youtu.be/pvutosKXUTM\">Review</a></td>\n</tr>\n<tr>\n<td align=\"left\">$130</td>\n<td align=\"left\"><a href=\"http://amzn.to/1DFDL4H\">Fluance SX6</a></td>\n<td align=\"left\"><a href=\"http://amzn.to/1xhcKPR\">Matching Black Only Center</a> Fluance makes some of the most surprisingly good cheap Home Theater gear out there. These speakers are no exception. They look good, sound GREAT. Almost too good.</td>\n<td align=\"left\"><a href=\"http://youtu.be/heo66YtJO1w\">Review</a></td>\n</tr>\n<tr>\n<td align=\"left\">$140</td>\n<td align=\"left\"><a href=\"http://amzn.to/1zzeXuH\">Yamaha NS4690</a></td>\n<td align=\"left\">While not the usual size you expect a bookshelf to be, if you want loud party music or explosion capable speakers, these are your fronts. Nothing matches these for a center so you are going to have to search a bit. or use one of the other centers linked here.</td>\n<td align=\"left\"><a href=\"http://youtu.be/Ez05YLveZTE\">Review</a></td>\n</tr>\n<tr>\n<td align=\"left\">$160</td>\n<td align=\"left\"><a href=\"http://amzn.to/1oovsaK\">Teac L-H265b</a></td>\n<td align=\"left\">The most impressive speaker experience I have had in a long time. In a small/medium room these are REAL hard to beat. Don&#39;t quite produce enough low end to do a large room but in 5 of these and a sub you will certainly get the chills.</td>\n<td align=\"left\"><a href=\"http://youtu.be/aiDoZybQ_48\">Review</a></td>\n</tr>\n<tr>\n<td align=\"left\">$170</td>\n<td align=\"left\"><a href=\"http://amzn.to/1nmkqv4\">Infinity P163</a></td>\n<td align=\"left\">SOLD EACH.. <a href=\"http://amzn.to/1yfknt7\">Matching Center</a> With a large array of models the Infinity Primus line has been around for a while. It also gets overlooked a lot. Many people swear by them. I tend to agree so they are a worthwhile addition to these lists. <a href=\"http://amzn.to/1jqiyWR\">Tower Variant</a></td>\n<td align=\"left\">[Review]()</td>\n</tr>\n<tr>\n<td align=\"left\">$200</td>\n<td align=\"left\"><a href=\"http://amzn.to/1axEmG9\">Bic America FH-65B</a></td>\n<td align=\"left\">SOLD EACH.. <a href=\"http://amzn.to/1aU8o74\">Matching Center</a> These are severe home theater speakers. Designed to accurately portray explosions, people screaming and tornado&#39;s with precision. Set these up and have your face melted off.  <a href=\"http://amzn.to/KYkSVw\">Tower Variant</a></td>\n<td align=\"left\"><a href=\"http://youtu.be/vWy5oX99Gk4\">Review</a></td>\n</tr>\n<tr>\n<td align=\"left\">$240</td>\n<td align=\"left\"><a href=\"http://amzn.to/1aiOliL\">Klipsch RB-41</a></td>\n<td align=\"left\"><a href=\"http://amzn.to/Wb9g7k\">Matching Center</a> Klipsch Reference series speakers spoil you a bit. Once you have heard them it is hard to go back to anything else. But they are an acquired taste. Try them out in a BB or anywhere else you can. <a href=\"http://amzn.to/1ezDPWM\">Tower Variant</a>.</td>\n<td align=\"left\">[Review]()</td>\n</tr>\n<tr>\n<td align=\"left\">$300</td>\n<td align=\"left\"><a href=\"http://www.chanemusiccinema.com/chane-loudspeakers/A1rx-c\">Chane A1rx-c</a></td>\n<td align=\"left\">Not your average <del>bear</del> Speaker. The Chane lineup is a no holds bard testament to engineering over marketing. Where word of mouth is what propels this brand. <a href=\"http://www.chanemusiccinema.com/chane-loudspeakers/A2rx-c\">Matching Center</a> and a <a href=\"http://www.chanemusiccinema.com/chane-loudspeakers/A3rx-c\">Tower Variant</a></td>\n<td align=\"left\">[Review]()</td>\n</tr>\n</tbody></table>\n\n<p>.</p>\n\n<p><strong>My full list of recommended Tower Speakers is located in another post <a href=\"http://redd.it/2t0r3f\">here</a></strong></p>\n\n<p>.</p>\n\n<hr/>\n\n<p><strong>Dedicated Rear Channel Speakers</strong>-------</p>\n\n<hr/>\n\n<p>.</p>\n\n<p>These speakers are specifically made to be invisible. Not visually invisibly, audibly unlocatable is a better description. To throw sound in multiple directions so when something plays in the rear channel you can&#39;t define its location. You can&#39;t do much with these bi/di-pole speakers except use them as rear channels in 5, 6 and 7.1 setups. A worthwhile upgrade in most cases and don&#39;t worry about &quot;matching&quot; your rear speakers to the fronts as timbre has very little to do with off phase rears.</p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Price/pr</th>\n<th align=\"left\">Item------------------</th>\n<th align=\"left\">Description - - - - - - - - - - - - - - - - - - - - -</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">$40</td>\n<td align=\"left\"><a href=\"http://amzn.to/1DGrE7t\">Micca Covo-s</a></td>\n<td align=\"left\">Tiny, coaxial, speaker. They do not have any mounting port so if you get these for rear duty prepare to screw them into a set of <a href=\"http://amzn.to/1DyU9Ud\">brackets</a> to mount them properly. <a href=\"http://youtu.be/ymk35MofhFA\">Review</a></td>\n</tr>\n<tr>\n<td align=\"left\">$100</td>\n<td align=\"left\"><a href=\"http://amzn.to/1lRheKK\">Polk OWM3</a></td>\n<td align=\"left\">While not Di or Bi-pole these OWM&#39;s are practically flat. They have built in mounts for corners or &quot;On Wall&quot; positioning and are an affordable option. Come in Black or White</td>\n</tr>\n<tr>\n<td align=\"left\">$120</td>\n<td align=\"left\"><a href=\"http://amzn.to/1c4BeFH\">Fluance AVBP2</a></td>\n<td align=\"left\">The cheapest truly Di-pole speaker you can buy. Usable for 5.1 or 7.1 applications in small rooms. Large rooms see the XPBP&#39;s Below</td>\n</tr>\n<tr>\n<td align=\"left\">$170</td>\n<td align=\"left\"><a href=\"http://amzn.to/1gxxFbf\">Klipsch S10</a></td>\n<td align=\"left\">While not part of their THX line these are sure to make some of the loudest noise of the group. Boom, smash WOOSH!</td>\n</tr>\n<tr>\n<td align=\"left\">$200</td>\n<td align=\"left\"><a href=\"http://amzn.to/19mWp6M\">Fluance XLBP</a></td>\n<td align=\"left\">The big brother of the AVBP2&#39;s these can handle large rooms and may be more balanced with big front speakers.</td>\n</tr>\n<tr>\n<td align=\"left\">$240</td>\n<td align=\"left\"><a href=\"http://amzn.to/1j4V4Ep\">Bic America PL-66</a></td>\n<td align=\"left\">Probably the biggest of the dedicated rears. These employ a passive radiator that keeps port noise down to 0.</td>\n</tr>\n<tr>\n<td align=\"left\">$400</td>\n<td align=\"left\"><a href=\"http://amzn.to/KYos1N\">Polk FXi A4</a></td>\n<td align=\"left\">Designed to match polks larger series of speakers (which doesn&#39;t matter) it is just nice to see a full sized speaker with Di-pole tweeters available</td>\n</tr>\n</tbody></table>\n\n<p>.</p>\n\n<hr/>\n\n<p><strong>Additional Requirements</strong>-------</p>\n\n<hr/>\n\n<p>.</p>\n\n<p>You will be needing some <a href=\"http://amzn.to/1sboc1V\">speaker wire</a>, Either 16 or 14 may be used in most scenarios where longer runs or larger speakers are used. Make sure you search for 100% copper or Oxygen free speaker wire! </p>\n\n<p><a href=\"http://youtu.be/WEimPBW37IA\">Here is my video explaining how to strip and Terminate Speaker wire</a></p>\n\n<p>This wire is used for all channels so buy enough to run everywhere and hide the wires along moulding and around door frames. You may also need a <a href=\"http://amzn.to/1czRkml\">Wire Stripper</a> if you don&#39;t already have one and I recommend you pick up some <a href=\"http://amzn.to/1m1wbqY\">Banana Clips</a> to make your life so much easier when connecting everything. A <a href=\"http://amzn.to/Sm1DaE\">single RCA</a> wire for your subwoofer is also needed and finally try not to overpay for <a href=\"http://amzn.to/1aUfKaA\">HDMI cables</a>.</p>\n\n<p>Questions, Comments please leave them below. I do read all of them.</p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "user_reports": [],
  "author_flair_text": "Operator",
  "over_18": false,
  "score": 177,
  "stickied": false,
  "domain": "self.Zeos",
  "is_self": true,
  "hidden": false,
  "_orphaned": {},
  "_api_link": "https://api.reddit.com/r/Zeos/comments/2usi5e/guide_surround_sound_51/?ref=search_posts",
  "_comments_by_id": {},
  "visited": false,
  "thumbnail": "self",
  "_has_fetched": true,
  "gilded": 0,
  "hide_score": false,
  "_info_url": "https://api.reddit.com/api/info/",
  "created_utc": 1423081472.0,
  "subreddit_id": "t5_2txbr",
  "id": "2usi5e",
  "_params": {},
  "media_embed": {},
  "name": "t3_2usi5e",
  "quarantine": false,
  "permalink": "https://www.reddit.com/r/Zeos/comments/2usi5e/guide_surround_sound_51/?ref=search_posts",
  "ups": 177,
  "url": "https://www.reddit.com/r/Zeos/comments/2usi5e/guide_surround_sound_51/",
  "title": "||GUIDE|| - Surround Sound (5.1+)",
  "preview": {
    "images": [
      {
        "resolutions": [
          {
            "width": 108,
            "height": 72,
            "url": "https://i.redditmedia.com/8tFquXW6ClSsUp6TuXzeQTS1VwZarDkFPUqXBs75oZ0.jpg?fit=crop&crop=faces%2Centropy&arh=2&w=108&s=885a3f324b63d7ea018812616a3fcb04"
          },
          {
            "width": 216,
            "height": 144,
            "url": "https://i.redditmedia.com/8tFquXW6ClSsUp6TuXzeQTS1VwZarDkFPUqXBs75oZ0.jpg?fit=crop&crop=faces%2Centropy&arh=2&w=216&s=5a563372641ee6d31018af8bd42a7521"
          }
        ],
        "id": "KeJHyghVE0cDkHMqgpUW1yB5BArMqw0_jrmVCXwMsE4",
        "variants": {},
        "source": {
          "width": 300,
          "height": 200,
          "url": "https://i.redditmedia.com/8tFquXW6ClSsUp6TuXzeQTS1VwZarDkFPUqXBs75oZ0.jpg?s=4e8bcae71470206e904942c9db26cbee"
        }
      }
    ]
  }
}