{
  "clicked": false,
  "_replaced_more": false,
  "archived": false,
  "num_comments": 4,
  "created": 1436239639.0,
  "saved": false,
  "selftext": "I just moved and have no need for my excess speakers, sub, receiver, and other goodies.\n\nI have a **7.1 NHT surround setup** (6 V small speakers and one V large center channel, Niles 10\" subwoofer), **4 Artision wall surround speakers** (these are insanely nice btw), a **Sony amp/receiver**, a **Pakedge 24 port gigabit ethernet switch**, a BROKEN **Niles amplifier** (we can arrange to get this fixed, pm me if interested on this one), **Autonomic Mirage Media Server**, and all the necessary stands and mounting hardware for the speakers, along with gold banana clips and speaker wire.\n\nThe **NHT 7.1 system with a Niles 10\" Subwoofer** comes with all the equipment for mounting on walls, including stands if you just want them as bookshelf speakers. I will throw in the banana clips and speaker wire. **Price for all the speakers, sub, and amp is $1300 OBO.** I will consider selling the **NHT speakers** as a pair, but I'd prefer to sell them as a 7.1 set for the sake of simplicity. **Two piece set of NHTs is $400.**\n [Center channel w/o grille](http://i.imgur.com/CzzWp1l.jpg)\nand [with](http://i.imgur.com/QqrFh7p.jpg).\n[Surround speaker w/o grille](http://i.imgur.com/Nw09QWx.jpg), [the lot](http://i.imgur.com/b9Y2OXe.jpg), and [the back](http://i.imgur.com/U7doMrg.jpg).\n[Subwoofer 1](http://i.imgur.com/Rh3gLzJ.jpg), [2](http://i.imgur.com/tRLvOg5.jpg), and [3](http://i.imgur.com/MCywtH7.jpg)\n\nThe **Niles amp** is broken. The right channel does not work for some reason. I took it apart and didn't see anything unusual, but I'm not an expert with audio equipment. The guy that helped me mount my personal speakers contacted the manufacturer and said that **the cost of the repair is $175 USD. They will fix it, but if they can't fix it, they will replace it with the newest model. Asking price will sit at $200 unfixed, if you want to get it fixed prior we can work it out.** \n[Pics](http://i.imgur.com/nN8lG2d.jpg), and [the back](http://i.imgur.com/Ra4xDar.jpg). \n\nThe [Sony amp/receiver](http://i.imgur.com/Po60yk7.jpg) works [flawlessly](http://i.imgur.com/EywRrxJ.jpg), I used it with two of the NHT speakers and the Niles sub. **I do not have the remote**, but if you have a universal remote, it will more than likely work with this. **Asking for $250 if not bought with the other speakers.**\n\nThe **Autonomic Mirage Media Server** is in flawless condition, very rarely used in the last two years. If you aren't familiar with these, it's used to stream local and online content from your PC to your speakers/TV. You can send a slideshow of pictures, iTunes media, and the like through your internet, and it has 500 gb of internal storage. [Pic 1](http://i.imgur.com/HWaWnpm.jpg), [2](http://i.imgur.com/8xCIafD.jpg), and [3](http://i.imgur.com/LcTo5QU.jpg). **Asking price is $500**. \n\nThe **Pakedge 24-port ethernet switch** is pretty straightfoward, used it with a maximum of 10 devices. These are meant for small businesses pretty much. I used it in my room for a little bit but the fan inside of it was difficult to fall asleep to. [Pic 1](http://i.imgur.com/CIXfZuy.jpg) and [2](http://i.imgur.com/fKLG9Xc.jpg). **Asking price is $250**.\n\nFinally, the **Artison portrait wall speakers**. Nearly flawless condition, but they have a bit of paint speckles on them (they were on the walls when we repainted the family room). I couldn't get the grilles off on these unfortunately, but there are plenty of pictures of that online. [Here's](http://i.imgur.com/bxgexV4.jpg) a [few](http://i.imgur.com/BUrE0dG.jpg) I took despite [that](http://i.imgur.com/q8Xyt3T.jpg). The four speakers have the wall mount brackets and sound amazing. **Asking price for all 4 is $500**. \n\n\n\n\nA lot of this stuff was the bleeding edge of a family room surround sound setup a few years ago, none of this is retail quality, but home theater grade. This inherently makes it all quite expensive, but I don't wanna screw any of you fine people. PM me and we can discuss pricing and possible shipping of smaller things. **I would prefer cash and local pickup, but we can probably work something out with paypal and shipping costs.**\n\nFeel free to PM me with any questions regarding the equipment. Thanks!",
  "mod_reports": [],
  "secure_media_embed": {},
  "author_flair_css_class": "1",
  "edited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I just moved and have no need for my excess speakers, sub, receiver, and other goodies.</p>\n\n<p>I have a <strong>7.1 NHT surround setup</strong> (6 V small speakers and one V large center channel, Niles 10&quot; subwoofer), <strong>4 Artision wall surround speakers</strong> (these are insanely nice btw), a <strong>Sony amp/receiver</strong>, a <strong>Pakedge 24 port gigabit ethernet switch</strong>, a BROKEN <strong>Niles amplifier</strong> (we can arrange to get this fixed, pm me if interested on this one), <strong>Autonomic Mirage Media Server</strong>, and all the necessary stands and mounting hardware for the speakers, along with gold banana clips and speaker wire.</p>\n\n<p>The <strong>NHT 7.1 system with a Niles 10&quot; Subwoofer</strong> comes with all the equipment for mounting on walls, including stands if you just want them as bookshelf speakers. I will throw in the banana clips and speaker wire. <strong>Price for all the speakers, sub, and amp is $1300 OBO.</strong> I will consider selling the <strong>NHT speakers</strong> as a pair, but I&#39;d prefer to sell them as a 7.1 set for the sake of simplicity. <strong>Two piece set of NHTs is $400.</strong>\n <a href=\"http://i.imgur.com/CzzWp1l.jpg\">Center channel w/o grille</a>\nand <a href=\"http://i.imgur.com/QqrFh7p.jpg\">with</a>.\n<a href=\"http://i.imgur.com/Nw09QWx.jpg\">Surround speaker w/o grille</a>, <a href=\"http://i.imgur.com/b9Y2OXe.jpg\">the lot</a>, and <a href=\"http://i.imgur.com/U7doMrg.jpg\">the back</a>.\n<a href=\"http://i.imgur.com/Rh3gLzJ.jpg\">Subwoofer 1</a>, <a href=\"http://i.imgur.com/tRLvOg5.jpg\">2</a>, and <a href=\"http://i.imgur.com/MCywtH7.jpg\">3</a></p>\n\n<p>The <strong>Niles amp</strong> is broken. The right channel does not work for some reason. I took it apart and didn&#39;t see anything unusual, but I&#39;m not an expert with audio equipment. The guy that helped me mount my personal speakers contacted the manufacturer and said that <strong>the cost of the repair is $175 USD. They will fix it, but if they can&#39;t fix it, they will replace it with the newest model. Asking price will sit at $200 unfixed, if you want to get it fixed prior we can work it out.</strong> \n<a href=\"http://i.imgur.com/nN8lG2d.jpg\">Pics</a>, and <a href=\"http://i.imgur.com/Ra4xDar.jpg\">the back</a>. </p>\n\n<p>The <a href=\"http://i.imgur.com/Po60yk7.jpg\">Sony amp/receiver</a> works <a href=\"http://i.imgur.com/EywRrxJ.jpg\">flawlessly</a>, I used it with two of the NHT speakers and the Niles sub. <strong>I do not have the remote</strong>, but if you have a universal remote, it will more than likely work with this. <strong>Asking for $250 if not bought with the other speakers.</strong></p>\n\n<p>The <strong>Autonomic Mirage Media Server</strong> is in flawless condition, very rarely used in the last two years. If you aren&#39;t familiar with these, it&#39;s used to stream local and online content from your PC to your speakers/TV. You can send a slideshow of pictures, iTunes media, and the like through your internet, and it has 500 gb of internal storage. <a href=\"http://i.imgur.com/HWaWnpm.jpg\">Pic 1</a>, <a href=\"http://i.imgur.com/8xCIafD.jpg\">2</a>, and <a href=\"http://i.imgur.com/LcTo5QU.jpg\">3</a>. <strong>Asking price is $500</strong>. </p>\n\n<p>The <strong>Pakedge 24-port ethernet switch</strong> is pretty straightfoward, used it with a maximum of 10 devices. These are meant for small businesses pretty much. I used it in my room for a little bit but the fan inside of it was difficult to fall asleep to. <a href=\"http://i.imgur.com/CIXfZuy.jpg\">Pic 1</a> and <a href=\"http://i.imgur.com/fKLG9Xc.jpg\">2</a>. <strong>Asking price is $250</strong>.</p>\n\n<p>Finally, the <strong>Artison portrait wall speakers</strong>. Nearly flawless condition, but they have a bit of paint speckles on them (they were on the walls when we repainted the family room). I couldn&#39;t get the grilles off on these unfortunately, but there are plenty of pictures of that online. <a href=\"http://i.imgur.com/bxgexV4.jpg\">Here&#39;s</a> a <a href=\"http://i.imgur.com/BUrE0dG.jpg\">few</a> I took despite <a href=\"http://i.imgur.com/q8Xyt3T.jpg\">that</a>. The four speakers have the wall mount brackets and sound amazing. <strong>Asking price for all 4 is $500</strong>. </p>\n\n<p>A lot of this stuff was the bleeding edge of a family room surround sound setup a few years ago, none of this is retail quality, but home theater grade. This inherently makes it all quite expensive, but I don&#39;t wanna screw any of you fine people. PM me and we can discuss pricing and possible shipping of smaller things. <strong>I would prefer cash and local pickup, but we can probably work something out with paypal and shipping costs.</strong></p>\n\n<p>Feel free to PM me with any questions regarding the equipment. Thanks!</p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "user_reports": [],
  "link_flair_css_class": "selling",
  "over_18": false,
  "score": 2,
  "stickied": false,
  "domain": "self.hardwareswap",
  "is_self": true,
  "hidden": false,
  "_orphaned": {},
  "_api_link": "https://api.reddit.com/r/hardwareswap/comments/3cdn3n/usa_ilh_home_theater_speakers_receiver_subwoofer/?ref=search_posts",
  "link_flair_text": "Selling",
  "_comments_by_id": {},
  "visited": false,
  "thumbnail": "",
  "_has_fetched": true,
  "gilded": 0,
  "hide_score": false,
  "_info_url": "https://api.reddit.com/api/info/",
  "created_utc": 1436239639.0,
  "subreddit_id": "t5_2skrs",
  "id": "3cdn3n",
  "_params": {},
  "media_embed": {},
  "name": "t3_3cdn3n",
  "quarantine": false,
  "permalink": "https://www.reddit.com/r/hardwareswap/comments/3cdn3n/usa_ilh_home_theater_speakers_receiver_subwoofer/?ref=search_posts",
  "ups": 2,
  "url": "https://www.reddit.com/r/hardwareswap/comments/3cdn3n/usa_ilh_home_theater_speakers_receiver_subwoofer/",
  "title": "[USA- IL][H] Home theater speakers, receiver, subwoofer, and more! [W] Paypal, local cash"
}