{
  "clicked": false,
  "_replaced_more": false,
  "archived": true,
  "num_comments": 1,
  "created": 1339761770.0,
  "saved": false,
  "selftext": "**Verified?** *(This bot cannot verify AMAs just yet)*\n\n**Date:** 2012-06-14\n\n**[Link to submission](http://www.reddit.com/r/IAmA/comments/v2h57/)** (*Has self-text*)\n\n**[Link to my post](http://www.reddit.com/r/IAmA/comments/v2h57/tabledresser/c50xf2b)**\n\n\n\nQuestions|Answers\n:--|:--\n[Just to say... love your guys work. Your speed and attention to detail are great!  The drops of humor are icing on the cake.](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50q2zu?context=5)|IFixit's goal is to teach everyone how to fix all their stuff. If the world can't have the manufacturer service manual, then by golly we're going to work together to write new manuals that are free to the world.\n[Edit: I do have a question.  Has Apple ever threatened you for anything?  Exposing parts, etc?](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50q2zu?context=5)|Thanks! 7oby is right, Apple has consistently used legal threats to keep their manuals offline and make sure they're the only ones who know how to fix Apple hardware.  Apple has generally left us alone because we're very careful: everything on iFixit is original content, made by either the community or by us. So there's not much they can do about us, as much as they probably prefer we didn't exist.  Copyright law was designed to encourage creativity, and I think that its application to encourage planned obsolescence and prevent repair is a bad thing for society. There are some efforts to pass legislation like Right to Repair that would force auto manufacturers to make their documentation available.\n[*Copyright law was designed to encourage creativity, and I think that its application to encourage planned obsolescence and prevent repair is a bad thing for society.*  Oregon is worse.](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50rxkz?context=5)|Wow, that's pretty obnoxious. Why would they do that?\n[How much do you spend on stuff to take apart... (I assume you get free stuff and have sponsors too...\\) And how often do things not work when you put them together again?](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50pzpx?context=5)|We buy products at retail just like anyone else. When what we want isn't sitting on the shelf, well… that's a story in itself.\n |We go to lengths to get hardware. Big, seriously long lengthy lengths. When it comes to acquiring devices, really no length is too long. As long as it's (mostly) legal and it doesn't require sacrificing any ewoks. Because I'm kind of attached to the furry guys.\n |When really high profile devices come out (iPads, iPhones, etc) we generally take the \"I-don't-care-how-much-it-is-I-need-it-now!\" mode of operation. We'll do what we gotta to make sure that we get gizmos first, even flying to the [other side of the world](https://twitter.com/jo_cleary/status/180246493830193152/photo/1) on occassion to take advantage of the ~18 hour time difference.\n |Concerning Sponsors: [This guy](http://blacksportsonline.com/home/wp-content/uploads/2012/05/Ricky-Bobby.jpg) is usually our main sponsor. But every once in a blue moon, a manufacturer will help us out with a teardowns. The \"Will it Blend?\" folks sent us [a blender](http://www.ifixit.com/Teardown/Blendtec-Total-Blender-Teardown/1128/1#.T9qCnStYu2o) for reference when we did the teardown on that blending behemoth, and their engineers helped fill us in on some technical questions that we had. But that's the exception—it's almost always just us and Ricky Bobby.\n[Since the MacBook Pro was rated so low, what would be a laptop that has a high repairability rating? Generally I'd assume that laptops are harder to repair vs desk tops by nature.](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50q1mp?context=5)|Easily removable bottom panel and readily accessible battery connector allow for easy repair of most components without touching the battery screws.\n |Unibody design allows for easy access of most components with minimal amounts of extra work needed to get to them.\n |Tri-wing screws limit the average person from replacing their own battery.\n |LCD replacement is still very tricky, which could easily result in shattering the front glass panel. But at least they're separable.\n |Lack of service documentation. There's no way we'd ever give a 10 to a company that used legal threats to keep their service documentation out of the hands of independent repair shops.\n |Dell deserves top marks for a lot of their laptops, and they make service documentation available. They don't get enough credit for that, IMHO. It's important.\n[I'm an Apple technician. Is there anything you'd like to know about my end?](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50szco?context=5)|Do you know if there's a service manual for the iPad or iPhone?\n[Hey Kyle! Thanks for doing an AMA - Love your site!](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50q41e?context=5)|I can't recommend the retina machine for reasons I outlines in the Wired article. I suspect that it's the recently updated MacBook Pro (non-retina), but I can't say that for sure until I get my grimy little paws on it. I'm guessing it's pretty similar to the [previous MacBook Pro](http://www.ifixit.com/Device/MacBook_Pro_15%22_Unibody_Late_2011), which is why I recommend it.  So if you're listening, awesome product designers that don't work for Apple, make something awesome and I'll buy it! Or don't, and Apple will make the kittens pay.\n[In your opinion, what is the best laptop available on the market today? What are some essential components that make it the best?](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50q41e?context=5)|Things that might change my mind: proprietary screws on the bottom, glue on the battery, changes to the display assembly that make repair expensive.  The core problem is that Apple is so far ahead of the competition. I was really optimistic about the [Dell Adamo](http://www.ifixit.com/Teardown/Dell-Adamo-Teardown/719/1), but they were never able to get the price reasonable. We don't take apart a lot of non-Apple laptops because we don't hear about exciting ones very often.\n[Are you honestly saying there isn't one laptop on the market that compares to the apple? Not even one? I can't help but feeling there may be some bias here...](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50swpu?context=5)|I'm certainly biased, because I've spent most of my time with Apple products. But the Adamo is the only non-Apple laptop I've used that I liked aesthetically. HP is doing some interesting things, and I'm interested in trying them out. I'm open minded, and I think we need to look beyond Apple!\n[Also, what's one tip you want to tell everyone in regards to what you've found while working with the products you do? Anything you've come across that would be really handy or helpful?](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50qxba?context=5)|It's a solid machine, and it runs Diablo III well. Which is all you can really ask for. I did all the upgrades myself, and it's only missing one screw! (Which fell out *after* the repairs, I swear!)\n[I've been looking into getting an ssd and removing my optical drive.  Do you recommend installing the ssd in place of the original drive and putting the hdd in the optical bay our just adding the ssd and not touching the original hdd?  Also, which drive do you have your OS and such installed on?](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50sfsy?context=5)|I believe I put the SSD in the original HDD slot because I thought it might be higher performance, but I don't have anything but intuition to back that up.\n |The standard setup is to install your OS on the SSD and put your user profile and data on the HDD. I've tried it the other way and it worked all right, but now I'm back to running the OS on the SSD. I'm pretty happy with the setup, although there are some interesting issues when you're running Filevault on both drives.\n[Just curious what's the business model behind ifixit?  How do you afford to buy and take apart all these neat gadgets?](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50rqng?context=5)|We seriously considered a donation model similar to Wikipedia. But I couldn't stand the thought of forcing the community to look at my face for a donation drive every year.\n |So we figured, let's just sell parts and tools and if people want to support us then we can give them something for the money. You're welcome to use our manuals without buying something from us. If you do support us, it gives us the ability to publish more manuals and do more advocacy work.\n[I am seriously considering buying a MBP very soon. Is it worth the extra money to purchase the new one or should I get the last generation at a discounted price?  And you know, if you have any extra stuff laying around, I like stuff...](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50qmwl?context=5)|I always buy used or refurbished hardware. It's better for the environment and better for your wallet. A time-honored strategy is to wait until the big product announcement and then buy last year's machine off the ~~suckers~~ customers that are upgrading to the newest model. [Last year's model](http://lastyearsmodel.org/) FTW!\n[How do you plan to combat the soldered-in RAM? or is it going to be impossible for a user to upgrade?](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50q5gx?context=5)|Weep for the future, Na'Toth. Weep for us all.\n |I've raised the flag of surrender on this. At this point, the RAM is completely non-user replaceable.\n |Unless your surface mount soldering skills are beyond superb, it's not feasible for a user to upgrade/replace the RAM without replacing the logic board. The same goes for flash memory on products like the iPhone.\n |That said, it is possible. I have a lot of super smart service tech friends overseas in electronics markets in Delhi, Cairo, and Nairobi that would think nothing of swapping out BGA parts for higher capacity chips. I spent a bunch of time filming them work last year, and I'll be telling their story in our upcoming documentary, [Fixers](http://ifixit.org/fixers-film/).\n[On average how many parts do you have left over when putting something back together again?](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50q6bh?context=5)|Oh, you know. [One or two](http://www.flickr.com/photos/jonwestra78/5454714734/sizes/o/in/photostream/).\n |Edit: Serious answer time. We're extremely careful during teardowns. We bag and label everything, and count screws, and take photos of cable routing, and anything else we can think of to make sure they go back together right.\n |Because once we're done with the teardown, we put it back together. Then we take it apart again, photographing it more methodically, and write the repair manual.\n |Usually the first time you take anything apart, you break something. Our repair manuals are there so we do the suffering for you ahead of time. So you can _actually_ put it back together!\n[What do you say to those who try and defend making a un-repairable product because it will stimulate the economy? And that if they make a gadget service able the product will fail? The article here.](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50rfpz?context=5)|Great question! I wrote a [whole post](http://ifixit.org/1927/techcrunch-is-full-of-it-repair-is-exactly-what-consumers-need/) about that particular article. What do you think?\n |One thing to keep in mind is that the manufacturing jobs are all overseas (unless you're in China), but the repair and refurbishment jobs are local. The aftermarket automotive repair market is huge and very critical to our economy. I don't see any reason why electronics repair can't be just as big.\n[Hey Kyle, big fan of your site! I was able to successfully install a SSD+Optibay on my MBP thanks to you guys.](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50tzyh?context=5)|USB missile launchers are critical for operational security. [Link to i.imgur.com](http://i.imgur.com/bazMX.jpg)\n[Beside your trusted ifixit kit, what else so you have on your workspace when doing a tear down ? can you post some picture of your lab?](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50tzyh?context=5)|(Also, that's an ESD safe workspace and we have anti-static wrist straps. But the Pro Tech Base Toolkit is all we really ever need for most work.)\n[Wiens?? Are you Mennonite? That's my last name.](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50teie?context=5)|My grandparents were; moved to the west coast from the Midwest. And visiting Vienna is sure a blast!\n[Soldering RAM on seems to be a hot topic.  Do you have any numbers regarding the MBA's RAM failure rate? If a chip goes bad, does it ignore that chip, or does it simply fail to boot?  I get the sense that modern RAM selected by Apple has a very, very slim failure rate.](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50s2ro?context=5)|You're right, RAM failure is quite rare. The primary issue with non-upgradeable RAM is that you can't extend the life of the device. For example, the millions of MacBook Airs that Apple sold with only 2 GB of RAM will end up getting disposed of prior to upgradeable MacBooks sold with the same amount of factory RAM.\n[Have you ever broken a device while disassembling it and had to purchase a second one?](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50rvww?context=5)|We generally only need one device for our teardowns. If we do break the device, it usually isn't something noticeable, and if it is we can usually hide it when we take the pictures.\n |However, we did go though three or four iPad 2s when we were doing the teardowns and repair guides. We hadn't quite figured out the ribbon cable placement and definitely sliced though a bunch of expensive touchscreen cables.\n |So yes, but we really, really try to avoid it.\n[Awesome ty.  Got any coupon codes perchance? ;\\)](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50uobi?context=5)|All right, you talked me into it. Coupon code REDDIT good for $8 off for the first 20 redditors to use it.\n[Will you be buying the new Macbook Pro?](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50q5kw?context=5)|Already did. I'm the canary in the coal mine—I buy things so you don't have to. [Link to i.imgur.com](http://i.imgur.com/ebPtF.jpg?1)\n[What can you tell us about slo_roller's mom!?  Go Mustangs, btw =P.](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50rk5s?context=5)|She prefers Mustangs, I can tell you that.\n[1\\) Once you remove the optical drive of the (older\\) Macbook Pro, is it possible to use it as an external optical drive (over USB\\)?](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50utag?context=5)|Yes, you can. There are two options: get [an external enclosure](http://www.amazon.com/StarTech-com-Slimline-Optical-Enclosure-SLMSOPTB/dp/B003GSCS2G) or just get a [SATA to USB cable adapter](http://www.amazon.com/Drive-Adapter-Converter-Optical-External/dp/B001OORMVQ/ref=pd_bxgy_pc_img_b).\n[2\\) Do you recommend buying the extended warranty on a Macbook (Air, Pro, or Retina\\)?](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50utag?context=5)|On something like this Retina machine, I'd say it's a necessity because no one but Apple will be able to service it. On the existing Pro, I don't generally recommend it because hiring an independent professional or servicing it yourself is more cost effective. (Of course, it depends on your lifestyle.)\n[3\\) Do you think that there is a possibility of putting 16 GB of RAM in the non-retina Macbook Pro?](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50utag?context=5)|Yes, I do. It's on my list of things to try. 8GB SODIMMS are available, I just have to test compatibility.\n[Sweet!](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50suud?context=5)|I think it's actually getting better. There's a lot of people out there making a lot of money fixing smartphones. iPhones are really worth $600, something many people don't realize until they break theirs and Apple refuses to warrantee it.\n[As proponents of repairing (which is awesome in a lot of ways\\), would you say that a career as a technician for electronic devices is a good move, or has that ship sailed long ago?](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50suud?context=5)|Our manuals have opened up a lot of opportunities. You can open a [Mac repair business](http://www.ifixit.com/Device/Mac) without having trained on every single Mac because you know we have comprehensive manuals. Same thing goes for [game console repair](http://www.ifixit.com/Device/Game_Console). We're working hard on comprehensive [Android repair manuals](http://www.ifixit.com/Device/Phone), but that's a big challenge and we need help.\n[Frog and Peach or Bulls?](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50veow?context=5)|Spike's.\n[Love the website! I might come in there soon if I can find some free time to add some desktop stuff. Fixing servers, motherboards, external hardrives, and all that good stuff too!](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50vgxr?context=5)|Absolutely, the Arduino guys are great. We've got a bunch floating around the office and we [like using them for projects](http://ifixit.org/2094/learning-arduino-kung-fu/)!\n[Just a few questions. Do you like Arduinos and other microchip stuff? What is the most ideal (reasonable\\) warranty that you could think of?](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50vgxr?context=5)|European warranties are required to be 2 years. Many cars have five year warranties. California requires manufacturers make service parts available for seven years. In my ideal world, five to seven years seems reasonable. It would make products cost more, but it would be worth it for the reduction in total unites manufactured.\n[I am a life long non apple customer, what (non apple\\) brand/model of laptop do you suggest that is equally repairable/upgradeable and still is decent laptop to use on a daily basis?](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50vl9t?context=5)|Both Dell and HP make service documentation available on their website. That's a big plus.\n[Is there not a certain point at which technology needs to incorporate these workarounds to reach the levels of thin-ness they're starting to hit?  For example, do you guys do teardowns of cell phones?  They need to solder their parts down to achieve reasonable levels of thin-ness, as well.](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50u3cj?context=5)|Yes, we absolutely do take apart cell phones. There, we focus primarily on repairability. Take a look through our [cell phone repair manuals](http://www.ifixit.com/Device/Phone)!\n[Hey, I have an iPad 3 with a home button that's a little less \"clicky\" than I would like. In other words, it's a little mushy.  My GF likes it and thinks it makes it more \"sleek\" and I guess it's all just personal preference, but if I *wanted* to fix it, what are my options?  I assume I'd have to simply order a new button part and take the screen off in order to get to it (more or less\\), right?  Or, are there other options?  Also, do you have a guide on your website to do such a thing for an iPad 3?](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c515b0w?context=5)|Absolutely! Our [iPad 3 repair manual](http://www.ifixit.com/Device/iPad_3_4G) isn't quite done, but here's a [sneak peak](http://www.ifixit.com/Guide/Installing-iPad-3-4G-Logic-Board/8672/1).\n[Cool; do you guys sell replacement parts? If not, where should I buy them from?  Can I buy an OEM home button, or what it be made by some third party?](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c51fjiu?context=5)|Absolutely, check out our [iPad parts store](http://www.ifixit.com/iPad-Parts).\n[What Android cellphone would you say is the best for being able to be repaired DIY, cheapest/easiest? Mainly if the screen were to get messed up, battery needed replacement (pretty much all have user replaceable batteries but some \"don't\"\\), and or the shell needed a replacement.](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50v5b5?context=5)|We haven't analyzed as many as we would like, but we've been really impressed by the serviceability of [Motorola Atrix](http://www.ifixit.com/Teardown/Motorola-Atrix-4G-Teardown/4964/1).\n[Thanks for the excellent toolkit i just bought from you!  ](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50qum5?context=5)|Thanks for supporting the free repair manual!\n[Heard you on NPR this morning! Didn't really pay attention but you kicked ass!](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50tm20?context=5)|Phew! I wasn't really paying attention either!\n[To give a back story, iFixit's website was down for about 3 hours yesterday after they announced they were doing a teardown of the new MBP.](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50qdqb?context=5)|Yeah, that was exciting. I spent all day yesterday babysitting our servers. We use Amazon EC2, so we can scale up to add more servers, but had never tested reddit-level traffic. Y'all effectively DOS'd us for about two hours before I was able to get everything calibrated correctly. We'll be better prepared next time!\n[Traffic level: reddit.](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50tr1p?context=5)|The alien invasion is a success!\n[Just want to say thanks for your website...i have fixed both my son's ipods using your guides...keep up the good work..much appreciated.](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50vqm0?context=5)|You're quite welcome! Thank you for fixing things.\n[Hi,Kyle Wiens, Is there any place I can get some parts of Mac book pro then I can assemble one,just like DIY our pc.thanks.](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50spn3?context=5)|Well we sell [MacBook parts](http://www.ifixit.com/Mac-Parts/MacBook). So you could get them from us. But it would be much cheaper to buy a couple broken machines and try to combine them into a functional unit.\n[It's here: Link to www.ifixit.com edit://Or the fantastic Pro Tech Base Toolkit has it.](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50r7k1?context=5)|What he said.\n[Where you able to put it back together? Can I have it? i need a leptop.](http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50uq0v?context=5)|Yes. No. (We have since taken it apart again.)\n\n\n*Last updated: 2012-06-19 05:26 UTC*\n\n*This post was generated by a robot! Send all complaints to [epsy](/message/compose/?to=epsy).*\n\n",
  "mod_reports": [],
  "secure_media_embed": {},
  "author_flair_css_class": "tabler",
  "edited": 1340083617.0,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Verified?</strong> <em>(This bot cannot verify AMAs just yet)</em></p>\n\n<p><strong>Date:</strong> 2012-06-14</p>\n\n<p><strong><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/\">Link to submission</a></strong> (<em>Has self-text</em>)</p>\n\n<p><strong><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/tabledresser/c50xf2b\">Link to my post</a></strong></p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Questions</th>\n<th align=\"left\">Answers</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50q2zu?context=5\">Just to say... love your guys work. Your speed and attention to detail are great!  The drops of humor are icing on the cake.</a></td>\n<td align=\"left\">IFixit&#39;s goal is to teach everyone how to fix all their stuff. If the world can&#39;t have the manufacturer service manual, then by golly we&#39;re going to work together to write new manuals that are free to the world.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50q2zu?context=5\">Edit: I do have a question.  Has Apple ever threatened you for anything?  Exposing parts, etc?</a></td>\n<td align=\"left\">Thanks! 7oby is right, Apple has consistently used legal threats to keep their manuals offline and make sure they&#39;re the only ones who know how to fix Apple hardware.  Apple has generally left us alone because we&#39;re very careful: everything on iFixit is original content, made by either the community or by us. So there&#39;s not much they can do about us, as much as they probably prefer we didn&#39;t exist.  Copyright law was designed to encourage creativity, and I think that its application to encourage planned obsolescence and prevent repair is a bad thing for society. There are some efforts to pass legislation like Right to Repair that would force auto manufacturers to make their documentation available.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50rxkz?context=5\"><em>Copyright law was designed to encourage creativity, and I think that its application to encourage planned obsolescence and prevent repair is a bad thing for society.</em>  Oregon is worse.</a></td>\n<td align=\"left\">Wow, that&#39;s pretty obnoxious. Why would they do that?</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50pzpx?context=5\">How much do you spend on stuff to take apart... (I assume you get free stuff and have sponsors too...) And how often do things not work when you put them together again?</a></td>\n<td align=\"left\">We buy products at retail just like anyone else. When what we want isn&#39;t sitting on the shelf, well… that&#39;s a story in itself.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">We go to lengths to get hardware. Big, seriously long lengthy lengths. When it comes to acquiring devices, really no length is too long. As long as it&#39;s (mostly) legal and it doesn&#39;t require sacrificing any ewoks. Because I&#39;m kind of attached to the furry guys.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">When really high profile devices come out (iPads, iPhones, etc) we generally take the &quot;I-don&#39;t-care-how-much-it-is-I-need-it-now!&quot; mode of operation. We&#39;ll do what we gotta to make sure that we get gizmos first, even flying to the <a href=\"https://twitter.com/jo_cleary/status/180246493830193152/photo/1\">other side of the world</a> on occassion to take advantage of the ~18 hour time difference.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Concerning Sponsors: <a href=\"http://blacksportsonline.com/home/wp-content/uploads/2012/05/Ricky-Bobby.jpg\">This guy</a> is usually our main sponsor. But every once in a blue moon, a manufacturer will help us out with a teardowns. The &quot;Will it Blend?&quot; folks sent us <a href=\"http://www.ifixit.com/Teardown/Blendtec-Total-Blender-Teardown/1128/1#.T9qCnStYu2o\">a blender</a> for reference when we did the teardown on that blending behemoth, and their engineers helped fill us in on some technical questions that we had. But that&#39;s the exception—it&#39;s almost always just us and Ricky Bobby.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50q1mp?context=5\">Since the MacBook Pro was rated so low, what would be a laptop that has a high repairability rating? Generally I&#39;d assume that laptops are harder to repair vs desk tops by nature.</a></td>\n<td align=\"left\">Easily removable bottom panel and readily accessible battery connector allow for easy repair of most components without touching the battery screws.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Unibody design allows for easy access of most components with minimal amounts of extra work needed to get to them.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Tri-wing screws limit the average person from replacing their own battery.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">LCD replacement is still very tricky, which could easily result in shattering the front glass panel. But at least they&#39;re separable.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Lack of service documentation. There&#39;s no way we&#39;d ever give a 10 to a company that used legal threats to keep their service documentation out of the hands of independent repair shops.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Dell deserves top marks for a lot of their laptops, and they make service documentation available. They don&#39;t get enough credit for that, IMHO. It&#39;s important.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50szco?context=5\">I&#39;m an Apple technician. Is there anything you&#39;d like to know about my end?</a></td>\n<td align=\"left\">Do you know if there&#39;s a service manual for the iPad or iPhone?</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50q41e?context=5\">Hey Kyle! Thanks for doing an AMA - Love your site!</a></td>\n<td align=\"left\">I can&#39;t recommend the retina machine for reasons I outlines in the Wired article. I suspect that it&#39;s the recently updated MacBook Pro (non-retina), but I can&#39;t say that for sure until I get my grimy little paws on it. I&#39;m guessing it&#39;s pretty similar to the <a href=\"http://www.ifixit.com/Device/MacBook_Pro_15%22_Unibody_Late_2011\">previous MacBook Pro</a>, which is why I recommend it.  So if you&#39;re listening, awesome product designers that don&#39;t work for Apple, make something awesome and I&#39;ll buy it! Or don&#39;t, and Apple will make the kittens pay.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50q41e?context=5\">In your opinion, what is the best laptop available on the market today? What are some essential components that make it the best?</a></td>\n<td align=\"left\">Things that might change my mind: proprietary screws on the bottom, glue on the battery, changes to the display assembly that make repair expensive.  The core problem is that Apple is so far ahead of the competition. I was really optimistic about the <a href=\"http://www.ifixit.com/Teardown/Dell-Adamo-Teardown/719/1\">Dell Adamo</a>, but they were never able to get the price reasonable. We don&#39;t take apart a lot of non-Apple laptops because we don&#39;t hear about exciting ones very often.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50swpu?context=5\">Are you honestly saying there isn&#39;t one laptop on the market that compares to the apple? Not even one? I can&#39;t help but feeling there may be some bias here...</a></td>\n<td align=\"left\">I&#39;m certainly biased, because I&#39;ve spent most of my time with Apple products. But the Adamo is the only non-Apple laptop I&#39;ve used that I liked aesthetically. HP is doing some interesting things, and I&#39;m interested in trying them out. I&#39;m open minded, and I think we need to look beyond Apple!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50qxba?context=5\">Also, what&#39;s one tip you want to tell everyone in regards to what you&#39;ve found while working with the products you do? Anything you&#39;ve come across that would be really handy or helpful?</a></td>\n<td align=\"left\">It&#39;s a solid machine, and it runs Diablo III well. Which is all you can really ask for. I did all the upgrades myself, and it&#39;s only missing one screw! (Which fell out <em>after</em> the repairs, I swear!)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50sfsy?context=5\">I&#39;ve been looking into getting an ssd and removing my optical drive.  Do you recommend installing the ssd in place of the original drive and putting the hdd in the optical bay our just adding the ssd and not touching the original hdd?  Also, which drive do you have your OS and such installed on?</a></td>\n<td align=\"left\">I believe I put the SSD in the original HDD slot because I thought it might be higher performance, but I don&#39;t have anything but intuition to back that up.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">The standard setup is to install your OS on the SSD and put your user profile and data on the HDD. I&#39;ve tried it the other way and it worked all right, but now I&#39;m back to running the OS on the SSD. I&#39;m pretty happy with the setup, although there are some interesting issues when you&#39;re running Filevault on both drives.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50rqng?context=5\">Just curious what&#39;s the business model behind ifixit?  How do you afford to buy and take apart all these neat gadgets?</a></td>\n<td align=\"left\">We seriously considered a donation model similar to Wikipedia. But I couldn&#39;t stand the thought of forcing the community to look at my face for a donation drive every year.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">So we figured, let&#39;s just sell parts and tools and if people want to support us then we can give them something for the money. You&#39;re welcome to use our manuals without buying something from us. If you do support us, it gives us the ability to publish more manuals and do more advocacy work.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50qmwl?context=5\">I am seriously considering buying a MBP very soon. Is it worth the extra money to purchase the new one or should I get the last generation at a discounted price?  And you know, if you have any extra stuff laying around, I like stuff...</a></td>\n<td align=\"left\">I always buy used or refurbished hardware. It&#39;s better for the environment and better for your wallet. A time-honored strategy is to wait until the big product announcement and then buy last year&#39;s machine off the <del>suckers</del> customers that are upgrading to the newest model. <a href=\"http://lastyearsmodel.org/\">Last year&#39;s model</a> FTW!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50q5gx?context=5\">How do you plan to combat the soldered-in RAM? or is it going to be impossible for a user to upgrade?</a></td>\n<td align=\"left\">Weep for the future, Na&#39;Toth. Weep for us all.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I&#39;ve raised the flag of surrender on this. At this point, the RAM is completely non-user replaceable.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Unless your surface mount soldering skills are beyond superb, it&#39;s not feasible for a user to upgrade/replace the RAM without replacing the logic board. The same goes for flash memory on products like the iPhone.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">That said, it is possible. I have a lot of super smart service tech friends overseas in electronics markets in Delhi, Cairo, and Nairobi that would think nothing of swapping out BGA parts for higher capacity chips. I spent a bunch of time filming them work last year, and I&#39;ll be telling their story in our upcoming documentary, <a href=\"http://ifixit.org/fixers-film/\">Fixers</a>.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50q6bh?context=5\">On average how many parts do you have left over when putting something back together again?</a></td>\n<td align=\"left\">Oh, you know. <a href=\"http://www.flickr.com/photos/jonwestra78/5454714734/sizes/o/in/photostream/\">One or two</a>.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Edit: Serious answer time. We&#39;re extremely careful during teardowns. We bag and label everything, and count screws, and take photos of cable routing, and anything else we can think of to make sure they go back together right.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Because once we&#39;re done with the teardown, we put it back together. Then we take it apart again, photographing it more methodically, and write the repair manual.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Usually the first time you take anything apart, you break something. Our repair manuals are there so we do the suffering for you ahead of time. So you can <em>actually</em> put it back together!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50rfpz?context=5\">What do you say to those who try and defend making a un-repairable product because it will stimulate the economy? And that if they make a gadget service able the product will fail? The article here.</a></td>\n<td align=\"left\">Great question! I wrote a <a href=\"http://ifixit.org/1927/techcrunch-is-full-of-it-repair-is-exactly-what-consumers-need/\">whole post</a> about that particular article. What do you think?</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">One thing to keep in mind is that the manufacturing jobs are all overseas (unless you&#39;re in China), but the repair and refurbishment jobs are local. The aftermarket automotive repair market is huge and very critical to our economy. I don&#39;t see any reason why electronics repair can&#39;t be just as big.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50tzyh?context=5\">Hey Kyle, big fan of your site! I was able to successfully install a SSD+Optibay on my MBP thanks to you guys.</a></td>\n<td align=\"left\">USB missile launchers are critical for operational security. <a href=\"http://i.imgur.com/bazMX.jpg\">Link to i.imgur.com</a></td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50tzyh?context=5\">Beside your trusted ifixit kit, what else so you have on your workspace when doing a tear down ? can you post some picture of your lab?</a></td>\n<td align=\"left\">(Also, that&#39;s an ESD safe workspace and we have anti-static wrist straps. But the Pro Tech Base Toolkit is all we really ever need for most work.)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50teie?context=5\">Wiens?? Are you Mennonite? That&#39;s my last name.</a></td>\n<td align=\"left\">My grandparents were; moved to the west coast from the Midwest. And visiting Vienna is sure a blast!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50s2ro?context=5\">Soldering RAM on seems to be a hot topic.  Do you have any numbers regarding the MBA&#39;s RAM failure rate? If a chip goes bad, does it ignore that chip, or does it simply fail to boot?  I get the sense that modern RAM selected by Apple has a very, very slim failure rate.</a></td>\n<td align=\"left\">You&#39;re right, RAM failure is quite rare. The primary issue with non-upgradeable RAM is that you can&#39;t extend the life of the device. For example, the millions of MacBook Airs that Apple sold with only 2 GB of RAM will end up getting disposed of prior to upgradeable MacBooks sold with the same amount of factory RAM.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50rvww?context=5\">Have you ever broken a device while disassembling it and had to purchase a second one?</a></td>\n<td align=\"left\">We generally only need one device for our teardowns. If we do break the device, it usually isn&#39;t something noticeable, and if it is we can usually hide it when we take the pictures.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">However, we did go though three or four iPad 2s when we were doing the teardowns and repair guides. We hadn&#39;t quite figured out the ribbon cable placement and definitely sliced though a bunch of expensive touchscreen cables.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">So yes, but we really, really try to avoid it.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50uobi?context=5\">Awesome ty.  Got any coupon codes perchance? ;)</a></td>\n<td align=\"left\">All right, you talked me into it. Coupon code REDDIT good for $8 off for the first 20 redditors to use it.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50q5kw?context=5\">Will you be buying the new Macbook Pro?</a></td>\n<td align=\"left\">Already did. I&#39;m the canary in the coal mine—I buy things so you don&#39;t have to. <a href=\"http://i.imgur.com/ebPtF.jpg?1\">Link to i.imgur.com</a></td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50rk5s?context=5\">What can you tell us about slo_roller&#39;s mom!?  Go Mustangs, btw =P.</a></td>\n<td align=\"left\">She prefers Mustangs, I can tell you that.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50utag?context=5\">1) Once you remove the optical drive of the (older) Macbook Pro, is it possible to use it as an external optical drive (over USB)?</a></td>\n<td align=\"left\">Yes, you can. There are two options: get <a href=\"http://www.amazon.com/StarTech-com-Slimline-Optical-Enclosure-SLMSOPTB/dp/B003GSCS2G\">an external enclosure</a> or just get a <a href=\"http://www.amazon.com/Drive-Adapter-Converter-Optical-External/dp/B001OORMVQ/ref=pd_bxgy_pc_img_b\">SATA to USB cable adapter</a>.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50utag?context=5\">2) Do you recommend buying the extended warranty on a Macbook (Air, Pro, or Retina)?</a></td>\n<td align=\"left\">On something like this Retina machine, I&#39;d say it&#39;s a necessity because no one but Apple will be able to service it. On the existing Pro, I don&#39;t generally recommend it because hiring an independent professional or servicing it yourself is more cost effective. (Of course, it depends on your lifestyle.)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50utag?context=5\">3) Do you think that there is a possibility of putting 16 GB of RAM in the non-retina Macbook Pro?</a></td>\n<td align=\"left\">Yes, I do. It&#39;s on my list of things to try. 8GB SODIMMS are available, I just have to test compatibility.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50suud?context=5\">Sweet!</a></td>\n<td align=\"left\">I think it&#39;s actually getting better. There&#39;s a lot of people out there making a lot of money fixing smartphones. iPhones are really worth $600, something many people don&#39;t realize until they break theirs and Apple refuses to warrantee it.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50suud?context=5\">As proponents of repairing (which is awesome in a lot of ways), would you say that a career as a technician for electronic devices is a good move, or has that ship sailed long ago?</a></td>\n<td align=\"left\">Our manuals have opened up a lot of opportunities. You can open a <a href=\"http://www.ifixit.com/Device/Mac\">Mac repair business</a> without having trained on every single Mac because you know we have comprehensive manuals. Same thing goes for <a href=\"http://www.ifixit.com/Device/Game_Console\">game console repair</a>. We&#39;re working hard on comprehensive <a href=\"http://www.ifixit.com/Device/Phone\">Android repair manuals</a>, but that&#39;s a big challenge and we need help.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50veow?context=5\">Frog and Peach or Bulls?</a></td>\n<td align=\"left\">Spike&#39;s.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50vgxr?context=5\">Love the website! I might come in there soon if I can find some free time to add some desktop stuff. Fixing servers, motherboards, external hardrives, and all that good stuff too!</a></td>\n<td align=\"left\">Absolutely, the Arduino guys are great. We&#39;ve got a bunch floating around the office and we <a href=\"http://ifixit.org/2094/learning-arduino-kung-fu/\">like using them for projects</a>!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50vgxr?context=5\">Just a few questions. Do you like Arduinos and other microchip stuff? What is the most ideal (reasonable) warranty that you could think of?</a></td>\n<td align=\"left\">European warranties are required to be 2 years. Many cars have five year warranties. California requires manufacturers make service parts available for seven years. In my ideal world, five to seven years seems reasonable. It would make products cost more, but it would be worth it for the reduction in total unites manufactured.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50vl9t?context=5\">I am a life long non apple customer, what (non apple) brand/model of laptop do you suggest that is equally repairable/upgradeable and still is decent laptop to use on a daily basis?</a></td>\n<td align=\"left\">Both Dell and HP make service documentation available on their website. That&#39;s a big plus.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50u3cj?context=5\">Is there not a certain point at which technology needs to incorporate these workarounds to reach the levels of thin-ness they&#39;re starting to hit?  For example, do you guys do teardowns of cell phones?  They need to solder their parts down to achieve reasonable levels of thin-ness, as well.</a></td>\n<td align=\"left\">Yes, we absolutely do take apart cell phones. There, we focus primarily on repairability. Take a look through our <a href=\"http://www.ifixit.com/Device/Phone\">cell phone repair manuals</a>!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c515b0w?context=5\">Hey, I have an iPad 3 with a home button that&#39;s a little less &quot;clicky&quot; than I would like. In other words, it&#39;s a little mushy.  My GF likes it and thinks it makes it more &quot;sleek&quot; and I guess it&#39;s all just personal preference, but if I <em>wanted</em> to fix it, what are my options?  I assume I&#39;d have to simply order a new button part and take the screen off in order to get to it (more or less), right?  Or, are there other options?  Also, do you have a guide on your website to do such a thing for an iPad 3?</a></td>\n<td align=\"left\">Absolutely! Our <a href=\"http://www.ifixit.com/Device/iPad_3_4G\">iPad 3 repair manual</a> isn&#39;t quite done, but here&#39;s a <a href=\"http://www.ifixit.com/Guide/Installing-iPad-3-4G-Logic-Board/8672/1\">sneak peak</a>.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c51fjiu?context=5\">Cool; do you guys sell replacement parts? If not, where should I buy them from?  Can I buy an OEM home button, or what it be made by some third party?</a></td>\n<td align=\"left\">Absolutely, check out our <a href=\"http://www.ifixit.com/iPad-Parts\">iPad parts store</a>.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50v5b5?context=5\">What Android cellphone would you say is the best for being able to be repaired DIY, cheapest/easiest? Mainly if the screen were to get messed up, battery needed replacement (pretty much all have user replaceable batteries but some &quot;don&#39;t&quot;), and or the shell needed a replacement.</a></td>\n<td align=\"left\">We haven&#39;t analyzed as many as we would like, but we&#39;ve been really impressed by the serviceability of <a href=\"http://www.ifixit.com/Teardown/Motorola-Atrix-4G-Teardown/4964/1\">Motorola Atrix</a>.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50qum5?context=5\">Thanks for the excellent toolkit i just bought from you!  </a></td>\n<td align=\"left\">Thanks for supporting the free repair manual!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50tm20?context=5\">Heard you on NPR this morning! Didn&#39;t really pay attention but you kicked ass!</a></td>\n<td align=\"left\">Phew! I wasn&#39;t really paying attention either!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50qdqb?context=5\">To give a back story, iFixit&#39;s website was down for about 3 hours yesterday after they announced they were doing a teardown of the new MBP.</a></td>\n<td align=\"left\">Yeah, that was exciting. I spent all day yesterday babysitting our servers. We use Amazon EC2, so we can scale up to add more servers, but had never tested reddit-level traffic. Y&#39;all effectively DOS&#39;d us for about two hours before I was able to get everything calibrated correctly. We&#39;ll be better prepared next time!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50tr1p?context=5\">Traffic level: reddit.</a></td>\n<td align=\"left\">The alien invasion is a success!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50vqm0?context=5\">Just want to say thanks for your website...i have fixed both my son&#39;s ipods using your guides...keep up the good work..much appreciated.</a></td>\n<td align=\"left\">You&#39;re quite welcome! Thank you for fixing things.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50spn3?context=5\">Hi,Kyle Wiens, Is there any place I can get some parts of Mac book pro then I can assemble one,just like DIY our pc.thanks.</a></td>\n<td align=\"left\">Well we sell <a href=\"http://www.ifixit.com/Mac-Parts/MacBook\">MacBook parts</a>. So you could get them from us. But it would be much cheaper to buy a couple broken machines and try to combine them into a functional unit.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50r7k1?context=5\">It&#39;s here: Link to www.ifixit.com edit://Or the fantastic Pro Tech Base Toolkit has it.</a></td>\n<td align=\"left\">What he said.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/v2h57/im_the_ifixit_guy_who_took_apart_the_new_retina/c50uq0v?context=5\">Where you able to put it back together? Can I have it? i need a leptop.</a></td>\n<td align=\"left\">Yes. No. (We have since taken it apart again.)</td>\n</tr>\n</tbody></table>\n\n<p><em>Last updated: 2012-06-19 05:26 UTC</em></p>\n\n<p><em>This post was generated by a robot! Send all complaints to <a href=\"/message/compose/?to=epsy\">epsy</a>.</em></p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "user_reports": [],
  "author_flair_text": "",
  "over_18": false,
  "score": 43,
  "stickied": false,
  "domain": "self.tabled",
  "is_self": true,
  "hidden": false,
  "_orphaned": {},
  "_api_link": "https://api.reddit.com/r/tabled/comments/v39a2/table_iama_im_the_ifixit_guy_who_took_apart_the/?ref=search_posts",
  "_comments_by_id": {},
  "visited": false,
  "thumbnail": "",
  "_has_fetched": true,
  "gilded": 0,
  "hide_score": false,
  "_info_url": "https://api.reddit.com/api/info/",
  "created_utc": 1339761770.0,
  "subreddit_id": "t5_2tkmw",
  "id": "v39a2",
  "_params": {},
  "media_embed": {},
  "name": "t3_v39a2",
  "quarantine": false,
  "permalink": "https://www.reddit.com/r/tabled/comments/v39a2/table_iama_im_the_ifixit_guy_who_took_apart_the/?ref=search_posts",
  "ups": 43,
  "url": "https://www.reddit.com/r/tabled/comments/v39a2/table_iama_im_the_ifixit_guy_who_took_apart_the/",
  "title": "[Table] IAmA: I'm the iFixit guy who took apart the new Retina MacBook Pro, and I'm on a mission to make your stuff repairable. AMA."
}