{
  "downs": 0,
  "mod_reports": [],
  "secure_media_embed": {},
  "_info_url": "https://api.reddit.com/api/info/",
  "gilded": 1,
  "num_comments": 1349,
  "_orphaned": {},
  "hidden": false,
  "ups": 3163,
  "url": "https://www.reddit.com/r/Fitness/comments/2qy30b/here_is_my_body_before_after_getting_a_job_at/",
  "_has_fetched": true,
  "quarantine": false,
  "name": "t3_2qy30b",
  "user_reports": [],
  "saved": false,
  "permalink": "https://www.reddit.com/r/Fitness/comments/2qy30b/here_is_my_body_before_after_getting_a_job_at/?ref=search_posts",
  "over_18": false,
  "is_self": true,
  "_params": {},
  "thumbnail": "",
  "created_utc": 1420055498.0,
  "_replaced_more": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"http://imgur.com/a/FGS0k\">http://imgur.com/a/FGS0k</a></p>\n\n<p>I am a 21 year old male 5&#39;10&#39;&#39;</p>\n\n<p>In the first picture I was 170lbs taken on 5/27/13</p>\n\n<p>In the second Picture I was 150lbs taken on  8/21/2013</p>\n\n<p>I dropped 20 pounds in 2 and a half months.</p>\n\n<p>I used intermittent fasting to achieve this physique. The Leangains method to be exact. Leangains.com has all the information you need to make this transformation. It is basically carb cycling with a 16 hour fast every day. I just concentrated on getting the protein I needed and ensured I was in a caloric deficit. I used a TDEE calculator for this.</p>\n\n<p>EDIT: This is the exact URL I followed to structure this diet plan. Follow the links embedded and see how far the rabbit hole takes you.\n<a href=\"http://rippedbody.jp/2011/10/08/leangains-intermittent-fasting-guide-how-to-do-it-by-yourself/\">http://rippedbody.jp/2011/10/08/leangains-intermittent-fasting-guide-how-to-do-it-by-yourself/</a></p>\n\n<p>For workouts I never did cardio and concentrated on compound lifts like bench, squats, pull-ups. I <strong>never</strong> do abs. These abs were achieved from using heavy weights which engage your core. Almost everything you do engages your core so your abs are getting worked every day (squats, bench)</p>\n\n<p><strong>Crunches and situps</strong> <del>do not give you abs</del> are not the key to abs. They may make a small difference overtime. But they really do not add to the overall mass of them. If you want them quick, then engage them with heavy weight.</p>\n\n<p>Achieving this while working at McDonald&#39;s taught me that dieting doesn&#39;t have to consume your life and nor should it. This shows that you can splurge and look great at the same time. Before you ask, <strong>Yes</strong> I did eat McDonald&#39;s food while I worked there. And a lot of it! Nearly every day. My favorite was a Big Mac Double quarter pounder with bacon. That is a Big Mac with quarter pounder meat on it, not the little slivers of meat that come on the original sandwich lol. No their meat doesn&#39;t have horse in it and I love their grilled chicken. There are healthy foods to be had at McDonald&#39;s and other fast food chains for that matter. </p>\n\n<p>The media destroys these companies when all they are doing is serving food. It is the customers responsibility to choose what they put in their body.\nAt the end of the day it is all about your <strong>caloric intake</strong> and work ethic!</p>\n\n<p>P.S. </p>\n\n<p>A McDonald&#39;s parfait is not exactly &quot;healthy&quot;. That is pure sugar.</p>\n\n<p><strong>EDIT:</strong> Wow this is scary. Front Page!? Thanks so much! You guys are awesome! My girlfriend is going to be so mad when she finds out how many people have seen me.</p>\n\n<p><strong>EDIT 2:</strong> No, this is not advertisement by McDonald&#39;s Corp. This is just an average guy who surprisingly  found himself on the front page of Reddit. But if anyone knows a guy, who knows a guy in advertisement. I could use some change to get rid of these student loans ;)</p>\n\n<p><strong>EDIT 3:</strong> Getting <strong>a lot</strong> of question so I will try and address a few of them now. I can&#39;t possibly answer all of them though, I&#39;m sorry :(</p>\n\n<p>I do not know my max in any of my lifts, as I am not a power lifter or interested in the numbers. These pictures were taken over a year ago and I cannot remember what I was using for bench/squats/etc. I remember doing 225 for 8 on bench press a little after this cut. Put that in a one rep max calculator and its says it would be around 285 for my max. Who knows if those work or not. But again I will not try it because the numbers don&#39;t interest me. Just to give some of you an idea though, I am currently using 75lb dumbbells for overhead shoulder press, 100lb dumbbells for flat press, squats I do not go over 225. Bad knees run in the family. Had knee surgery in highschool. Pull-ups I tie 45 pound plate to me for added resistance.</p>\n\n<p>Workouts: I like to go heavy on the compound movement, usually 8 to 10 reps when wanting to put on size, and reps of 5 when wanting to build strength. I like using strong lifts for building strength. I am a firm believer of working each body part at least twice a week. I like doing upper/lower body splits. Monday upper, Tuesday lower, Wednesday off, Thursday upper, Friday lower. Sat, Sun rest. Though I do not always follow this routine because I like to switch it up, but I always try to work each body part twice a week.</p>\n\n<p>I am by no means a professional and do not plan to be. Do what you think is best. This method just worked for me so I wanted to share it.</p>\n\n<p><strong>UPDATE:</strong> No, I do not work at McDonald&#39;s anymore. I worked there while completing my Bachelor&#39;s Degree and Interning. Currently I am 183 lbs and started a career Information Technology. I continue to lift and plan my next cut in February, and should be done with it in May. Maybe I will see you guys again soon! Thanks for all the support! :)</p>\n\n<p><strong>SHOUT-OUT:</strong> To the Hodgetwins who follow a very similar diet as what I have done here. They are a great YouTube Channel <strong>(TwinMuscleWorkout) (FastingTwins) (Hodgetwins)</strong> and I highly suggest checking them out! They approach dieting and training in a fun way, the same way as I, and I never miss one of their videos. They were a big part of my inspiration and they can inspire you guys as well!</p>\n</div><!-- SC_ON -->",
  "subreddit_id": "t5_2qhx4",
  "archived": true,
  "domain": "self.Fitness",
  "clicked": false,
  "score": 3163,
  "link_flair_text": "/r/all",
  "id": "2qy30b",
  "stickied": false,
  "media_embed": {},
  "visited": false,
  "selftext": "http://imgur.com/a/FGS0k\n\nI am a 21 year old male 5'10''\n\nIn the first picture I was 170lbs taken on 5/27/13\n\nIn the second Picture I was 150lbs taken on  8/21/2013\n\nI dropped 20 pounds in 2 and a half months.\n\nI used intermittent fasting to achieve this physique. The Leangains method to be exact. Leangains.com has all the information you need to make this transformation. It is basically carb cycling with a 16 hour fast every day. I just concentrated on getting the protein I needed and ensured I was in a caloric deficit. I used a TDEE calculator for this.\n\nEDIT: This is the exact URL I followed to structure this diet plan. Follow the links embedded and see how far the rabbit hole takes you.\nhttp://rippedbody.jp/2011/10/08/leangains-intermittent-fasting-guide-how-to-do-it-by-yourself/\n\nFor workouts I never did cardio and concentrated on compound lifts like bench, squats, pull-ups. I **never** do abs. These abs were achieved from using heavy weights which engage your core. Almost everything you do engages your core so your abs are getting worked every day (squats, bench)\n\n**Crunches and situps** ~~do not give you abs~~ are not the key to abs. They may make a small difference overtime. But they really do not add to the overall mass of them. If you want them quick, then engage them with heavy weight.\n\n\nAchieving this while working at McDonald's taught me that dieting doesn't have to consume your life and nor should it. This shows that you can splurge and look great at the same time. Before you ask, **Yes** I did eat McDonald's food while I worked there. And a lot of it! Nearly every day. My favorite was a Big Mac Double quarter pounder with bacon. That is a Big Mac with quarter pounder meat on it, not the little slivers of meat that come on the original sandwich lol. No their meat doesn't have horse in it and I love their grilled chicken. There are healthy foods to be had at McDonald's and other fast food chains for that matter. \n\nThe media destroys these companies when all they are doing is serving food. It is the customers responsibility to choose what they put in their body.\nAt the end of the day it is all about your **caloric intake** and work ethic!\n\nP.S. \n\nA McDonald's parfait is not exactly \"healthy\". That is pure sugar.\n\n**EDIT:** Wow this is scary. Front Page!? Thanks so much! You guys are awesome! My girlfriend is going to be so mad when she finds out how many people have seen me.\n\n**EDIT 2:** No, this is not advertisement by McDonald's Corp. This is just an average guy who surprisingly  found himself on the front page of Reddit. But if anyone knows a guy, who knows a guy in advertisement. I could use some change to get rid of these student loans ;)\n\n**EDIT 3:** Getting **a lot** of question so I will try and address a few of them now. I can't possibly answer all of them though, I'm sorry :(\n\nI do not know my max in any of my lifts, as I am not a power lifter or interested in the numbers. These pictures were taken over a year ago and I cannot remember what I was using for bench/squats/etc. I remember doing 225 for 8 on bench press a little after this cut. Put that in a one rep max calculator and its says it would be around 285 for my max. Who knows if those work or not. But again I will not try it because the numbers don't interest me. Just to give some of you an idea though, I am currently using 75lb dumbbells for overhead shoulder press, 100lb dumbbells for flat press, squats I do not go over 225. Bad knees run in the family. Had knee surgery in highschool. Pull-ups I tie 45 pound plate to me for added resistance.\n\nWorkouts: I like to go heavy on the compound movement, usually 8 to 10 reps when wanting to put on size, and reps of 5 when wanting to build strength. I like using strong lifts for building strength. I am a firm believer of working each body part at least twice a week. I like doing upper/lower body splits. Monday upper, Tuesday lower, Wednesday off, Thursday upper, Friday lower. Sat, Sun rest. Though I do not always follow this routine because I like to switch it up, but I always try to work each body part twice a week.\n\nI am by no means a professional and do not plan to be. Do what you think is best. This method just worked for me so I wanted to share it.\n\n**UPDATE:** No, I do not work at McDonald's anymore. I worked there while completing my Bachelor's Degree and Interning. Currently I am 183 lbs and started a career Information Technology. I continue to lift and plan my next cut in February, and should be done with it in May. Maybe I will see you guys again soon! Thanks for all the support! :)\n\n**SHOUT-OUT:** To the Hodgetwins who follow a very similar diet as what I have done here. They are a great YouTube Channel **(TwinMuscleWorkout) (FastingTwins) (Hodgetwins)** and I highly suggest checking them out! They approach dieting and training in a fun way, the same way as I, and I never miss one of their videos. They were a big part of my inspiration and they can inspire you guys as well!\n\n\n",
  "hide_score": false,
  "_api_link": "https://api.reddit.com/r/Fitness/comments/2qy30b/here_is_my_body_before_after_getting_a_job_at/?ref=search_posts",
  "locked": false,
  "edited": 1420134073.0,
  "title": "Here is My Body. Before & After getting a Job at McDonald's.",
  "created": 1420055498.0,
  "_comments_by_id": {}
}