{
  "clicked": false,
  "_replaced_more": false,
  "archived": false,
  "num_comments": 14,
  "created": 1439533692.0,
  "saved": false,
  "selftext": "2015 Tampa Bay Buccaneers\n\n2015 Schedule:\n\nWeek\tOpponents:\n1\tTEN\n2\t@NO\n3\t@HOU\n4\tCAR\n5\tJAX\n6\tBYE\n7\t@WAS\n8\t@ATL\n9\tNYG\n10\tDAL\n11\t@PHI\n12\t@IND\n13\tATL\n14\tNO\n15\t@STL\n16\tCHI\n17\t@CAR\n\n2014 Season in Review:\n\nThe Tampa Bay Buccaneers’ 2014 season was their first under new coach Lovie Smith, former defensive mind and head coach of the Chicago Bears. They drafted Mike Evans out of Texas A&M and acquired Josh McCown from the Bears in what we thought was going to be the new high powered Bucs passing attack. We were wrong. With thumb injuries and poor play ailing McCown, a subpar offensive line and a completely trashed run game due to an inefficient Doug Martin, the Bucs went 0-6 in the NFC South and 2-14 on the season besting only the Steelers and Redskins. That being said, the scoring difference (omitting the routs we took from Baltimore and ATL week 3) the majority of losses came within a one score scoring differential. Losing, the last game of the season to the New Orleans Saints, the Bucs secured the first overall pick in the 2015 NFL Draft in hopes of finding an answer to the franchise's problems.\n\nOffseason Transactions\n\n2015 NFL Draft:\n\nRound 1, pick 1: QB Jameis Winston\nRound 2, pick 34: OL Donovan Smith\nRound 2, pick 61: OL Ali Marpet\nRound 4, pick 124: LB Kwon Alexander\nRound 5, pick 162: WR Kenny Bell\nRound 6, pick 184: WR/KR Kaelin Clay.\nRound 7, pick 231: RB/FB Joey Iosefa\n\nOffseason Additions:\n\nTE Tim Wright, DE George Johnson, DT Henry Melton, OLB Bruce Carter, LB Larry Dean, CB Sterling Moore, S Chris Conte, P Spencer Lanning, DE Dequan Bowers, DT Tony McDaniel\n\nOffseason Losses:\n\nQB Josh McCown, OT Anthony Collins, OT Oniel Cousins, DE Michael Johnson, DE Adrian Clayborn, ILB Mason Foster, ILB Dane Fletcher, S Dashon Goldson. \n\nQB Assessment :\n\nLovie Smith brought in Josh McCown for the 2014 season. He thought the Veteran Chicago Bear could become the experienced play-caller that the Bucs needed. His injury riddled 2-14 season, that he got to share with Mike Glennon, proved otherwise. While Mike actually played better than McCown, with the aid of Mike Evans and Vincent Jackson, the terrible offensive line play combined with Glennon's lack of pocket mobility led to his poor play as well. Now, with the 1st overall pick in the draft, we have named Jameis Winston as our new franchise leading, starting Quarterback. This Heisman winning quarterback has the right attitude (despite what his past record might show he has actually been a \"gem\" for the team on and OFF the field so far), athletic ability, and big play arm to help the Buccaneers win some games this season. He has had some problems with interceptions and forcing plays, especially his last season, but he is still an unproven rookie quarterback thus his fantasy value should be kept low. His offensive line has improved. With a year under their belts working with each other, combined with two second round picks on O-lineman, the line should perform much better this season. Also, Jameis has great targets such as Evans, Jackson, Tim Wright, a young growing chemistry with Kenny Bell and Austin Seferian-Jenkins who has been killing it in camp so far. There is upside as a late round sleeper QB, but I would not rely on Jameis as an actual option for your team until he has proven himself.\n\nRB Assessment\n\nCHOO CHOO!! ALL ABOARD!! The ubiquitous hype train for Doug Martin is back, and this is the only year I have thought it to be legitimate. The 2012 Muscle Hamster rookie season heard round the world was only attributed to the success of his interior line. Davin Joseph and Carl Nicks, albeit they both had their share of injuries, are phenomenal guards and playing tandem whilst healthy led to huge holes in the middle that Dougie plowed through. The last two years Martin has had injuries, a poor offensive line, and he was constantly playing from behind. His numbers were abysmal. This year he is in a better offense with Dirk Koetter coming in to clean up our system, Mike, VJAx, Jameis and the rookies to form a stronger passing attack, and an improved offensive line that will allow Doug to perform better. He is very healthy, he lost weight and is deemed much more explosive this camp, and he is poised for a big season even though his ADP is low. I am definitely buying low on Doug Martin who could easily be RB2 this year if he stays healthy. Charles Sims, the second year RB out of WVU has been having a great offseason and is ranked higher than Bobby Rainey and Mike James on the depth chart. The coaches are loving him, Dirk Koetter really likes him for third down situations, but we will have to see how much he plays as we adjust to Koetter's new offense. I could only see Sims as a flex with a low floor, but worth consideration on the wire as the season progresses.\n\nWR Assessment\n\nJameis Winston and the Bucs offensive line are going to be the keys to the success to the offense. Everything boils down to their play. If the o-line sucks and can't block for Doug, then the box things out and more people cover the wide-outs, and if they can't pass block for Jameis, he won't have enough time to throw it to the receivers. That being said, Mike Evans and Vincent Jackson both posted 1,000 yard seasons in an inefficient offensive scheme. This means that they both have tons of upside for this season and all the hype with the franchise changes. Mike is ranked WR1 with VJax on the other side. I believe both will be viable WR2 options if not Mike as a WR1. These guys will perform, get open, and make big plays and hopefully more of them with Jameis at the helm. Coming in at our third WR adds some ambiguity. Louis Murphy Jr. is currently holding that spot on the depth chart, but don't be surprised to see Kenny Bell get serious reps in the slot this year. Murphy has more experience and has an underrated explosiveness about him in the open-field, yet Bell has great chemistry with Jameis as they study film together constantly and roomed together in training camp and rookie camp. Robert Herron and Kaelin Clay are other names you will see in the mix competing for the other WR spots, but the first two I mentioned are going to be the most productive. Clay is mainly a punt returner and Herron is inconsistent and undersized. Look out for Murphy or Bell throughout the beginning of the season for an early waiver wire pick-up.\n\nTE Assessment\n\nAustin Seferian-Jenkins has been all the rave this offseason. He's been explosive at camp making big athletic and even acrobatic plays while boasting much better hands than he had last season. I would keep an eye on him as a low-end TE1 who may even surprise with an outstanding season. The Bucs have a lot of depth at TE, but they have yet to show who will star besides ASJ. Tim Wright returned to Tampa Bay, but it appears he will play a more limited role compared to his productive 2013 season. He is listed as 3rd or 4th on the Depth Chart, but he is a true receiving TE so his fantasy  value is higher than that. Brandon Myers and Luke Stocker are the other TEs in the starting rotation, but they play more of a traditional blocking TE although Myers has some athletic upside. I'd wait and stream the TEs who are performing under ASJ if they are even worth it.\n\nKicker/Defense Assessment\n\nPatrick Murray is the placekicker for the Buccaneers. As a rookie last year he posted an 83.3% FG PCT, making 20/24 attempts including a long of 55 yards. The Buccaneers defense was close to the bottom of the totem pole last year ranking 25th in points allowed (25.6 per game). However, these numbers were affected by statistical outlier games where we were routed by the Falcons and Ravens. Although we didn't draft any serious defensive players, and we lost MLB Mason Foster and DEs Adrian Clayborn and Michael Johnson, not all defensive hope is lost. This year we have added some veteran interior D-lineman in Henry Melton and Tony McDaniel to add to our stacked DT corps of Gerald McCoy and Clinton McDonald. Last year, the Bucs had more sacks from Defensive Tackles (18) than any other NFL team. We are hoping for big years from McCoy and the rest of our interior and there has been discussion as to changing some defensive sets where more interior D-lineman can have their strengths accentuated at the same time. As far as our pass rush on the outside, it might be weak. DeQuan Bowers and Jacques Smith are pressured to be productive this year, and that might be a weak spot on our defense. However, hopefully our possibly week Defensive End play will be neutralized by our strong LBs. Lavonte David is easy. He's smart, quick, athletic, and has a nose for the football. Fellow LB Danny Lansanah is playing the strong side SAM LB which allows his athletic playmaking ability to complement the Will LB LAvonte. Fighting for the third LB spot, the Mike are veteran Bruce Carter and rookie Kwon Alexander. Alexander is more athletic and his move from outside to inside has been a postive adjustment for him. Run stuffer Bruce Carter will prove a good challenge and we will see how it plays out in camp. Alterraun Verner and Jonathon Banks lead our cornerbacks who have been average to above average in the past few years. Their play will be looked at under a microscope this season to see how they fare. Behind them we have depth at safety. Addind DJ Swearinger and Chris Conte to contest with Major Wright and Bradley McDougald has yielded good competition and I believe we will have solid play from out safeties this year. Fantasy-wise the Bucs defense is going to be inconsistent this year as much of their play will be. I would stream Bucs D/ST during favorable match-ups as we gauge how they play throughout the season.\n\nSummary/Notes\n\nWhile the Tampa Bay Buccaneers seem to be on the upswing of things offensively, there are still some worries. Rarely does a team simply draft a QB and all their problems that led to a 2-14 season vanish. Jameis Winston has great potential, and his ability to move around and outside the pocket will hopefully help since our offensive line has some rookies on it and sure as heck won't be the Cowboys O-line. However, with a healthy RB in Doug Martin and athletic upside in Charles Sims, the explosive, sure-handed twin towers of Mike Evans and Vincent Jackson, a new QB and some new great additions to our defense, coupled with the shame from last year's atrocious season, the Tampa Bay Buccaneers are poised to have a much better season this year. I think the Bucs are a team whose players will be overlooked this year simply because they are on the Bucs. Be cognizant of Jameis, Doug Martin, and ASJ as well as the 3rd WR that other people aren't picking up yet to get ahead of your friends in your league. Have a great day and good luck in your season. GO BUCS!",
  "mod_reports": [],
  "secure_media_embed": {},
  "edited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>2015 Tampa Bay Buccaneers</p>\n\n<p>2015 Schedule:</p>\n\n<p>Week    Opponents:\n1   TEN\n2   @NO\n3   @HOU\n4   CAR\n5   JAX\n6   BYE\n7   @WAS\n8   @ATL\n9   NYG\n10  DAL\n11  @PHI\n12  @IND\n13  ATL\n14  NO\n15  @STL\n16  CHI\n17  @CAR</p>\n\n<p>2014 Season in Review:</p>\n\n<p>The Tampa Bay Buccaneers’ 2014 season was their first under new coach Lovie Smith, former defensive mind and head coach of the Chicago Bears. They drafted Mike Evans out of Texas A&amp;M and acquired Josh McCown from the Bears in what we thought was going to be the new high powered Bucs passing attack. We were wrong. With thumb injuries and poor play ailing McCown, a subpar offensive line and a completely trashed run game due to an inefficient Doug Martin, the Bucs went 0-6 in the NFC South and 2-14 on the season besting only the Steelers and Redskins. That being said, the scoring difference (omitting the routs we took from Baltimore and ATL week 3) the majority of losses came within a one score scoring differential. Losing, the last game of the season to the New Orleans Saints, the Bucs secured the first overall pick in the 2015 NFL Draft in hopes of finding an answer to the franchise&#39;s problems.</p>\n\n<p>Offseason Transactions</p>\n\n<p>2015 NFL Draft:</p>\n\n<p>Round 1, pick 1: QB Jameis Winston\nRound 2, pick 34: OL Donovan Smith\nRound 2, pick 61: OL Ali Marpet\nRound 4, pick 124: LB Kwon Alexander\nRound 5, pick 162: WR Kenny Bell\nRound 6, pick 184: WR/KR Kaelin Clay.\nRound 7, pick 231: RB/FB Joey Iosefa</p>\n\n<p>Offseason Additions:</p>\n\n<p>TE Tim Wright, DE George Johnson, DT Henry Melton, OLB Bruce Carter, LB Larry Dean, CB Sterling Moore, S Chris Conte, P Spencer Lanning, DE Dequan Bowers, DT Tony McDaniel</p>\n\n<p>Offseason Losses:</p>\n\n<p>QB Josh McCown, OT Anthony Collins, OT Oniel Cousins, DE Michael Johnson, DE Adrian Clayborn, ILB Mason Foster, ILB Dane Fletcher, S Dashon Goldson. </p>\n\n<p>QB Assessment :</p>\n\n<p>Lovie Smith brought in Josh McCown for the 2014 season. He thought the Veteran Chicago Bear could become the experienced play-caller that the Bucs needed. His injury riddled 2-14 season, that he got to share with Mike Glennon, proved otherwise. While Mike actually played better than McCown, with the aid of Mike Evans and Vincent Jackson, the terrible offensive line play combined with Glennon&#39;s lack of pocket mobility led to his poor play as well. Now, with the 1st overall pick in the draft, we have named Jameis Winston as our new franchise leading, starting Quarterback. This Heisman winning quarterback has the right attitude (despite what his past record might show he has actually been a &quot;gem&quot; for the team on and OFF the field so far), athletic ability, and big play arm to help the Buccaneers win some games this season. He has had some problems with interceptions and forcing plays, especially his last season, but he is still an unproven rookie quarterback thus his fantasy value should be kept low. His offensive line has improved. With a year under their belts working with each other, combined with two second round picks on O-lineman, the line should perform much better this season. Also, Jameis has great targets such as Evans, Jackson, Tim Wright, a young growing chemistry with Kenny Bell and Austin Seferian-Jenkins who has been killing it in camp so far. There is upside as a late round sleeper QB, but I would not rely on Jameis as an actual option for your team until he has proven himself.</p>\n\n<p>RB Assessment</p>\n\n<p>CHOO CHOO!! ALL ABOARD!! The ubiquitous hype train for Doug Martin is back, and this is the only year I have thought it to be legitimate. The 2012 Muscle Hamster rookie season heard round the world was only attributed to the success of his interior line. Davin Joseph and Carl Nicks, albeit they both had their share of injuries, are phenomenal guards and playing tandem whilst healthy led to huge holes in the middle that Dougie plowed through. The last two years Martin has had injuries, a poor offensive line, and he was constantly playing from behind. His numbers were abysmal. This year he is in a better offense with Dirk Koetter coming in to clean up our system, Mike, VJAx, Jameis and the rookies to form a stronger passing attack, and an improved offensive line that will allow Doug to perform better. He is very healthy, he lost weight and is deemed much more explosive this camp, and he is poised for a big season even though his ADP is low. I am definitely buying low on Doug Martin who could easily be RB2 this year if he stays healthy. Charles Sims, the second year RB out of WVU has been having a great offseason and is ranked higher than Bobby Rainey and Mike James on the depth chart. The coaches are loving him, Dirk Koetter really likes him for third down situations, but we will have to see how much he plays as we adjust to Koetter&#39;s new offense. I could only see Sims as a flex with a low floor, but worth consideration on the wire as the season progresses.</p>\n\n<p>WR Assessment</p>\n\n<p>Jameis Winston and the Bucs offensive line are going to be the keys to the success to the offense. Everything boils down to their play. If the o-line sucks and can&#39;t block for Doug, then the box things out and more people cover the wide-outs, and if they can&#39;t pass block for Jameis, he won&#39;t have enough time to throw it to the receivers. That being said, Mike Evans and Vincent Jackson both posted 1,000 yard seasons in an inefficient offensive scheme. This means that they both have tons of upside for this season and all the hype with the franchise changes. Mike is ranked WR1 with VJax on the other side. I believe both will be viable WR2 options if not Mike as a WR1. These guys will perform, get open, and make big plays and hopefully more of them with Jameis at the helm. Coming in at our third WR adds some ambiguity. Louis Murphy Jr. is currently holding that spot on the depth chart, but don&#39;t be surprised to see Kenny Bell get serious reps in the slot this year. Murphy has more experience and has an underrated explosiveness about him in the open-field, yet Bell has great chemistry with Jameis as they study film together constantly and roomed together in training camp and rookie camp. Robert Herron and Kaelin Clay are other names you will see in the mix competing for the other WR spots, but the first two I mentioned are going to be the most productive. Clay is mainly a punt returner and Herron is inconsistent and undersized. Look out for Murphy or Bell throughout the beginning of the season for an early waiver wire pick-up.</p>\n\n<p>TE Assessment</p>\n\n<p>Austin Seferian-Jenkins has been all the rave this offseason. He&#39;s been explosive at camp making big athletic and even acrobatic plays while boasting much better hands than he had last season. I would keep an eye on him as a low-end TE1 who may even surprise with an outstanding season. The Bucs have a lot of depth at TE, but they have yet to show who will star besides ASJ. Tim Wright returned to Tampa Bay, but it appears he will play a more limited role compared to his productive 2013 season. He is listed as 3rd or 4th on the Depth Chart, but he is a true receiving TE so his fantasy  value is higher than that. Brandon Myers and Luke Stocker are the other TEs in the starting rotation, but they play more of a traditional blocking TE although Myers has some athletic upside. I&#39;d wait and stream the TEs who are performing under ASJ if they are even worth it.</p>\n\n<p>Kicker/Defense Assessment</p>\n\n<p>Patrick Murray is the placekicker for the Buccaneers. As a rookie last year he posted an 83.3% FG PCT, making 20/24 attempts including a long of 55 yards. The Buccaneers defense was close to the bottom of the totem pole last year ranking 25th in points allowed (25.6 per game). However, these numbers were affected by statistical outlier games where we were routed by the Falcons and Ravens. Although we didn&#39;t draft any serious defensive players, and we lost MLB Mason Foster and DEs Adrian Clayborn and Michael Johnson, not all defensive hope is lost. This year we have added some veteran interior D-lineman in Henry Melton and Tony McDaniel to add to our stacked DT corps of Gerald McCoy and Clinton McDonald. Last year, the Bucs had more sacks from Defensive Tackles (18) than any other NFL team. We are hoping for big years from McCoy and the rest of our interior and there has been discussion as to changing some defensive sets where more interior D-lineman can have their strengths accentuated at the same time. As far as our pass rush on the outside, it might be weak. DeQuan Bowers and Jacques Smith are pressured to be productive this year, and that might be a weak spot on our defense. However, hopefully our possibly week Defensive End play will be neutralized by our strong LBs. Lavonte David is easy. He&#39;s smart, quick, athletic, and has a nose for the football. Fellow LB Danny Lansanah is playing the strong side SAM LB which allows his athletic playmaking ability to complement the Will LB LAvonte. Fighting for the third LB spot, the Mike are veteran Bruce Carter and rookie Kwon Alexander. Alexander is more athletic and his move from outside to inside has been a postive adjustment for him. Run stuffer Bruce Carter will prove a good challenge and we will see how it plays out in camp. Alterraun Verner and Jonathon Banks lead our cornerbacks who have been average to above average in the past few years. Their play will be looked at under a microscope this season to see how they fare. Behind them we have depth at safety. Addind DJ Swearinger and Chris Conte to contest with Major Wright and Bradley McDougald has yielded good competition and I believe we will have solid play from out safeties this year. Fantasy-wise the Bucs defense is going to be inconsistent this year as much of their play will be. I would stream Bucs D/ST during favorable match-ups as we gauge how they play throughout the season.</p>\n\n<p>Summary/Notes</p>\n\n<p>While the Tampa Bay Buccaneers seem to be on the upswing of things offensively, there are still some worries. Rarely does a team simply draft a QB and all their problems that led to a 2-14 season vanish. Jameis Winston has great potential, and his ability to move around and outside the pocket will hopefully help since our offensive line has some rookies on it and sure as heck won&#39;t be the Cowboys O-line. However, with a healthy RB in Doug Martin and athletic upside in Charles Sims, the explosive, sure-handed twin towers of Mike Evans and Vincent Jackson, a new QB and some new great additions to our defense, coupled with the shame from last year&#39;s atrocious season, the Tampa Bay Buccaneers are poised to have a much better season this year. I think the Bucs are a team whose players will be overlooked this year simply because they are on the Bucs. Be cognizant of Jameis, Doug Martin, and ASJ as well as the 3rd WR that other people aren&#39;t picking up yet to get ahead of your friends in your league. Have a great day and good luck in your season. GO BUCS!</p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "user_reports": [],
  "over_18": false,
  "score": 20,
  "stickied": false,
  "domain": "self.fantasyfootball",
  "is_self": true,
  "hidden": false,
  "_orphaned": {},
  "_api_link": "https://api.reddit.com/r/fantasyfootball/comments/3gxz4m/rfantasyfootballs_32_in_32_tampa_bay_buccaneers/?ref=search_posts",
  "_comments_by_id": {},
  "visited": false,
  "thumbnail": "",
  "_has_fetched": true,
  "gilded": 0,
  "hide_score": false,
  "_info_url": "https://api.reddit.com/api/info/",
  "created_utc": 1439533692.0,
  "subreddit_id": "t5_2qlqq",
  "id": "3gxz4m",
  "_params": {},
  "media_embed": {},
  "name": "t3_3gxz4m",
  "quarantine": false,
  "permalink": "https://www.reddit.com/r/fantasyfootball/comments/3gxz4m/rfantasyfootballs_32_in_32_tampa_bay_buccaneers/?ref=search_posts",
  "ups": 20,
  "url": "https://www.reddit.com/r/fantasyfootball/comments/3gxz4m/rfantasyfootballs_32_in_32_tampa_bay_buccaneers/",
  "title": "r/FantasyFootball's 32 in 32: Tampa Bay Buccaneers"
}