{
  "selftext": "Updated 2/06/2009\n\nPrologue\n\nMy name is Mike Miller. This is my story of what’s been labeled the “Ice Storm of 2009.” Personally I think it’s a horrible name, I would have said “The Ice storm of January 2009.” I’m a degreed electrical engineer. I live and work in a small rural town in the bootheel of Missouri. While I personally believe the actions and responsibilities I committed to were minor, and did not involve hard physical labor, I made a difference and instilled confidence in those that needed it to make this story have a happy ending. With everything I did, I considered it my duty and service to my community to perform. I asked for nothing but the freedom to execute my actions, and when monetary rewards were mentioned I politely declined, for it was my duty to perform this civil service.\n\nMy Intro\n\nI have been working at a high tech company in a very small town in southeast Missouri for just about the past two years. The community is mostly agricultural, not to say that other businesses do not exist like the one I work for, but it certainly is not an area based on a services industry like a big city. I went to school at Purdue University where I joined Triangle Fraternity and obtained my Electrical Engineering Technology degree. I attended both the main and the Indianapolis campus, finishing my degree at the latter, but not before completing my sophomore year in the “more prestigious” school of Engineering at the main campus. Many jobs and roles were taken on during my schooling which played a part in all this. One job was at Rockwell Automation (who owns Allen-Bradley) where I maintained computer systems and made some networking connections and industry learning that helped me through this situation, primarily ladder logic.\n\nThe situation of Malden\n\nEveryone knew an ice storm was coming. No one could have predicted what would eventually happen. The town of Malden is actually fed by an outside power transmission line that carries the bulk of the load for the power grid. Apparently since this revelation there had been motions to dismiss the “old power plant” that ran it prior to this. Everyone in Malden should be thankful this never happened. The main transmission lines come from Kennett, MO and through Piggot, MO. As I write this the main lines are still down, and it is a healthy amount of time before they are expected to be functional again.\n\nThe storm begins, Day One (January 27, 2009)\n\nI grew up in Indiana, so winter weather was no big deal for me. The ice came. About half-inch to three quarters collected. Some areas had some difficulty but for the most part things weren’t bad. I had not gotten involved at this point, but from what I saw later on, this is the point where the elected officials and appointed individuals started their emergency responsibilities. It was freezing rain. It was cold enough outside to maintain the ice, but it was raining. When the rain hit the ice, it became ice. My business was officially closed at noon. I grabbed some non-perishable food, looked for a cheap vent less heater (with no luck) and returned to work that afternoon to estimate how long the systems could survive without power. We run a nation-wide encryption grid for video services that our customers depend on. The timer is somewhere between eight and sixteen hours. After eight hours they are out of contact with us, it’s anyone’s guess how long they can maintain services. Eight hours is a guarantee however. My boss and I came to the conclusion that we should cut to bare minimum and leave everything running. I agreed to rebuild things as necessary should it take a turn for the worst, that it was best to keep it running to buy me a window as long as possible. I went and rented a movie, “Lakeview terrace”, in the hopes that I would still have power and have the opportunity to watch the movie. I was wrong. Candlelight was my source of light. After forty-five minutes of the movie my laptop battery died. It was dark out by now. You couldn’t step outside without hearing the crash of the tree limbs falling under the pressure of the ice. The ice continued to come. The sound of the trees falling apart filled the night, like thieves smashing windows as they ransacked a house. The problem was that it wasn’t all trees. Some of it was the power poles crashing down under the weight of the trees fallen upon them and the already ridiculous accumulations of ice. I knew I had a responsibility in all this, but I didn’t quite yet know what it was.\n\nDay Two, January 28, 2009\n\nI woke up early, as I knew I would have to melt the ice off my car. I took a conservative shower, I still had some hot water, but for how long? At some point during the night the ice had switched over to snow, a bad sign, apparent on my way to work. My company had no power. The backup batteries were drained. The communication lines were still OK, so we placed generators to run the critical key servers and networking components. One name took all the responsibility for the eight hour cycle and I’ll give you one guess who accepted the responsibility. The plan was to come in every eight hours, start the system, cycle the keys (restarting the timer), and stop the system. After the plan was outlined, the few in the office at the time (since we clearly weren’t opening) discussed how they would spend their time. I stated that my plan was to “Go help the city.” Various remarks were made to the idea that they’d actually let me help, that I wasn’t qualified, but my mind had already been made. We all went our separate ways.\n\nOnly one place in town was serving breakfast so I went there. I wanted to help, but I had no clear path as to how to reach the people I needed. The wait for food was abnormal, and since I had nothing better to do I waited. Eventually Jarrett Bullock came in who is the chief of police in Malden. I offered my services. We knew each other on an acquaintance level. He invited me to a private city council meeting on the scenario. I thought it was public, or else why would I have been invited. He apparently knew my qualifications a bit better than that. \n\nThe meeting involved the mayor, city council members and heads of various departments (none other than Jarrett had I ever interfaced with until now.) The plan was outlined. I think I was the only civilian (READ: not holding a position) in the meeting. When the meeting broke, I made my qualifications known. I arranged with various people and went to seek supplies to last me a few days since things were clearly bad and any purchases would be rare. The top of my list was Mountain Dew, followed by a twelve pack (to help sleep of course), and various other items.\n\nAfter I was ready to fully commit, I engaged with the code officer for the city. Our primary task was to get power restored to the high school. With the power grid completely devastated and very few buildings able to be energized with the power production available, the high school was clearly a priority. As a shelter, location for food distribution and preparation, and also as a center for coordination it was clear that this had to happen. After visiting the power plant, I realized their concern was for the load. I proposed a plan which involved bringing the load to zero during the process of energizing the grid which I would execute. The operators of the power plant agreed. Eventually we would start, one breaker at a time ensuring the plant was comfortable with the load until all power was restored to what would become the primary shelter and base of operations. There was one problem. Wal-Mart was on the same circuit. Wal-Mart had to be deactivated before we could take the circuit live if my plan was to succeed. I passed the buck to the code officer and said that I would take the high school if he would take Wal-Mart. Off I went, back into the unknown with who I needed to get in contact with. I found them and we coordinated. We turned off every breaker while the code officer took care of Wal-Mart. \n\nThe board of public works indicated they were ready to make an attempt. We were ready. They flipped the switch. We activated the breakers one at a time as promised. Nothing happened. We turned off all the breakers and headed to the substation to meet with them. The daylight was dimming, time was of the essence. I was on point, and expected to know what to do even though I had never dealt with power distribution. The person from the public works made it very aware that the lines weren’t making it all the way to the substation; else it would have a different activity. Drawing from experience in my own expertise the answer was simple, check the lines. We made the call, before daylight runs out check everything along the lines. We needed the high school online. There was no telling how much demand would be placed upon shelters. As they broke to investigate the lines under the last hour of daylight, I went to the family center which I was completely unfamiliar with until this point. I ran into some friends and had a nice turkey sandwich and soup of which I was very thankful for. \n\nAt the Malden family center one thing became very clear. Typically in a small town like Malden, rumors spread rampant. Without access to viable information things were really bad. No matter what the priorities were to the council members and mayor there was no good way to quash the rumors that spread, other than to stop them one person at a time. Small southern towns have many gun owners, and multiple guns. Should the rumors get too bad and the population believe any of it, things could rapidly spiral out of control. The rumors in reference to the situation were spreading like pollen on a hot spring day to someone with allergies. I did my best to spread accurate information and began pondering how to solve this issue.\n\nBack to work on getting power to the school. They had found an airbrake in the lines which was inhibiting power. We also gathered a generator from my company which was our backup plan. The airbrake was removed from the failure equation and as I was discussing plans to hardwire the generator, the substation came online. We hit the breakers for the high school one at a time and everything went smooth. Once the high school was online we broke for the evening. It was too late to transfer people to it, let alone get the proper organization in place.\n\nI still had heat. I went home and slept. At midnight I woke up and performed my duties for my company.\n\nDay Three, January 29, 2009\n\nI woke at 7:30am and started the cycle for my company. I went to the high school to check things out; the power and heat were fine. The building was ready. I went to the morning meeting and proposed a center for organization at the high school, the superintendant agreed. The circuit activation for the high school had gone smooth enough that a plan was laid out to contact local businesses and have them follow a similar procedure so that the initial load would be minimized and then gradually increased. Among other proposals was something from the superintendent. The high school had a system for delivering text messages via cellular phone for relevant information such as footballs games, dances, etc. Without power, any landline on a cordless was useless, as was TV and radio. Cellular phones didn’t need power like those, and could be recharged in a car. It was proposed to use it to deliver updates and information. The concept was so well received by me that I spurted out in disarray regarding what would be needed to bring it online. It was then concluded to not focus attention on the details and work them out later. Not far after, my gears were spinning on the communication concepts again. I proposed a whiteboard for current and relevant information to be placed centrally where people might read it and answer their own questions regarding rumors. After the meeting I was told to execute the idea. Not much later the meeting was over.\n\nToday was mostly a relaxed day for me. I tried to be as proactive as I could, but once things were online it was time for others to step in. After some interaction I learned the high school was on a VOIP system. Not being landline, I asked about the connection with some concerns about a cable modem. Once I knew the lines were telecom, I knew they would work. The T1 lines my company uses were online and active so the communications grid was fine as long as we got the networking gear up and running. At this point I went ahead and executed the information board idea. The network administrator was on his way in. When he arrived, the network was brought online enabling internet, and VOIP services. The text message initiative was then executed delivering the information on the information board to all recipients. One point I made sure was sent across the text messaging was for local business owners to contact city hall. This was in regards to the gradual circuit turn-on for reducing load. Later I would learn that the city wanted the calls routed to the board of public works. While they might have been annoyed, I knew later on when this became apparent that the idea had worked, the local business owners were contacted effectively. As my dad would say, “If this was the worst mistake I had made, things would be just fine.”\n\nOne thing the mayor did request of me was television for the people, primarily for the super bowl. After I had worked out with the superintendent that the high school library could be used for meetings and local coordination I set upon his task to acquire some sort of broadcast reception. I knew cable would be a far cry as the cable lines were worse than the power lines. Having dish alignment experience in my industry for C-Band transmissions, I knew I only needed a southwest facing view with enough look angle to pick up a satellite ku band signal, enough coax with connectors, and a receiver. I contacted a couple local business owners with some assistance and acquired the coax and dish. An individual there was familiar with aligning them. We just needed something to bolt the dish to. Enter the school bus. Using a license plate screw as a pilot and drilling one hole below it the dish was bolted to the back of the school bus. I helped gauge the coax run. It was now time to perform the eight hour cycle for my company so I left reluctantly and delegated the responsibility to get the system aligned and running.\n\nUpon my return, the dish was up and functioning. Sound wasn’t working right, but I knew what the answer was. The TV was run through an overhead projector with connections on one side of the commons area of the high school. Rather than connect to the single channel amplified speakers overhead the connections had been made to the weak speaker in the projector. Utilizing my understanding of audio systems, I quickly resolved the issue, sending the sound through the pre-amps and amps in place creating the perfect setup (for a shelter) to deliver local broadcast video via the dish receiver. I ate dinner and called it a night after some time helping out with various activities at the shelter.\n\nI went home and slept. At midnight I woke up and performed my duties for my company.\n\nDay Four, January 30, 2009\n\nI woke at 7:30am and started the cycle for my company. Up until this point I had been primarily helping the city get shelters going such as the high school. With these online it was clear to me that my responsibilities would change. Coordinating with the head of the local board of public works I made my way to the power plant. I couldn’t distinguish at this point who was a local worker and who was imported. Being myself I just assumed everyone was there to work locally. Thing were going fine and the local guys (clearly working way more than anyone should) were handling everything. Then all at once both generators died at the exact same time. The stop light indicated a “high stator temperature.” The system basically involves an engine (like a car) buckled to a generator (alternator). The stator is in the generator part, but the gauges said the temperature was fine. My thoughts were “What happened?”, because this can’t repeat. If we had to slowly bring the generators back online (more the circuits) then it would be absolutely ridiculous. We needed consistent power to keep the city out of chaos, especially during evening hours. Enter my next task. What could I do? I could pick up a stack of stapled together schematics and plc (programmable logic controller) ladder logic and find what could have shut off the generators, both of them, at the same time. So I dug and dug. There were no justifiable indicators. The only thing I could point to was the PLC. There was a hired hand engineer who went through them with me and we both came to the same conclusion. I called my dad. A PLC pro, plus I know that while I worked for his company at the time they had done controls for Caterpillar generation systems like the ones that were running. He gave me some contact information for the various companies, and contacted some industry friends on my behalf. Meanwhile we contacted the company that designed the control system. Being that I was just thrown into the mix and the hired hand was more familiar I asked him to mediate the conversation. He was very hesitant. It wasn’t his plant, and it wasn’t his day to day operations. I sat him down and made my own directives, he had to make this call because no one here was more qualified than he was to carry it out. After a pep talk, he called them going over everything we had already gone over. Their engineers came to the same conclusion we did, the PLC burped. Since a PLC burp was not a justifiable reason to bring down the plant, the company recommended transferring the controls to “manual mode”, which takes the PLC out of the loop. Once this was explained to the local operators, it was executed within sixty seconds since it was a simple flip of a switch.\n\nThe local workers and the outsourced help continued to work hard on maintenance issues. When the time came around I elected to bring everyone dinner. The local First Presbyterian Church kitchen had been assisted in no small part by a co-worker of mine, Doug Dirks and his wife Sally. When word spread of my involvement, he sought to “fatten me up.” The local crews had also been getting dinner there. So I went and paid him a visit. I told them that I needed half a dozen plates for myself and the workers at the plant. They gave me six double portions and my choice of everything they had including desserts. They also passed along their gratitude which I relayed. Things were ok after that, relatively. I swung by the high school on my way out to check in, and went home.\n\nI went home and slept. At midnight I woke up and performed my duties for my company.\n\nDay Five, January 31, 2009\n\nI woke at 7:30am and started the cycle for my company. Today would be very different. It was Saturday. Monday I would have to work for my company fulltime again. The city could not rely upon me. Regardless, I went into the morning meeting ready to go again. The civil air patrol was ready to take aerial photography, but needed the hangar door opened. Once again, whether or not I was asked, I was there. I had a look at the power situation and the generator originally intended for the high school was delivered to the hangar. Upon evaluation a three phase generator would be required. As the steps to accomplish this were being taken care of, another task was requested. For all the devastation of the power lines a procedure needed to be outlined to get materials and qualified electricians to repair connections to the houses as the lineman were making their progress. Once the understanding and communication had taken place to ensure the hangar door was taken care of properly, I set forth on outlining the procedure for identifying work to be completed on houses, material acquisition, and compensation for these efforts. First came materials. A member of the board and I went to the local supplier. It became clear that materials may not be readily available until Monday (It was Saturday). I helped outline a procedure which utilized existing ground teams, customer contact, and active additional teams to assess needed work. I worked with individuals to ensure that the recording would qualify for FEMA aid, and be as streamlined as possible. We also considered other factors such as generators, and approval by the code inspector. At the end of the day, I finished my work there and stated it as my last day. Many more deserved a break more than I did, but I had to end my services at some point. On my way out I requested that power to my company be made a priority in reference to our nationwide commitments. I did the 4pm cycle at my company. The last thing I did was loan my electronic multi meter to the code inspector to assist in wire inspections which was required under the procedure set forth.\n\nI then took a (in my opinion) much deserved break from my volunteer work. My boss covered for me at midnight, so that I could enjoy the time off.\n\nDay Six, February 1, 2009\n\nI woke at 7:30am and started the cycle for my company. I grabbed 2 croissants from Hardees (there was a special). The line workers were working on the lines outside my house so I offered them one of them and thanked them for all their efforts. I knew what they were up against. They politely declined and promised us power that day, which I knew I couldn’t hold them to. I took the day to relax, checking in with the high school and board of public works to ensure nothing crazy happened. I handled a couple of super bowl reception issues and then did my 4pm shift. I watched some of the super bowl, and then broke for the high school. The high school was serving pizza and I went and brought some back for my neighbor who was without electricity like me. He wasn’t willing to go down there to get it for one reason or another so I brought it back for him. I watched the game after that at the Country Club until about half-time. I then met up with a co-worker and watched the rest of the game. My company now had power. I informed my boss and the upper management that we had power and was hoping to end my eight hour shifts early. No such luck. I went in and did my duty a little premature but completed it regardless.\n\nDay Seven, February 2, 2009\n\nWork began again. I shifted the company back into production mode. Contacts from my prior inquisitions came in, and I relayed them to the board of public works head. Better late than never, but the plant has apparently been running fine. Back to normal business for me.\n\nFinal Notes\n\nExempt from the record of account are many things. Names are not mentioned for protection of the individuals unless they request or their reference could not possibly incriminate them. There was a pump outage that induced a boil water order. There is no mention to the arrival of cots and bottled water which greatly alleviated the situation. There is no mention to the arrival of the National Guard, which greatly assisted the police force of Malden. There is no mention of the arrival of additional civil air patrolmen, which offered their services in more ways than one. There is no mention to the mandated curfews and other such instances of the State of Emergency declared in the area.\n\nI have also dismissed many details. Upon request I will add them in. My goal with this writing was to deliver the most accurate representation of the actions I performed that were most critical of my performance. I am more than willing to elaborate on any of it, with my only request being to expedite any such elaboration before the memories become “long-term”.\n\nI personally met many people through this event. Very good people indeed. They have garnered the utmost of my respect. I have no proper way of conveying this.\n\nFinally, everyone worked their butt off. Considering the start of all this, and how much that was accomplished, I think things were executed with exact precision. Thank everyone that you know was involved with the effort and everyone you might suspect lended a hand.",
  "gilded": 0,
  "score": 27,
  "removal_reason": null,
  "approved_by": null,
  "created_utc": 1437630325.0,
  "is_self": true,
  "stickied": false,
  "edited": false,
  "distinguished": null,
  "permalink": "https://www.reddit.com/r/TIDTRT/comments/3eaimf/tidtrt_2009_i_helped_save_a_city_during_an_ice/?ref=search_posts",
  "banned_by": null,
  "from_id": null,
  "likes": null,
  "_underscore_names": null,
  "num_reports": null,
  "link_flair_css_class": "yellow",
  "_info_url": "https://api.reddit.com/api/info/",
  "id": "3eaimf",
  "archived": false,
  "secure_media": null,
  "from_kind": null,
  "saved": false,
  "domain": "self.TIDTRT",
  "ups": 27,
  "suggested_sort": null,
  "quarantine": false,
  "over_18": false,
  "hide_score": false,
  "url": "https://www.reddit.com/r/TIDTRT/comments/3eaimf/tidtrt_2009_i_helped_save_a_city_during_an_ice/",
  "subreddit_id": "t5_37d62",
  "_params": {},
  "_comments": null,
  "_replaced_more": false,
  "_comments_by_id": {},
  "user_reports": [],
  "media_embed": {},
  "created": 1437633925.0,
  "author_flair_text": null,
  "visited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Updated 2/06/2009</p>\n\n<p>Prologue</p>\n\n<p>My name is Mike Miller. This is my story of what’s been labeled the “Ice Storm of 2009.” Personally I think it’s a horrible name, I would have said “The Ice storm of January 2009.” I’m a degreed electrical engineer. I live and work in a small rural town in the bootheel of Missouri. While I personally believe the actions and responsibilities I committed to were minor, and did not involve hard physical labor, I made a difference and instilled confidence in those that needed it to make this story have a happy ending. With everything I did, I considered it my duty and service to my community to perform. I asked for nothing but the freedom to execute my actions, and when monetary rewards were mentioned I politely declined, for it was my duty to perform this civil service.</p>\n\n<p>My Intro</p>\n\n<p>I have been working at a high tech company in a very small town in southeast Missouri for just about the past two years. The community is mostly agricultural, not to say that other businesses do not exist like the one I work for, but it certainly is not an area based on a services industry like a big city. I went to school at Purdue University where I joined Triangle Fraternity and obtained my Electrical Engineering Technology degree. I attended both the main and the Indianapolis campus, finishing my degree at the latter, but not before completing my sophomore year in the “more prestigious” school of Engineering at the main campus. Many jobs and roles were taken on during my schooling which played a part in all this. One job was at Rockwell Automation (who owns Allen-Bradley) where I maintained computer systems and made some networking connections and industry learning that helped me through this situation, primarily ladder logic.</p>\n\n<p>The situation of Malden</p>\n\n<p>Everyone knew an ice storm was coming. No one could have predicted what would eventually happen. The town of Malden is actually fed by an outside power transmission line that carries the bulk of the load for the power grid. Apparently since this revelation there had been motions to dismiss the “old power plant” that ran it prior to this. Everyone in Malden should be thankful this never happened. The main transmission lines come from Kennett, MO and through Piggot, MO. As I write this the main lines are still down, and it is a healthy amount of time before they are expected to be functional again.</p>\n\n<p>The storm begins, Day One (January 27, 2009)</p>\n\n<p>I grew up in Indiana, so winter weather was no big deal for me. The ice came. About half-inch to three quarters collected. Some areas had some difficulty but for the most part things weren’t bad. I had not gotten involved at this point, but from what I saw later on, this is the point where the elected officials and appointed individuals started their emergency responsibilities. It was freezing rain. It was cold enough outside to maintain the ice, but it was raining. When the rain hit the ice, it became ice. My business was officially closed at noon. I grabbed some non-perishable food, looked for a cheap vent less heater (with no luck) and returned to work that afternoon to estimate how long the systems could survive without power. We run a nation-wide encryption grid for video services that our customers depend on. The timer is somewhere between eight and sixteen hours. After eight hours they are out of contact with us, it’s anyone’s guess how long they can maintain services. Eight hours is a guarantee however. My boss and I came to the conclusion that we should cut to bare minimum and leave everything running. I agreed to rebuild things as necessary should it take a turn for the worst, that it was best to keep it running to buy me a window as long as possible. I went and rented a movie, “Lakeview terrace”, in the hopes that I would still have power and have the opportunity to watch the movie. I was wrong. Candlelight was my source of light. After forty-five minutes of the movie my laptop battery died. It was dark out by now. You couldn’t step outside without hearing the crash of the tree limbs falling under the pressure of the ice. The ice continued to come. The sound of the trees falling apart filled the night, like thieves smashing windows as they ransacked a house. The problem was that it wasn’t all trees. Some of it was the power poles crashing down under the weight of the trees fallen upon them and the already ridiculous accumulations of ice. I knew I had a responsibility in all this, but I didn’t quite yet know what it was.</p>\n\n<p>Day Two, January 28, 2009</p>\n\n<p>I woke up early, as I knew I would have to melt the ice off my car. I took a conservative shower, I still had some hot water, but for how long? At some point during the night the ice had switched over to snow, a bad sign, apparent on my way to work. My company had no power. The backup batteries were drained. The communication lines were still OK, so we placed generators to run the critical key servers and networking components. One name took all the responsibility for the eight hour cycle and I’ll give you one guess who accepted the responsibility. The plan was to come in every eight hours, start the system, cycle the keys (restarting the timer), and stop the system. After the plan was outlined, the few in the office at the time (since we clearly weren’t opening) discussed how they would spend their time. I stated that my plan was to “Go help the city.” Various remarks were made to the idea that they’d actually let me help, that I wasn’t qualified, but my mind had already been made. We all went our separate ways.</p>\n\n<p>Only one place in town was serving breakfast so I went there. I wanted to help, but I had no clear path as to how to reach the people I needed. The wait for food was abnormal, and since I had nothing better to do I waited. Eventually Jarrett Bullock came in who is the chief of police in Malden. I offered my services. We knew each other on an acquaintance level. He invited me to a private city council meeting on the scenario. I thought it was public, or else why would I have been invited. He apparently knew my qualifications a bit better than that. </p>\n\n<p>The meeting involved the mayor, city council members and heads of various departments (none other than Jarrett had I ever interfaced with until now.) The plan was outlined. I think I was the only civilian (READ: not holding a position) in the meeting. When the meeting broke, I made my qualifications known. I arranged with various people and went to seek supplies to last me a few days since things were clearly bad and any purchases would be rare. The top of my list was Mountain Dew, followed by a twelve pack (to help sleep of course), and various other items.</p>\n\n<p>After I was ready to fully commit, I engaged with the code officer for the city. Our primary task was to get power restored to the high school. With the power grid completely devastated and very few buildings able to be energized with the power production available, the high school was clearly a priority. As a shelter, location for food distribution and preparation, and also as a center for coordination it was clear that this had to happen. After visiting the power plant, I realized their concern was for the load. I proposed a plan which involved bringing the load to zero during the process of energizing the grid which I would execute. The operators of the power plant agreed. Eventually we would start, one breaker at a time ensuring the plant was comfortable with the load until all power was restored to what would become the primary shelter and base of operations. There was one problem. Wal-Mart was on the same circuit. Wal-Mart had to be deactivated before we could take the circuit live if my plan was to succeed. I passed the buck to the code officer and said that I would take the high school if he would take Wal-Mart. Off I went, back into the unknown with who I needed to get in contact with. I found them and we coordinated. We turned off every breaker while the code officer took care of Wal-Mart. </p>\n\n<p>The board of public works indicated they were ready to make an attempt. We were ready. They flipped the switch. We activated the breakers one at a time as promised. Nothing happened. We turned off all the breakers and headed to the substation to meet with them. The daylight was dimming, time was of the essence. I was on point, and expected to know what to do even though I had never dealt with power distribution. The person from the public works made it very aware that the lines weren’t making it all the way to the substation; else it would have a different activity. Drawing from experience in my own expertise the answer was simple, check the lines. We made the call, before daylight runs out check everything along the lines. We needed the high school online. There was no telling how much demand would be placed upon shelters. As they broke to investigate the lines under the last hour of daylight, I went to the family center which I was completely unfamiliar with until this point. I ran into some friends and had a nice turkey sandwich and soup of which I was very thankful for. </p>\n\n<p>At the Malden family center one thing became very clear. Typically in a small town like Malden, rumors spread rampant. Without access to viable information things were really bad. No matter what the priorities were to the council members and mayor there was no good way to quash the rumors that spread, other than to stop them one person at a time. Small southern towns have many gun owners, and multiple guns. Should the rumors get too bad and the population believe any of it, things could rapidly spiral out of control. The rumors in reference to the situation were spreading like pollen on a hot spring day to someone with allergies. I did my best to spread accurate information and began pondering how to solve this issue.</p>\n\n<p>Back to work on getting power to the school. They had found an airbrake in the lines which was inhibiting power. We also gathered a generator from my company which was our backup plan. The airbrake was removed from the failure equation and as I was discussing plans to hardwire the generator, the substation came online. We hit the breakers for the high school one at a time and everything went smooth. Once the high school was online we broke for the evening. It was too late to transfer people to it, let alone get the proper organization in place.</p>\n\n<p>I still had heat. I went home and slept. At midnight I woke up and performed my duties for my company.</p>\n\n<p>Day Three, January 29, 2009</p>\n\n<p>I woke at 7:30am and started the cycle for my company. I went to the high school to check things out; the power and heat were fine. The building was ready. I went to the morning meeting and proposed a center for organization at the high school, the superintendant agreed. The circuit activation for the high school had gone smooth enough that a plan was laid out to contact local businesses and have them follow a similar procedure so that the initial load would be minimized and then gradually increased. Among other proposals was something from the superintendent. The high school had a system for delivering text messages via cellular phone for relevant information such as footballs games, dances, etc. Without power, any landline on a cordless was useless, as was TV and radio. Cellular phones didn’t need power like those, and could be recharged in a car. It was proposed to use it to deliver updates and information. The concept was so well received by me that I spurted out in disarray regarding what would be needed to bring it online. It was then concluded to not focus attention on the details and work them out later. Not far after, my gears were spinning on the communication concepts again. I proposed a whiteboard for current and relevant information to be placed centrally where people might read it and answer their own questions regarding rumors. After the meeting I was told to execute the idea. Not much later the meeting was over.</p>\n\n<p>Today was mostly a relaxed day for me. I tried to be as proactive as I could, but once things were online it was time for others to step in. After some interaction I learned the high school was on a VOIP system. Not being landline, I asked about the connection with some concerns about a cable modem. Once I knew the lines were telecom, I knew they would work. The T1 lines my company uses were online and active so the communications grid was fine as long as we got the networking gear up and running. At this point I went ahead and executed the information board idea. The network administrator was on his way in. When he arrived, the network was brought online enabling internet, and VOIP services. The text message initiative was then executed delivering the information on the information board to all recipients. One point I made sure was sent across the text messaging was for local business owners to contact city hall. This was in regards to the gradual circuit turn-on for reducing load. Later I would learn that the city wanted the calls routed to the board of public works. While they might have been annoyed, I knew later on when this became apparent that the idea had worked, the local business owners were contacted effectively. As my dad would say, “If this was the worst mistake I had made, things would be just fine.”</p>\n\n<p>One thing the mayor did request of me was television for the people, primarily for the super bowl. After I had worked out with the superintendent that the high school library could be used for meetings and local coordination I set upon his task to acquire some sort of broadcast reception. I knew cable would be a far cry as the cable lines were worse than the power lines. Having dish alignment experience in my industry for C-Band transmissions, I knew I only needed a southwest facing view with enough look angle to pick up a satellite ku band signal, enough coax with connectors, and a receiver. I contacted a couple local business owners with some assistance and acquired the coax and dish. An individual there was familiar with aligning them. We just needed something to bolt the dish to. Enter the school bus. Using a license plate screw as a pilot and drilling one hole below it the dish was bolted to the back of the school bus. I helped gauge the coax run. It was now time to perform the eight hour cycle for my company so I left reluctantly and delegated the responsibility to get the system aligned and running.</p>\n\n<p>Upon my return, the dish was up and functioning. Sound wasn’t working right, but I knew what the answer was. The TV was run through an overhead projector with connections on one side of the commons area of the high school. Rather than connect to the single channel amplified speakers overhead the connections had been made to the weak speaker in the projector. Utilizing my understanding of audio systems, I quickly resolved the issue, sending the sound through the pre-amps and amps in place creating the perfect setup (for a shelter) to deliver local broadcast video via the dish receiver. I ate dinner and called it a night after some time helping out with various activities at the shelter.</p>\n\n<p>I went home and slept. At midnight I woke up and performed my duties for my company.</p>\n\n<p>Day Four, January 30, 2009</p>\n\n<p>I woke at 7:30am and started the cycle for my company. Up until this point I had been primarily helping the city get shelters going such as the high school. With these online it was clear to me that my responsibilities would change. Coordinating with the head of the local board of public works I made my way to the power plant. I couldn’t distinguish at this point who was a local worker and who was imported. Being myself I just assumed everyone was there to work locally. Thing were going fine and the local guys (clearly working way more than anyone should) were handling everything. Then all at once both generators died at the exact same time. The stop light indicated a “high stator temperature.” The system basically involves an engine (like a car) buckled to a generator (alternator). The stator is in the generator part, but the gauges said the temperature was fine. My thoughts were “What happened?”, because this can’t repeat. If we had to slowly bring the generators back online (more the circuits) then it would be absolutely ridiculous. We needed consistent power to keep the city out of chaos, especially during evening hours. Enter my next task. What could I do? I could pick up a stack of stapled together schematics and plc (programmable logic controller) ladder logic and find what could have shut off the generators, both of them, at the same time. So I dug and dug. There were no justifiable indicators. The only thing I could point to was the PLC. There was a hired hand engineer who went through them with me and we both came to the same conclusion. I called my dad. A PLC pro, plus I know that while I worked for his company at the time they had done controls for Caterpillar generation systems like the ones that were running. He gave me some contact information for the various companies, and contacted some industry friends on my behalf. Meanwhile we contacted the company that designed the control system. Being that I was just thrown into the mix and the hired hand was more familiar I asked him to mediate the conversation. He was very hesitant. It wasn’t his plant, and it wasn’t his day to day operations. I sat him down and made my own directives, he had to make this call because no one here was more qualified than he was to carry it out. After a pep talk, he called them going over everything we had already gone over. Their engineers came to the same conclusion we did, the PLC burped. Since a PLC burp was not a justifiable reason to bring down the plant, the company recommended transferring the controls to “manual mode”, which takes the PLC out of the loop. Once this was explained to the local operators, it was executed within sixty seconds since it was a simple flip of a switch.</p>\n\n<p>The local workers and the outsourced help continued to work hard on maintenance issues. When the time came around I elected to bring everyone dinner. The local First Presbyterian Church kitchen had been assisted in no small part by a co-worker of mine, Doug Dirks and his wife Sally. When word spread of my involvement, he sought to “fatten me up.” The local crews had also been getting dinner there. So I went and paid him a visit. I told them that I needed half a dozen plates for myself and the workers at the plant. They gave me six double portions and my choice of everything they had including desserts. They also passed along their gratitude which I relayed. Things were ok after that, relatively. I swung by the high school on my way out to check in, and went home.</p>\n\n<p>I went home and slept. At midnight I woke up and performed my duties for my company.</p>\n\n<p>Day Five, January 31, 2009</p>\n\n<p>I woke at 7:30am and started the cycle for my company. Today would be very different. It was Saturday. Monday I would have to work for my company fulltime again. The city could not rely upon me. Regardless, I went into the morning meeting ready to go again. The civil air patrol was ready to take aerial photography, but needed the hangar door opened. Once again, whether or not I was asked, I was there. I had a look at the power situation and the generator originally intended for the high school was delivered to the hangar. Upon evaluation a three phase generator would be required. As the steps to accomplish this were being taken care of, another task was requested. For all the devastation of the power lines a procedure needed to be outlined to get materials and qualified electricians to repair connections to the houses as the lineman were making their progress. Once the understanding and communication had taken place to ensure the hangar door was taken care of properly, I set forth on outlining the procedure for identifying work to be completed on houses, material acquisition, and compensation for these efforts. First came materials. A member of the board and I went to the local supplier. It became clear that materials may not be readily available until Monday (It was Saturday). I helped outline a procedure which utilized existing ground teams, customer contact, and active additional teams to assess needed work. I worked with individuals to ensure that the recording would qualify for FEMA aid, and be as streamlined as possible. We also considered other factors such as generators, and approval by the code inspector. At the end of the day, I finished my work there and stated it as my last day. Many more deserved a break more than I did, but I had to end my services at some point. On my way out I requested that power to my company be made a priority in reference to our nationwide commitments. I did the 4pm cycle at my company. The last thing I did was loan my electronic multi meter to the code inspector to assist in wire inspections which was required under the procedure set forth.</p>\n\n<p>I then took a (in my opinion) much deserved break from my volunteer work. My boss covered for me at midnight, so that I could enjoy the time off.</p>\n\n<p>Day Six, February 1, 2009</p>\n\n<p>I woke at 7:30am and started the cycle for my company. I grabbed 2 croissants from Hardees (there was a special). The line workers were working on the lines outside my house so I offered them one of them and thanked them for all their efforts. I knew what they were up against. They politely declined and promised us power that day, which I knew I couldn’t hold them to. I took the day to relax, checking in with the high school and board of public works to ensure nothing crazy happened. I handled a couple of super bowl reception issues and then did my 4pm shift. I watched some of the super bowl, and then broke for the high school. The high school was serving pizza and I went and brought some back for my neighbor who was without electricity like me. He wasn’t willing to go down there to get it for one reason or another so I brought it back for him. I watched the game after that at the Country Club until about half-time. I then met up with a co-worker and watched the rest of the game. My company now had power. I informed my boss and the upper management that we had power and was hoping to end my eight hour shifts early. No such luck. I went in and did my duty a little premature but completed it regardless.</p>\n\n<p>Day Seven, February 2, 2009</p>\n\n<p>Work began again. I shifted the company back into production mode. Contacts from my prior inquisitions came in, and I relayed them to the board of public works head. Better late than never, but the plant has apparently been running fine. Back to normal business for me.</p>\n\n<p>Final Notes</p>\n\n<p>Exempt from the record of account are many things. Names are not mentioned for protection of the individuals unless they request or their reference could not possibly incriminate them. There was a pump outage that induced a boil water order. There is no mention to the arrival of cots and bottled water which greatly alleviated the situation. There is no mention to the arrival of the National Guard, which greatly assisted the police force of Malden. There is no mention of the arrival of additional civil air patrolmen, which offered their services in more ways than one. There is no mention to the mandated curfews and other such instances of the State of Emergency declared in the area.</p>\n\n<p>I have also dismissed many details. Upon request I will add them in. My goal with this writing was to deliver the most accurate representation of the actions I performed that were most critical of my performance. I am more than willing to elaborate on any of it, with my only request being to expedite any such elaboration before the memories become “long-term”.</p>\n\n<p>I personally met many people through this event. Very good people indeed. They have garnered the utmost of my respect. I have no proper way of conveying this.</p>\n\n<p>Finally, everyone worked their butt off. Considering the start of all this, and how much that was accomplished, I think things were executed with exact precision. Thank everyone that you know was involved with the effort and everyone you might suspect lended a hand.</p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "_comment_sort": null,
  "report_reasons": null,
  "name": "t3_3eaimf",
  "from": null,
  "hidden": false,
  "clicked": false,
  "media": null,
  "json_dict": null,
  "_api_link": "https://api.reddit.com/r/TIDTRT/comments/3eaimf/tidtrt_2009_i_helped_save_a_city_during_an_ice/?ref=search_posts",
  "secure_media_embed": {},
  "mod_reports": [],
  "_orphaned": {},
  "_uniq": null,
  "num_comments": 8,
  "link_flair_text": "Long but amazing",
  "title": "TIDTRT - 2009 - I helped save a city during an ice storm",
  "_has_fetched": true,
  "author_flair_css_class": null,
  "thumbnail": ""
}