{
  "clicked": false,
  "_replaced_more": false,
  "archived": true,
  "num_comments": 509,
  "created": 1410445396.0,
  "saved": false,
  "selftext": "-------------------------------------------------------THE AIRPORTS\n\n19 alleged terrorists (to be referred just as terrorists from now on) were able to avoid hundreds of airport CCTVs, except 3.\nOf those 3, [one of the recordings](https://www.youtube.com/watch?v=uLEqjpHVPhM) (which will be named Dulles from now on) that was only [released in 2004](http://www.nbcnews.com/id/5485376/ns/us_news-security/t/sept-panelcriticizes-dullessecurity-screeners/) poses a serious problem:\n\nAt least until the date of the 9/11, all of the CCTVs available (including the Pentagons') only recorded at 1-5FPS and had timestamps while the Dulles was recording at +12FPS(if I am not mistaken) and has no timestamp.\n\nThe airports, which the terrorists used, have hundreds of CCTVs that cover the entrances and all of the public areas, yet only 1 camera from 2 airports ([Dulles](https://www.youtube.com/watch?v=uLEqjpHVPhM) and [Portland, Maine](https://www.youtube.com/watch?v=aNVWpjOjLe0)) were able to capture 6 of the 19 terrorists.\nThe airplane victims were also never captured by the airport CCTVs. In contrast, here is the [constant tracking via CCTV](https://www.youtube.com/watch?v=A5Ie1uLT5AA) of the navy yard shooting using all the CCTVs that captured the shooter outside and inside the building.\nSomehow the Logan airport failed to record a single victim and/or terrorist.\n\n--------------------------------------------------------THE HIJACKS\n\nEvery pilot and co-pilot is instructed with transponder squawk codes, one of them [-7500-](https://www.youtube.com/watch?v=7UZiQUNl76M&t=46) is the code for [hijacking](http://www.liveleak.com/view?i=57d_1392620694) and it takes 3s to input and send.\nDespite having 4 pilots and 4 co-pilots, not one of them sent out the 3s squawk as they were instructed to.\nThe alleged Flight11's FDR shows that [the airplane was too high](https://www.youtube.com/watch?v=DzR-q0ijbV0&t=251) to have struck the lamp posts.\nTodd Beamer, one of Flight93's passenger, described the hijack occuring as he was speaking ([at 9:43 AM](http://i.imgur.com/5Vx2cxf.jpg)) when in fact this event had already happened [~20 minutes earlier.](http://en.wikipedia.org/wiki/United_Airlines_Flight_93#Hijacking)\n\n--------------------------------------------------------**THE CRASHES**\n\n-------------------------THE PENTAGON-------------------------------\n\nOnly 2 cameras recorded an object crashing into the Pentagon, one recorded only a flash.\nThe 2 cameras that recorded the object show a [white smoke](http://i.imgur.com/EvtM7nN.jpg) coming from the object that the Flight77 could not have produced:\n\nEngine damage from lamp-posts impact: Not possible, airplane engine smoke produces a [thin and dark smoke](https://www.youtube.com/watch?v=9KhZwsYtNDE)\n\nFuel leaking from tank damage or engine damage: Not possible, it didn't catch fire when the airplane exploded, [the lawn has no jetfuel burn marks.](http://i.imgur.com/dJkv2XB.jpg)\n\nContrails: Not possible seen that the humidity levels were not enough, corroborated by the lack of those on both airplanes that crashed into the twin towers\n\nCondensation: Not possible, same reason as contrails\n\nRocket/missile-like smoke: Strongly resembles the smoke produced by [missiles/rockets](http://i.imgur.com/WXrH3vv.jpg) and **might** explain why Pentagon personnel stated that they noticed the [smell of cordite](https://www.google.com/search?q=Even+before+stepping+outside+I+could+smell+the+cordite)\n\nThese 2 cameras have all frames perfectly synchronized -including the moment of the high speed explosion- except the one where the object enters the frame. According to the cameras, the airplane existed in 2 different places in the same moment of time.\n\n-------------------------THE PENNSYLVANIA---------------------------\n\nDespite the entire airplane allegedly plunged into the ground, one of the [engines jumped to a considerable distance from the crash site.](http://i.imgur.com/CvyJNQw.png) This engine was attached to the same airplane as the other one, diving at the same speed as the other one and hitting the same ground as the other one, yet one of the engines was buried and the other landed far away for no reason.\n\nThe engine that was buried under the ground was [compressed along it's length under ~3 and half feet of dirt.](http://i.imgur.com/4IcZzuY.jpg) This engine had a [clam shell](http://i.imgur.com/r0dxyQB.jpg) of considerable proportions, but for some reason not one part of that shell is present in the previously linked photo of the engine.\n\nThere were debris found at such a distance from the impact point of the airplane that it could not have been covered from its explosion, this path of debris suggests that the airplane was actually [flying on the opposite direction](http://i.imgur.com/dmTLqpx.gif) and not the one officially told. This also fits [Val MacClatchey's testimony of the plane path.](http://i.imgur.com/TF5vSXo.png)\n\nVal MacClatchey's famous photo poses a serious problem, it displays a mushroom cloud that is [consistent with an explosion and not with a jet crash.](http://i.imgur.com/P0bEagi.jpg) When an airplane crashes it produces a long column of smoke, not just a mushroom cloud. The lack of typical airplane crash aftermath smoke has also been confirmed by [another witness.](https://www.youtube.com/watch?v=frtqTM5rUes)\n\nIn contrast with Flight 93, here is an airplane crash of a Boeing 737-200 of 17,November 2013 that [nose dived](https://www.youtube.com/watch?v=koUV3xRIraU) in [70º](http://en.wikipedia.org/wiki/Tatarstan_Airlines_Flight_363#Crash) and still had plenty of [easily identifiable airplane parts](http://www.dailymail.co.uk/news/article-2509388/Video-shows-Boeing-737-plane-crash-Russia-killing-50-people.html) and [both engines were found in the same location.](http://rt.com/news/kazan-crash-live-updates-876/)\n\nHere you can see more airplane crashes comparisons with Flight 93 and see how unique Flight 93 was. http://killtown.911review.org/flight93/crash-comparisons.html\n\n----------------------------------------------------------THE CALLS\n\nThere are 2 calls that contradict the offical version of events; the before mentioned [Todd Beamer call and Jeremy Glick's.](http://i.imgur.com/MkjKRCV.png)\n\nTodd Beamer:\n\n>Flight 93 hijack occured at [9:28](http://en.wikipedia.org/wiki/United_Airlines_Flight_93#Hijacking)\n\n>Todd Beamer's call describes the hijack about to happen at [9:43](http://intelfiles.egoplex.com/2001-09-11-FBI-FD302-lisa-jefferson.pdf)\n\n>Flight 93 crashed at [10:03](http://en.wikipedia.org/wiki/United_Airlines_Flight_93#Crash)\n\n>Todd Beamer's call made with an airphone last for [3925 seconds.](http://i.imgur.com/MkjKRCV.png) It last 45 minutes *after* the plane had already crashed.\n\n>Lisa Jefferson also confirms that the call was not lost: [\"We didn’t lose a connection because there’s a different sound that you use. It’s a squealing sound when you lose a connection. I never lost connection, but it just went silent.\"](http://www.beliefnet.com/Inspiration/2006/06/I-Promised-I-Wouldnt-Hang-Up.aspx?p=2)\n\nJeremy Glick:\n\n>Call starts at 9:37\n\n>Flight 93 crashes at 10:03\n\n>Call lasts for 7565 seconds, placing the end of the call at 11:41. It last for 1 hour and ~38 minutes *after* the plane had already crashed.\n\nThese calls were made from the airplane's airphone destined to two different interfaces: One was to the GTE's assistant landline telephone, the other was to a cellphone.\n\nThese calls could not have remained connected by a system mistake because airphones charge per time, the system was built to only count the time the client is connected in order to avoid overcharging him by allowing calls to \"stay connected\" when they were not. The fact that they also disconnected at different times rules out any possible system fault which, if possible, would at best disconnect both calls at the same time since they would have \"disconnected\" at the same time, the time of the crash.\n\nThe [ACARS data also corroborates the above,](http://pilotsfor911truth.org/ACARS-CONFIRMED-911-AIRCRAFT-AIRBORNE-LONG-AFTER-CRASH.html) seen that the only possible explanation for the calls to remain connected after the airplane crashed is that the airplane from where the calls came from never crashed in the first place.\n\n--------------------------------------------**THE TOWERS' COLLAPSES**\n\n-------------------------SOUTH TOWER--------------------------------\n\nThe section above the airplane impact zone tilted and then fell vertically, violating Newton's First Law of Motion in which a body in motion (rotation in this case) tends to stay in motion unless acted on by an outside force. In this case [this was the expected movement of the top](https://www.youtube.com/watch?v=tcQOODryBDw) if it was simply collapsing.\n\nDespite the fact that the top section tilted and was only ~30%(33floors) of the building it was still capable of destroying the remaining ~69%(76 floors) completely, directly violating Newton's third law.\n\n-------------------------NORTH TOWER--------------------------------\n\nA problem with this collapse is that despite the fact that the top section fell vertically and almost symetrically, it can be clearly identified a concentrated destruction almost as fast as the [debris fall occuring on the right face of the building.](https://www.youtube.com/watch?v=lKYW89xEYg0&t=26)\n\nSharing the exact same result as the South Tower, the North tower also violates Newton's third law by an even larger margin. The top section was only 15.45%(17 floors) destroying the intact ~~93%~~ 83% (92 floors).\n\nAccording to NIST, WTC1 fell only 28% longer than pure free-fall:\n\n>\"The upper section of the building then collapsed onto the floors below, within **12s**, the collapse of WTC 1 had left nothing but rubble.\"\n\n[NIST file NCSTAR1 section 2.9](http://www.nist.gov/el/disasterstudies/wtc/wtc_draftreports.cfm)\n\nIf it was free fall it would have been 9.32s without air resistance, meaning that *-according to NIST-* all floors provided a resistance that add up to 2.77s (12s - 9.32s).\n\nBelow the collapse area there were 95 floors.\n\n2.77s / 95 floors = each floor being destroyed in **0.029s**\n\n29/**1000ths** of a second.\n\nAccording to NIST, each floor -composed by concrete and steel- was being destroyed as fast as the impact between a stick and a cue ball.\n\nDespite the top being only ~**16%** of the building (weaker and lighter), the result was still a perfect vertical gravity assisted downfall destruction of the remaining ~~93%~~ 83% perfectly intact structure (*stronger as well*) defying yet again another law of physics -Newton's third law- in which a smaller and weaker body cannot destroy a bigger and stronger body.\n\nFor example: for every floor of the ~~93%~~ 83% destroyed another floor of the 16% has to be destroyed. If Newton's third law had been respected, the building would be standing with ~75 floors, not 0.\nA better explanation of the laws of physics violation: https://www.youtube.com/watch?v=DPwwcXF_V0c&t=2329\n\n**CONTD IN COMMENTS**\n\n\n\n\n\n",
  "mod_reports": [],
  "secure_media_embed": {},
  "edited": 1410474912.0,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>-------------------------------------------------------THE AIRPORTS</p>\n\n<p>19 alleged terrorists (to be referred just as terrorists from now on) were able to avoid hundreds of airport CCTVs, except 3.\nOf those 3, <a href=\"https://www.youtube.com/watch?v=uLEqjpHVPhM\">one of the recordings</a> (which will be named Dulles from now on) that was only <a href=\"http://www.nbcnews.com/id/5485376/ns/us_news-security/t/sept-panelcriticizes-dullessecurity-screeners/\">released in 2004</a> poses a serious problem:</p>\n\n<p>At least until the date of the 9/11, all of the CCTVs available (including the Pentagons&#39;) only recorded at 1-5FPS and had timestamps while the Dulles was recording at +12FPS(if I am not mistaken) and has no timestamp.</p>\n\n<p>The airports, which the terrorists used, have hundreds of CCTVs that cover the entrances and all of the public areas, yet only 1 camera from 2 airports (<a href=\"https://www.youtube.com/watch?v=uLEqjpHVPhM\">Dulles</a> and <a href=\"https://www.youtube.com/watch?v=aNVWpjOjLe0\">Portland, Maine</a>) were able to capture 6 of the 19 terrorists.\nThe airplane victims were also never captured by the airport CCTVs. In contrast, here is the <a href=\"https://www.youtube.com/watch?v=A5Ie1uLT5AA\">constant tracking via CCTV</a> of the navy yard shooting using all the CCTVs that captured the shooter outside and inside the building.\nSomehow the Logan airport failed to record a single victim and/or terrorist.</p>\n\n<p>--------------------------------------------------------THE HIJACKS</p>\n\n<p>Every pilot and co-pilot is instructed with transponder squawk codes, one of them <a href=\"https://www.youtube.com/watch?v=7UZiQUNl76M&amp;t=46\">-7500-</a> is the code for <a href=\"http://www.liveleak.com/view?i=57d_1392620694\">hijacking</a> and it takes 3s to input and send.\nDespite having 4 pilots and 4 co-pilots, not one of them sent out the 3s squawk as they were instructed to.\nThe alleged Flight11&#39;s FDR shows that <a href=\"https://www.youtube.com/watch?v=DzR-q0ijbV0&amp;t=251\">the airplane was too high</a> to have struck the lamp posts.\nTodd Beamer, one of Flight93&#39;s passenger, described the hijack occuring as he was speaking (<a href=\"http://i.imgur.com/5Vx2cxf.jpg\">at 9:43 AM</a>) when in fact this event had already happened <a href=\"http://en.wikipedia.org/wiki/United_Airlines_Flight_93#Hijacking\">~20 minutes earlier.</a></p>\n\n<p>--------------------------------------------------------<strong>THE CRASHES</strong></p>\n\n<p>-------------------------THE PENTAGON-------------------------------</p>\n\n<p>Only 2 cameras recorded an object crashing into the Pentagon, one recorded only a flash.\nThe 2 cameras that recorded the object show a <a href=\"http://i.imgur.com/EvtM7nN.jpg\">white smoke</a> coming from the object that the Flight77 could not have produced:</p>\n\n<p>Engine damage from lamp-posts impact: Not possible, airplane engine smoke produces a <a href=\"https://www.youtube.com/watch?v=9KhZwsYtNDE\">thin and dark smoke</a></p>\n\n<p>Fuel leaking from tank damage or engine damage: Not possible, it didn&#39;t catch fire when the airplane exploded, <a href=\"http://i.imgur.com/dJkv2XB.jpg\">the lawn has no jetfuel burn marks.</a></p>\n\n<p>Contrails: Not possible seen that the humidity levels were not enough, corroborated by the lack of those on both airplanes that crashed into the twin towers</p>\n\n<p>Condensation: Not possible, same reason as contrails</p>\n\n<p>Rocket/missile-like smoke: Strongly resembles the smoke produced by <a href=\"http://i.imgur.com/WXrH3vv.jpg\">missiles/rockets</a> and <strong>might</strong> explain why Pentagon personnel stated that they noticed the <a href=\"https://www.google.com/search?q=Even+before+stepping+outside+I+could+smell+the+cordite\">smell of cordite</a></p>\n\n<p>These 2 cameras have all frames perfectly synchronized -including the moment of the high speed explosion- except the one where the object enters the frame. According to the cameras, the airplane existed in 2 different places in the same moment of time.</p>\n\n<p>-------------------------THE PENNSYLVANIA---------------------------</p>\n\n<p>Despite the entire airplane allegedly plunged into the ground, one of the <a href=\"http://i.imgur.com/CvyJNQw.png\">engines jumped to a considerable distance from the crash site.</a> This engine was attached to the same airplane as the other one, diving at the same speed as the other one and hitting the same ground as the other one, yet one of the engines was buried and the other landed far away for no reason.</p>\n\n<p>The engine that was buried under the ground was <a href=\"http://i.imgur.com/4IcZzuY.jpg\">compressed along it&#39;s length under ~3 and half feet of dirt.</a> This engine had a <a href=\"http://i.imgur.com/r0dxyQB.jpg\">clam shell</a> of considerable proportions, but for some reason not one part of that shell is present in the previously linked photo of the engine.</p>\n\n<p>There were debris found at such a distance from the impact point of the airplane that it could not have been covered from its explosion, this path of debris suggests that the airplane was actually <a href=\"http://i.imgur.com/dmTLqpx.gif\">flying on the opposite direction</a> and not the one officially told. This also fits <a href=\"http://i.imgur.com/TF5vSXo.png\">Val MacClatchey&#39;s testimony of the plane path.</a></p>\n\n<p>Val MacClatchey&#39;s famous photo poses a serious problem, it displays a mushroom cloud that is <a href=\"http://i.imgur.com/P0bEagi.jpg\">consistent with an explosion and not with a jet crash.</a> When an airplane crashes it produces a long column of smoke, not just a mushroom cloud. The lack of typical airplane crash aftermath smoke has also been confirmed by <a href=\"https://www.youtube.com/watch?v=frtqTM5rUes\">another witness.</a></p>\n\n<p>In contrast with Flight 93, here is an airplane crash of a Boeing 737-200 of 17,November 2013 that <a href=\"https://www.youtube.com/watch?v=koUV3xRIraU\">nose dived</a> in <a href=\"http://en.wikipedia.org/wiki/Tatarstan_Airlines_Flight_363#Crash\">70º</a> and still had plenty of <a href=\"http://www.dailymail.co.uk/news/article-2509388/Video-shows-Boeing-737-plane-crash-Russia-killing-50-people.html\">easily identifiable airplane parts</a> and <a href=\"http://rt.com/news/kazan-crash-live-updates-876/\">both engines were found in the same location.</a></p>\n\n<p>Here you can see more airplane crashes comparisons with Flight 93 and see how unique Flight 93 was. <a href=\"http://killtown.911review.org/flight93/crash-comparisons.html\">http://killtown.911review.org/flight93/crash-comparisons.html</a></p>\n\n<p>----------------------------------------------------------THE CALLS</p>\n\n<p>There are 2 calls that contradict the offical version of events; the before mentioned <a href=\"http://i.imgur.com/MkjKRCV.png\">Todd Beamer call and Jeremy Glick&#39;s.</a></p>\n\n<p>Todd Beamer:</p>\n\n<blockquote>\n<p>Flight 93 hijack occured at <a href=\"http://en.wikipedia.org/wiki/United_Airlines_Flight_93#Hijacking\">9:28</a></p>\n\n<p>Todd Beamer&#39;s call describes the hijack about to happen at <a href=\"http://intelfiles.egoplex.com/2001-09-11-FBI-FD302-lisa-jefferson.pdf\">9:43</a></p>\n\n<p>Flight 93 crashed at <a href=\"http://en.wikipedia.org/wiki/United_Airlines_Flight_93#Crash\">10:03</a></p>\n\n<p>Todd Beamer&#39;s call made with an airphone last for <a href=\"http://i.imgur.com/MkjKRCV.png\">3925 seconds.</a> It last 45 minutes <em>after</em> the plane had already crashed.</p>\n\n<p>Lisa Jefferson also confirms that the call was not lost: <a href=\"http://www.beliefnet.com/Inspiration/2006/06/I-Promised-I-Wouldnt-Hang-Up.aspx?p=2\">&quot;We didn’t lose a connection because there’s a different sound that you use. It’s a squealing sound when you lose a connection. I never lost connection, but it just went silent.&quot;</a></p>\n</blockquote>\n\n<p>Jeremy Glick:</p>\n\n<blockquote>\n<p>Call starts at 9:37</p>\n\n<p>Flight 93 crashes at 10:03</p>\n\n<p>Call lasts for 7565 seconds, placing the end of the call at 11:41. It last for 1 hour and ~38 minutes <em>after</em> the plane had already crashed.</p>\n</blockquote>\n\n<p>These calls were made from the airplane&#39;s airphone destined to two different interfaces: One was to the GTE&#39;s assistant landline telephone, the other was to a cellphone.</p>\n\n<p>These calls could not have remained connected by a system mistake because airphones charge per time, the system was built to only count the time the client is connected in order to avoid overcharging him by allowing calls to &quot;stay connected&quot; when they were not. The fact that they also disconnected at different times rules out any possible system fault which, if possible, would at best disconnect both calls at the same time since they would have &quot;disconnected&quot; at the same time, the time of the crash.</p>\n\n<p>The <a href=\"http://pilotsfor911truth.org/ACARS-CONFIRMED-911-AIRCRAFT-AIRBORNE-LONG-AFTER-CRASH.html\">ACARS data also corroborates the above,</a> seen that the only possible explanation for the calls to remain connected after the airplane crashed is that the airplane from where the calls came from never crashed in the first place.</p>\n\n<p>--------------------------------------------<strong>THE TOWERS&#39; COLLAPSES</strong></p>\n\n<p>-------------------------SOUTH TOWER--------------------------------</p>\n\n<p>The section above the airplane impact zone tilted and then fell vertically, violating Newton&#39;s First Law of Motion in which a body in motion (rotation in this case) tends to stay in motion unless acted on by an outside force. In this case <a href=\"https://www.youtube.com/watch?v=tcQOODryBDw\">this was the expected movement of the top</a> if it was simply collapsing.</p>\n\n<p>Despite the fact that the top section tilted and was only ~30%(33floors) of the building it was still capable of destroying the remaining ~69%(76 floors) completely, directly violating Newton&#39;s third law.</p>\n\n<p>-------------------------NORTH TOWER--------------------------------</p>\n\n<p>A problem with this collapse is that despite the fact that the top section fell vertically and almost symetrically, it can be clearly identified a concentrated destruction almost as fast as the <a href=\"https://www.youtube.com/watch?v=lKYW89xEYg0&amp;t=26\">debris fall occuring on the right face of the building.</a></p>\n\n<p>Sharing the exact same result as the South Tower, the North tower also violates Newton&#39;s third law by an even larger margin. The top section was only 15.45%(17 floors) destroying the intact <del>93%</del> 83% (92 floors).</p>\n\n<p>According to NIST, WTC1 fell only 28% longer than pure free-fall:</p>\n\n<blockquote>\n<p>&quot;The upper section of the building then collapsed onto the floors below, within <strong>12s</strong>, the collapse of WTC 1 had left nothing but rubble.&quot;</p>\n</blockquote>\n\n<p><a href=\"http://www.nist.gov/el/disasterstudies/wtc/wtc_draftreports.cfm\">NIST file NCSTAR1 section 2.9</a></p>\n\n<p>If it was free fall it would have been 9.32s without air resistance, meaning that <em>-according to NIST-</em> all floors provided a resistance that add up to 2.77s (12s - 9.32s).</p>\n\n<p>Below the collapse area there were 95 floors.</p>\n\n<p>2.77s / 95 floors = each floor being destroyed in <strong>0.029s</strong></p>\n\n<p>29/<strong>1000ths</strong> of a second.</p>\n\n<p>According to NIST, each floor -composed by concrete and steel- was being destroyed as fast as the impact between a stick and a cue ball.</p>\n\n<p>Despite the top being only ~<strong>16%</strong> of the building (weaker and lighter), the result was still a perfect vertical gravity assisted downfall destruction of the remaining <del>93%</del> 83% perfectly intact structure (<em>stronger as well</em>) defying yet again another law of physics -Newton&#39;s third law- in which a smaller and weaker body cannot destroy a bigger and stronger body.</p>\n\n<p>For example: for every floor of the <del>93%</del> 83% destroyed another floor of the 16% has to be destroyed. If Newton&#39;s third law had been respected, the building would be standing with ~75 floors, not 0.\nA better explanation of the laws of physics violation: <a href=\"https://www.youtube.com/watch?v=DPwwcXF_V0c&amp;t=2329\">https://www.youtube.com/watch?v=DPwwcXF_V0c&amp;t=2329</a></p>\n\n<p><strong>CONTD IN COMMENTS</strong></p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "user_reports": [],
  "over_18": false,
  "score": 602,
  "stickied": false,
  "domain": "self.conspiracy",
  "is_self": true,
  "hidden": false,
  "_orphaned": {},
  "_api_link": "https://api.reddit.com/r/conspiracy/comments/2g3nfe/comprehensive_list_of_problems_and_contradictions/?ref=search_posts",
  "_comments_by_id": {},
  "visited": false,
  "thumbnail": "self",
  "_has_fetched": true,
  "gilded": 0,
  "hide_score": false,
  "_info_url": "https://api.reddit.com/api/info/",
  "created_utc": 1410445396.0,
  "subreddit_id": "t5_2qh4r",
  "id": "2g3nfe",
  "_params": {},
  "media_embed": {},
  "name": "t3_2g3nfe",
  "quarantine": false,
  "permalink": "https://www.reddit.com/r/conspiracy/comments/2g3nfe/comprehensive_list_of_problems_and_contradictions/?ref=search_posts",
  "ups": 602,
  "url": "https://www.reddit.com/r/conspiracy/comments/2g3nfe/comprehensive_list_of_problems_and_contradictions/",
  "title": "Comprehensive list of problems and contradictions with the official version of 9.11.01"
}