{
  "downs": 0,
  "mod_reports": [],
  "secure_media_embed": {},
  "_info_url": "https://api.reddit.com/api/info/",
  "gilded": 0,
  "num_comments": 151,
  "_orphaned": {},
  "hidden": false,
  "ups": 79,
  "url": "https://www.reddit.com/r/IAmA/comments/2xq048/we_are_bil_the_unconference_that_has_grown_from/",
  "_has_fetched": true,
  "quarantine": false,
  "name": "t3_2xq048",
  "user_reports": [],
  "saved": false,
  "permalink": "https://www.reddit.com/r/IAmA/comments/2xq048/we_are_bil_the_unconference_that_has_grown_from/?ref=search_posts",
  "over_18": false,
  "is_self": true,
  "_params": {},
  "thumbnail": "self",
  "created_utc": 1425337162.0,
  "_replaced_more": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello Reddit!</p>\n\n<p>My name is <em>Reichart Von Wolfsheild</em>. I&#39;m one of the original co-founders of the global BIL movement.  I&#39;m currently helping build the upcoming <a href=\"http://www.bilcollaborative.org/tickets-2015-la\">BIL event in Los Angeles March 7th and 8th</a>.\nYou can view details about the upcoming event in LA here <a href=\"http://www.bilcollaborative.org/\">http://www.bilcollaborative.org/</a> or one of the many BIL events world wide here: <a href=\"http://bilconference.com/\">http://bilconference.com/</a></p>\n\n<p>The purpose of all of this is to explain what BIL is, how it got started, and how you can participate.</p>\n\n<p>Regarding my own background, I have had my hand in many pies.  I&#39;m a technologist, inventor, artist and futurist.  For several years I hosted History Channel&#39;s &#39;Invention USA.&#39;  I built my first computer out of transistors when I was a teen.  In the early 1980s I helped pioneer music videos for the then-fledgling network MTV.  I&#39;ve developed AI applications along with many other systems for the DoD and Boeing.  Co-designed one of the the worlds first Set Top box computers.  Created Disney&#39;s Animation Studio software.  Owned a video game company that featured brands such as Die Hard, Shrek, and Who Framed Roger Rabbit.  Created the Return Fire franchise of multi-player games.  Designed toys for Mattel, and designed the first portable quad cam video-assist system for the movie industry. ... and a bunch of other crap.  :)</p>\n\n<p><em>Cody Marx Bailey</em> is involved in a lot of different things. Technology, fashion, entertainment with an underlying theme of counter-culture. He enjoys the desert, cold weather and hates bullshit.</p>\n\n<p><em>Max Lugavere</em> is American television personality, producer, filmmaker, and musician. Lugavere earned a degree in film and psychology from the University of Miami in Coral Gables, Florida. He, along with Jason Silva, produced and starred in a video documentary/performance piece entitled &quot;Textures of Selfhood&quot;—an experimental film about hedonism and spirituality, and were co-hosts on Al Gore&#39;s Current TV. He is producing a new millennial-focused documentary about Alzheimers prevention called <a href=\"https://www.kickstarter.com/projects/maxlugavere/bread-head-can-we-prevent-americas-most-feared-dis\">Bread Head</a>, who&#39;s recent Kickstarter campaign earned over double its anticipated goal.</p>\n\n<p><em>Dr. Aubrey de Grey</em> is a biomedical gerontologist based in Mountain View, California, USA Cambridge, UK, and is the Chief Science Officer of <a href=\"http://www.sens.org\">SENS Research Foundation</a>, a 501(c)(3) non-profit charity dedicated to combating the aging process. He is also Editor-in-Chief of &quot;Rejuvenation Research&quot;, the world&#39;s highest-impact peer-reviewed academic journal focused on intervention in aging. SENS Research Foundation&#39;s work encompasses the etiology of all the accumulating and eventually pathogenic molecular and cellular side-effects of metabolism (&quot;damage&quot;) that constitute mammalian aging and the design of interventions to repair and/or obviate that damage. He has developed a possibly comprehensive plan for such repair, termed Strategies for Engineered Negligible Senescence (SENS), which breaks the aging problem down into seven major classes of damage and identifies detailed approaches to addressing each one.</p>\n\n<p><em>Michael Cummings</em> is an original member of the BIL team who has been involved since the birth of BIL. He currently heads up organization of the BIL in Vancouver, Canada that happens just following TED. He also works with BILders around the world to help guide them on running BIL events in their areas. He spends his days away from BIL building websites, shooting photos, and traveling.</p>\n\n<p><em>Sabrina Williams</em> is an urban farmer who wrote an article about Blues, Marx, and Elvis cited in the publication “Community, space and online censorship: regulating pornotopia”.   She also handles fiscal sponsorship for BIL.</p>\n\n<p><em>Daniel Finfer</em> is the one-man-band <a href=\"http://www.ancientlasers.bandcamp.com\">Ancient Lasers</a>, an electro pop outfit. His full-length album &quot;You In The Future&quot; explores themes of transhumanism, futurism, the technological singularity, and other sci-fi themes, was produced by Daniel Anderson of Idiot Pilot &amp; Glowbug fame. He has DJ&#39;d many futurist events, including BIL, Ephemerisle, and most notably Elon Musk &amp; Bill Nye&#39;s Mars Curiosity party in 2012. He has also been a marketing consultant for SENS Foundation, Foresight Nanotechnology, Altervision3D, and Sotheby&#39;s International. </p>\n\n<p><a href=\"https://twitter.com/BRKVW/status/572516887948472320\">https://twitter.com/BRKVW/status/572516887948472320</a></p>\n</div><!-- SC_ON -->",
  "subreddit_id": "t5_2qzb6",
  "archived": true,
  "domain": "self.IAmA",
  "clicked": false,
  "score": 79,
  "link_flair_text": "Specialized Profession",
  "id": "2xq048",
  "stickied": false,
  "media_embed": {},
  "link_flair_css_class": "specialized",
  "visited": false,
  "selftext": "Hello Reddit!\n \nMy name is *Reichart Von Wolfsheild*. I'm one of the original co-founders of the global BIL movement.  I'm currently helping build the upcoming [BIL event in Los Angeles March 7th and 8th](http://www.bilcollaborative.org/tickets-2015-la).\nYou can view details about the upcoming event in LA here http://www.bilcollaborative.org/ or one of the many BIL events world wide here: http://bilconference.com/\n\nThe purpose of all of this is to explain what BIL is, how it got started, and how you can participate.\n \nRegarding my own background, I have had my hand in many pies.  I'm a technologist, inventor, artist and futurist.  For several years I hosted History Channel's 'Invention USA.'  I built my first computer out of transistors when I was a teen.  In the early 1980s I helped pioneer music videos for the then-fledgling network MTV.  I've developed AI applications along with many other systems for the DoD and Boeing.  Co-designed one of the the worlds first Set Top box computers.  Created Disney's Animation Studio software.  Owned a video game company that featured brands such as Die Hard, Shrek, and Who Framed Roger Rabbit.  Created the Return Fire franchise of multi-player games.  Designed toys for Mattel, and designed the first portable quad cam video-assist system for the movie industry. ... and a bunch of other crap.  :)\n\n*Cody Marx Bailey* is involved in a lot of different things. Technology, fashion, entertainment with an underlying theme of counter-culture. He enjoys the desert, cold weather and hates bullshit.\n \n*Max Lugavere* is American television personality, producer, filmmaker, and musician. Lugavere earned a degree in film and psychology from the University of Miami in Coral Gables, Florida. He, along with Jason Silva, produced and starred in a video documentary/performance piece entitled \"Textures of Selfhood\"—an experimental film about hedonism and spirituality, and were co-hosts on Al Gore's Current TV. He is producing a new millennial-focused documentary about Alzheimers prevention called [Bread Head](https://www.kickstarter.com/projects/maxlugavere/bread-head-can-we-prevent-americas-most-feared-dis), who's recent Kickstarter campaign earned over double its anticipated goal.\n\n*Dr. Aubrey de Grey* is a biomedical gerontologist based in Mountain View, California, USA Cambridge, UK, and is the Chief Science Officer of [SENS Research Foundation](http://www.sens.org), a 501(c)(3) non-profit charity dedicated to combating the aging process. He is also Editor-in-Chief of \"Rejuvenation Research\", the world's highest-impact peer-reviewed academic journal focused on intervention in aging. SENS Research Foundation's work encompasses the etiology of all the accumulating and eventually pathogenic molecular and cellular side-effects of metabolism (\"damage\") that constitute mammalian aging and the design of interventions to repair and/or obviate that damage. He has developed a possibly comprehensive plan for such repair, termed Strategies for Engineered Negligible Senescence (SENS), which breaks the aging problem down into seven major classes of damage and identifies detailed approaches to addressing each one.\n\n*Michael Cummings* is an original member of the BIL team who has been involved since the birth of BIL. He currently heads up organization of the BIL in Vancouver, Canada that happens just following TED. He also works with BILders around the world to help guide them on running BIL events in their areas. He spends his days away from BIL building websites, shooting photos, and traveling.\n\n*Sabrina Williams* is an urban farmer who wrote an article about Blues, Marx, and Elvis cited in the publication “Community, space and online censorship: regulating pornotopia”.   She also handles fiscal sponsorship for BIL.\n\n*Daniel Finfer* is the one-man-band [Ancient Lasers](http://www.ancientlasers.bandcamp.com), an electro pop outfit. His full-length album \"You In The Future\" explores themes of transhumanism, futurism, the technological singularity, and other sci-fi themes, was produced by Daniel Anderson of Idiot Pilot & Glowbug fame. He has DJ'd many futurist events, including BIL, Ephemerisle, and most notably Elon Musk & Bill Nye's Mars Curiosity party in 2012. He has also been a marketing consultant for SENS Foundation, Foresight Nanotechnology, Altervision3D, and Sotheby's International. \n\nhttps://twitter.com/BRKVW/status/572516887948472320",
  "hide_score": false,
  "_api_link": "https://api.reddit.com/r/IAmA/comments/2xq048/we_are_bil_the_unconference_that_has_grown_from/?ref=search_posts",
  "locked": false,
  "edited": 1425604870.0,
  "title": "We are BIL, the un/conference that has grown from its 'humble roots' as a plan to crash TED: Reichart Von Wolfsheild (History Channel's Invention USA) Aubrey de Grey (SENS), Max Lugavere (Filmmaker), and Sabrina Williams, Michael Cummings, Cody Marx Bailey, & Daniel Finfer (BIL)",
  "created": 1425337162.0,
  "_comments_by_id": {}
}