{
  "downs": 0,
  "mod_reports": [],
  "secure_media_embed": {},
  "_info_url": "https://api.reddit.com/api/info/",
  "gilded": 0,
  "num_comments": 91,
  "_orphaned": {},
  "hidden": false,
  "ups": 893,
  "url": "https://www.reddit.com/r/FanTheories/comments/11g1l9/boo_from_monsters_inc_is_also_violet_from_the/",
  "_has_fetched": true,
  "quarantine": false,
  "name": "t3_11g1l9",
  "user_reports": [],
  "saved": false,
  "permalink": "https://www.reddit.com/r/FanTheories/comments/11g1l9/boo_from_monsters_inc_is_also_violet_from_the/?ref=search_posts",
  "over_18": false,
  "is_self": true,
  "_params": {},
  "thumbnail": "self",
  "created_utc": 1350188666.0,
  "_replaced_more": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is something I&#39;ve been thinking about all week. Let&#39;s start off by mentioning how Pixar absolutely loves to put Easter Eggs into their movies which can be seen <a href=\"http://www.youtube.com/watch?v=I_8x3n15L7E\">here</a>, and how Boo was put into Toy Story 3 as a <a href=\"http://4.bp.blogspot.com/_9wv3mCUr7aE/TSR_tG0l8wI/AAAAAAAAAbI/hWmTRRdvwy8/s1600/BooToyStory3.jpg\">small cameo</a>.</p>\n\n<p>So why can&#39;t she be in The Incredibles?</p>\n\n<p>All right, all right, I&#39;ll go a little bit more in-depth. <a href=\"http://a69.g.akamai.net/n/69/10688/v1/img5.allocine.fr/acmedia/medias/nmedia/18/78/58/36/19468836.jpg\">Here</a> is Boo in Kindergarten, and <a href=\"http://4.bp.blogspot.com/-MU1UvrSZLfE/TagF-eKUDfI/AAAAAAAAAQc/JZ36o59jQvw/s1600/film-the_incredibles-violet-68777.jpg\">here</a> is Violet. Look a little alike? I know what you&#39;re going to say, Ozzertron you handsome devil, their hair colour is different! To which I would reply, well, so what? It&#39;s not like hair colour is something that will never change, especially on a teenager going through a moody phase, trying to seem more mysterious. Back to Boo. In the scene in the locker room in Monsters, Inc., while Sulley is playing Hide-and-Seek with her he is amazed at how good she is at hiding, why it&#39;s almost as if she&#39;s <em>disappearing and reappearing</em> in another spot altogether, and no, I don&#39;t mean teleportation, I mean invisibility or maybe even some light telekinesis. Boo being as young as she is, wouldn&#39;t understand completely how her powers work and would only be able to use them when she is happy and relaxed, which explains why she doesn&#39;t use them when she is afraid of Sulley&#39;s child-scaring demonstration or around <a href=\"http://4.bp.blogspot.com/-kdCPMDhBT6E/T5sdOv_bBhI/AAAAAAAAAxw/U1VTPwIF9Ho/s1600/Randal.jpg\">Randall</a> and his &quot;Scream Extractor&quot;. Forgive me if I&#39;m wrong, but didn&#39;t Violet have a similar problem where she was unable to perform under heavy pressure or have little faith in her ability, possibly stemming from some traumatic early childhood experience where they didn&#39;t help her out in a bad situation? I&#39;m not too sure on that one, I haven&#39;t seen The Incredibles in a while.</p>\n\n<p>Early on in Monsters, Inc. it is established how each professional scarer is assigned to children that suit them the best, which would work out well because with Randall&#39;s camouflage or &quot;invisibility&quot;, would be ideal with a toddler coming to terms having superpowers. Randall would be the representation of what Boo doesn&#39;t understand about herself or possibly what she may become, which fits in with her being only able to use them when she is happiest or the most sure of herself. At the end of Monsters, Inc. Boo is no longer afraid of Randall which in turn allows her powers to flourish. </p>\n\n<p>In the locker scene, it would of been easy for her to turn invisible or to simply float over the stall&#39;s walls. But what about her clothes you say? Well in The Incredibles Violet turns her head invisible to peek around corners or over a set of stairs and isn&#39;t it possible that Boo would do the same thing? Or, possibly her over-protective father could have his <a href=\"http://www.virginmedia.com/images/pixar-incrediblesedna-300x400.jpg\">Superhero fashion designer friend</a> make her some all-purpose toddler invisibility clothes so she could be better protected in case she ever needed them. Mr. Incredible would have known about her powers from a very early age, proven by Mrs. Incredible saying how Jack-Jack doesn&#39;t have any powers. On the subject of Mr. Incredible, didn&#39;t you ever wonder why Boo identified so quickly with Sulley? I mean, it&#39;s not like his large, hulking frame could of reminded her of anyone, right? I also noticed that Boo had a complete lack of fear of heights when she was happy and with Sulley, almost as if she had a way of catching herself with her telekinetic powers so that she didn&#39;t hurt herself.</p>\n\n<p>tl;dr Boo from Monsters, Inc. is Violet from The Incredibles because of reasons.</p>\n\n<p>[EDIT] I accidentally&#39;d a word.</p>\n</div><!-- SC_ON -->",
  "subreddit_id": "t5_2u6rc",
  "archived": true,
  "domain": "self.FanTheories",
  "clicked": false,
  "score": 893,
  "id": "11g1l9",
  "stickied": false,
  "media_embed": {},
  "visited": false,
  "selftext": "This is something I've been thinking about all week. Let's start off by mentioning how Pixar absolutely loves to put Easter Eggs into their movies which can be seen [here](http://www.youtube.com/watch?v=I_8x3n15L7E), and how Boo was put into Toy Story 3 as a [small cameo](http://4.bp.blogspot.com/_9wv3mCUr7aE/TSR_tG0l8wI/AAAAAAAAAbI/hWmTRRdvwy8/s1600/BooToyStory3.jpg).\n\nSo why can't she be in The Incredibles?\n\nAll right, all right, I'll go a little bit more in-depth. [Here](http://a69.g.akamai.net/n/69/10688/v1/img5.allocine.fr/acmedia/medias/nmedia/18/78/58/36/19468836.jpg) is Boo in Kindergarten, and [here](http://4.bp.blogspot.com/-MU1UvrSZLfE/TagF-eKUDfI/AAAAAAAAAQc/JZ36o59jQvw/s1600/film-the_incredibles-violet-68777.jpg) is Violet. Look a little alike? I know what you're going to say, Ozzertron you handsome devil, their hair colour is different! To which I would reply, well, so what? It's not like hair colour is something that will never change, especially on a teenager going through a moody phase, trying to seem more mysterious. Back to Boo. In the scene in the locker room in Monsters, Inc., while Sulley is playing Hide-and-Seek with her he is amazed at how good she is at hiding, why it's almost as if she's *disappearing and reappearing* in another spot altogether, and no, I don't mean teleportation, I mean invisibility or maybe even some light telekinesis. Boo being as young as she is, wouldn't understand completely how her powers work and would only be able to use them when she is happy and relaxed, which explains why she doesn't use them when she is afraid of Sulley's child-scaring demonstration or around [Randall](http://4.bp.blogspot.com/-kdCPMDhBT6E/T5sdOv_bBhI/AAAAAAAAAxw/U1VTPwIF9Ho/s1600/Randal.jpg) and his \"Scream Extractor\". Forgive me if I'm wrong, but didn't Violet have a similar problem where she was unable to perform under heavy pressure or have little faith in her ability, possibly stemming from some traumatic early childhood experience where they didn't help her out in a bad situation? I'm not too sure on that one, I haven't seen The Incredibles in a while.\n\n Early on in Monsters, Inc. it is established how each professional scarer is assigned to children that suit them the best, which would work out well because with Randall's camouflage or \"invisibility\", would be ideal with a toddler coming to terms having superpowers. Randall would be the representation of what Boo doesn't understand about herself or possibly what she may become, which fits in with her being only able to use them when she is happiest or the most sure of herself. At the end of Monsters, Inc. Boo is no longer afraid of Randall which in turn allows her powers to flourish. \n\nIn the locker scene, it would of been easy for her to turn invisible or to simply float over the stall's walls. But what about her clothes you say? Well in The Incredibles Violet turns her head invisible to peek around corners or over a set of stairs and isn't it possible that Boo would do the same thing? Or, possibly her over-protective father could have his [Superhero fashion designer friend](http://www.virginmedia.com/images/pixar-incrediblesedna-300x400.jpg) make her some all-purpose toddler invisibility clothes so she could be better protected in case she ever needed them. Mr. Incredible would have known about her powers from a very early age, proven by Mrs. Incredible saying how Jack-Jack doesn't have any powers. On the subject of Mr. Incredible, didn't you ever wonder why Boo identified so quickly with Sulley? I mean, it's not like his large, hulking frame could of reminded her of anyone, right? I also noticed that Boo had a complete lack of fear of heights when she was happy and with Sulley, almost as if she had a way of catching herself with her telekinetic powers so that she didn't hurt herself.\n\ntl;dr Boo from Monsters, Inc. is Violet from The Incredibles because of reasons.\n\n[EDIT] I accidentally'd a word.",
  "hide_score": false,
  "_api_link": "https://api.reddit.com/r/FanTheories/comments/11g1l9/boo_from_monsters_inc_is_also_violet_from_the/?ref=search_posts",
  "locked": false,
  "edited": 1350191022.0,
  "title": "Boo from Monsters, Inc. is also Violet from The Incredibles [Spoilers]",
  "created": 1350188666.0,
  "_comments_by_id": {}
}