{
  "clicked": false,
  "_replaced_more": false,
  "archived": true,
  "num_comments": 121,
  "created": 1428493768.0,
  "saved": false,
  "selftext": "First, before I get jumped on and downvoted to oblivion, I want to reiterate that this post is about Cyanogen Inc and. It isn't about Cyanogen OS and/or CyanogenMod. Second, this isn't a hate post saying 'Steve Kondik suxxxx', so hear me out before you dismiss this as one of those.\n\nFor those who don't know what the difference is, CyanogenMod is the open community-built fork of stock android. It was founded by Steve Kondik. Kondik later on went to form Cyanogen Inc., and it is Cyanogen Inc that builds Cyanogen OS, a custom version of Cyanogen Mod that comes preloaded on partner devices, including the Oneplus One. If you are still confused read this very informative Wikipedia article: http://en.wikipedia.org/wiki/CyanogenMod\n\nCyanogen OS is basically stock android with a lot of useful customisations and features like Privacy Guard, Theme Manager, etc. I have been using CM since version 9. I love everything about it, and truly feel it makes android even better in every way. \n\nWhen I purchase my Oneplus One, one of the *primary reasons* I did it was because it had Cyanogen OS installed. Yes, specifically Cyanogen **OS**. That's because I thought '*This is CM with a company behind it. This means great support and accountability. People will get getting paid to work on it. It can only get better from here*'. Don't get me wrong, I absolutely love the hard work the community has put into making CM. It's just that there was structure to it now (in a sense). On receiving my OPO, I realised there were a few issues with the device. I had touchscreen issues, some software bugs. That's alright. This is a v1 device that two new startups have created, it can't be perfect on day 1. One thing I did expect though, was fast updates. Not day 1 like my Nexus 5, but is 2-3 months really unreasonable to ask?\n\nIt has taken FAR too long for them to put out CM12S (from a for-profit company, mind you). And I'm really disappointed. This is why (please correct me if I'm wrong):\n\n1. Cyanogen OS is built on STOCK android and leaves it as stock as possible. There is no massive re-design involved (yeah, touchwiz). They already have a great feature set, and basically had to port all these features to work on Lollipop (with a LOT of help from the community, ofcourse). \n\n2. Cyanogen Inc are a COMPANY that focusses ONLY on creating Cyanogen OS. One forked version near-stock version of android. Nothing else. No hardware, etc. This OS is (apart from drivers) exactly the same on all partner devices.\n\n3. They have a great, thriving community that is directly or indirectly helping them build their OS. \n\n4. Current partner devices are about a maximum of 5. The Cyanogen Inc websites lists 3 right now, so I don't know if the other's (Like OPPO N1) are even supported.\n\n5. They are generating awesome interest and getting massive funding from venture capitals. So they definitely wouldn't have a shortage of resources.\n\n6. Their hero product is *one* operating system. Wait, this isn't just their hero product, it's their *only* product.\n\n7. They broke their partnership with **Oneplus**. Oneplus then doubled up, thought of what to do, planned it out, hired a f'ing team, announced and branded their OS, and put out V1 of OxygenOS it BEFORE Cyanogen Inc put out Cyanogen 12S. Granted OxygenOS is lot more basic, but look at the stuff Oneplus had to do. C-Inc was very much established, had a much bigger headstart, a bigger team, far more expertise. \n\nDon't tell me they are a startup. Cyanogen OS is the one and thing they do, man! \n\nDon't tell me 'Don't ask for ETAs'. I won't ask for ETAs from CyanogenMod, it's a community. C-Inc. is doing this full time, for-profit. This is what I felt was an advantage of CM11S over CM11. So I will very well expect and ask for a ETA, and expect them to stick to it.\n\nDon't tell me xyz certification. That cannot be the reason for an OS to be delayed for *weeks or months*.\n\nDon't tell me to 'calm the f down'. I have waited and waited for an incorporated company to deliver on failed promises. Not justified? Really?\n\nEveryone seems to have been distracted by OxygenOS for the moment, and C-Inc. has definitely got a breather thanks to Oneplus.\n\nSorry for the long post. Thanks for reading. No offence meant to anyone. Just voicing my opinion here.\n\nTL;DR: Bought a OPO, loved the thought of the OPO-C Inc partnership, had great expectations for Cyanogen Inc. Can't believe the hardware partner (OP) was able to recover from a broken contract shock and build an OS of their own before Cyanogen Inc. could. Really disappointed with the delays, broken promises and angry PR :(\n",
  "mod_reports": [],
  "secure_media_embed": {},
  "author_flair_css_class": "two-black",
  "edited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First, before I get jumped on and downvoted to oblivion, I want to reiterate that this post is about Cyanogen Inc and. It isn&#39;t about Cyanogen OS and/or CyanogenMod. Second, this isn&#39;t a hate post saying &#39;Steve Kondik suxxxx&#39;, so hear me out before you dismiss this as one of those.</p>\n\n<p>For those who don&#39;t know what the difference is, CyanogenMod is the open community-built fork of stock android. It was founded by Steve Kondik. Kondik later on went to form Cyanogen Inc., and it is Cyanogen Inc that builds Cyanogen OS, a custom version of Cyanogen Mod that comes preloaded on partner devices, including the Oneplus One. If you are still confused read this very informative Wikipedia article: <a href=\"http://en.wikipedia.org/wiki/CyanogenMod\">http://en.wikipedia.org/wiki/CyanogenMod</a></p>\n\n<p>Cyanogen OS is basically stock android with a lot of useful customisations and features like Privacy Guard, Theme Manager, etc. I have been using CM since version 9. I love everything about it, and truly feel it makes android even better in every way. </p>\n\n<p>When I purchase my Oneplus One, one of the <em>primary reasons</em> I did it was because it had Cyanogen OS installed. Yes, specifically Cyanogen <strong>OS</strong>. That&#39;s because I thought &#39;<em>This is CM with a company behind it. This means great support and accountability. People will get getting paid to work on it. It can only get better from here</em>&#39;. Don&#39;t get me wrong, I absolutely love the hard work the community has put into making CM. It&#39;s just that there was structure to it now (in a sense). On receiving my OPO, I realised there were a few issues with the device. I had touchscreen issues, some software bugs. That&#39;s alright. This is a v1 device that two new startups have created, it can&#39;t be perfect on day 1. One thing I did expect though, was fast updates. Not day 1 like my Nexus 5, but is 2-3 months really unreasonable to ask?</p>\n\n<p>It has taken FAR too long for them to put out CM12S (from a for-profit company, mind you). And I&#39;m really disappointed. This is why (please correct me if I&#39;m wrong):</p>\n\n<ol>\n<li><p>Cyanogen OS is built on STOCK android and leaves it as stock as possible. There is no massive re-design involved (yeah, touchwiz). They already have a great feature set, and basically had to port all these features to work on Lollipop (with a LOT of help from the community, ofcourse). </p></li>\n<li><p>Cyanogen Inc are a COMPANY that focusses ONLY on creating Cyanogen OS. One forked version near-stock version of android. Nothing else. No hardware, etc. This OS is (apart from drivers) exactly the same on all partner devices.</p></li>\n<li><p>They have a great, thriving community that is directly or indirectly helping them build their OS. </p></li>\n<li><p>Current partner devices are about a maximum of 5. The Cyanogen Inc websites lists 3 right now, so I don&#39;t know if the other&#39;s (Like OPPO N1) are even supported.</p></li>\n<li><p>They are generating awesome interest and getting massive funding from venture capitals. So they definitely wouldn&#39;t have a shortage of resources.</p></li>\n<li><p>Their hero product is <em>one</em> operating system. Wait, this isn&#39;t just their hero product, it&#39;s their <em>only</em> product.</p></li>\n<li><p>They broke their partnership with <strong>Oneplus</strong>. Oneplus then doubled up, thought of what to do, planned it out, hired a f&#39;ing team, announced and branded their OS, and put out V1 of OxygenOS it BEFORE Cyanogen Inc put out Cyanogen 12S. Granted OxygenOS is lot more basic, but look at the stuff Oneplus had to do. C-Inc was very much established, had a much bigger headstart, a bigger team, far more expertise. </p></li>\n</ol>\n\n<p>Don&#39;t tell me they are a startup. Cyanogen OS is the one and thing they do, man! </p>\n\n<p>Don&#39;t tell me &#39;Don&#39;t ask for ETAs&#39;. I won&#39;t ask for ETAs from CyanogenMod, it&#39;s a community. C-Inc. is doing this full time, for-profit. This is what I felt was an advantage of CM11S over CM11. So I will very well expect and ask for a ETA, and expect them to stick to it.</p>\n\n<p>Don&#39;t tell me xyz certification. That cannot be the reason for an OS to be delayed for <em>weeks or months</em>.</p>\n\n<p>Don&#39;t tell me to &#39;calm the f down&#39;. I have waited and waited for an incorporated company to deliver on failed promises. Not justified? Really?</p>\n\n<p>Everyone seems to have been distracted by OxygenOS for the moment, and C-Inc. has definitely got a breather thanks to Oneplus.</p>\n\n<p>Sorry for the long post. Thanks for reading. No offence meant to anyone. Just voicing my opinion here.</p>\n\n<p>TL;DR: Bought a OPO, loved the thought of the OPO-C Inc partnership, had great expectations for Cyanogen Inc. Can&#39;t believe the hardware partner (OP) was able to recover from a broken contract shock and build an OS of their own before Cyanogen Inc. could. Really disappointed with the delays, broken promises and angry PR :(</p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "user_reports": [],
  "author_flair_text": "OnePlus Two",
  "over_18": false,
  "score": 300,
  "stickied": false,
  "domain": "self.oneplus",
  "is_self": true,
  "hidden": false,
  "_orphaned": {},
  "_api_link": "https://api.reddit.com/r/oneplus/comments/31uyrn/discussion_anyone_else_really_disappointed_with/?ref=search_posts",
  "_comments_by_id": {},
  "visited": false,
  "thumbnail": "self",
  "_has_fetched": true,
  "gilded": 0,
  "hide_score": false,
  "_info_url": "https://api.reddit.com/api/info/",
  "created_utc": 1428493768.0,
  "subreddit_id": "t5_30qnb",
  "id": "31uyrn",
  "_params": {},
  "media_embed": {},
  "name": "t3_31uyrn",
  "quarantine": false,
  "permalink": "https://www.reddit.com/r/oneplus/comments/31uyrn/discussion_anyone_else_really_disappointed_with/?ref=search_posts",
  "ups": 300,
  "url": "https://www.reddit.com/r/oneplus/comments/31uyrn/discussion_anyone_else_really_disappointed_with/",
  "title": "[DISCUSSION] Anyone else really disappointed with Cyanogen Inc.?"
}