{
  "selftext": "Reddit Inc. has obviously not been as gung-ho about stopping CISPA as it was about SOPA. No big deal. We understand that you are a corporation, and you have your own interests. However, I strongly suggest that Reddit Inc. takes a serious stance against CISPA. If there isn't a movement by the corporation, then it will be done by the people. Two ideas.\n\n1. I propose removing Reddit from our AdBlock exceptions list on May 1^st. This will continue until Reddit Inc. decides to join us in opposing Cispa.\n\n2. Also beginning on May 1, there will be a boycott of purchasing Reddit Gold. Thanks for the ideas, guys!\n\n3. A week long boycott going through May 14 until May 21. Seven days of redditors not using Reddit.\n\nIf they join us on or before May 14^th we will not need to do the boycott. If they join *any time* after May 14, then the boycott needs to continue as planned. It will not be very convincing if we just wuss out three days into a demonstration.\n\nSo, what do you think? Do you like the idea? Will you actually do it?\n\nEdit: Changed the date to May 14 so that /r/FIA will not endangered by the blackout. My bad.\n\nEdit 2: [Here](http://www.reddit.com/r/ideasfortheadmins/comments/swu9t/looking_for_admin_support_against_cispa_in_the/) is a link to a thread for the admins. Give it some publicity, and hopefully we will hear from Reddit personally.\n\nEdit 3: Along with AdBlocking, we should do a Reddit Gold boycott. No one purchases gold memberships until we see action. Any positive reinforcement on this, and I'll add it to the list. **Implemented**\n\nEdit 4: [Here](http://www.reddit.com/r/evolutionReddit/comments/swgyt/cybersecurity_round_two_reddit_hivemind_vs_us/) is a link to some other great web activism. We don't have to stop at CISPA.\n\nEdit 5: Okay, a lot of people are leaving messages about how we need to hit the politicians. I couldn't agree more, but I also accept the fact that this is less likely. If we could get some people to send letters, and make phone calls to their representatives it would be much more effective at mitigating future bills that negatively affect us. Can someone write up an example/template so that we can send these letters en masse?\n\nEdit 6: [Awesome Infographic](http://i.imgur.com/ga3Pb.jpg) that gives some explanation of CISPA vs. SOPA.\n\nEdit 7: Making requests for the FBI to send you all the information they have on you? Might be a good heads up to see some of the types of information that entities will be able to share with each other. A few thousand requests should be a pretty clear heads-up. [Link](http://getmyfbifile.com/) to info about getting your FBI file. (Better idea? Let me know!)\n\n**Serious** Edit: Alright, so there are a lot of people who will (not surprisingly) refuse to leave reddit for a week. Since this seems to be so intolerable, I've gotten an interesting suggestion.  For the days that we have our protest/boycott people should make accounts with something such as: ANTICISPA_PROTEST_xxx (where the x's are for a random number, so you can all make these accounts)\n\nNo use of your normal username, just the protesting one. This will keep Reddit informed about our dissatisfaction with their stance on CISPA, and also allow people to take a bigger advantage of our tier-style boycott (No use for the serious boycott, only ANTICISPA accounts for the people who still want to make an impact). Can I get some feedback?\n\nAn honest thank you to POTATO_IN_MY_ANUS for this **seriously** brilliant suggestion =)\n\n**To the administrators** I am making a request for *two* things:\n\n1. If the admins 'absolutely cannot, under any circumstance' blackout the site then have them write an incredibly detailed blog post, much like they did about PIPA/SOPA, so that users can be informed, motivated, and encouraged to take action on their own. Using the blog post to effectively spread the word across the entire site will show the users just how much of an impact CISPA has on all American internet users.\n\n2. Have the admins explicitly state that while CISPA does not really affect reddit INC all that much, it does dramatically eliminate many safeguards for user privacy and expectations of anonymity. Have them explain that while they cannot black out the site that they are using their voice, as best they can, to explain to users that they need to advocate for themselves and how they can do it.\n\nThank you to SwampySoccerField for this great idea in communicating with the admins.\n\nI am not trying to make this an anti-Reddit campaign. You allow us to communicate very effectively, and we thoroughly enjoy using your site. I know that we can come to an agreement. But, **please**, show us that you are listening. Show us that you are trying to do *something* that can benefit (hopefully with some good, politically motivated action) everyone.\n\n**SUNDAY EDIT:** Again, thank you so much. You guys have been awesome. [Link](http://www.reddit.com/r/announcements/comments/sxdxv/a_quick_note_on_cispa_and_related_bills/c4hs04e) to the administrator's response. Thank you for responding to us and starting to really help us out here. Let's not think that this thing is over, it is only the beginning. [Here](http://www.reddit.com/r/politics/comments/syif5/redditors_its_time_to_take_action_four_bills_are/) is a link to the start of our movement.\n\n**Monday Edit:** No response from Reddit Inc. AdBlock is on. I hope to hear from some of you that you've started to protest alongside me. Still looking for a better solution, but haven't been getting a lot of response. I was thinking that we could push the idea of using throwaway accounts with ANTICISPA in the name closer to May 7. Maybe if Reddit sees some outcry, they'll actually want to take a stance before we abandon the site for a week. Keep up the good fight.\n\n**Final Edit:** Sorry about the delay. I've had a lot of things going on, so I wasn't able to log in late last night. This will be my last post/comment/anything on Reddit until the 21st. I hope all of you were serious when you said you'd join me. For those of you who simply can *not* resist Reddit, I ask that you kindly stop using your normal account. Make one called CISPA_PROTEST_2220222 and post/comment/vote with that. You guys have been great. I'll see you all in a week.",
  "gilded": 0,
  "score": 3053,
  "removal_reason": null,
  "approved_by": null,
  "created_utc": 1335626581.0,
  "is_self": true,
  "stickied": false,
  "edited": true,
  "distinguished": null,
  "permalink": "https://www.reddit.com/r/politics/comments/swseu/lets_get_reddit_inc_interested_in_opposing_cispa/?ref=search_posts",
  "banned_by": null,
  "from_id": null,
  "likes": null,
  "_underscore_names": null,
  "num_reports": null,
  "link_flair_css_class": null,
  "_info_url": "https://api.reddit.com/api/info/",
  "id": "swseu",
  "archived": true,
  "secure_media": null,
  "from_kind": null,
  "saved": false,
  "domain": "self.politics",
  "ups": 3053,
  "suggested_sort": null,
  "quarantine": false,
  "over_18": false,
  "hide_score": false,
  "url": "https://www.reddit.com/r/politics/comments/swseu/lets_get_reddit_inc_interested_in_opposing_cispa/",
  "subreddit_id": "t5_2cneq",
  "_params": {},
  "_comments": null,
  "_replaced_more": false,
  "_comments_by_id": {},
  "user_reports": [],
  "media_embed": {},
  "created": 1335626581.0,
  "author_flair_text": null,
  "visited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Reddit Inc. has obviously not been as gung-ho about stopping CISPA as it was about SOPA. No big deal. We understand that you are a corporation, and you have your own interests. However, I strongly suggest that Reddit Inc. takes a serious stance against CISPA. If there isn&#39;t a movement by the corporation, then it will be done by the people. Two ideas.</p>\n\n<ol>\n<li><p>I propose removing Reddit from our AdBlock exceptions list on May 1<sup>st.</sup> This will continue until Reddit Inc. decides to join us in opposing Cispa.</p></li>\n<li><p>Also beginning on May 1, there will be a boycott of purchasing Reddit Gold. Thanks for the ideas, guys!</p></li>\n<li><p>A week long boycott going through May 14 until May 21. Seven days of redditors not using Reddit.</p></li>\n</ol>\n\n<p>If they join us on or before May 14<sup>th</sup> we will not need to do the boycott. If they join <em>any time</em> after May 14, then the boycott needs to continue as planned. It will not be very convincing if we just wuss out three days into a demonstration.</p>\n\n<p>So, what do you think? Do you like the idea? Will you actually do it?</p>\n\n<p>Edit: Changed the date to May 14 so that <a href=\"/r/FIA\">/r/FIA</a> will not endangered by the blackout. My bad.</p>\n\n<p>Edit 2: <a href=\"http://www.reddit.com/r/ideasfortheadmins/comments/swu9t/looking_for_admin_support_against_cispa_in_the/\">Here</a> is a link to a thread for the admins. Give it some publicity, and hopefully we will hear from Reddit personally.</p>\n\n<p>Edit 3: Along with AdBlocking, we should do a Reddit Gold boycott. No one purchases gold memberships until we see action. Any positive reinforcement on this, and I&#39;ll add it to the list. <strong>Implemented</strong></p>\n\n<p>Edit 4: <a href=\"http://www.reddit.com/r/evolutionReddit/comments/swgyt/cybersecurity_round_two_reddit_hivemind_vs_us/\">Here</a> is a link to some other great web activism. We don&#39;t have to stop at CISPA.</p>\n\n<p>Edit 5: Okay, a lot of people are leaving messages about how we need to hit the politicians. I couldn&#39;t agree more, but I also accept the fact that this is less likely. If we could get some people to send letters, and make phone calls to their representatives it would be much more effective at mitigating future bills that negatively affect us. Can someone write up an example/template so that we can send these letters en masse?</p>\n\n<p>Edit 6: <a href=\"http://i.imgur.com/ga3Pb.jpg\">Awesome Infographic</a> that gives some explanation of CISPA vs. SOPA.</p>\n\n<p>Edit 7: Making requests for the FBI to send you all the information they have on you? Might be a good heads up to see some of the types of information that entities will be able to share with each other. A few thousand requests should be a pretty clear heads-up. <a href=\"http://getmyfbifile.com/\">Link</a> to info about getting your FBI file. (Better idea? Let me know!)</p>\n\n<p><strong>Serious</strong> Edit: Alright, so there are a lot of people who will (not surprisingly) refuse to leave reddit for a week. Since this seems to be so intolerable, I&#39;ve gotten an interesting suggestion.  For the days that we have our protest/boycott people should make accounts with something such as: ANTICISPA_PROTEST_xxx (where the x&#39;s are for a random number, so you can all make these accounts)</p>\n\n<p>No use of your normal username, just the protesting one. This will keep Reddit informed about our dissatisfaction with their stance on CISPA, and also allow people to take a bigger advantage of our tier-style boycott (No use for the serious boycott, only ANTICISPA accounts for the people who still want to make an impact). Can I get some feedback?</p>\n\n<p>An honest thank you to POTATO_IN_MY_ANUS for this <strong>seriously</strong> brilliant suggestion =)</p>\n\n<p><strong>To the administrators</strong> I am making a request for <em>two</em> things:</p>\n\n<ol>\n<li><p>If the admins &#39;absolutely cannot, under any circumstance&#39; blackout the site then have them write an incredibly detailed blog post, much like they did about PIPA/SOPA, so that users can be informed, motivated, and encouraged to take action on their own. Using the blog post to effectively spread the word across the entire site will show the users just how much of an impact CISPA has on all American internet users.</p></li>\n<li><p>Have the admins explicitly state that while CISPA does not really affect reddit INC all that much, it does dramatically eliminate many safeguards for user privacy and expectations of anonymity. Have them explain that while they cannot black out the site that they are using their voice, as best they can, to explain to users that they need to advocate for themselves and how they can do it.</p></li>\n</ol>\n\n<p>Thank you to SwampySoccerField for this great idea in communicating with the admins.</p>\n\n<p>I am not trying to make this an anti-Reddit campaign. You allow us to communicate very effectively, and we thoroughly enjoy using your site. I know that we can come to an agreement. But, <strong>please</strong>, show us that you are listening. Show us that you are trying to do <em>something</em> that can benefit (hopefully with some good, politically motivated action) everyone.</p>\n\n<p><strong>SUNDAY EDIT:</strong> Again, thank you so much. You guys have been awesome. <a href=\"http://www.reddit.com/r/announcements/comments/sxdxv/a_quick_note_on_cispa_and_related_bills/c4hs04e\">Link</a> to the administrator&#39;s response. Thank you for responding to us and starting to really help us out here. Let&#39;s not think that this thing is over, it is only the beginning. <a href=\"http://www.reddit.com/r/politics/comments/syif5/redditors_its_time_to_take_action_four_bills_are/\">Here</a> is a link to the start of our movement.</p>\n\n<p><strong>Monday Edit:</strong> No response from Reddit Inc. AdBlock is on. I hope to hear from some of you that you&#39;ve started to protest alongside me. Still looking for a better solution, but haven&#39;t been getting a lot of response. I was thinking that we could push the idea of using throwaway accounts with ANTICISPA in the name closer to May 7. Maybe if Reddit sees some outcry, they&#39;ll actually want to take a stance before we abandon the site for a week. Keep up the good fight.</p>\n\n<p><strong>Final Edit:</strong> Sorry about the delay. I&#39;ve had a lot of things going on, so I wasn&#39;t able to log in late last night. This will be my last post/comment/anything on Reddit until the 21st. I hope all of you were serious when you said you&#39;d join me. For those of you who simply can <em>not</em> resist Reddit, I ask that you kindly stop using your normal account. Make one called CISPA_PROTEST_2220222 and post/comment/vote with that. You guys have been great. I&#39;ll see you all in a week.</p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "_comment_sort": null,
  "report_reasons": null,
  "name": "t3_swseu",
  "from": null,
  "hidden": false,
  "clicked": false,
  "media": null,
  "json_dict": null,
  "_api_link": "https://api.reddit.com/r/politics/comments/swseu/lets_get_reddit_inc_interested_in_opposing_cispa/?ref=search_posts",
  "secure_media_embed": {},
  "mod_reports": [],
  "_orphaned": {},
  "_uniq": null,
  "num_comments": 1030,
  "link_flair_text": null,
  "title": "Let's get Reddit Inc. interested in opposing CISPA.",
  "_has_fetched": true,
  "author_flair_css_class": null,
  "thumbnail": "self"
}