{
  "selftext": "The topic of net neutrality has come up many times in various forms in previous years, but this time I feel like there is plenty of room to argue for either side.  On both sides of the debate there are companies and individuals up in arms, which makes this instance particularly interesting.\n\n**What is net neutrality?**  Basically, it is the belief that companies and governments should treat all information on the internet equally, and not discriminate or charge differently based on the type of content, the creator of the content, or the content itself.\n\n**The debate right now** is whether or not the U.S. federal government should expand certain regulations already in place on whether or not your internet provider can (among other things) limit or increase our access to certain content providers based on their own discretion.\n\nInternet Service Providers like Verizon have in the past sued the federal government for their right to be able to do such a thing. Verizon won [their most recent case](http://en.wikipedia.org/wiki/Verizon_Communications_Inc._v._Federal_Communications_Commission_%282014%29) against the FCC in January.  Verizon's position was that they have the right to limit broadband access to favor certain interests based on their discretion.  They also argued that net neutrality laws currently in place by the FCC are limits on their first amendment rights to free speech.  Because the information they transmit is a reflection of their free speech, Verizon reserves the right to use their discretion to limit what is transmitted.  \n\n**“Just as a newspaper is entitled to decide which content to publish and where, broadband providers may feature some content over others.”**\n\nAs of now, the U.S. federal government is seeking to expand their power to prevent such action, and ***defend*** net neutrality.  This is in contrast to previous net neutrality issues such as the SOPA act which sought to expand U.S. federal power in order to ***reduce*** so-called net neutrality.\n\nSo obviously the U.S. government believes that there is room for abuse in the current system now, and needs to create legislation to prevent ISPs from diminishing the quality of our (the people's) internet experience.  Proponents of government action that I have see on Facebook have cited [this](http://knowmore.washingtonpost.com/2014/04/25/this-hilarious-graph-of-netflix-speeds-shows-the-importance-of-net-neutrality/) graph.  This example shows how Comcast was limiting broadband connection speed to Netflix, until Netflix paid Comcast a fee.  This sort of example brings to light the concerns of the proponents of net neutrality.  If Comcast is to regulate all internet traffic unimpeded, could they stop us from expressing our free speech, or stop us from accessing websites we like because it hurts their interests?  If I created a website dedicated to spreading information to stir up bad public opinion of Comcast, could they block my website's traffic?\n\n**There are lots of great opinions** on either side of this debate, and extremely compelling arguments for either party.  Public opinion on the issue really does seem divided, with content industry giants such as Google, Netflix and Twitter supporting expanding U.S. federal legislation, and opposing telecommunications giants like Comcast, Verizon and Time Warner.  \n\nShould we recognize the right of telecommunications companies to exercise their right to free speech fully?\nShould we use further government intervention to limit abuses from these ISPs?  Would increasing government legislation pave the way for internet to become a public utility?  Would that be good or bad?  Will our own free speech and quality of internet experience be diminished by further government meddling, or by telecommunications companies?  Are FCC regulations already in place currently in violation of the First Amendment?  What is at stake if federal regulations do or don't occur?\n\nI would very much like to hear your opinions on the issue, because I myself am on the fence about it.  Please feel free to correct me about anything I said in this post.",
  "gilded": 0,
  "score": 83,
  "removal_reason": null,
  "approved_by": null,
  "created_utc": 1415692159.0,
  "is_self": true,
  "stickied": false,
  "edited": false,
  "distinguished": null,
  "permalink": "https://www.reddit.com/r/NeutralPolitics/comments/2ly490/net_neutrality_in_the_us_is_it_good_or_bad/?ref=search_posts",
  "banned_by": null,
  "from_id": null,
  "likes": null,
  "_underscore_names": null,
  "num_reports": null,
  "link_flair_css_class": null,
  "_info_url": "https://api.reddit.com/api/info/",
  "id": "2ly490",
  "archived": true,
  "secure_media": null,
  "from_kind": null,
  "saved": false,
  "domain": "self.NeutralPolitics",
  "ups": 83,
  "suggested_sort": null,
  "quarantine": false,
  "over_18": false,
  "hide_score": false,
  "url": "https://www.reddit.com/r/NeutralPolitics/comments/2ly490/net_neutrality_in_the_us_is_it_good_or_bad/",
  "subreddit_id": "t5_2tk0i",
  "_params": {},
  "_comments": null,
  "_replaced_more": false,
  "_comments_by_id": {},
  "user_reports": [],
  "media_embed": {},
  "created": 1415692159.0,
  "author_flair_text": null,
  "visited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The topic of net neutrality has come up many times in various forms in previous years, but this time I feel like there is plenty of room to argue for either side.  On both sides of the debate there are companies and individuals up in arms, which makes this instance particularly interesting.</p>\n\n<p><strong>What is net neutrality?</strong>  Basically, it is the belief that companies and governments should treat all information on the internet equally, and not discriminate or charge differently based on the type of content, the creator of the content, or the content itself.</p>\n\n<p><strong>The debate right now</strong> is whether or not the U.S. federal government should expand certain regulations already in place on whether or not your internet provider can (among other things) limit or increase our access to certain content providers based on their own discretion.</p>\n\n<p>Internet Service Providers like Verizon have in the past sued the federal government for their right to be able to do such a thing. Verizon won <a href=\"http://en.wikipedia.org/wiki/Verizon_Communications_Inc._v._Federal_Communications_Commission_%282014%29\">their most recent case</a> against the FCC in January.  Verizon&#39;s position was that they have the right to limit broadband access to favor certain interests based on their discretion.  They also argued that net neutrality laws currently in place by the FCC are limits on their first amendment rights to free speech.  Because the information they transmit is a reflection of their free speech, Verizon reserves the right to use their discretion to limit what is transmitted.  </p>\n\n<p><strong>“Just as a newspaper is entitled to decide which content to publish and where, broadband providers may feature some content over others.”</strong></p>\n\n<p>As of now, the U.S. federal government is seeking to expand their power to prevent such action, and <strong><em>defend</em></strong> net neutrality.  This is in contrast to previous net neutrality issues such as the SOPA act which sought to expand U.S. federal power in order to <strong><em>reduce</em></strong> so-called net neutrality.</p>\n\n<p>So obviously the U.S. government believes that there is room for abuse in the current system now, and needs to create legislation to prevent ISPs from diminishing the quality of our (the people&#39;s) internet experience.  Proponents of government action that I have see on Facebook have cited <a href=\"http://knowmore.washingtonpost.com/2014/04/25/this-hilarious-graph-of-netflix-speeds-shows-the-importance-of-net-neutrality/\">this</a> graph.  This example shows how Comcast was limiting broadband connection speed to Netflix, until Netflix paid Comcast a fee.  This sort of example brings to light the concerns of the proponents of net neutrality.  If Comcast is to regulate all internet traffic unimpeded, could they stop us from expressing our free speech, or stop us from accessing websites we like because it hurts their interests?  If I created a website dedicated to spreading information to stir up bad public opinion of Comcast, could they block my website&#39;s traffic?</p>\n\n<p><strong>There are lots of great opinions</strong> on either side of this debate, and extremely compelling arguments for either party.  Public opinion on the issue really does seem divided, with content industry giants such as Google, Netflix and Twitter supporting expanding U.S. federal legislation, and opposing telecommunications giants like Comcast, Verizon and Time Warner.  </p>\n\n<p>Should we recognize the right of telecommunications companies to exercise their right to free speech fully?\nShould we use further government intervention to limit abuses from these ISPs?  Would increasing government legislation pave the way for internet to become a public utility?  Would that be good or bad?  Will our own free speech and quality of internet experience be diminished by further government meddling, or by telecommunications companies?  Are FCC regulations already in place currently in violation of the First Amendment?  What is at stake if federal regulations do or don&#39;t occur?</p>\n\n<p>I would very much like to hear your opinions on the issue, because I myself am on the fence about it.  Please feel free to correct me about anything I said in this post.</p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "_comment_sort": null,
  "report_reasons": null,
  "name": "t3_2ly490",
  "from": null,
  "hidden": false,
  "clicked": false,
  "media": null,
  "json_dict": null,
  "_api_link": "https://api.reddit.com/r/NeutralPolitics/comments/2ly490/net_neutrality_in_the_us_is_it_good_or_bad/?ref=search_posts",
  "secure_media_embed": {},
  "mod_reports": [],
  "_orphaned": {},
  "_uniq": null,
  "num_comments": 92,
  "link_flair_text": null,
  "title": "Net Neutrality in the U.S. Is it good or bad?",
  "_has_fetched": true,
  "author_flair_css_class": null,
  "thumbnail": ""
}