{
  "selftext": "**Verified?** *(This bot cannot verify AMAs just yet)*\n\n**Date:** 2013-05-17\n\n**[Link to submission](http://www.reddit.com/r/IAmA/comments/1ej8wy/)** (*Has self-text*)\n\n**[Link to my post](http://www.reddit.com/r/IAmA/comments/1ej8wy/tabledresser/ca0yvv4)**\n\n\n\nQuestions|Answers\n:--|:--\n[What is it with the scent of all the stores? Is that mandatory?](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0ri23?context=5)|Oh god. Fierce Cologne, supposedly #4 in the world. It's mandatory to \"spritz\" 10 pumps of cologne several inches from the clothes every hour, in addition to the scent spraying machines that only some stores have.\n |That amount of alcohol in the air makes your nails brittle and eyes red, if you work there all day like I did.\n[Did you ever have to turn down someone who applied because they're \"fat\"?](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0rmnn?context=5)|I have. I have also hired great people who are definitely what the company would've considered \"too fat\" but I really liked them and needed them.\n[Will employees be fired if they get fat while working at A&F?](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0s7g9?context=5)|Ha. Yes I've seen it. People get fat or new managers come in who disagree with the looks and bodies of the staff-very common problem. So that manager will fire them or take away all their hours, etc. It's pretty scandalous shit really but all too common.  It is downright encouraged from the district managers and their bosses however. If your boss visits your store and ugly person, fat person or someone out of dress code is working, then you're in big trouble. fucked up huh?\n[What is considered \"too fat\"? ](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0slmu?context=5)|Too fat is in the eye of the beholder.The company requires managers to \"recruit\" daily. However, realistically, that only happens about once a week on average. When recruiting, two managers are supposed to walk around public places, hunting down attractive people to work as clerks, what A&F calls \"Models\" in the stores. You literally look at people, mumble to each other, \"Are they cute enough? Skinny enough? Attractive? Hmm..\" It's horrible and awkward. You learn what the company wants by studying the official Look Book (I forgot what it's officially called) every Tuesday. The Look Book highlights the People department of our company. There are pictures from our stores around the world of our models who exemplify what we want. Smiling, sexy, skinny, clear skinned, confident, people. There is no paper that says, too fat and your boss won't say it. You decide it when you're out recruiting.\n |The key word that the company uses to define everything we want--and what our customers should want, from us and from our image is: \"ASPIRATIONAL\". If you are not acting or looking aspirational, and the people you hire are not aspirational then you are not going to get promoted. So it's not necessarily simply \"not\" too fat.\n[Haha oh man, if you look at Jeffries' Wednesday Facebook apology about the 2006 quote, he calls A&F an \"aspirational\" company, which, according to my computer, is not a word. ](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0w0ot?context=5)|And he's not aspirational. I bet a million bucks that there's child porn on his computer too. creep.\n |It's said in the company that he has extreme OCD and that's why everything in the company is sooo particular. There's something called standard where piles of clothing have a specific way of being displayed. The stacks have to be folded in a perfectly level and uniform way with all sides perfect, the edges and corners perfect and the height even. That's why employees are always folding and ignore you.\n[To be fair, most stores I've seen look beautiful inside.](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0wo50?context=5)|Yes they can be immaculate.\n[When I worked there (quit before I completed the training process\\) they did the same thing, I wasn't sure why at the time, and now I know. I am so glad I didn't stay to actually work there. ](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca17ucf?context=5)|It's so weird to take a guy in the backroom and make him take his shirt off, pull down his jeans right to his pubes and then take his picture. We have to do this to search for greeters. Fucking awkward. Of course, with everyone in the fucking company having OCD, they made us do it like ten times with these people off the clock!\n[Also, Why did corp. only have scantly clad men in front of the stores and NEVER women???](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0rexi?context=5)|Good question. There is a lot of unusual, impractical and just bad practices that stem down from upper and corporate management (the ceo) that the company practices. For example, placing nude men standing next to each other as if they're butt humping, on all the shopping bags. Not a good idea and not necessarily popular from a marketing perspective. As to \"WHY?\", i think it's because there is a lot of closeted gay men in the company, and a lot of advertising, in-company media and propaganda that is borderline child porn.\n[I didn't see this question posted anywhere else on here but since you mentioned it, how does the company/hiring managers feel about gay workers? ](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca17f4z?context=5)|If a person talks, looks or acts gay, they are not supposed to be hired. This company builds itself on people. People are it's \"only advertisement\". The people they put on a pedastal are straight, clean, young, usually white people with clear skin and natural look. That means they must act and dress straight.\n |I've had a woman interview who was a great fit. She told me, I'm gay but I'll wear whatever the dresscode is for women. I asked my boss before hiring her. He said no. There are a lot of higher-up, male managers that are in the closet, now that I think about it. There are also still simply gay and flamboyantly gay people on staff. They get in. (We have ugly people too. People hire their friends, etc.)\n |A&F provides benefits for same sex couples. A&F just prefers straight acting people. It really is like this: [they don't like gays but are gay](http://www.youtube.com/watch?v=qaendBOenFg).\n[When helping someone find an item, how are employees supposed to tell a customer if A&F doesn't offer their (larger\\) size?](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0sl67?context=5)|You just tell them blatantly, \"We don't make XL for women.\" Back in 2005 and earlier, Abercrombie & Fitch trained its employees to purposely ignore, not help, and be snotty to it's customers. This created a \"too good\" image for them and was encouraged. The company and the program have literally no shame. years later, we now are forced to greet everyone you see and the program has changed.\n[Why do you no longer work there?](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0rsa9?context=5)|I always hated it and regretted it. I finally quit after I had a manager who wouldn't leave me alone. This manager would call me before and after work and encourage us to work on our days off. Ugh just a horrible, fake, shallow person. It made me realize that I needed to spend more time on me, my life and family and what I really want in a career.\n[\"Mmm, yeah, I'm going to have to go ahead and ask you to come in on Sunday, too.\"](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca13y00?context=5)|Tps reports!\n[May I ask, what is it that you want in a career? ](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0vccq?context=5)|I want freedom of creativity and to have some control, a salary that I consider fair, the option of benefits and less stressful environment that allows me to sit, think, not stand the entire time, not limit my ergonomics, and provides me with two consecutive days off a week. Mostly, I want to work for a company that I believe in whole heartedly and that makes a difference.\n[Well good for you! Glad to hear they didn't fire you because you were fat. Just kidding. ^^^No ^^^but ^^^really.](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0rw72?context=5)|I can out eat a fat person. I loves to eat.\n[I wish you well in your search. A job like that, most particularly a job you can believe in is hard to come by.  It seems employee's are another resource to most companies and treated as such.  I hope you find what you are looking for.](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca19jlt?context=5)|Thanks. Especially in this day and age, I think I'll just have to seize the internet and make my own thing to be happy. If it takes off, great. A decent day job will have to pay the bills meanwhile.\n[Thanks for answering my first question.  I actually find it amazing that A&F  has gotten so much attention recently, especially since I can't imagine anyone beyond high schoolk wearing A&F.  Also thought it was well known that they don't make large sizes.  Anyway, do you still work in retail?](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0sqhg?context=5)|No. I hope to never work in retail again. I have noticed that everyone who shops there is usually foreign and trying to assimilate, or a douche who has bad taste, or a young american teen trying to be popular. Mostly foreigners trying to assimilate. \n[When I lived in Germany I noticed that A&F and Hollister was insanely popular. Did you notice a lot of German tourists?](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0uigu?context=5)|We get people of all kinds. Chinese, Korean and Japanese are the most popular. In retail, there's something called buyers. These people hoard certain namebrands and sell them overseas at 300-500% markup, easily. Asian buyers come in, buy as much as they can at a time and leave with duffel bags full of nasty clearance clothing that they sell for hundreds overseas. \n[I heard somewhere that A&F doesn't hire Chinese people. Is there any truth to this, in your experience?](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0sj7j?context=5)|That is stemming from a HUGE fucking lawsuit that happened more than ten years ago. (racism is more evident in the company, moreso than other companies however) From that lawsuit, all employees of color were paid a few thousand dollars and several measures were put in place. One of them being, \"the diversity tracker\". Abercrombie was mandated, indirectly from the court case, to count how many diverse people it hired and keep these numbers in the positive at each location. I believe in like 2011, the arrangements put in place from this court case ended. Now there is no diversity tracker, but the company boasts something like 51% of its employees identify as \"people of color\".  I didn't see anyone flat out deny hiring someone because of race. But I did encounter backlash for hiring Blacks who were attractive and qualified, even by Abercrombie standards. Upper management never condoned hiring diverse people, just stupid co workers and staff. \n[Sooo did you see any Asian people working at those stores?  My buddy probably wouldn't want to work there either.](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0z6k5?context=5)|Yeah there's asians. I'd say it's pretty obvious that white people get promoted and white models get selected to do the ads more than any other group however. But from a marketing standpoint, white people are who the company is trying to attract and imitate and whites have a more \"disposable\" income demographically speaking.\n[With all the negative publicity and stereotypes about A&F, what are some positive things you've experienced? (about the company, clothes, anything\\)](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0s2jc?context=5)|The jackets and hoodies fit really well. Although the pieces are all from the same sweatshops that other cheap clothes are from, they sometimes come out fitting well and slimming, for a petite person like me. All the other things we make are riddled with problems though.  Uh...other good things about the experience: good and cheap health benefits. I'm sure they existed so that no one would go 'ugly' or too 'sick' to be gone long.  My favorite part of the job was my kids, my staff. I like to hire and train them and hear about where they are in their lives, etc.\n[So we've established that the front-line low level people have to be slim, attractive, etc..  What about the management that doesn't work the front lines? District manager and up. What did they look like? Did you find them all attractive/thin, etc?](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0vk2f?context=5)|Everyone has to be thin and attractive. Everyone up the ladder has to be thin enough to fit in our clothing and wear them everyday in the corporate Home Office in Ohio. Oh it's so sad when someone gets too pregnant to fit into our clothes or has to lose baby weight. The pressure is unbelievable. I have noticed that older men get to have facial hair and they can wear anything from the store, where as store employees have to wear limited items. The only people who don't wear our stuff are servicemen who are contracted from outside the company. Even undercover security wears our clothes which blows their cover!\n[So what happens when a pregnant woman can no longer fit into the clothes? Are they then allowed to wear their own?](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0xclm?context=5)|She has to squeeze into them. You are allowed to wear other similar clothes but it's asking to be fired.\n[Limited on which clothing they can wear? Is that limiting which clothing they can wear FROM a&f? I too managed a retail store and it was just 'wear our clothes', not 'wear our specific pre chosen outfits'.](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca16g6p?context=5)|The clothing that employees can wear from A&F is very limited. Options change with the season. Non ripped, dark skinny jeans are required and a collared button down white or navy blue shirt or skimpy blouse is the standard. Corporates can wear anything. There is some wiggle room. Since things are expensive, it's totally normal to wear the same shit everyday.\n[Is the company as loathe to hire minorities as it is unattractive or fat people?](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0ssye?context=5)|Ya. More than anything, A&F hates and says blatantly in its interview guide to not hire a person if they are an \"introvert\".\n |There's a thing called the \"Cast-of Tracker\" that is your top ten most attractive and outgoing female and male models(salesfloor staff). (It is okay and encouraged for an ugly or chubby employee to only work in the back or with the night crew and not be on the salesfloor.) Every year the cast of gets their photo taken and submitted to corporate. Calendars and video propaganda are made and dispersed congratulating the sexiest store locations, etc. Models on the walls and bags are chosen from a national selection process that filters these cast of people. So looks are incredibly important to get corporate attention and therefore promotions.\n[Have you ever actually witnessed a person being discriminated against on the basis of race, or material actively condoning this type of action?](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0uh4u?context=5)|Yes, after I got promoted, I hired a new staff. Existing employees had no problem making comments to me about how I had \"jungle fever\" for hiring black people and questioned why I hired an Indian girl. I worked with them over time to exemplify and tell them how our generation needs to make conscious decisions about how we are going to treat people and that we need to reflect all the customers. Sales went up and the customers appreciated it. That is the mindset of my upbringing though, not Abercrombie's.\n |A Spanish only speaking woman and her sons came into our store and were ridiculed by an associate of mine. The father translated to me their horror and embarrassment. I profusely apologized and felt just awful. The woman was crying. I disciplined that kid and he quit before I could get another reason to legally fire him. He had a clique of asses that worked there and I had to get rid of each of them for different reasons.\n[What's up?  I heard that employees are required to say what's up when they make eye contact with a customer, is this true? ](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0v721?context=5)|You're required to say the current tagline to anyone within 15 seconds of them entering the store and that has been for a long time, \"Hey What's up\". That's the simplest one. One time it was long and stupid, \"Hey How's it going? Have you tried our jeans? They'll make you look like a star. \"\n |If we say, \"Can I help you find something to go with that item you're holding?\" It means we're onto you trying to steal whatever you're holding.\n[Do you agree with the company's hiring policies? And if they are ever \"too fat\" to hire do you tell them why they didn't get the job? Edit: spelling. ](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0ruy0?context=5)|I do not agree with the company in any way. I took the job after college when I couldn't find a job in my major and really really really needed the money for my family. I also was dying to work a full time job for the first time! What a disappointment.  People are never told why, or why not they are hired. There is a script for those questions and a script for nearly everything. Everything at the company has a predetermined response that we memorize. This predetermined agenda is referred to as \"The Program\".\n[Can you give us some examples?](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0sgxy?context=5)|Person: \"The music is too loud.\" A&F: Our music is set to an adjusted level. We can check to make sure this level is set correctly. Would you like to file a volume complaint so our technician can come check it?\n |Person: Do you have anything in Black? A&F: We don't make Black.\n |Person: Are you a racist company? A&F: A&F is proud to be a supporter of several diverse organizations and scholarship funds such as... person: \"Can i go in the fitting room with my friend?\" A&F: \"No.\" Not unless you tell me physically disabled or that is your child that you want to go in with.\n |Secret shoppers actually check on these responses by testing employees undercover twice a month.\n[Why don't they make black? ](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0vww1?context=5)|I think that would be too common of a color for them to make. They would sell a lot more though, and instead make neon colors that no one buys. Like I said, they don't do a lot of things that make sense.\n[I remember seeing an article years ago about a girl who was black who was hired on and was only allowed to work in the backroom. Were you pressured to hire by race? and was the area you worked in predominantly white? and if so were you instructed to treat customers and employees differently?](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0y9p5?context=5)|We were pressured to hire by race back when the diversity was a bigger issue. Each store has a diversity scorecard. You want to balance out those numbers and keep them in the positive because of the high turnover rate. A kid who interviews great but isn't scored as \"Great\" looking can get hired as a backroom/stockroom employee. But hey, there's some good looking kids there too. I got to say that. Obviously, you can't stretch things too far. If the kid isn't even close to the ideal A&F look, it's going to be a constant battle with upper management to keep that kid on staff. You have to vouch for ugly hires. Even if they are the only ones who get the job done, management does not want to see them ever again.\n[As an ex-A&F worker, glad you got out. Smell the cologne-free fresh air!  The store I worked at was hit several times by shoplifters with bags that bypassed the magnetic security readers usually out front. Did you have issues like that, or with shoplifting in general?](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0vhp1?context=5)|You know every store does.\n[It got frustrating when my manager started to check employees for shoplifting after closing hours, as well. That, and the cheesy intro video for every employee about the same thing.](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0vku9?context=5)|Ya well i hated having that too, especially as a model, not just a manager. But if you think about it, everything that's stolen goes through those doors and we still don't see it happen.\n[What did you think about the ordeal with Jersey Shore's Situation? He was asked not to wear their clothes, then A&F came out with a shirt that said \"Fitchuation\" and he sued them... ](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0xtm3?context=5)|I'm proud to say I have never watched that show and am not familiar with the situation. Sounds comical, both lose. The people who design the clothes are former managers who go live at the Home Office- pretty much the nazi camp of Abercrombie. It's a literal campus in this Ohio forest with real deer and everyone wears flannel. Theres a cafeteria and a building for every department. They drink their own bottled \"Abercrombie & Fitch\" water. Lame. I joke that it's an Aryan breeding ground and a big eugenics conspiracy.\n[Glad you got out! What do you do now?](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0u87y?context=5)|I'm still happily unemployed and have been focused on taking a break. Working there kept me on my feet for over 40 hours a week. Chairs and sitting are not allowed, and the floors were concrete. My feet and back were shot for too long. I am doing some indie shorts now, something I'd always wanted to do.\n[What's one of the most outlandish things you've seen in regards to the dress code rules. Are there any rules in regards to the dress code you thought were particularly ridiculous?](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0u9e0?context=5)|Wearing sandals is mandatory. We are allowed, on paper, to wear some select shoes, but it is not encouraged. In fact, my bosses over the years are very disappointed and angry when they see you wearing shoes. I hate wearing the tight tight pants or jeggings. They're so tight, you get yeast infections and can't really move well enough to do your job. The dye on the jeans makes your legs turn blue.\n |We're forced to wear flat sandals with no support or padding. Over time, employee's feet actually flatten. Their shoe size changes because the arch collapses in their foot.  I think that it's weird that even the CEO and corporate people have to wear the jeans, because it looks unprofessional.\n |Oh yeah, whenever I wore my glasses, i was quietly advised to not wear them again.\n[Is it just me or does this seem like a really random question? Might as well ask why they don't sell dynamite or dildos. ](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0si3a?context=5)|No, the most extreme thing that they sell are racist shirts, sexist shirts and not the sizes xl for women. All the clothes are extremely small, especially the men's shirts and pants. This means only skinny people will wear it. Clever I suppose. The kids store also sold thongs a while back, that was in the news.\n[What was the stupidest question you got? Also, were customers stuck up often?](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca102em?context=5)|We have some stuck up customers. A lot of celebrities shop there too surprisingly. The stupidest questions we get are the pranks. People prank abercrombie a lot, like prank calling. People come in and take their shirts off and dance to the loud music to make fun of us, etc. Not aggravating though, just dumb. We ask for it.\n[Why did you have us remove the Tear tags as our store called them (the made by tag\\)???](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0reeo?context=5)|I don't believe I was there when this memo came through to instruct employees to remove tags. Sounds like one of the sweatshops printed a label that didn't comply with a federal fabric standard and you had to remove them for legal safe sale or something. In retail, there's a lot of mindless labor like that without explanation and that's why we are paid so little. But hey, we pick the job too!\n[I just want to say thank you for hosting a GREAT AMA :\\) Do you see any hypocrisy when people call him ugly, while he is being attacked for similar reasons? (Although he's a far worse case for sure\\)](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0xmmm?context=5)|Lol. You're right. There is hypocrisy but I never thought of it that way. I just feel frustrated that many CEOs and people in powerful positions are literally so stupid, useless and immature. I think if they were more educated and caring, we could really be in a much better place with better leaders to follow and companies that we could trust and support.\n[Is there any schedule to the sales, or a \"best time\" to shop there? Obviously the clearance rack, but any secrets about the pricing or how it works would be cool to know. I actually do like some of their clothes (I'm 31 and probably not hot enough to work there\\) but just can't imagine spending that much on clothes, yknow?](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0w9z3?context=5)|The older something is, the cheaper it is. The best time would be in december because holiday sales. And right before school starts, there's always a huge jean sale that gets pretty good. Mens clothing is marked down every other Thursday and women's clothing is marked down every other Wednesday. You also can get coupon codes and good prices online or if you sign up for emails/text. They'll always let you know when the sales are. There's better clearance online. The outlets aren't worth your time either.\n[Do you or other employees have any idea what the conditions are in the places where they make the clothes? What are the company instructions to say when people ask about that kind of thing?](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0sjmy?context=5)|There is a bit on their website about the sweat shop conditions. They have gone through some steps to make sure they are like certified and official but I believe that doesn't mean anything. It usually means that, in that country of origin, the factory is vetted and workers get like a standard wage. That usually is equivalent to still just pennies in US dollars however.\n |I know that their contracted sweatshops are located almost all over the world from China to Bangladesh, Vietnam, Japan, etc. The shipments arrive with bugs in them from all over the world, how beautiful!\n[Could you ever get that horrible stench out of your clothes?](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0sf0g?context=5)|It would take more than one wash to do so. Some people really crave that smell. The colognes are shoplifted every hour, guaranteed. Some customers beg you to spray it on their purchases.  Guess what it does when you spray it on the clothes as much as we do? It permanently stains them! stupid stupid illogical Abercrombie.\n[So you only made 22k as a manager? How many hours did you work? Salary or hourly?](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0vew3?context=5)|As a new manager, you start at 29K. pretty pathetic. A store manager, who is usually top dog at a location gets 39K and that usually takes a year or 2 to get to. District managers make almost 60k and get a company car, but still have to work on their weekends. \n[What would they do if they saw homeless people wearing their shirts? Would they attempt to buy them off the \"fat\" homeless people?](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca17lnq?context=5)|We get so many people, out of the demographic A&F targets, shopping there. They can only limit so much by price and select sizing. I know that whatever doesnt sell after going to outlets, doesn't get marked down and sent to Ross. It gets destroyed. A lot of companies literally incinerate their old and unbought products to keep its value. Hallmark used to do it, may still.\n[Do you think that should result in less/no tax breaks for an organization that destroys their unsold items?](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca1a0r3?context=5)|No, because that'd be impossible and silly to regulate. It would mean a government branch that watches what people dispose or destroy. That's just impractical. I think it's wrong, but am not sure what I'd do about it.\n[Are you ugly?](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0rm4b?context=5)|I am like most people: I have a longer list of what I don't like about my body and face than what I like.  I was surprised when I was hired. But people tell me I'm beautiful and I've always been very thin. I guess I'm not ugly with my makeup on! A&F really takes into account whether you look straight, act straight, and are \"natural\" looking and dress tastefully. Straight white teeth, clear skin, and preferably no extra piercings or tattoos are important.\n[Out of curiosity, along with the whole no tattoos and piercings rule, how do they feel about hair dyed something slightly unnatural?](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca119ky?context=5)|Hair dye changes are supposed to be discussed before occurring. Any unnatural, unclassic or untraditional makeup or nail polish or hair color and styles are not allowed. So if you have blonde highlights and you're black or asian or some race that is unbelievably blonde, they will pull you aside and talk to you about it.\n |It's a bit extreme. Nothing besides a basic ponytail or bobby pin is allowed. Nail polish is prohibited unless pink or red or french tip only on toenails. No rhinestones or accessories or jewelry, besides a plain watch or wedding ring. \n[Did this job ever get you laid?](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0tq79?context=5)|Don't think so. I don't tell most people that I work there because they'll think I'm stupid and racist and shallow. But there is a lot of sex and scandal within the company.\n[Are they more likely to hire some one who has played a certain sport?](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca10wm9?context=5)|Yes, or if you do anything outgoing or extracurricular. They love people who have been on reality shows or are in greek sororities and fraternities. They also love anyone who kisses ass and pretends to do what the brand is about. ex: I love abercrombie so I have a pet moose. or I love Hollister and I like surf all the time.\n[Do adults still buy and wear the brand ? I went to a wealthy high school and AF became a uniform. I wonder if those guys still shop there when older.](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca132cw?context=5)|Ruehl was such an impractical idea: a store targeted toward coed youth where each item costs hundreds of dollars,in the u.s. Abercrombie has failed to learn that girls and mothers make the purchasess in their stores and thats who they need to be appealing to to make any money.\n[What is the best qualit item you have to guys?.](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca132cw?context=5)|Yes, adults do buy the clothes and people with identity problems like middle aged men, elderly women and people covered in plastic surgery like the CEO. \n[Do all the stores smell that bad?](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0rt2g?context=5)|I bet. It is mandatory but I haven't stepped into all of the stores. A different scent is used in Hollister and in Abercrombie Kids, also our \"brands\" and stores.\n[How much did you make as manager? Just out of curiosity, only answer if you want to!](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0zfwt?context=5)|29k as starting manager, 39k as a store manager. You can't really argue or bargain with them, even if you threaten to leave. Theyre very stingy with money and pay the least of all retailers, I hear. They are annual raises but usually amount to cents or a a few bucks.\n[I definitely stole from that store all the time when I was in high school. Nobody ever greeted me, or even really looked at me, so I grabbed what I wanted, and just walked out.](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0y370?context=5)|Sooo many thieves. Hundreds. I've learned that there are two kinds: one who have a conscious and those who don't. The ones who don't have a conscious just deny everything when you catch them redhanded! I've caught them stealing while wearing stuff they stole previously. Lot of repeat offenders too. \n[Proof?](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0tph9?context=5)|[Link to imgur.com](http://imgur.com/KYKioce)\n[Only paid 22k/yr?  I hope you live somewhere affordable. ](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0xdj2?context=5)|It was 29k before taxes and i was living in a very expensive town where the cost of living is closer to 60k!\n[Why do you think the company is allowed to discriminate on every level and openly not be an equal opportunity employer?  Do they have really good lawyers?  How often do they get sued?  Do y'all have HR people at all?](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca1fapc?context=5)|Yes theres HR. Theres a lawsuit about once a week it seems. Great lawyers. Everythings very careful and they settle all lawsuits. If you work here, you get more class action payouts than bonuses and raises combined.\n[What's the difference between a \"Model\" and an \"Impact Team Member\"?](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca1698c?context=5)|Model is a salesfloor associate. Impact team member is a stock room associate. They are meant to stay in the separate places. Models are outgoing and help people, maintain floor, operate register, fitting room, etc. Impact deal with replenishing sold items, prepping items, putting away shipment, maintaining stock. If you're not outgoing or scored as \"great\" looking, you are considered for a impact team member.\n[Question; would you hire someone who looked nice but was somewhat still an introvert?](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca14drv?context=5)|Oh ya. I hired a lot of people I shouldnt have by their standards. The interview guide is word for word. It tells you how to evaluate them. It says if the person is great looking and fits the brand style, then they are pretty much a shoe in.\n |Sometimes I got sappy and hired people who really needed a job and seemed hardworking, even though they werent great looking but just amazing, smart, dedicated, professional teenagers man. I hated turning those kids down because they didn't do anything wrong. We get great interviews from not great looking people and have to send them away. Real shame. \n[Do you do background/credit checks on all your employees or just some?](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0tter?context=5)|They do background checks on everyone.\n[Do you have any proof?](http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0ujnz?context=5)|Yea, I'll go get it some mail or paperwork with both our names on it. I just don't want my specific identity to be exposed for potential legal reasons.\n |Proof i worked there or proof of the managers? [Link to imgur.com](http://imgur.com/KYKioce)\n\n\n*Last updated: 2013-05-21 22:07 UTC*\n\n*This post was generated by a robot! Send all complaints to [epsy](/message/compose/?to=epsy).*\n\n",
  "gilded": 0,
  "score": 13,
  "removal_reason": null,
  "approved_by": null,
  "created_utc": 1368835453.0,
  "is_self": true,
  "stickied": false,
  "edited": 1369174115.0,
  "distinguished": null,
  "permalink": "https://www.reddit.com/r/tabled/comments/1ejpng/table_iama_i_was_an_abercrombie_amp_fitch_manager/?ref=search_posts",
  "banned_by": null,
  "from_id": null,
  "likes": null,
  "_underscore_names": null,
  "num_reports": null,
  "link_flair_css_class": null,
  "_info_url": "https://api.reddit.com/api/info/",
  "id": "1ejpng",
  "archived": true,
  "secure_media": null,
  "from_kind": null,
  "saved": false,
  "domain": "self.tabled",
  "ups": 13,
  "suggested_sort": null,
  "quarantine": false,
  "over_18": false,
  "hide_score": false,
  "url": "https://www.reddit.com/r/tabled/comments/1ejpng/table_iama_i_was_an_abercrombie_amp_fitch_manager/",
  "subreddit_id": "t5_2tkmw",
  "_params": {},
  "_comments": null,
  "_replaced_more": false,
  "_comments_by_id": {},
  "user_reports": [],
  "media_embed": {},
  "created": 1368835453.0,
  "author_flair_text": "",
  "visited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Verified?</strong> <em>(This bot cannot verify AMAs just yet)</em></p>\n\n<p><strong>Date:</strong> 2013-05-17</p>\n\n<p><strong><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/\">Link to submission</a></strong> (<em>Has self-text</em>)</p>\n\n<p><strong><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/tabledresser/ca0yvv4\">Link to my post</a></strong></p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Questions</th>\n<th align=\"left\">Answers</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0ri23?context=5\">What is it with the scent of all the stores? Is that mandatory?</a></td>\n<td align=\"left\">Oh god. Fierce Cologne, supposedly #4 in the world. It&#39;s mandatory to &quot;spritz&quot; 10 pumps of cologne several inches from the clothes every hour, in addition to the scent spraying machines that only some stores have.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">That amount of alcohol in the air makes your nails brittle and eyes red, if you work there all day like I did.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0rmnn?context=5\">Did you ever have to turn down someone who applied because they&#39;re &quot;fat&quot;?</a></td>\n<td align=\"left\">I have. I have also hired great people who are definitely what the company would&#39;ve considered &quot;too fat&quot; but I really liked them and needed them.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0s7g9?context=5\">Will employees be fired if they get fat while working at A&amp;F?</a></td>\n<td align=\"left\">Ha. Yes I&#39;ve seen it. People get fat or new managers come in who disagree with the looks and bodies of the staff-very common problem. So that manager will fire them or take away all their hours, etc. It&#39;s pretty scandalous shit really but all too common.  It is downright encouraged from the district managers and their bosses however. If your boss visits your store and ugly person, fat person or someone out of dress code is working, then you&#39;re in big trouble. fucked up huh?</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0slmu?context=5\">What is considered &quot;too fat&quot;? </a></td>\n<td align=\"left\">Too fat is in the eye of the beholder.The company requires managers to &quot;recruit&quot; daily. However, realistically, that only happens about once a week on average. When recruiting, two managers are supposed to walk around public places, hunting down attractive people to work as clerks, what A&amp;F calls &quot;Models&quot; in the stores. You literally look at people, mumble to each other, &quot;Are they cute enough? Skinny enough? Attractive? Hmm..&quot; It&#39;s horrible and awkward. You learn what the company wants by studying the official Look Book (I forgot what it&#39;s officially called) every Tuesday. The Look Book highlights the People department of our company. There are pictures from our stores around the world of our models who exemplify what we want. Smiling, sexy, skinny, clear skinned, confident, people. There is no paper that says, too fat and your boss won&#39;t say it. You decide it when you&#39;re out recruiting.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">The key word that the company uses to define everything we want--and what our customers should want, from us and from our image is: &quot;ASPIRATIONAL&quot;. If you are not acting or looking aspirational, and the people you hire are not aspirational then you are not going to get promoted. So it&#39;s not necessarily simply &quot;not&quot; too fat.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0w0ot?context=5\">Haha oh man, if you look at Jeffries&#39; Wednesday Facebook apology about the 2006 quote, he calls A&amp;F an &quot;aspirational&quot; company, which, according to my computer, is not a word. </a></td>\n<td align=\"left\">And he&#39;s not aspirational. I bet a million bucks that there&#39;s child porn on his computer too. creep.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">It&#39;s said in the company that he has extreme OCD and that&#39;s why everything in the company is sooo particular. There&#39;s something called standard where piles of clothing have a specific way of being displayed. The stacks have to be folded in a perfectly level and uniform way with all sides perfect, the edges and corners perfect and the height even. That&#39;s why employees are always folding and ignore you.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0wo50?context=5\">To be fair, most stores I&#39;ve seen look beautiful inside.</a></td>\n<td align=\"left\">Yes they can be immaculate.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca17ucf?context=5\">When I worked there (quit before I completed the training process) they did the same thing, I wasn&#39;t sure why at the time, and now I know. I am so glad I didn&#39;t stay to actually work there. </a></td>\n<td align=\"left\">It&#39;s so weird to take a guy in the backroom and make him take his shirt off, pull down his jeans right to his pubes and then take his picture. We have to do this to search for greeters. Fucking awkward. Of course, with everyone in the fucking company having OCD, they made us do it like ten times with these people off the clock!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0rexi?context=5\">Also, Why did corp. only have scantly clad men in front of the stores and NEVER women???</a></td>\n<td align=\"left\">Good question. There is a lot of unusual, impractical and just bad practices that stem down from upper and corporate management (the ceo) that the company practices. For example, placing nude men standing next to each other as if they&#39;re butt humping, on all the shopping bags. Not a good idea and not necessarily popular from a marketing perspective. As to &quot;WHY?&quot;, i think it&#39;s because there is a lot of closeted gay men in the company, and a lot of advertising, in-company media and propaganda that is borderline child porn.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca17f4z?context=5\">I didn&#39;t see this question posted anywhere else on here but since you mentioned it, how does the company/hiring managers feel about gay workers? </a></td>\n<td align=\"left\">If a person talks, looks or acts gay, they are not supposed to be hired. This company builds itself on people. People are it&#39;s &quot;only advertisement&quot;. The people they put on a pedastal are straight, clean, young, usually white people with clear skin and natural look. That means they must act and dress straight.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I&#39;ve had a woman interview who was a great fit. She told me, I&#39;m gay but I&#39;ll wear whatever the dresscode is for women. I asked my boss before hiring her. He said no. There are a lot of higher-up, male managers that are in the closet, now that I think about it. There are also still simply gay and flamboyantly gay people on staff. They get in. (We have ugly people too. People hire their friends, etc.)</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">A&amp;F provides benefits for same sex couples. A&amp;F just prefers straight acting people. It really is like this: <a href=\"http://www.youtube.com/watch?v=qaendBOenFg\">they don&#39;t like gays but are gay</a>.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0sl67?context=5\">When helping someone find an item, how are employees supposed to tell a customer if A&amp;F doesn&#39;t offer their (larger) size?</a></td>\n<td align=\"left\">You just tell them blatantly, &quot;We don&#39;t make XL for women.&quot; Back in 2005 and earlier, Abercrombie &amp; Fitch trained its employees to purposely ignore, not help, and be snotty to it&#39;s customers. This created a &quot;too good&quot; image for them and was encouraged. The company and the program have literally no shame. years later, we now are forced to greet everyone you see and the program has changed.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0rsa9?context=5\">Why do you no longer work there?</a></td>\n<td align=\"left\">I always hated it and regretted it. I finally quit after I had a manager who wouldn&#39;t leave me alone. This manager would call me before and after work and encourage us to work on our days off. Ugh just a horrible, fake, shallow person. It made me realize that I needed to spend more time on me, my life and family and what I really want in a career.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca13y00?context=5\">&quot;Mmm, yeah, I&#39;m going to have to go ahead and ask you to come in on Sunday, too.&quot;</a></td>\n<td align=\"left\">Tps reports!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0vccq?context=5\">May I ask, what is it that you want in a career? </a></td>\n<td align=\"left\">I want freedom of creativity and to have some control, a salary that I consider fair, the option of benefits and less stressful environment that allows me to sit, think, not stand the entire time, not limit my ergonomics, and provides me with two consecutive days off a week. Mostly, I want to work for a company that I believe in whole heartedly and that makes a difference.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0rw72?context=5\">Well good for you! Glad to hear they didn&#39;t fire you because you were fat. Just kidding. <sup><sup><sup>No</sup></sup></sup> <sup><sup><sup>but</sup></sup></sup> <sup><sup><sup>really.</sup></sup></sup></a></td>\n<td align=\"left\">I can out eat a fat person. I loves to eat.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca19jlt?context=5\">I wish you well in your search. A job like that, most particularly a job you can believe in is hard to come by.  It seems employee&#39;s are another resource to most companies and treated as such.  I hope you find what you are looking for.</a></td>\n<td align=\"left\">Thanks. Especially in this day and age, I think I&#39;ll just have to seize the internet and make my own thing to be happy. If it takes off, great. A decent day job will have to pay the bills meanwhile.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0sqhg?context=5\">Thanks for answering my first question.  I actually find it amazing that A&amp;F  has gotten so much attention recently, especially since I can&#39;t imagine anyone beyond high schoolk wearing A&amp;F.  Also thought it was well known that they don&#39;t make large sizes.  Anyway, do you still work in retail?</a></td>\n<td align=\"left\">No. I hope to never work in retail again. I have noticed that everyone who shops there is usually foreign and trying to assimilate, or a douche who has bad taste, or a young american teen trying to be popular. Mostly foreigners trying to assimilate.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0uigu?context=5\">When I lived in Germany I noticed that A&amp;F and Hollister was insanely popular. Did you notice a lot of German tourists?</a></td>\n<td align=\"left\">We get people of all kinds. Chinese, Korean and Japanese are the most popular. In retail, there&#39;s something called buyers. These people hoard certain namebrands and sell them overseas at 300-500% markup, easily. Asian buyers come in, buy as much as they can at a time and leave with duffel bags full of nasty clearance clothing that they sell for hundreds overseas.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0sj7j?context=5\">I heard somewhere that A&amp;F doesn&#39;t hire Chinese people. Is there any truth to this, in your experience?</a></td>\n<td align=\"left\">That is stemming from a HUGE fucking lawsuit that happened more than ten years ago. (racism is more evident in the company, moreso than other companies however) From that lawsuit, all employees of color were paid a few thousand dollars and several measures were put in place. One of them being, &quot;the diversity tracker&quot;. Abercrombie was mandated, indirectly from the court case, to count how many diverse people it hired and keep these numbers in the positive at each location. I believe in like 2011, the arrangements put in place from this court case ended. Now there is no diversity tracker, but the company boasts something like 51% of its employees identify as &quot;people of color&quot;.  I didn&#39;t see anyone flat out deny hiring someone because of race. But I did encounter backlash for hiring Blacks who were attractive and qualified, even by Abercrombie standards. Upper management never condoned hiring diverse people, just stupid co workers and staff.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0z6k5?context=5\">Sooo did you see any Asian people working at those stores?  My buddy probably wouldn&#39;t want to work there either.</a></td>\n<td align=\"left\">Yeah there&#39;s asians. I&#39;d say it&#39;s pretty obvious that white people get promoted and white models get selected to do the ads more than any other group however. But from a marketing standpoint, white people are who the company is trying to attract and imitate and whites have a more &quot;disposable&quot; income demographically speaking.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0s2jc?context=5\">With all the negative publicity and stereotypes about A&amp;F, what are some positive things you&#39;ve experienced? (about the company, clothes, anything)</a></td>\n<td align=\"left\">The jackets and hoodies fit really well. Although the pieces are all from the same sweatshops that other cheap clothes are from, they sometimes come out fitting well and slimming, for a petite person like me. All the other things we make are riddled with problems though.  Uh...other good things about the experience: good and cheap health benefits. I&#39;m sure they existed so that no one would go &#39;ugly&#39; or too &#39;sick&#39; to be gone long.  My favorite part of the job was my kids, my staff. I like to hire and train them and hear about where they are in their lives, etc.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0vk2f?context=5\">So we&#39;ve established that the front-line low level people have to be slim, attractive, etc..  What about the management that doesn&#39;t work the front lines? District manager and up. What did they look like? Did you find them all attractive/thin, etc?</a></td>\n<td align=\"left\">Everyone has to be thin and attractive. Everyone up the ladder has to be thin enough to fit in our clothing and wear them everyday in the corporate Home Office in Ohio. Oh it&#39;s so sad when someone gets too pregnant to fit into our clothes or has to lose baby weight. The pressure is unbelievable. I have noticed that older men get to have facial hair and they can wear anything from the store, where as store employees have to wear limited items. The only people who don&#39;t wear our stuff are servicemen who are contracted from outside the company. Even undercover security wears our clothes which blows their cover!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0xclm?context=5\">So what happens when a pregnant woman can no longer fit into the clothes? Are they then allowed to wear their own?</a></td>\n<td align=\"left\">She has to squeeze into them. You are allowed to wear other similar clothes but it&#39;s asking to be fired.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca16g6p?context=5\">Limited on which clothing they can wear? Is that limiting which clothing they can wear FROM a&amp;f? I too managed a retail store and it was just &#39;wear our clothes&#39;, not &#39;wear our specific pre chosen outfits&#39;.</a></td>\n<td align=\"left\">The clothing that employees can wear from A&amp;F is very limited. Options change with the season. Non ripped, dark skinny jeans are required and a collared button down white or navy blue shirt or skimpy blouse is the standard. Corporates can wear anything. There is some wiggle room. Since things are expensive, it&#39;s totally normal to wear the same shit everyday.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0ssye?context=5\">Is the company as loathe to hire minorities as it is unattractive or fat people?</a></td>\n<td align=\"left\">Ya. More than anything, A&amp;F hates and says blatantly in its interview guide to not hire a person if they are an &quot;introvert&quot;.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">There&#39;s a thing called the &quot;Cast-of Tracker&quot; that is your top ten most attractive and outgoing female and male models(salesfloor staff). (It is okay and encouraged for an ugly or chubby employee to only work in the back or with the night crew and not be on the salesfloor.) Every year the cast of gets their photo taken and submitted to corporate. Calendars and video propaganda are made and dispersed congratulating the sexiest store locations, etc. Models on the walls and bags are chosen from a national selection process that filters these cast of people. So looks are incredibly important to get corporate attention and therefore promotions.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0uh4u?context=5\">Have you ever actually witnessed a person being discriminated against on the basis of race, or material actively condoning this type of action?</a></td>\n<td align=\"left\">Yes, after I got promoted, I hired a new staff. Existing employees had no problem making comments to me about how I had &quot;jungle fever&quot; for hiring black people and questioned why I hired an Indian girl. I worked with them over time to exemplify and tell them how our generation needs to make conscious decisions about how we are going to treat people and that we need to reflect all the customers. Sales went up and the customers appreciated it. That is the mindset of my upbringing though, not Abercrombie&#39;s.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">A Spanish only speaking woman and her sons came into our store and were ridiculed by an associate of mine. The father translated to me their horror and embarrassment. I profusely apologized and felt just awful. The woman was crying. I disciplined that kid and he quit before I could get another reason to legally fire him. He had a clique of asses that worked there and I had to get rid of each of them for different reasons.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0v721?context=5\">What&#39;s up?  I heard that employees are required to say what&#39;s up when they make eye contact with a customer, is this true? </a></td>\n<td align=\"left\">You&#39;re required to say the current tagline to anyone within 15 seconds of them entering the store and that has been for a long time, &quot;Hey What&#39;s up&quot;. That&#39;s the simplest one. One time it was long and stupid, &quot;Hey How&#39;s it going? Have you tried our jeans? They&#39;ll make you look like a star. &quot;</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">If we say, &quot;Can I help you find something to go with that item you&#39;re holding?&quot; It means we&#39;re onto you trying to steal whatever you&#39;re holding.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0ruy0?context=5\">Do you agree with the company&#39;s hiring policies? And if they are ever &quot;too fat&quot; to hire do you tell them why they didn&#39;t get the job? Edit: spelling. </a></td>\n<td align=\"left\">I do not agree with the company in any way. I took the job after college when I couldn&#39;t find a job in my major and really really really needed the money for my family. I also was dying to work a full time job for the first time! What a disappointment.  People are never told why, or why not they are hired. There is a script for those questions and a script for nearly everything. Everything at the company has a predetermined response that we memorize. This predetermined agenda is referred to as &quot;The Program&quot;.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0sgxy?context=5\">Can you give us some examples?</a></td>\n<td align=\"left\">Person: &quot;The music is too loud.&quot; A&amp;F: Our music is set to an adjusted level. We can check to make sure this level is set correctly. Would you like to file a volume complaint so our technician can come check it?</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Person: Do you have anything in Black? A&amp;F: We don&#39;t make Black.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Person: Are you a racist company? A&amp;F: A&amp;F is proud to be a supporter of several diverse organizations and scholarship funds such as... person: &quot;Can i go in the fitting room with my friend?&quot; A&amp;F: &quot;No.&quot; Not unless you tell me physically disabled or that is your child that you want to go in with.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Secret shoppers actually check on these responses by testing employees undercover twice a month.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0vww1?context=5\">Why don&#39;t they make black? </a></td>\n<td align=\"left\">I think that would be too common of a color for them to make. They would sell a lot more though, and instead make neon colors that no one buys. Like I said, they don&#39;t do a lot of things that make sense.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0y9p5?context=5\">I remember seeing an article years ago about a girl who was black who was hired on and was only allowed to work in the backroom. Were you pressured to hire by race? and was the area you worked in predominantly white? and if so were you instructed to treat customers and employees differently?</a></td>\n<td align=\"left\">We were pressured to hire by race back when the diversity was a bigger issue. Each store has a diversity scorecard. You want to balance out those numbers and keep them in the positive because of the high turnover rate. A kid who interviews great but isn&#39;t scored as &quot;Great&quot; looking can get hired as a backroom/stockroom employee. But hey, there&#39;s some good looking kids there too. I got to say that. Obviously, you can&#39;t stretch things too far. If the kid isn&#39;t even close to the ideal A&amp;F look, it&#39;s going to be a constant battle with upper management to keep that kid on staff. You have to vouch for ugly hires. Even if they are the only ones who get the job done, management does not want to see them ever again.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0vhp1?context=5\">As an ex-A&amp;F worker, glad you got out. Smell the cologne-free fresh air!  The store I worked at was hit several times by shoplifters with bags that bypassed the magnetic security readers usually out front. Did you have issues like that, or with shoplifting in general?</a></td>\n<td align=\"left\">You know every store does.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0vku9?context=5\">It got frustrating when my manager started to check employees for shoplifting after closing hours, as well. That, and the cheesy intro video for every employee about the same thing.</a></td>\n<td align=\"left\">Ya well i hated having that too, especially as a model, not just a manager. But if you think about it, everything that&#39;s stolen goes through those doors and we still don&#39;t see it happen.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0xtm3?context=5\">What did you think about the ordeal with Jersey Shore&#39;s Situation? He was asked not to wear their clothes, then A&amp;F came out with a shirt that said &quot;Fitchuation&quot; and he sued them... </a></td>\n<td align=\"left\">I&#39;m proud to say I have never watched that show and am not familiar with the situation. Sounds comical, both lose. The people who design the clothes are former managers who go live at the Home Office- pretty much the nazi camp of Abercrombie. It&#39;s a literal campus in this Ohio forest with real deer and everyone wears flannel. Theres a cafeteria and a building for every department. They drink their own bottled &quot;Abercrombie &amp; Fitch&quot; water. Lame. I joke that it&#39;s an Aryan breeding ground and a big eugenics conspiracy.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0u87y?context=5\">Glad you got out! What do you do now?</a></td>\n<td align=\"left\">I&#39;m still happily unemployed and have been focused on taking a break. Working there kept me on my feet for over 40 hours a week. Chairs and sitting are not allowed, and the floors were concrete. My feet and back were shot for too long. I am doing some indie shorts now, something I&#39;d always wanted to do.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0u9e0?context=5\">What&#39;s one of the most outlandish things you&#39;ve seen in regards to the dress code rules. Are there any rules in regards to the dress code you thought were particularly ridiculous?</a></td>\n<td align=\"left\">Wearing sandals is mandatory. We are allowed, on paper, to wear some select shoes, but it is not encouraged. In fact, my bosses over the years are very disappointed and angry when they see you wearing shoes. I hate wearing the tight tight pants or jeggings. They&#39;re so tight, you get yeast infections and can&#39;t really move well enough to do your job. The dye on the jeans makes your legs turn blue.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">We&#39;re forced to wear flat sandals with no support or padding. Over time, employee&#39;s feet actually flatten. Their shoe size changes because the arch collapses in their foot.  I think that it&#39;s weird that even the CEO and corporate people have to wear the jeans, because it looks unprofessional.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Oh yeah, whenever I wore my glasses, i was quietly advised to not wear them again.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0si3a?context=5\">Is it just me or does this seem like a really random question? Might as well ask why they don&#39;t sell dynamite or dildos. </a></td>\n<td align=\"left\">No, the most extreme thing that they sell are racist shirts, sexist shirts and not the sizes xl for women. All the clothes are extremely small, especially the men&#39;s shirts and pants. This means only skinny people will wear it. Clever I suppose. The kids store also sold thongs a while back, that was in the news.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca102em?context=5\">What was the stupidest question you got? Also, were customers stuck up often?</a></td>\n<td align=\"left\">We have some stuck up customers. A lot of celebrities shop there too surprisingly. The stupidest questions we get are the pranks. People prank abercrombie a lot, like prank calling. People come in and take their shirts off and dance to the loud music to make fun of us, etc. Not aggravating though, just dumb. We ask for it.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0reeo?context=5\">Why did you have us remove the Tear tags as our store called them (the made by tag)???</a></td>\n<td align=\"left\">I don&#39;t believe I was there when this memo came through to instruct employees to remove tags. Sounds like one of the sweatshops printed a label that didn&#39;t comply with a federal fabric standard and you had to remove them for legal safe sale or something. In retail, there&#39;s a lot of mindless labor like that without explanation and that&#39;s why we are paid so little. But hey, we pick the job too!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0xmmm?context=5\">I just want to say thank you for hosting a GREAT AMA :) Do you see any hypocrisy when people call him ugly, while he is being attacked for similar reasons? (Although he&#39;s a far worse case for sure)</a></td>\n<td align=\"left\">Lol. You&#39;re right. There is hypocrisy but I never thought of it that way. I just feel frustrated that many CEOs and people in powerful positions are literally so stupid, useless and immature. I think if they were more educated and caring, we could really be in a much better place with better leaders to follow and companies that we could trust and support.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0w9z3?context=5\">Is there any schedule to the sales, or a &quot;best time&quot; to shop there? Obviously the clearance rack, but any secrets about the pricing or how it works would be cool to know. I actually do like some of their clothes (I&#39;m 31 and probably not hot enough to work there) but just can&#39;t imagine spending that much on clothes, yknow?</a></td>\n<td align=\"left\">The older something is, the cheaper it is. The best time would be in december because holiday sales. And right before school starts, there&#39;s always a huge jean sale that gets pretty good. Mens clothing is marked down every other Thursday and women&#39;s clothing is marked down every other Wednesday. You also can get coupon codes and good prices online or if you sign up for emails/text. They&#39;ll always let you know when the sales are. There&#39;s better clearance online. The outlets aren&#39;t worth your time either.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0sjmy?context=5\">Do you or other employees have any idea what the conditions are in the places where they make the clothes? What are the company instructions to say when people ask about that kind of thing?</a></td>\n<td align=\"left\">There is a bit on their website about the sweat shop conditions. They have gone through some steps to make sure they are like certified and official but I believe that doesn&#39;t mean anything. It usually means that, in that country of origin, the factory is vetted and workers get like a standard wage. That usually is equivalent to still just pennies in US dollars however.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I know that their contracted sweatshops are located almost all over the world from China to Bangladesh, Vietnam, Japan, etc. The shipments arrive with bugs in them from all over the world, how beautiful!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0sf0g?context=5\">Could you ever get that horrible stench out of your clothes?</a></td>\n<td align=\"left\">It would take more than one wash to do so. Some people really crave that smell. The colognes are shoplifted every hour, guaranteed. Some customers beg you to spray it on their purchases.  Guess what it does when you spray it on the clothes as much as we do? It permanently stains them! stupid stupid illogical Abercrombie.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0vew3?context=5\">So you only made 22k as a manager? How many hours did you work? Salary or hourly?</a></td>\n<td align=\"left\">As a new manager, you start at 29K. pretty pathetic. A store manager, who is usually top dog at a location gets 39K and that usually takes a year or 2 to get to. District managers make almost 60k and get a company car, but still have to work on their weekends.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca17lnq?context=5\">What would they do if they saw homeless people wearing their shirts? Would they attempt to buy them off the &quot;fat&quot; homeless people?</a></td>\n<td align=\"left\">We get so many people, out of the demographic A&amp;F targets, shopping there. They can only limit so much by price and select sizing. I know that whatever doesnt sell after going to outlets, doesn&#39;t get marked down and sent to Ross. It gets destroyed. A lot of companies literally incinerate their old and unbought products to keep its value. Hallmark used to do it, may still.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca1a0r3?context=5\">Do you think that should result in less/no tax breaks for an organization that destroys their unsold items?</a></td>\n<td align=\"left\">No, because that&#39;d be impossible and silly to regulate. It would mean a government branch that watches what people dispose or destroy. That&#39;s just impractical. I think it&#39;s wrong, but am not sure what I&#39;d do about it.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0rm4b?context=5\">Are you ugly?</a></td>\n<td align=\"left\">I am like most people: I have a longer list of what I don&#39;t like about my body and face than what I like.  I was surprised when I was hired. But people tell me I&#39;m beautiful and I&#39;ve always been very thin. I guess I&#39;m not ugly with my makeup on! A&amp;F really takes into account whether you look straight, act straight, and are &quot;natural&quot; looking and dress tastefully. Straight white teeth, clear skin, and preferably no extra piercings or tattoos are important.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca119ky?context=5\">Out of curiosity, along with the whole no tattoos and piercings rule, how do they feel about hair dyed something slightly unnatural?</a></td>\n<td align=\"left\">Hair dye changes are supposed to be discussed before occurring. Any unnatural, unclassic or untraditional makeup or nail polish or hair color and styles are not allowed. So if you have blonde highlights and you&#39;re black or asian or some race that is unbelievably blonde, they will pull you aside and talk to you about it.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">It&#39;s a bit extreme. Nothing besides a basic ponytail or bobby pin is allowed. Nail polish is prohibited unless pink or red or french tip only on toenails. No rhinestones or accessories or jewelry, besides a plain watch or wedding ring.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0tq79?context=5\">Did this job ever get you laid?</a></td>\n<td align=\"left\">Don&#39;t think so. I don&#39;t tell most people that I work there because they&#39;ll think I&#39;m stupid and racist and shallow. But there is a lot of sex and scandal within the company.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca10wm9?context=5\">Are they more likely to hire some one who has played a certain sport?</a></td>\n<td align=\"left\">Yes, or if you do anything outgoing or extracurricular. They love people who have been on reality shows or are in greek sororities and fraternities. They also love anyone who kisses ass and pretends to do what the brand is about. ex: I love abercrombie so I have a pet moose. or I love Hollister and I like surf all the time.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca132cw?context=5\">Do adults still buy and wear the brand ? I went to a wealthy high school and AF became a uniform. I wonder if those guys still shop there when older.</a></td>\n<td align=\"left\">Ruehl was such an impractical idea: a store targeted toward coed youth where each item costs hundreds of dollars,in the u.s. Abercrombie has failed to learn that girls and mothers make the purchasess in their stores and thats who they need to be appealing to to make any money.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca132cw?context=5\">What is the best qualit item you have to guys?.</a></td>\n<td align=\"left\">Yes, adults do buy the clothes and people with identity problems like middle aged men, elderly women and people covered in plastic surgery like the CEO.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0rt2g?context=5\">Do all the stores smell that bad?</a></td>\n<td align=\"left\">I bet. It is mandatory but I haven&#39;t stepped into all of the stores. A different scent is used in Hollister and in Abercrombie Kids, also our &quot;brands&quot; and stores.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0zfwt?context=5\">How much did you make as manager? Just out of curiosity, only answer if you want to!</a></td>\n<td align=\"left\">29k as starting manager, 39k as a store manager. You can&#39;t really argue or bargain with them, even if you threaten to leave. Theyre very stingy with money and pay the least of all retailers, I hear. They are annual raises but usually amount to cents or a a few bucks.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0y370?context=5\">I definitely stole from that store all the time when I was in high school. Nobody ever greeted me, or even really looked at me, so I grabbed what I wanted, and just walked out.</a></td>\n<td align=\"left\">Sooo many thieves. Hundreds. I&#39;ve learned that there are two kinds: one who have a conscious and those who don&#39;t. The ones who don&#39;t have a conscious just deny everything when you catch them redhanded! I&#39;ve caught them stealing while wearing stuff they stole previously. Lot of repeat offenders too.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0tph9?context=5\">Proof?</a></td>\n<td align=\"left\"><a href=\"http://imgur.com/KYKioce\">Link to imgur.com</a></td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0xdj2?context=5\">Only paid 22k/yr?  I hope you live somewhere affordable. </a></td>\n<td align=\"left\">It was 29k before taxes and i was living in a very expensive town where the cost of living is closer to 60k!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca1fapc?context=5\">Why do you think the company is allowed to discriminate on every level and openly not be an equal opportunity employer?  Do they have really good lawyers?  How often do they get sued?  Do y&#39;all have HR people at all?</a></td>\n<td align=\"left\">Yes theres HR. Theres a lawsuit about once a week it seems. Great lawyers. Everythings very careful and they settle all lawsuits. If you work here, you get more class action payouts than bonuses and raises combined.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca1698c?context=5\">What&#39;s the difference between a &quot;Model&quot; and an &quot;Impact Team Member&quot;?</a></td>\n<td align=\"left\">Model is a salesfloor associate. Impact team member is a stock room associate. They are meant to stay in the separate places. Models are outgoing and help people, maintain floor, operate register, fitting room, etc. Impact deal with replenishing sold items, prepping items, putting away shipment, maintaining stock. If you&#39;re not outgoing or scored as &quot;great&quot; looking, you are considered for a impact team member.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca14drv?context=5\">Question; would you hire someone who looked nice but was somewhat still an introvert?</a></td>\n<td align=\"left\">Oh ya. I hired a lot of people I shouldnt have by their standards. The interview guide is word for word. It tells you how to evaluate them. It says if the person is great looking and fits the brand style, then they are pretty much a shoe in.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Sometimes I got sappy and hired people who really needed a job and seemed hardworking, even though they werent great looking but just amazing, smart, dedicated, professional teenagers man. I hated turning those kids down because they didn&#39;t do anything wrong. We get great interviews from not great looking people and have to send them away. Real shame.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0tter?context=5\">Do you do background/credit checks on all your employees or just some?</a></td>\n<td align=\"left\">They do background checks on everyone.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/1ej8wy/i_was_an_abercrombie_fitch_manager_for_several/ca0ujnz?context=5\">Do you have any proof?</a></td>\n<td align=\"left\">Yea, I&#39;ll go get it some mail or paperwork with both our names on it. I just don&#39;t want my specific identity to be exposed for potential legal reasons.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Proof i worked there or proof of the managers? <a href=\"http://imgur.com/KYKioce\">Link to imgur.com</a></td>\n</tr>\n</tbody></table>\n\n<p><em>Last updated: 2013-05-21 22:07 UTC</em></p>\n\n<p><em>This post was generated by a robot! Send all complaints to <a href=\"/message/compose/?to=epsy\">epsy</a>.</em></p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "_comment_sort": null,
  "report_reasons": null,
  "name": "t3_1ejpng",
  "from": null,
  "hidden": false,
  "clicked": false,
  "media": null,
  "json_dict": null,
  "_api_link": "https://api.reddit.com/r/tabled/comments/1ejpng/table_iama_i_was_an_abercrombie_amp_fitch_manager/?ref=search_posts",
  "secure_media_embed": {},
  "mod_reports": [],
  "_orphaned": {},
  "_uniq": null,
  "num_comments": 0,
  "link_flair_text": null,
  "title": "[Table] IAmA: I was an Abercrombie &amp; Fitch manager for several years AMA",
  "_has_fetched": true,
  "author_flair_css_class": "tabler",
  "thumbnail": ""
}