{
  "clicked": false,
  "_replaced_more": false,
  "archived": true,
  "num_comments": 91,
  "created": 1353083200.0,
  "saved": false,
  "selftext": "*I'll try to keep this short as my English is not great (it's my second language), but I felt I had to write something about this.  Context is important, that is to say, it is important to look at history and try to see why things happened, and not repeat the same mistakes again.*\n\nI have seen a lot of coverage about Sinofsky's departure that has been very biased.  It's pretty clear that bloggers and certainly the Technorati did not like Sinofsky at all.  The reason for this is quite simple, he took Microsoft been being too open and transparent to a Microsoft where information is not disseminated so indiscriminately.   Apple has always been this way, so the individuals covering Apple expect this and do not really complain about this.  In fact, being secretive has benefited Apple very much in creating crazy amounts of hype.  To understand why Sinofsky did this, you have to take a look back at Windows Vista when it was code named Longhorn and put things in context and perspective.  \n\nLonghorn was a very ambitious project whose development dates back to 2001, shortly after the release of Windows XP.  Longhorn was originally slated to bring a ton of new features including WinFS, vector graphics, and radical new sidebar to replace the taskbar, and significant changes to the kernel.  It also would bring technologies named ‘Avalon and Indigo’ which eventually ended up as a much different technology called what we now know as Windows Presentation Foundation.  Longhorn was headed up by Jim Allchin who showed off a lot of what was planned for Longhorn at PDC 2003.  People were genuinely excited about what Microsoft was doing at this time, and Microsoft was the dominant technology company at this time too.  What we later found out was the demos showed at PDC 2003 were faked demos and concept videos, and not real code running.  If you look at Microsoft demos today, they always emphasize that this is real code running on a real machine in real time.  As we would find out, Microsoft overpromised and would severely under-deliver.  Over the next two years Jim Allchin would royally fuck up the development of Longhorn.  I remember installing Longhorn Build 4074 in 2004, and knowing that this project was in serious trouble.  In 2004 Microsoft decided to reset the project and essentially start from scratch.  For all intents and purposes it took 2 years to develop Windows Vista and it was released in 2006.  Jim Allchin retired at the end of the development of Vista.  Morale of Microsoft enthusiasts/fanboys was at an all-time low by time Vista was released.  An initially super-ambitious release was now much more mediocre and was plagued with a ton of hardware issues because the driver model was changed.  Vista was an okay product, but it stopped being defended among Microsoft supporters and this led to massive perception problems.  Apple starting to rise around this time too with iPod now gaining serious traction.  Microsoft failed to respond to Vista criticism; marketing has always been a problem at Microsoft.  \n\nNow to Sinfosky.  Sinofsky joined Microsoft in 1989 (the year I was born!) at the age of 23, straight after receiving a Master’s degree in computer science from the University of Massachusetts Amherst.  He rose to power by catching the attention of Bill Gates and becoming a technical assistant.  He was partially responsible for Gates releasing the “Internet Tidal Wave” memo in 1995 (Bing it).  A litter later, Sinofsky threatened to quit if he was not given a desired assignment.  Gates said that he couldn’t imagine Microsoft without Steven. As consolation, Microsoft's leadership at the time put some other products under Sinofsky’s control.  (From sfgate article)  This ultimately led to Sinofsky becoming in charge of Office, starting with Office 2000.  He became known for getting office released office on time, Office 2000, then Office XP, Office 2003, and finally Office 2007.  Interesting to note, Stephen Elop (now CEO of Nokia) oversaw Office after Sinofsky left to take over Windows.  Sinofsky’s first lieutenant Julie-Larson Green rose up with Sinofsky, and was responsible for introducing the ribbon in Office 2007.  Steve and Julie did have a relationship for a little bit, but that’s largely irrelevant.  \n\nSo, now Office 2007 has been released, Jim Allchin has retired, and we now have Bill Gates saying he will step down in 2008.  Bill Gates chose Ray Ozzie to be his replacement.  Ray Ozzie proved to be disastrous and had no vision for consumers. Ballmer has been CEO for a couple years now at this time. With Microsoft not wanting the next operating system to take 5 years to be released and clear hole in leadership, Steven Sinofsky stepped up to filled the gap. He was especially valuable because he had a proven track record of getting things done on time.  In addition he had overseen an ambitious version of Office that was just released (Office 2007) which had paid off well.  \n\nIn 2008 Sinofsky wrote a memo called Translucency vs. Transparency in a blogpost.  This really got bloggers pissed off.  And we went from a company that poured its heart out about Vista, to a company that basically said nothing about what it was going to do about Windows 7.  Sinfosky choose the philosophy of under-promising and over-delivering.  Sinofsky fired a bunch of people when he took over the Windows division, many who had led to the fuck-up that Vista was.  He also brought a lot of his own people from the Office side into the Windows division.  Sinofsky also eliminated a lot of the middle management.  This led to a lot of more senior executives either leaving Microsoft, or going to either Windows Azure or Windows Entertainment (Xbox) side of the company.  Notably, J Allard and Robbie Bach stepped down in 2010, many said this was related to Sinofsky but this simply is not the case.  Zune failure and a billion dollar right off due to overheating problems with xbox hardware contributed to them leaving. \n\nSinofsky ended up delivering a great product with Windows 7 and more importantly it was on time.  He brought a lot of changes to the start menu and how the taskbar works.  Sinofsky continued to rise and gain power within Microsoft as the development of Windows 8.   He and Julie-Larson Green took a serious look at where the world was going, and decided to radically overhaul Windows.  What we now have is Windows 8, which I’m sure all of you have been following.  Sinofsky also made many tough decisions which I think would not have a been made without him.  First, he did not allow a tablet version of the Windows Phone operating system.  Tablet sales have always been a subset of the phone sales.  More iphones sold than ipads, more android phones sold than android tablets, and more blackberrys sold than playbooks.  A very small number of Windows Phones had been sold, an even smaller number of Windows Phone Tablets would have been sold.  I’m sure it would have been a great product, but would ultimately be a waste of resources.  Windows Phone 7/7.5 also decided to go with managed code rather than native code.  In theory, this sounds great and there is a lot of promise to it, but it has not worked out well.  This is part of the reason Windows Phone has failed to attract many mobile developers who write native code applications on iOS.  The windows phone team implemented technologies such as silverlight, .net, xna as their development platform.   Sinofsky decided not to go with these and was ultimately correct.  The Windows Phone team switched over to the full Windows 8 kernel with Windows Phone 8, and you can now write applications in native code.  This was also partially made possible by Sinofsky’s work with porting the kernel to ARM.  Xna is now also gone for game development going forward, and I think this speaks to the speculation that Xbox.vnext will also be based on the Windows 8 kernel.  In fact David Cutler is now on the Xbox team (please read Showstoppers by Gary Pascal).  Sinofsky along with Jule-Larson Green were also very strong supporters of the Microsoft Surface and ensured that it was kept a secret.   \n\nSo, now we go to coverage from the Technorati regarding Steven Sinofsky.  I’m a MSFT fanboy, and am generally a fan of Paul Thurrott, Mary-Jo Foley, and many others.  However, they have been absolutely atrocious when it comes to covering Steve Sinofsky.  The hate Sinofsky because he has not openly given them information about Windows 7 and Windows 8 development and decided to keep more things secret.   This last week on Paul Thurrott’s two podcasts he openly admitted he hates Sinofsky because it made it harder for him to write his book.  Sinofsky did not give Thurrott internal builds of Windows 8, so he could write his book more easily.  Thurrott also believes he is entitled to get information from Microsoft because he writes about Microsoft and helps consumers with technical problems.  I am sure many of you remember Thurrott freaking out about Microsoft removing aero glass from Windows even though it was the right decision due to battery life.  Well it now turns out that Thurrott was only angry about it because he was forced to re-take screenshots for his book because now there was no aero.  Microsoft is a private corporation that can do what it wants and Thurrott is not owed anything.  Mary-Jo Foley also said she hates Sinofsky because he had her blacklisted from Microsoft.  Bloggers may be financially better off without Sinofsky because they can get more information and write more blog posts with more access to the company.  Lot of traffic also went to Sinofky’s own blog, instead of other blogs.  The pundits also say Sinofsky was hard to work with an arrogant.  It's clear they've never worked for a corporation.  Well Steve Jobs and Bill Gates were also arrogant, condescending and tough to work with.  Leaders have to make tough decisions and this will always piss some people off.  Other complaints include that he did not embrace Silverlight.  Silverlight was a bastardized version of WPF which was too resource intensive.  It’s dying.  Why embrace something that is dying?  Also the pundits suggest Scott Guthrie would be a great replacement for Sinofsky.  Are you fucking kidding me?  We need a person in charge who will fight for consumers and make radical changes, someone with a vision as Sinofsky had.  \n\nSinofsky has been nothing but excellent for Microsoft.  He has fought for consumers and made the tough decisions that others would not have.  Sinofsky made the trains run on time. He embraced the Metro design language, borrowing from the Zune team and Windows Phone team. It is quite clear that Sinofsky quit.  I believe he wanted more power or certain decisions to go his way that did not and he ultimately decided to quit.  Ballmer has been great at protecting himself and his position of CEO over the last decade.  I do not think he wanted Sinofsky to gain more power and potentially become CEO down the road. It's telling that he split Sinofsky's position to two women who I think he can easily control.  I think Sinofsky’s influence and legacy on the company will remain even though he is not there anymore.  More things are going to be kept secret until it is the appropriate time to release the information.   Microsoft will also get more and more into hardware.  I believe we will see Sinofsky back a few years from now as CEO of Microsoft.  \n\nEdit: Should also be noted that Thurrott was snubbed for an early SurfaceRT review and has been slamming it ever since.  What a crybaby. \n\n*Fuck, well I wrote a very long incoherent rambling mess, but I had to get this off my chest.  I’m posting this anyways; even though nobody will probably read this. Lol.*\n\n**tl;dr:** **Steven Sinofsky rocks and was good for Microsoft!  I also believe he quit on his own accord.  Bloggers hate him because they had a direct financial loss due to having less information about the company and ignore the good he did.**\n\nP.S. Love/Hate relationship with Sinofsky and bloggers can be traced way back to 2007 starting with Long Zheng http://www.istartedsomething.com/20071207/director-windows-disclosure/\n\n( ͡° ͜ʖ ͡°)",
  "mod_reports": [],
  "secure_media_embed": {},
  "edited": 1353342419.0,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>I&#39;ll try to keep this short as my English is not great (it&#39;s my second language), but I felt I had to write something about this.  Context is important, that is to say, it is important to look at history and try to see why things happened, and not repeat the same mistakes again.</em></p>\n\n<p>I have seen a lot of coverage about Sinofsky&#39;s departure that has been very biased.  It&#39;s pretty clear that bloggers and certainly the Technorati did not like Sinofsky at all.  The reason for this is quite simple, he took Microsoft been being too open and transparent to a Microsoft where information is not disseminated so indiscriminately.   Apple has always been this way, so the individuals covering Apple expect this and do not really complain about this.  In fact, being secretive has benefited Apple very much in creating crazy amounts of hype.  To understand why Sinofsky did this, you have to take a look back at Windows Vista when it was code named Longhorn and put things in context and perspective.  </p>\n\n<p>Longhorn was a very ambitious project whose development dates back to 2001, shortly after the release of Windows XP.  Longhorn was originally slated to bring a ton of new features including WinFS, vector graphics, and radical new sidebar to replace the taskbar, and significant changes to the kernel.  It also would bring technologies named ‘Avalon and Indigo’ which eventually ended up as a much different technology called what we now know as Windows Presentation Foundation.  Longhorn was headed up by Jim Allchin who showed off a lot of what was planned for Longhorn at PDC 2003.  People were genuinely excited about what Microsoft was doing at this time, and Microsoft was the dominant technology company at this time too.  What we later found out was the demos showed at PDC 2003 were faked demos and concept videos, and not real code running.  If you look at Microsoft demos today, they always emphasize that this is real code running on a real machine in real time.  As we would find out, Microsoft overpromised and would severely under-deliver.  Over the next two years Jim Allchin would royally fuck up the development of Longhorn.  I remember installing Longhorn Build 4074 in 2004, and knowing that this project was in serious trouble.  In 2004 Microsoft decided to reset the project and essentially start from scratch.  For all intents and purposes it took 2 years to develop Windows Vista and it was released in 2006.  Jim Allchin retired at the end of the development of Vista.  Morale of Microsoft enthusiasts/fanboys was at an all-time low by time Vista was released.  An initially super-ambitious release was now much more mediocre and was plagued with a ton of hardware issues because the driver model was changed.  Vista was an okay product, but it stopped being defended among Microsoft supporters and this led to massive perception problems.  Apple starting to rise around this time too with iPod now gaining serious traction.  Microsoft failed to respond to Vista criticism; marketing has always been a problem at Microsoft.  </p>\n\n<p>Now to Sinfosky.  Sinofsky joined Microsoft in 1989 (the year I was born!) at the age of 23, straight after receiving a Master’s degree in computer science from the University of Massachusetts Amherst.  He rose to power by catching the attention of Bill Gates and becoming a technical assistant.  He was partially responsible for Gates releasing the “Internet Tidal Wave” memo in 1995 (Bing it).  A litter later, Sinofsky threatened to quit if he was not given a desired assignment.  Gates said that he couldn’t imagine Microsoft without Steven. As consolation, Microsoft&#39;s leadership at the time put some other products under Sinofsky’s control.  (From sfgate article)  This ultimately led to Sinofsky becoming in charge of Office, starting with Office 2000.  He became known for getting office released office on time, Office 2000, then Office XP, Office 2003, and finally Office 2007.  Interesting to note, Stephen Elop (now CEO of Nokia) oversaw Office after Sinofsky left to take over Windows.  Sinofsky’s first lieutenant Julie-Larson Green rose up with Sinofsky, and was responsible for introducing the ribbon in Office 2007.  Steve and Julie did have a relationship for a little bit, but that’s largely irrelevant.  </p>\n\n<p>So, now Office 2007 has been released, Jim Allchin has retired, and we now have Bill Gates saying he will step down in 2008.  Bill Gates chose Ray Ozzie to be his replacement.  Ray Ozzie proved to be disastrous and had no vision for consumers. Ballmer has been CEO for a couple years now at this time. With Microsoft not wanting the next operating system to take 5 years to be released and clear hole in leadership, Steven Sinofsky stepped up to filled the gap. He was especially valuable because he had a proven track record of getting things done on time.  In addition he had overseen an ambitious version of Office that was just released (Office 2007) which had paid off well.  </p>\n\n<p>In 2008 Sinofsky wrote a memo called Translucency vs. Transparency in a blogpost.  This really got bloggers pissed off.  And we went from a company that poured its heart out about Vista, to a company that basically said nothing about what it was going to do about Windows 7.  Sinfosky choose the philosophy of under-promising and over-delivering.  Sinofsky fired a bunch of people when he took over the Windows division, many who had led to the fuck-up that Vista was.  He also brought a lot of his own people from the Office side into the Windows division.  Sinofsky also eliminated a lot of the middle management.  This led to a lot of more senior executives either leaving Microsoft, or going to either Windows Azure or Windows Entertainment (Xbox) side of the company.  Notably, J Allard and Robbie Bach stepped down in 2010, many said this was related to Sinofsky but this simply is not the case.  Zune failure and a billion dollar right off due to overheating problems with xbox hardware contributed to them leaving. </p>\n\n<p>Sinofsky ended up delivering a great product with Windows 7 and more importantly it was on time.  He brought a lot of changes to the start menu and how the taskbar works.  Sinofsky continued to rise and gain power within Microsoft as the development of Windows 8.   He and Julie-Larson Green took a serious look at where the world was going, and decided to radically overhaul Windows.  What we now have is Windows 8, which I’m sure all of you have been following.  Sinofsky also made many tough decisions which I think would not have a been made without him.  First, he did not allow a tablet version of the Windows Phone operating system.  Tablet sales have always been a subset of the phone sales.  More iphones sold than ipads, more android phones sold than android tablets, and more blackberrys sold than playbooks.  A very small number of Windows Phones had been sold, an even smaller number of Windows Phone Tablets would have been sold.  I’m sure it would have been a great product, but would ultimately be a waste of resources.  Windows Phone 7/7.5 also decided to go with managed code rather than native code.  In theory, this sounds great and there is a lot of promise to it, but it has not worked out well.  This is part of the reason Windows Phone has failed to attract many mobile developers who write native code applications on iOS.  The windows phone team implemented technologies such as silverlight, .net, xna as their development platform.   Sinofsky decided not to go with these and was ultimately correct.  The Windows Phone team switched over to the full Windows 8 kernel with Windows Phone 8, and you can now write applications in native code.  This was also partially made possible by Sinofsky’s work with porting the kernel to ARM.  Xna is now also gone for game development going forward, and I think this speaks to the speculation that Xbox.vnext will also be based on the Windows 8 kernel.  In fact David Cutler is now on the Xbox team (please read Showstoppers by Gary Pascal).  Sinofsky along with Jule-Larson Green were also very strong supporters of the Microsoft Surface and ensured that it was kept a secret.   </p>\n\n<p>So, now we go to coverage from the Technorati regarding Steven Sinofsky.  I’m a MSFT fanboy, and am generally a fan of Paul Thurrott, Mary-Jo Foley, and many others.  However, they have been absolutely atrocious when it comes to covering Steve Sinofsky.  The hate Sinofsky because he has not openly given them information about Windows 7 and Windows 8 development and decided to keep more things secret.   This last week on Paul Thurrott’s two podcasts he openly admitted he hates Sinofsky because it made it harder for him to write his book.  Sinofsky did not give Thurrott internal builds of Windows 8, so he could write his book more easily.  Thurrott also believes he is entitled to get information from Microsoft because he writes about Microsoft and helps consumers with technical problems.  I am sure many of you remember Thurrott freaking out about Microsoft removing aero glass from Windows even though it was the right decision due to battery life.  Well it now turns out that Thurrott was only angry about it because he was forced to re-take screenshots for his book because now there was no aero.  Microsoft is a private corporation that can do what it wants and Thurrott is not owed anything.  Mary-Jo Foley also said she hates Sinofsky because he had her blacklisted from Microsoft.  Bloggers may be financially better off without Sinofsky because they can get more information and write more blog posts with more access to the company.  Lot of traffic also went to Sinofky’s own blog, instead of other blogs.  The pundits also say Sinofsky was hard to work with an arrogant.  It&#39;s clear they&#39;ve never worked for a corporation.  Well Steve Jobs and Bill Gates were also arrogant, condescending and tough to work with.  Leaders have to make tough decisions and this will always piss some people off.  Other complaints include that he did not embrace Silverlight.  Silverlight was a bastardized version of WPF which was too resource intensive.  It’s dying.  Why embrace something that is dying?  Also the pundits suggest Scott Guthrie would be a great replacement for Sinofsky.  Are you fucking kidding me?  We need a person in charge who will fight for consumers and make radical changes, someone with a vision as Sinofsky had.  </p>\n\n<p>Sinofsky has been nothing but excellent for Microsoft.  He has fought for consumers and made the tough decisions that others would not have.  Sinofsky made the trains run on time. He embraced the Metro design language, borrowing from the Zune team and Windows Phone team. It is quite clear that Sinofsky quit.  I believe he wanted more power or certain decisions to go his way that did not and he ultimately decided to quit.  Ballmer has been great at protecting himself and his position of CEO over the last decade.  I do not think he wanted Sinofsky to gain more power and potentially become CEO down the road. It&#39;s telling that he split Sinofsky&#39;s position to two women who I think he can easily control.  I think Sinofsky’s influence and legacy on the company will remain even though he is not there anymore.  More things are going to be kept secret until it is the appropriate time to release the information.   Microsoft will also get more and more into hardware.  I believe we will see Sinofsky back a few years from now as CEO of Microsoft.  </p>\n\n<p>Edit: Should also be noted that Thurrott was snubbed for an early SurfaceRT review and has been slamming it ever since.  What a crybaby. </p>\n\n<p><em>Fuck, well I wrote a very long incoherent rambling mess, but I had to get this off my chest.  I’m posting this anyways; even though nobody will probably read this. Lol.</em></p>\n\n<p><strong>tl;dr:</strong> <strong>Steven Sinofsky rocks and was good for Microsoft!  I also believe he quit on his own accord.  Bloggers hate him because they had a direct financial loss due to having less information about the company and ignore the good he did.</strong></p>\n\n<p>P.S. Love/Hate relationship with Sinofsky and bloggers can be traced way back to 2007 starting with Long Zheng <a href=\"http://www.istartedsomething.com/20071207/director-windows-disclosure/\">http://www.istartedsomething.com/20071207/director-windows-disclosure/</a></p>\n\n<p>( ͡° ͜ʖ ͡°)</p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "user_reports": [],
  "over_18": false,
  "score": 76,
  "stickied": false,
  "domain": "self.microsoft",
  "is_self": true,
  "hidden": false,
  "_orphaned": {},
  "_api_link": "https://api.reddit.com/r/microsoft/comments/13ay9t/thoughts_on_steven_sinofsky/?ref=search_posts",
  "_comments_by_id": {},
  "visited": false,
  "thumbnail": "self",
  "_has_fetched": true,
  "gilded": 0,
  "hide_score": false,
  "_info_url": "https://api.reddit.com/api/info/",
  "created_utc": 1353079600.0,
  "subreddit_id": "t5_2qh1b",
  "id": "13ay9t",
  "_params": {},
  "media_embed": {},
  "name": "t3_13ay9t",
  "quarantine": false,
  "permalink": "https://www.reddit.com/r/microsoft/comments/13ay9t/thoughts_on_steven_sinofsky/?ref=search_posts",
  "ups": 76,
  "url": "https://www.reddit.com/r/microsoft/comments/13ay9t/thoughts_on_steven_sinofsky/",
  "title": "Thoughts on Steven Sinofsky"
}