{
  "clicked": false,
  "_replaced_more": false,
  "archived": true,
  "num_comments": 0,
  "created": 1331669640.0,
  "saved": false,
  "selftext": "**Verified?** *(This bot cannot verify AMAs just yet)*\n\n**Date:** 2012-03-13\n\n**[Link to submission](http://www.reddit.com/r/IAmA/comments/qu8xd/)**\n\n**[Link to my post](http://www.reddit.com/r/IAmA/comments/qu8xd/tabledresser/c40ndn8)**\n\n\n\nQuestions|Answers\n:--|:--\n[How much does a performer typically make?  How does it \\(assuming it does\\) vary depending on stunts performed?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40hf7s?context=5)|Unfortunately I can't disclose that due to contractual obligations ): But I can say that they do take good care of us.\n[:\\(  Thanks for answering though :\\)  Is there a \"corporate ladder\" per se in Cirque du Soleil, and if so, where would a performer look to \"climb\" next?  Is it another act, or management, or a show outside of Cirque du Soleil?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40hh9d?context=5)|There's always room for growth in the company, be it coaching, directing, working in technical or administrative jobs. You'd be amazed at the amount of different jobs there are in keeping this company and its shows going.\n[What are the parties like after the shows?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40hgfl?context=5)|Hahaha the premiere parties on big top shows can definitely be fun. Like when our acrobats show up break dancers at the clubs. Occasionally some celebrities will crash the parties.  \n[Wait wait wait. Did you just say that the acrobats have showed up break dancers in dance battles? That is crazy!!!!](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40lkhb?context=5)|Yea! It was awesome! Happened at a club in Boston.\n[What celebrities have been there? ](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40jkdp?context=5)|My favorite has been Pierce Brosnan, because I'm a huge 007 fan. Others have been Naomi Campbell, Reese Witherspoon, and Demi Moore to name a few.\n[1\\) How much turnover is there in performers? Are there new people all the time, or do they try to keep a cast together as long as possible?  2\\) Do they discourage romantic relationships between the performers? Do you think such things should be prohibited or not, and why?  3\\) Do you and the performers get input into things like costumes and story? How are those ideas developed and when do you come into the process?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40hy3r?context=5)|Hi! The cast usually stays the same for a good amount of time with the occasional exception of a few artists that leave or arrive every couple of months. The company doesn't discourage romantic relationships between the artists. I don't think they should unless it becomes an issue and affects the artists or the show professionally. We don't get to say much about costumes or story lines, especially on an older show (creations for new shows are a bit different). We of course can always voice our opinion and it's taken into consideration. \n[How did you get the job?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40hf77?context=5)|I was approached by a talent scout that had found my Jazz cd online back in 2002, he requested I record some cirque songs. After he flew from Montreal to Los Angeles where I had an audition in person. Within a week I got the job. \n[How did your parents take the 'I'm running off to join the circus' line you have to give them?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40x4o4?context=5)|Haha It wasn't too bad, because my mom traveled with me while I was on Quidam because I was a minor at the time. \n[How does a typical show go for you? Could you run us through a typical day?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40hnvl?context=5)|Depends on if its a one or two show day. Usually I have to be in 2 hours before the show. I start with my make up that takes me about 30-45 min to apply then I go to do a soundcheck with the rest of the band. It can take anywhere from 20-30min. Afterward I go backstage and start getting my costume on. (which takes a while; a whole team is required to help me put on the dress in Alegria). 5 min to animation, and I am backstage getting ready to walk on. :) If there are two shows that day, we have one hour and a half between shows, where we all go to the catering and grab a bite to eat. 3 hours later and I'm home. (hotel room) I hope this gives you an idea. :)\n[Does this become redundant? Do you ever feel like you're in ground hogs day? ](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40v3zj?context=5)|I enjoy each and every show, but to keep it fun and new we are always looking for fun things and little interactions with each other.\n[How did you join? What exactly do you do as a performer? What is your act I mean? What IS it like living out of a suitcase? What did your parents say when you joined the company? ](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40hfut?context=5)|I'm a singer and character. Living out of a suitcase can be difficult especially when moving from one climate to another, like Montreal to the South of France for example. Especially for someone like me that likes shoes so much! My parents have always been super supportive, and originally when I was in Quidam my mother traveled with me because I was a minor.\n[How old are you now/how long have you been touring?  Do you not keep many things as you have to keep traveling?  Do/did one of your parents travel with you when you were under 18?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40hgf7?context=5)|I'm 23 now, I've been touring off and on for ten years. Unfortunately I can't take too many things because we're only allowed two suitcases on arena tours. My mother traveled with me when I was in Quidam since I was a minor then.\n[What are they looking for in a singer? Any advice for someone who wants to audition for them?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40l0of?context=5)|Usually they look for versatile and interesting voices with professionalism.\n[That's amazing! Especially with all the teamwork involved in some of the routines. I didn't even know circus schools existed! What's the typical career length for someone on the show that consists of highly physical demanding stuff?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40hnts?context=5)|Well, I think it depends on the act and how the acrobat takes care of themselves (maybe a bit of genetics too). I know some acrobats that are well into their 40's and 50's that still perform! \n[What is a click track?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40kj04?context=5)|A track with a metronome click that helps keep the musicians and singers on tempo. The audience can't hear it because it's only in our in-ear monitors.\n[How often do performers get hurt?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40hg1h?context=5)|Serious injuries are very rare, but the normal wear and tear of physical activity does happen. We are lucky to have a great performance medicine team available in every show and training. \n[How long do you see yourself performing?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40hl7k?context=5)|I'm lucky that should be able to sing even from a wheelchair, if that answers your question. Look for me at the senior center! ;)\n[Cool IAmA. Seen Cirque du Soleil on TV a couple years back, real trippy stuff if I recall.  I got some tickets for the... Michael Jackson/Cirque du Soleil/Immortal Tour in november actually.  Don't really know what to expect, big fan of MJ though. You involved anyhow? If not do you know anything fun/nice/cool about it that you could share? ](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40hksz?context=5)|Cool! I'm glad you're going to get to see it. I personally haven't seen it yet, although my family has. I have a couple of friends working on the show. I've heard it's massive and more of a concert than a traditional Cirque du Soleil show. You'll love it! :D.\n[Do you ever have days where you wake up and just don't feel like performing? If so, does it affect your performance come showtime?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40i19c?context=5)|I can honestly say I've never had one of those days. Occasionally I get sick and sometimes have to sing through a sore throat which isn't fun. But you learn how to take care of your voice and body and how to work through it. :)\n[I would also like to listen.  Where did you originally post your jazz CD?  ](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40kgkb?context=5)|On my old website: [Link to www.denisegonzalez.com](http://www.denisegonzalez.com) You can take a listen there, under music.  hehe It's super old. I recorded it when I was 12.\n[This is amazing, I absolutely love Cirque. Maybe I saw you in Quidam!  If there was one thing about your job/the Cirque that you could change, what would it be?  Is there any rivalries between different performance teams? For example, the contortionists versus the strongmen? The clowns versus the musicians?  One of the shows I went to planted a performer in the audience and the clown kept picking on him throughout the show. Is that guy's job for the entire tour \"audience guy,\" or does he get to be in other aspects of the performance?  Thank you so much, this is a great AMA ](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40kjm2?context=5)|I don't think there are rivalries, but we definitely have fun with one another. ESPECIALLY in the dressing rooms... The boys are always pulling pranks on each other. Most shows when they pick someone from the audience, they genuinely are a patron. Yes, other shows have a bit more setup where he's in on the prank too.\n[Do you have any examples of pranks?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40njhv?context=5)|If it's Dralion then the guy in the audience is a performer. Just recently the guys put lotion on one of the other guys mirrors, and they tie each others shoe laces regularly. Those are just the PG pranks ;)\n[Yeah it wasn't clear it was a performer at first, it seemed like the clown just liked picking on him. But at the end when they pulled him on stage, he started tumbling and flipping with the performers so we knew. It was still great \\(I forget the show. Maybe Mystere?\\)](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40njhv?context=5)|Dralion, I believe.\n[What decided which shows you were going to perform in? Do you have a chance to change or move onto different ones? Any interesting stories to tell besides the ones posted already?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40i5ng?context=5)|The casting department as well as Artistic Directors decide who will be on what show. I have worked on Quidam, Corteo and most recently, Alegria. You'd  be surprised that although Cirque is such a big company, it still feels like a family. I find that there are people I know and have worked with on every cirque show. Last month I went to watch Totem in the Royal Albert Hall in London, and I thought I didn't know anybody on the show. After the show I heard my name being called as I was leaving the theatre, it was a technician I had worked with on Corteo! Turned out there were several people I knew on the show. :) It's a small cirque world.\n[What do you consider to be the most musically challenging show? Which one had been your musical favorite?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40j2oy?context=5)|Alegria by far has to be the most challenging musically, because you are constantly singing throughout the whole show and are singing styles that really vary in styles one right after another. It's my favorite to sing :)\n[What happens when you want to stop traveling and settle down?  Have you ever thought about that? ](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40hhra?context=5)|Well I'm doing some other things outside of Cirque, They're great at giving shorter contracts if you want. I just got home from France while touring with Alegria two days ago. And I'm getting ready to start on some new projects.\n[I saw Alegria in Omaha and the singing was hauntingly beautiful, but what is up with that wierd clown bit at the start of the second half of the show?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40khx1?context=5)|The little clown falls in love with the white singer!\n[Some of the people on that show are RIPPED. How many hours a day do they work out????](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40kurx?context=5)|Some stay after the show to workout for at least another hour. So they are easily doing 6 hours of exercise in a single day.\n[You say you joined as a minor.  did you ever finish school or is there a cirque traveling school? curious is all.](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40j9md?context=5)|Yes, I had a tutor with me on tour. I later went back to \"regular\" school and graduated highschool and went on to study at Pepperdine University.\n[Great AMA, thank you so-so much for sharing!  I guess I'll see you, in May, in Budapest. Yey!  How many changes should I expect in the show from the dvd version?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40j5x7?context=5)|No problem. I won't be in Budapest, I am not on the show at the moment. But you won't be disappointed, its a beautiful show! :D There are minor changes made to the show since the dvd. Let me know what you think of it! :D.\n[Have you met Guy Laliberte? if yes how was he?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40kc12?context=5)|Yes, I've met him several times. He would sometimes come to our premieres and even party with us after. He's a super nice and very approachable guy. :)\n[I saw Alegria in San Francisco in 2003 I think.  I'm guessing that wasn't you then!  Same character but she was much older.  Great voice though.  My question for you then: how hot does it get trying to perform while wearing that costume?!  Also, when I was there, they came out in the audience and tried to get my wife to participate, and she didn't want to.  They seemed really annoyed at that.  \\(We weren't in the \"ambience\" section or anything, so hadn't tacitly agreed to play along.\\)  Do you think they were really annoyed or was that part of the acting?  Finally: what is the worst disaster \\(that involved you\\) that occurred during a performance?  Wig fell off, had a coughing fit, etc?  Or is it so well rehearsed that it pretty much comes off without a hitch?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40l8gt?context=5)|No, that wasn't me.  That costume is by far the most uncomfortable thing ever! It's literally a cage and sitting down is a serious challenge! But the way it looks makes it totally worth it! I love it! :D I don't think they were annoyed. I know from previous experiences that it can be challenging to perform with a live audience that will react differently each and every time. For example there were several times when I went to go pick a guy from the audience to dance with me on stage, and he would refuse to come up with me. It can be tough. The worse disaster... hmm well now that you mention wigs falling off. My first show as black singer I lost my wig at the beginning of contortion. :S What a nightmare.\n[Your eyes are hypnotic. Will you marry me?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40ikvz?context=5)|Hehe *blush*\n[Not going to lie, I am a Cirque Du Soleil superfan. I've seen about 9 shows in person, one being Quidam\\(my favorite\\) which I waited 10 years to come back to the U.S, and paid and got front row seats last years. Pretty sure you were the singer too!\\(look very similar\\)  To the question! I've seen in most it seems like people are from all different nationalities and backrounds. How does this effect the way everyone mingles?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40kx93?context=5)|For the most part everyone gets along really well. Everyone has to be very open and understanding that we all come very different backgrounds and standards. \n[If it's not going in too far, could you tell us more about what happened?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40kpdj?context=5)|Well, I've seen a couple falls resulting in ankle/leg injuries. Nothing super serious.\n[Thanks for the answer, reality is always more realistic than I imagine it.  Also, I'm curious about the bald man you sang with at the show I saw \\(the one with the facial tattoos, I caught his name but I can't remember it right now\\). Is he a eunuch or can he just do that with his voice naturally?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40m36u?context=5)|What bald singer? On which show?\n[I loved Alegria. What you guys do is amazing. I am learning to juggle: any chance I will get my break on the Cirque stage?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40iub7?context=5)|Thank you! Cirque has a casting website where you can see what they are looking for at the moment, and where you can send your material.\n[Do you get offended when people refer to you as a carnie?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40ll2c?context=5)|The only people who have referred to me as a carnie have been my good friends, and they know I don't smell of cabbage. ;)\n[I saw *Alegria* in Kansas City at the Sprint Center. Did you sing in that show? Because that was an unbelievable performance. What did you think of our venue? Or do your performances blur into one another, making it hard to remember specific venues?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40kyql?context=5)|I was not with Alegria at the time. Yes, sometimes it's hard to remember what each venue looked like. :S.\n[Oh my god, you're the white dress in Allegria! <3 that show, <3 that song <3 everything about it!  I can't praise you and your fellow performers enough, you all give me a trip away from reality whenever I get the chance to attend a show...  What are you currently in?  Do you switch from show to show?  I mean, I remember recently that Allegria and Quidam both played Toronto \\(Allegria 2 years ago and Quidam just this year\\), would you have been part of that, just one of them, or neither?  Bleh, wtf... I'm trying to ask if you stick with one show for a few years or if you do one tour with one show, season ends, switch to a new show, etc...  Also, you've been with Cirque for 10 years or so, have you stuck to one region or traveled the world?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40lalq?context=5)|No, I did not perform in Toronto. I've recently been doing shorter contracts with cirque. Which is nice because I have time to do my personal projects.  No, I haven't stuck to a certain region, I've been lucky enough to have traveled the world with Cirque. :)\n[I went to a Cirque du Soleil-show in Moscow not too long ago. I liked it :\\)  So.. Do you like circus life?  Where are you right now? \\(Not trying to be creepy, just wondering..\\) How do your circus travel? Like, how do you travel between shows and such?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40ldj8?context=5)|I love it! It's definitely intense though. I'm back in Los Angeles where I live. When we travel from city to city we sometimes take chartered flights or if the distances are short, we travel on bus.\n[Were you singing for the Alegria show that staged in Dubai a couple of years ago? Like 2010 or 2009.](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40jj9y?context=5)|No, I joined Alegria at the end of 2011.\n[Wow, I saw Alegria in London a few years back, was incredible, as are the rest of the Cirque du soleil shows!  How long did it take until you were bored of your routine, or have you ever been bored of your routine after so long?  What is your favorite Cirque du soleil show?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40ldrh?context=5)|I have never gotten bored on stage. I think it's because you are constantly trying to make each show better than the last. You never settle and that's a great motivating challenge; at least for me it is. :) My favorite shows are Quidam, Alegria, and Love.\n[Is there a hierarchy of performers? Is there a rivalry or animosity between any of the groups? Also I seem to recall an article about how hard it is to manage the group, especially the clowns. The article mentions that they tend to be devastatingly depressed. How true is this?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40mpgq?context=5)|Um yes, I think there is a bit of a hierarchy amongst the artists. Usually the ones that have been there the longest (most seniority) or the coaches are at the top.  I've met both really happy clowns and sad clowns as well; just like I've met happy acrobats and sad acrobats. I think it's a bit of a generalization. \n[Quidam was such an awesome show. In the beginning, there is a solo for the female lead. Do you actually sing or is it recorded or sung backstage?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40rjro?context=5)|No, it's all sung live onstage. :)\n[Oh god, I love Cirque, I saw Alegria and Quidam when I was younger, and more recently, Ovo \\(all in the SF Bay Area\\). I'm in love with the soundtracks.  Are you the singer on the soundtracks as well as the live shows?  Were you in Ovo?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40lh6d?context=5)|No I'm not on the soundtracks or on Ovo. \n[That's awesome.  What are the perks of the job?  Are relationships allowed with other Cirque employees?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40l8ae?context=5)|Well, the places we get to travel to sometimes seriously feels like a paid vacation. I think that's the biggest perk of all. Last week we were in Nice, France. :) Relationships on tour are allowed, as long as it doesn't affect the work environment. Cirque doesn't get into people's personal life.\n[Denise, my wife and I just saw you in Dallas this past weekend; she had never been to a cirque show.  We loved the fact that the music is live... here are a couple of questions.  What is your favorite part of the show?  Have you ever seen any close calls with someone messing up or having an accident?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40n0jz?context=5)|Hi! I'm glad you and your wife enjoyed the show! Although, I wasn't preforming in Dallas this past week.  1.My favorite part of Quidam is the opening number \"Petit Salon\" when the chairs lift off the ground! Gives me chills every time! :D  2.The amount of time I spend on the road depends on the tour and my contract. For example I just arrived home, and it had been 4 months since I was last home.  3.Yes, I've seen a couple of close calls. Everyone messes up at one point or another, but it usually doesn't result in injury. \n[I've always wondered if there is room for people with multiple talents at Cirque du Soleil. I have a degree in music \\(I'm a tenor\\), but I also juggle \\(I can juggle seven balls pretty consistently\\). Everyone keeps telling me I should somehow do both, which I think is stupid, but if any organization could turn that thing into something presentable it would be Cirque du Soleil. Are there artists at Cirque that are the jack of all trades sort? Or do they search for artists with multiple talents?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40mjjd?context=5)|Absolutely! That makes your doubly special! They are always looking for new and unconventional acts! I say go for it! Send them a video! Check out their casting page. Best of luck to you! :)\n[Hey Denise, you are super cute, but can you introduce me to Felix Cane?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40kxrr?context=5)|Hehe thanks. I do not know Felix Cane. Sorry :(\n[I fell in love with \"O\" and have seen a few shows since, the emotional experience of watching is incredible.   I'm curious about one thing. I've heard from a forgotten source that many Cirque du Soleil performers are plucked from third world countries and, while treated better, are essentially slave performers. Also, what are the consequences for breaking your contract? ](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40lp4v?context=5)|I don't think this applies to cirque. Everyone is treated very well and is not take advantage of. Consequences of breaking your contract? Well I think it depends of each situation. I'm not entirely sure. This is VERY rare. \n[Do you have enough time at each location to experience the cities and countries where you perform or is it kind of limited?  Also, what's your favorite place you've travelled?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40lkao?context=5)|Yes, we manage to get out and explore the cities. I think Tokyo has been my favorite city! :D.\n[I've seen almost all the Cirque performances!  Alegria, Quidam and Corteo are my absolute favorites, so if you've performed in San Jose, I've seen you!  What's it like working with Benoit Jutras?  Did you cover for his daughter during the Quidam tours?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40nrmp?context=5)|I've actually never performed in San Jose with a Cirque show. Yes, I played Zoe in Quidam.\n[I've been to a few Cirque shows in Vegas and have never been disappointed.  The one thing that always stood out to me \\(even through all the makeup and such\\) is how goddamn attractive the vast majority of Cirque performers are \\(male and female alike.. straight guy here\\).  So my question is this: Is there some sort of breeding program amongst Cirque performers to create a master race of super good looking talented people, and if so, where can I purchase one \\(or more\\) of the offspring?? ](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40l32h?context=5)|Hahaha I think you're on to something! ;) \n[How do you feel about the shift from big-top shows to arena shows?  When I heard that the next local Cirque show was in a local arena, I was really upset. The whole idea behind the big-top was that cirque made it all very close and connected, an arena is just an arena.  As a performer, do you feel the same way? \\(That an arena show takes some of the audience connection away and lessens the experience?\\)](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40opcz?context=5)|I really enjoyed being able to experience both.  Bigtop definitely gives a more intimate feeling to both the audience as well as the artist. But arena enables Cirque to go to markets they otherwise would no be able to visit. And to tell you the truth, singing in front of all those people is even more exhilarating! \n[When you were a child how was your education handled? Have you completed high school and/or college?  How difficult is it to maintain a relationship \\(romantic or otherwise\\) with such time contraints?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40mpk4?context=5)|I had a tutor with me on tour, I finished highschool outside of cirque then went on to Pepperdine University. Relationships (both romantic and other) are difficult on tour since you are always traveling and so busy all the time. That's why many have their partners with them on tour.\n[2 questions: Have you worked with laur fugere? What do you think of her?   Second, It's my dream to produce my own shows much like cirque du soleil. I am almost finished with my schooling in music business in LA and would like to intern/become part of the cirque team. What is the most common way you see new people coming on board?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40msvk?context=5)|Yes, I know Laur. She coached me for Quidam 10 years ago! She is fantastic, and I learned so much from her. I guess the best way to join to team is to check out their jobs page on the cirque website. :) I wish you the best of luck! \n[I've spoken with her before good to hear she lives up to her reputation :\\) I noticed you do your own makeup, do most of the performers have to do everything themselves\\(aside costumes\\)? What kind of training do you have to do to keep up with the show and its extensive requirements? How much of it do you have to do on your own and how much is given to you?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40nb69?context=5)|Yes, all artists do their own makeup. On a weekly basis, there is only about one day of training. The shows alone keep everyone in pretty good shape! It's a lot of work!\n[What color and style underwear are you wearing?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40sjge?context=5)|Your mamma's granny panties! ;)\n[How much work/practice goes into the creation of a new Cirque show? Do you start prepping weeks in advance? Months?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40mtfi?context=5)|There is A LOT of work that goes into a new show. MONTHS and MONTHS in advance. \n[I have considered doing technical work for cirque. How difficult is the coordination between: acrobats, dancers, and various other performers, with the technical crew, and equipment.   Secondly, how far in advance do the crew arrive to set up the rig?   Also do the acrobats sometimes request to be there when their act pieces are flown to make sure it feels safe for them?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40n0qw?context=5)|There is a lot of coordination between artistic/logistic/technical/and administrative departments on tour.  On big top, the technical team arrives about a week before the artists do, and on arena they arrive a day before the artists.  I've never seen an artist request to be there when their act pieces are shipped/ or flown. Everything is taken really well care of and there are rarely any problems. :)\n[How did you go to school?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40lepg?context=5)|I had a tutor on tour with me. 5 days a week, but there was the perk of no homework! :D  I had a tutor on tour with me :)\n[How long is it between being given the lyrics and having to learn the song\\(s\\) and the show starting to be shown to the public?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40lli2?context=5)|Usually about a month (or more) is the amount of training time before a singer will be put on stage.\n[Can i hear you sing Alegria? That lady that did the initial tour in US was my all time favourite singer of all shows. just curious if you could do the main chorus or something?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40qh2c?context=5)|I'll try to post a video. I have a couple of snippets on my youtube channel if you'd like to hear: [Link to www.youtube.com](http://www.youtube.com/watch?v=bnm8kDnA6iY&list=UU7Ao3CGCf6OQrEqdY5cbfrw&index=7&feature=plc)  \n[You have a great voice. you are far hotter than the OG Alegria singer i saw back in the days - but i think she sounded better for that song \\(duh she wrote it\\) not to cut you - your voice in insane and you are far more beautiful.   Btw that dress the black/white one - that is hot!! do you get to keep your uniforms? I wonder if they sell it.](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c4113hm?context=5)|Haha thanks! No, we don't get to keep the costumes.\n[I saw Alegria a few years ago and got hooked immediately. The music got to me, more than any of the other \\(albeit stunning\\) spectacle. René Dupéré is amazing. What's it like to work with him?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40ldki?context=5)|I agree! I love the music to Alegria. I have personally never met René. :(\n[If I want to see Alegria in Europe this year, which venue would you recommend? :\\)](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40nt8j?context=5)|I'm sure Paris would be a cool place to go see Alegria! :) \n[What is it like being in a circus? Is it a very close community or do people just do their jobs separately? ](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40irlm?context=5)|For the most part, it's a very close community. We all care for one another and become like a family. :)\n[What is your favourite act to watch in each of the shows?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40m4g1?context=5)|I usually love all aerial acts, and handbalancing!\n[Just saw Quidam Thursday when it was in Texas. How much free reign over acts do the performers have? Is everything carefully planned out by the artistic directors or could a performer decide they wanted to do some more backflips and just add those in themselves?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40oi9c?context=5)|It's a bit of both. The artists can change certain moves that would showcase their strengths.\n[How much do you make?  What sort of sexcapades go on in the cirucs?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40vcdg?context=5)|I can't share that information due to contractual obligations. Sorry. hahah No sexcapades. \n[I've seen several different cirque shows, but one thing I can't figure out is what language is that? Or is it even a language at all? ](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40m9na?context=5)|Most of the songs are made up lyrics to sound like a language. \n[I just saw Alegria a few months ago in Florida, and it was great!  Was that you I saw?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40m05c?context=5)|No, I joined in Europe.  No, that wasn't me. I joined Alegria in Europe.\n[Were you at the San Jose showing? I just saw it Saturday.](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40m90v?context=5)|No, I wasn't there.\n[Oh wow. Will you be in Hidalgo, TX tomorrow through Sunday? I plan on getting tickets to go.  Edit: I guess, I should be asking, are you preforming in Dralion?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40p672?context=5)|No, I'm not in Dralion. \n[What do you think differentiates Cirque from other circuses/entertainment in general?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40luwz?context=5)|Although I have never worked in a \"real\" Circus,  I believe Cirque is different from other circuses because: the size of the company, They are constantly looking for new ideas in unconventional places, they have branched into other things such as resident shows, movies, and soundtracks, and the most obvious, they don't use animals. I think Cirque is more like Entertainment in general. Many of our tour managers etc. have come from the rock n' roll tours. The set up, is very similar. \n[Dudee just sat down and watched alegria yesterday, haha so that was you on the DVD? The white singer?](http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40msu9?context=5)|No, that wasn't me.\n\n\n*Last updated: 2012-03-17 14:09 UTC*\n\n*This post was generated by a robot! Send all complaints to [epsy](/message/compose/?to=epsy).*\n\n",
  "mod_reports": [],
  "secure_media_embed": {},
  "author_flair_css_class": "tabler",
  "edited": true,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Verified?</strong> <em>(This bot cannot verify AMAs just yet)</em></p>\n\n<p><strong>Date:</strong> 2012-03-13</p>\n\n<p><strong><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/\">Link to submission</a></strong></p>\n\n<p><strong><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/tabledresser/c40ndn8\">Link to my post</a></strong></p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Questions</th>\n<th align=\"left\">Answers</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40hf7s?context=5\">How much does a performer typically make?  How does it (assuming it does) vary depending on stunts performed?</a></td>\n<td align=\"left\">Unfortunately I can&#39;t disclose that due to contractual obligations ): But I can say that they do take good care of us.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40hh9d?context=5\">:(  Thanks for answering though :)  Is there a &quot;corporate ladder&quot; per se in Cirque du Soleil, and if so, where would a performer look to &quot;climb&quot; next?  Is it another act, or management, or a show outside of Cirque du Soleil?</a></td>\n<td align=\"left\">There&#39;s always room for growth in the company, be it coaching, directing, working in technical or administrative jobs. You&#39;d be amazed at the amount of different jobs there are in keeping this company and its shows going.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40hgfl?context=5\">What are the parties like after the shows?</a></td>\n<td align=\"left\">Hahaha the premiere parties on big top shows can definitely be fun. Like when our acrobats show up break dancers at the clubs. Occasionally some celebrities will crash the parties.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40lkhb?context=5\">Wait wait wait. Did you just say that the acrobats have showed up break dancers in dance battles? That is crazy!!!!</a></td>\n<td align=\"left\">Yea! It was awesome! Happened at a club in Boston.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40jkdp?context=5\">What celebrities have been there? </a></td>\n<td align=\"left\">My favorite has been Pierce Brosnan, because I&#39;m a huge 007 fan. Others have been Naomi Campbell, Reese Witherspoon, and Demi Moore to name a few.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40hy3r?context=5\">1) How much turnover is there in performers? Are there new people all the time, or do they try to keep a cast together as long as possible?  2) Do they discourage romantic relationships between the performers? Do you think such things should be prohibited or not, and why?  3) Do you and the performers get input into things like costumes and story? How are those ideas developed and when do you come into the process?</a></td>\n<td align=\"left\">Hi! The cast usually stays the same for a good amount of time with the occasional exception of a few artists that leave or arrive every couple of months. The company doesn&#39;t discourage romantic relationships between the artists. I don&#39;t think they should unless it becomes an issue and affects the artists or the show professionally. We don&#39;t get to say much about costumes or story lines, especially on an older show (creations for new shows are a bit different). We of course can always voice our opinion and it&#39;s taken into consideration.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40hf77?context=5\">How did you get the job?</a></td>\n<td align=\"left\">I was approached by a talent scout that had found my Jazz cd online back in 2002, he requested I record some cirque songs. After he flew from Montreal to Los Angeles where I had an audition in person. Within a week I got the job.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40x4o4?context=5\">How did your parents take the &#39;I&#39;m running off to join the circus&#39; line you have to give them?</a></td>\n<td align=\"left\">Haha It wasn&#39;t too bad, because my mom traveled with me while I was on Quidam because I was a minor at the time.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40hnvl?context=5\">How does a typical show go for you? Could you run us through a typical day?</a></td>\n<td align=\"left\">Depends on if its a one or two show day. Usually I have to be in 2 hours before the show. I start with my make up that takes me about 30-45 min to apply then I go to do a soundcheck with the rest of the band. It can take anywhere from 20-30min. Afterward I go backstage and start getting my costume on. (which takes a while; a whole team is required to help me put on the dress in Alegria). 5 min to animation, and I am backstage getting ready to walk on. :) If there are two shows that day, we have one hour and a half between shows, where we all go to the catering and grab a bite to eat. 3 hours later and I&#39;m home. (hotel room) I hope this gives you an idea. :)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40v3zj?context=5\">Does this become redundant? Do you ever feel like you&#39;re in ground hogs day? </a></td>\n<td align=\"left\">I enjoy each and every show, but to keep it fun and new we are always looking for fun things and little interactions with each other.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40hfut?context=5\">How did you join? What exactly do you do as a performer? What is your act I mean? What IS it like living out of a suitcase? What did your parents say when you joined the company? </a></td>\n<td align=\"left\">I&#39;m a singer and character. Living out of a suitcase can be difficult especially when moving from one climate to another, like Montreal to the South of France for example. Especially for someone like me that likes shoes so much! My parents have always been super supportive, and originally when I was in Quidam my mother traveled with me because I was a minor.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40hgf7?context=5\">How old are you now/how long have you been touring?  Do you not keep many things as you have to keep traveling?  Do/did one of your parents travel with you when you were under 18?</a></td>\n<td align=\"left\">I&#39;m 23 now, I&#39;ve been touring off and on for ten years. Unfortunately I can&#39;t take too many things because we&#39;re only allowed two suitcases on arena tours. My mother traveled with me when I was in Quidam since I was a minor then.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40l0of?context=5\">What are they looking for in a singer? Any advice for someone who wants to audition for them?</a></td>\n<td align=\"left\">Usually they look for versatile and interesting voices with professionalism.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40hnts?context=5\">That&#39;s amazing! Especially with all the teamwork involved in some of the routines. I didn&#39;t even know circus schools existed! What&#39;s the typical career length for someone on the show that consists of highly physical demanding stuff?</a></td>\n<td align=\"left\">Well, I think it depends on the act and how the acrobat takes care of themselves (maybe a bit of genetics too). I know some acrobats that are well into their 40&#39;s and 50&#39;s that still perform!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40kj04?context=5\">What is a click track?</a></td>\n<td align=\"left\">A track with a metronome click that helps keep the musicians and singers on tempo. The audience can&#39;t hear it because it&#39;s only in our in-ear monitors.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40hg1h?context=5\">How often do performers get hurt?</a></td>\n<td align=\"left\">Serious injuries are very rare, but the normal wear and tear of physical activity does happen. We are lucky to have a great performance medicine team available in every show and training.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40hl7k?context=5\">How long do you see yourself performing?</a></td>\n<td align=\"left\">I&#39;m lucky that should be able to sing even from a wheelchair, if that answers your question. Look for me at the senior center! ;)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40hksz?context=5\">Cool IAmA. Seen Cirque du Soleil on TV a couple years back, real trippy stuff if I recall.  I got some tickets for the... Michael Jackson/Cirque du Soleil/Immortal Tour in november actually.  Don&#39;t really know what to expect, big fan of MJ though. You involved anyhow? If not do you know anything fun/nice/cool about it that you could share? </a></td>\n<td align=\"left\">Cool! I&#39;m glad you&#39;re going to get to see it. I personally haven&#39;t seen it yet, although my family has. I have a couple of friends working on the show. I&#39;ve heard it&#39;s massive and more of a concert than a traditional Cirque du Soleil show. You&#39;ll love it! :D.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40i19c?context=5\">Do you ever have days where you wake up and just don&#39;t feel like performing? If so, does it affect your performance come showtime?</a></td>\n<td align=\"left\">I can honestly say I&#39;ve never had one of those days. Occasionally I get sick and sometimes have to sing through a sore throat which isn&#39;t fun. But you learn how to take care of your voice and body and how to work through it. :)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40kgkb?context=5\">I would also like to listen.  Where did you originally post your jazz CD?  </a></td>\n<td align=\"left\">On my old website: <a href=\"http://www.denisegonzalez.com\">Link to www.denisegonzalez.com</a> You can take a listen there, under music.  hehe It&#39;s super old. I recorded it when I was 12.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40kjm2?context=5\">This is amazing, I absolutely love Cirque. Maybe I saw you in Quidam!  If there was one thing about your job/the Cirque that you could change, what would it be?  Is there any rivalries between different performance teams? For example, the contortionists versus the strongmen? The clowns versus the musicians?  One of the shows I went to planted a performer in the audience and the clown kept picking on him throughout the show. Is that guy&#39;s job for the entire tour &quot;audience guy,&quot; or does he get to be in other aspects of the performance?  Thank you so much, this is a great AMA </a></td>\n<td align=\"left\">I don&#39;t think there are rivalries, but we definitely have fun with one another. ESPECIALLY in the dressing rooms... The boys are always pulling pranks on each other. Most shows when they pick someone from the audience, they genuinely are a patron. Yes, other shows have a bit more setup where he&#39;s in on the prank too.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40njhv?context=5\">Do you have any examples of pranks?</a></td>\n<td align=\"left\">If it&#39;s Dralion then the guy in the audience is a performer. Just recently the guys put lotion on one of the other guys mirrors, and they tie each others shoe laces regularly. Those are just the PG pranks ;)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40njhv?context=5\">Yeah it wasn&#39;t clear it was a performer at first, it seemed like the clown just liked picking on him. But at the end when they pulled him on stage, he started tumbling and flipping with the performers so we knew. It was still great (I forget the show. Maybe Mystere?)</a></td>\n<td align=\"left\">Dralion, I believe.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40i5ng?context=5\">What decided which shows you were going to perform in? Do you have a chance to change or move onto different ones? Any interesting stories to tell besides the ones posted already?</a></td>\n<td align=\"left\">The casting department as well as Artistic Directors decide who will be on what show. I have worked on Quidam, Corteo and most recently, Alegria. You&#39;d  be surprised that although Cirque is such a big company, it still feels like a family. I find that there are people I know and have worked with on every cirque show. Last month I went to watch Totem in the Royal Albert Hall in London, and I thought I didn&#39;t know anybody on the show. After the show I heard my name being called as I was leaving the theatre, it was a technician I had worked with on Corteo! Turned out there were several people I knew on the show. :) It&#39;s a small cirque world.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40j2oy?context=5\">What do you consider to be the most musically challenging show? Which one had been your musical favorite?</a></td>\n<td align=\"left\">Alegria by far has to be the most challenging musically, because you are constantly singing throughout the whole show and are singing styles that really vary in styles one right after another. It&#39;s my favorite to sing :)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40hhra?context=5\">What happens when you want to stop traveling and settle down?  Have you ever thought about that? </a></td>\n<td align=\"left\">Well I&#39;m doing some other things outside of Cirque, They&#39;re great at giving shorter contracts if you want. I just got home from France while touring with Alegria two days ago. And I&#39;m getting ready to start on some new projects.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40khx1?context=5\">I saw Alegria in Omaha and the singing was hauntingly beautiful, but what is up with that wierd clown bit at the start of the second half of the show?</a></td>\n<td align=\"left\">The little clown falls in love with the white singer!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40kurx?context=5\">Some of the people on that show are RIPPED. How many hours a day do they work out????</a></td>\n<td align=\"left\">Some stay after the show to workout for at least another hour. So they are easily doing 6 hours of exercise in a single day.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40j9md?context=5\">You say you joined as a minor.  did you ever finish school or is there a cirque traveling school? curious is all.</a></td>\n<td align=\"left\">Yes, I had a tutor with me on tour. I later went back to &quot;regular&quot; school and graduated highschool and went on to study at Pepperdine University.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40j5x7?context=5\">Great AMA, thank you so-so much for sharing!  I guess I&#39;ll see you, in May, in Budapest. Yey!  How many changes should I expect in the show from the dvd version?</a></td>\n<td align=\"left\">No problem. I won&#39;t be in Budapest, I am not on the show at the moment. But you won&#39;t be disappointed, its a beautiful show! :D There are minor changes made to the show since the dvd. Let me know what you think of it! :D.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40kc12?context=5\">Have you met Guy Laliberte? if yes how was he?</a></td>\n<td align=\"left\">Yes, I&#39;ve met him several times. He would sometimes come to our premieres and even party with us after. He&#39;s a super nice and very approachable guy. :)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40l8gt?context=5\">I saw Alegria in San Francisco in 2003 I think.  I&#39;m guessing that wasn&#39;t you then!  Same character but she was much older.  Great voice though.  My question for you then: how hot does it get trying to perform while wearing that costume?!  Also, when I was there, they came out in the audience and tried to get my wife to participate, and she didn&#39;t want to.  They seemed really annoyed at that.  (We weren&#39;t in the &quot;ambience&quot; section or anything, so hadn&#39;t tacitly agreed to play along.)  Do you think they were really annoyed or was that part of the acting?  Finally: what is the worst disaster (that involved you) that occurred during a performance?  Wig fell off, had a coughing fit, etc?  Or is it so well rehearsed that it pretty much comes off without a hitch?</a></td>\n<td align=\"left\">No, that wasn&#39;t me.  That costume is by far the most uncomfortable thing ever! It&#39;s literally a cage and sitting down is a serious challenge! But the way it looks makes it totally worth it! I love it! :D I don&#39;t think they were annoyed. I know from previous experiences that it can be challenging to perform with a live audience that will react differently each and every time. For example there were several times when I went to go pick a guy from the audience to dance with me on stage, and he would refuse to come up with me. It can be tough. The worse disaster... hmm well now that you mention wigs falling off. My first show as black singer I lost my wig at the beginning of contortion. :S What a nightmare.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40ikvz?context=5\">Your eyes are hypnotic. Will you marry me?</a></td>\n<td align=\"left\">Hehe <em>blush</em></td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40kx93?context=5\">Not going to lie, I am a Cirque Du Soleil superfan. I&#39;ve seen about 9 shows in person, one being Quidam(my favorite) which I waited 10 years to come back to the U.S, and paid and got front row seats last years. Pretty sure you were the singer too!(look very similar)  To the question! I&#39;ve seen in most it seems like people are from all different nationalities and backrounds. How does this effect the way everyone mingles?</a></td>\n<td align=\"left\">For the most part everyone gets along really well. Everyone has to be very open and understanding that we all come very different backgrounds and standards.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40kpdj?context=5\">If it&#39;s not going in too far, could you tell us more about what happened?</a></td>\n<td align=\"left\">Well, I&#39;ve seen a couple falls resulting in ankle/leg injuries. Nothing super serious.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40m36u?context=5\">Thanks for the answer, reality is always more realistic than I imagine it.  Also, I&#39;m curious about the bald man you sang with at the show I saw (the one with the facial tattoos, I caught his name but I can&#39;t remember it right now). Is he a eunuch or can he just do that with his voice naturally?</a></td>\n<td align=\"left\">What bald singer? On which show?</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40iub7?context=5\">I loved Alegria. What you guys do is amazing. I am learning to juggle: any chance I will get my break on the Cirque stage?</a></td>\n<td align=\"left\">Thank you! Cirque has a casting website where you can see what they are looking for at the moment, and where you can send your material.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40ll2c?context=5\">Do you get offended when people refer to you as a carnie?</a></td>\n<td align=\"left\">The only people who have referred to me as a carnie have been my good friends, and they know I don&#39;t smell of cabbage. ;)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40kyql?context=5\">I saw <em>Alegria</em> in Kansas City at the Sprint Center. Did you sing in that show? Because that was an unbelievable performance. What did you think of our venue? Or do your performances blur into one another, making it hard to remember specific venues?</a></td>\n<td align=\"left\">I was not with Alegria at the time. Yes, sometimes it&#39;s hard to remember what each venue looked like. :S.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40lalq?context=5\">Oh my god, you&#39;re the white dress in Allegria! &lt;3 that show, &lt;3 that song &lt;3 everything about it!  I can&#39;t praise you and your fellow performers enough, you all give me a trip away from reality whenever I get the chance to attend a show...  What are you currently in?  Do you switch from show to show?  I mean, I remember recently that Allegria and Quidam both played Toronto (Allegria 2 years ago and Quidam just this year), would you have been part of that, just one of them, or neither?  Bleh, wtf... I&#39;m trying to ask if you stick with one show for a few years or if you do one tour with one show, season ends, switch to a new show, etc...  Also, you&#39;ve been with Cirque for 10 years or so, have you stuck to one region or traveled the world?</a></td>\n<td align=\"left\">No, I did not perform in Toronto. I&#39;ve recently been doing shorter contracts with cirque. Which is nice because I have time to do my personal projects.  No, I haven&#39;t stuck to a certain region, I&#39;ve been lucky enough to have traveled the world with Cirque. :)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40ldj8?context=5\">I went to a Cirque du Soleil-show in Moscow not too long ago. I liked it :)  So.. Do you like circus life?  Where are you right now? (Not trying to be creepy, just wondering..) How do your circus travel? Like, how do you travel between shows and such?</a></td>\n<td align=\"left\">I love it! It&#39;s definitely intense though. I&#39;m back in Los Angeles where I live. When we travel from city to city we sometimes take chartered flights or if the distances are short, we travel on bus.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40jj9y?context=5\">Were you singing for the Alegria show that staged in Dubai a couple of years ago? Like 2010 or 2009.</a></td>\n<td align=\"left\">No, I joined Alegria at the end of 2011.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40ldrh?context=5\">Wow, I saw Alegria in London a few years back, was incredible, as are the rest of the Cirque du soleil shows!  How long did it take until you were bored of your routine, or have you ever been bored of your routine after so long?  What is your favorite Cirque du soleil show?</a></td>\n<td align=\"left\">I have never gotten bored on stage. I think it&#39;s because you are constantly trying to make each show better than the last. You never settle and that&#39;s a great motivating challenge; at least for me it is. :) My favorite shows are Quidam, Alegria, and Love.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40mpgq?context=5\">Is there a hierarchy of performers? Is there a rivalry or animosity between any of the groups? Also I seem to recall an article about how hard it is to manage the group, especially the clowns. The article mentions that they tend to be devastatingly depressed. How true is this?</a></td>\n<td align=\"left\">Um yes, I think there is a bit of a hierarchy amongst the artists. Usually the ones that have been there the longest (most seniority) or the coaches are at the top.  I&#39;ve met both really happy clowns and sad clowns as well; just like I&#39;ve met happy acrobats and sad acrobats. I think it&#39;s a bit of a generalization.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40rjro?context=5\">Quidam was such an awesome show. In the beginning, there is a solo for the female lead. Do you actually sing or is it recorded or sung backstage?</a></td>\n<td align=\"left\">No, it&#39;s all sung live onstage. :)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40lh6d?context=5\">Oh god, I love Cirque, I saw Alegria and Quidam when I was younger, and more recently, Ovo (all in the SF Bay Area). I&#39;m in love with the soundtracks.  Are you the singer on the soundtracks as well as the live shows?  Were you in Ovo?</a></td>\n<td align=\"left\">No I&#39;m not on the soundtracks or on Ovo.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40l8ae?context=5\">That&#39;s awesome.  What are the perks of the job?  Are relationships allowed with other Cirque employees?</a></td>\n<td align=\"left\">Well, the places we get to travel to sometimes seriously feels like a paid vacation. I think that&#39;s the biggest perk of all. Last week we were in Nice, France. :) Relationships on tour are allowed, as long as it doesn&#39;t affect the work environment. Cirque doesn&#39;t get into people&#39;s personal life.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40n0jz?context=5\">Denise, my wife and I just saw you in Dallas this past weekend; she had never been to a cirque show.  We loved the fact that the music is live... here are a couple of questions.  What is your favorite part of the show?  Have you ever seen any close calls with someone messing up or having an accident?</a></td>\n<td align=\"left\">Hi! I&#39;m glad you and your wife enjoyed the show! Although, I wasn&#39;t preforming in Dallas this past week.  1.My favorite part of Quidam is the opening number &quot;Petit Salon&quot; when the chairs lift off the ground! Gives me chills every time! :D  2.The amount of time I spend on the road depends on the tour and my contract. For example I just arrived home, and it had been 4 months since I was last home.  3.Yes, I&#39;ve seen a couple of close calls. Everyone messes up at one point or another, but it usually doesn&#39;t result in injury.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40mjjd?context=5\">I&#39;ve always wondered if there is room for people with multiple talents at Cirque du Soleil. I have a degree in music (I&#39;m a tenor), but I also juggle (I can juggle seven balls pretty consistently). Everyone keeps telling me I should somehow do both, which I think is stupid, but if any organization could turn that thing into something presentable it would be Cirque du Soleil. Are there artists at Cirque that are the jack of all trades sort? Or do they search for artists with multiple talents?</a></td>\n<td align=\"left\">Absolutely! That makes your doubly special! They are always looking for new and unconventional acts! I say go for it! Send them a video! Check out their casting page. Best of luck to you! :)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40kxrr?context=5\">Hey Denise, you are super cute, but can you introduce me to Felix Cane?</a></td>\n<td align=\"left\">Hehe thanks. I do not know Felix Cane. Sorry :(</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40lp4v?context=5\">I fell in love with &quot;O&quot; and have seen a few shows since, the emotional experience of watching is incredible.   I&#39;m curious about one thing. I&#39;ve heard from a forgotten source that many Cirque du Soleil performers are plucked from third world countries and, while treated better, are essentially slave performers. Also, what are the consequences for breaking your contract? </a></td>\n<td align=\"left\">I don&#39;t think this applies to cirque. Everyone is treated very well and is not take advantage of. Consequences of breaking your contract? Well I think it depends of each situation. I&#39;m not entirely sure. This is VERY rare.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40lkao?context=5\">Do you have enough time at each location to experience the cities and countries where you perform or is it kind of limited?  Also, what&#39;s your favorite place you&#39;ve travelled?</a></td>\n<td align=\"left\">Yes, we manage to get out and explore the cities. I think Tokyo has been my favorite city! :D.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40nrmp?context=5\">I&#39;ve seen almost all the Cirque performances!  Alegria, Quidam and Corteo are my absolute favorites, so if you&#39;ve performed in San Jose, I&#39;ve seen you!  What&#39;s it like working with Benoit Jutras?  Did you cover for his daughter during the Quidam tours?</a></td>\n<td align=\"left\">I&#39;ve actually never performed in San Jose with a Cirque show. Yes, I played Zoe in Quidam.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40l32h?context=5\">I&#39;ve been to a few Cirque shows in Vegas and have never been disappointed.  The one thing that always stood out to me (even through all the makeup and such) is how goddamn attractive the vast majority of Cirque performers are (male and female alike.. straight guy here).  So my question is this: Is there some sort of breeding program amongst Cirque performers to create a master race of super good looking talented people, and if so, where can I purchase one (or more) of the offspring?? </a></td>\n<td align=\"left\">Hahaha I think you&#39;re on to something! ;)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40opcz?context=5\">How do you feel about the shift from big-top shows to arena shows?  When I heard that the next local Cirque show was in a local arena, I was really upset. The whole idea behind the big-top was that cirque made it all very close and connected, an arena is just an arena.  As a performer, do you feel the same way? (That an arena show takes some of the audience connection away and lessens the experience?)</a></td>\n<td align=\"left\">I really enjoyed being able to experience both.  Bigtop definitely gives a more intimate feeling to both the audience as well as the artist. But arena enables Cirque to go to markets they otherwise would no be able to visit. And to tell you the truth, singing in front of all those people is even more exhilarating!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40mpk4?context=5\">When you were a child how was your education handled? Have you completed high school and/or college?  How difficult is it to maintain a relationship (romantic or otherwise) with such time contraints?</a></td>\n<td align=\"left\">I had a tutor with me on tour, I finished highschool outside of cirque then went on to Pepperdine University. Relationships (both romantic and other) are difficult on tour since you are always traveling and so busy all the time. That&#39;s why many have their partners with them on tour.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40msvk?context=5\">2 questions: Have you worked with laur fugere? What do you think of her?   Second, It&#39;s my dream to produce my own shows much like cirque du soleil. I am almost finished with my schooling in music business in LA and would like to intern/become part of the cirque team. What is the most common way you see new people coming on board?</a></td>\n<td align=\"left\">Yes, I know Laur. She coached me for Quidam 10 years ago! She is fantastic, and I learned so much from her. I guess the best way to join to team is to check out their jobs page on the cirque website. :) I wish you the best of luck!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40nb69?context=5\">I&#39;ve spoken with her before good to hear she lives up to her reputation :) I noticed you do your own makeup, do most of the performers have to do everything themselves(aside costumes)? What kind of training do you have to do to keep up with the show and its extensive requirements? How much of it do you have to do on your own and how much is given to you?</a></td>\n<td align=\"left\">Yes, all artists do their own makeup. On a weekly basis, there is only about one day of training. The shows alone keep everyone in pretty good shape! It&#39;s a lot of work!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40sjge?context=5\">What color and style underwear are you wearing?</a></td>\n<td align=\"left\">Your mamma&#39;s granny panties! ;)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40mtfi?context=5\">How much work/practice goes into the creation of a new Cirque show? Do you start prepping weeks in advance? Months?</a></td>\n<td align=\"left\">There is A LOT of work that goes into a new show. MONTHS and MONTHS in advance.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40n0qw?context=5\">I have considered doing technical work for cirque. How difficult is the coordination between: acrobats, dancers, and various other performers, with the technical crew, and equipment.   Secondly, how far in advance do the crew arrive to set up the rig?   Also do the acrobats sometimes request to be there when their act pieces are flown to make sure it feels safe for them?</a></td>\n<td align=\"left\">There is a lot of coordination between artistic/logistic/technical/and administrative departments on tour.  On big top, the technical team arrives about a week before the artists do, and on arena they arrive a day before the artists.  I&#39;ve never seen an artist request to be there when their act pieces are shipped/ or flown. Everything is taken really well care of and there are rarely any problems. :)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40lepg?context=5\">How did you go to school?</a></td>\n<td align=\"left\">I had a tutor on tour with me. 5 days a week, but there was the perk of no homework! :D  I had a tutor on tour with me :)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40lli2?context=5\">How long is it between being given the lyrics and having to learn the song(s) and the show starting to be shown to the public?</a></td>\n<td align=\"left\">Usually about a month (or more) is the amount of training time before a singer will be put on stage.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40qh2c?context=5\">Can i hear you sing Alegria? That lady that did the initial tour in US was my all time favourite singer of all shows. just curious if you could do the main chorus or something?</a></td>\n<td align=\"left\">I&#39;ll try to post a video. I have a couple of snippets on my youtube channel if you&#39;d like to hear: <a href=\"http://www.youtube.com/watch?v=bnm8kDnA6iY&amp;list=UU7Ao3CGCf6OQrEqdY5cbfrw&amp;index=7&amp;feature=plc\">Link to www.youtube.com</a></td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c4113hm?context=5\">You have a great voice. you are far hotter than the OG Alegria singer i saw back in the days - but i think she sounded better for that song (duh she wrote it) not to cut you - your voice in insane and you are far more beautiful.   Btw that dress the black/white one - that is hot!! do you get to keep your uniforms? I wonder if they sell it.</a></td>\n<td align=\"left\">Haha thanks! No, we don&#39;t get to keep the costumes.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40ldki?context=5\">I saw Alegria a few years ago and got hooked immediately. The music got to me, more than any of the other (albeit stunning) spectacle. René Dupéré is amazing. What&#39;s it like to work with him?</a></td>\n<td align=\"left\">I agree! I love the music to Alegria. I have personally never met René. :(</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40nt8j?context=5\">If I want to see Alegria in Europe this year, which venue would you recommend? :)</a></td>\n<td align=\"left\">I&#39;m sure Paris would be a cool place to go see Alegria! :)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40irlm?context=5\">What is it like being in a circus? Is it a very close community or do people just do their jobs separately? </a></td>\n<td align=\"left\">For the most part, it&#39;s a very close community. We all care for one another and become like a family. :)</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40m4g1?context=5\">What is your favourite act to watch in each of the shows?</a></td>\n<td align=\"left\">I usually love all aerial acts, and handbalancing!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40oi9c?context=5\">Just saw Quidam Thursday when it was in Texas. How much free reign over acts do the performers have? Is everything carefully planned out by the artistic directors or could a performer decide they wanted to do some more backflips and just add those in themselves?</a></td>\n<td align=\"left\">It&#39;s a bit of both. The artists can change certain moves that would showcase their strengths.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40vcdg?context=5\">How much do you make?  What sort of sexcapades go on in the cirucs?</a></td>\n<td align=\"left\">I can&#39;t share that information due to contractual obligations. Sorry. hahah No sexcapades.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40m9na?context=5\">I&#39;ve seen several different cirque shows, but one thing I can&#39;t figure out is what language is that? Or is it even a language at all? </a></td>\n<td align=\"left\">Most of the songs are made up lyrics to sound like a language.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40m05c?context=5\">I just saw Alegria a few months ago in Florida, and it was great!  Was that you I saw?</a></td>\n<td align=\"left\">No, I joined in Europe.  No, that wasn&#39;t me. I joined Alegria in Europe.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40m90v?context=5\">Were you at the San Jose showing? I just saw it Saturday.</a></td>\n<td align=\"left\">No, I wasn&#39;t there.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40p672?context=5\">Oh wow. Will you be in Hidalgo, TX tomorrow through Sunday? I plan on getting tickets to go.  Edit: I guess, I should be asking, are you preforming in Dralion?</a></td>\n<td align=\"left\">No, I&#39;m not in Dralion.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40luwz?context=5\">What do you think differentiates Cirque from other circuses/entertainment in general?</a></td>\n<td align=\"left\">Although I have never worked in a &quot;real&quot; Circus,  I believe Cirque is different from other circuses because: the size of the company, They are constantly looking for new ideas in unconventional places, they have branched into other things such as resident shows, movies, and soundtracks, and the most obvious, they don&#39;t use animals. I think Cirque is more like Entertainment in general. Many of our tour managers etc. have come from the rock n&#39; roll tours. The set up, is very similar.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/qu8xd/iama_cirque_du_soleil_singer_i_have_been_on_three/c40msu9?context=5\">Dudee just sat down and watched alegria yesterday, haha so that was you on the DVD? The white singer?</a></td>\n<td align=\"left\">No, that wasn&#39;t me.</td>\n</tr>\n</tbody></table>\n\n<p><em>Last updated: 2012-03-17 14:09 UTC</em></p>\n\n<p><em>This post was generated by a robot! Send all complaints to <a href=\"/message/compose/?to=epsy\">epsy</a>.</em></p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "user_reports": [],
  "author_flair_text": "",
  "over_18": false,
  "score": 29,
  "stickied": false,
  "domain": "self.tabled",
  "is_self": true,
  "hidden": false,
  "_orphaned": {},
  "_api_link": "https://api.reddit.com/r/tabled/comments/quxtq/table_iama_cirque_du_soleil_singer_i_have_been_on/?ref=search_posts",
  "_comments_by_id": {},
  "visited": false,
  "thumbnail": "",
  "_has_fetched": true,
  "gilded": 0,
  "hide_score": false,
  "_info_url": "https://api.reddit.com/api/info/",
  "created_utc": 1331669640.0,
  "subreddit_id": "t5_2tkmw",
  "id": "quxtq",
  "_params": {},
  "media_embed": {},
  "name": "t3_quxtq",
  "quarantine": false,
  "permalink": "https://www.reddit.com/r/tabled/comments/quxtq/table_iama_cirque_du_soleil_singer_i_have_been_on/?ref=search_posts",
  "ups": 29,
  "url": "https://www.reddit.com/r/tabled/comments/quxtq/table_iama_cirque_du_soleil_singer_i_have_been_on/",
  "title": "[Table] IAmA Cirque du Soleil singer, I have been on three shows. I started when I was 13. AMA"
}