{
  "selftext": "http://www.wsj.com/articles/electric-car-pioneer-musk-charges-head-on-at-detroit-1421033527?mod=WSJ_hp_RightTopStories\n\nText from article: Musk Charges head on at Detroit\n\n\n\nWhen Elon Musk , who loudly disdains the traditional auto industry, makes his first public appearance in Detroit in two years on Tuesday, it will be easy to see how much has changed since then.\n\nMr. Musk’s Tesla Motors Inc. is worth six times more in stock-market value. He is pushing hard to sell 500,000 vehicles a year by 2020, up from 90 a day in the third quarter. And giant auto makers are on a collision course with Tesla like never before, with General Motors Co. showing off a new electric car at the Detroit auto show on Monday.\n\nMr. Musk’s response? He says he doesn’t plan to change a thing, from his proclivity for F-bombs to double duty as chief executive of rocket makerSpace Exploration Technologies Corp., or SpaceX, to a hands-on obsession with the tiniest operational and car-design details at Tesla.\n\nHe calls himself a “nano-manager,” works about 100 hours a week and still runs the auto maker largely as he did before it sold the first Tesla Roadster in 2008.\n\n“I have OCD on product-related issues,” he says with a laugh. “I always see what’s... wrong. Would you want that? When I see a car or a rocket or spacecraft, I only see what’s wrong. I never see what’s right. It’s not a recipe for happiness.”\n\n\n\nIn a speech Tuesday at an auto-show event, Mr. Musk is expected to criticize larger auto makers for not responding to Tesla even more aggressively. He denounces the rest of the industry as only halfheartedly trying to produce battery-powered cars for the masses, not just early adopters.\n\nMore than a decade after launching Tesla, the 43-year-old Mr. Musk has gained lots of believers in his brash, iconoclastic quest to run gas guzzlers off the road. Tesla is worth $26 billion in stock-market value, nearly half the size of GM or Ford Motor Co. GM sold more than 27,000 new vehicles a day in the third quarter—or about 90 every five minutes.\n\nPanasonic Corp. will invest as much as $2 billion toward the $5 billion cost of Tesla’s new lithium-ion battery factory, under construction in Nevada. The state approved $1.3 billion in tax breaks and other incentives for Tesla, among the most ever in the U.S. for any company.\n\nFuturis Automotive is getting a new factory the size of three football fields in Newark, Calif., ready to rev up production of seats and headliners for Tesla, which builds its Model S sedans nearby. Headliners are attached to the inside roof of cars.\n\n“We decided to move into the Bay Area because we believe in what Tesla is trying to do,” says Sam Coughlin, Futuris’s top executive in the U.S. He plans to double the number of jobs at the factory this year, including engineers wooed away from Detroit.\n\nJust 0.3% of the new vehicles registered in the U.S. since the start of 2012 are fully electric-powered, according to IHS Automotive, part of IHS Inc. Tesla had more than 20% of all electric-car sales in that period.\n\nTesla’s growing size is one reason why Audi AG , the premium-car brand owned by Germany’s Volkswagen AG , is working on a compact sport-utility vehicle designed to go 300 miles on an electric charge, according to Audi executives. Tesla plans to start selling its new Model X sport-utility vehicle in the third quarter of 2015.\n\nSpaceX Stumbles in Test to Show Reusable Rocket Technology Advances\nGM’s new Chevrolet Bolt would be aimed directly at Tesla’s forthcoming Model 3 and capable of traveling 200 miles with one charge, according to people familiar with the strategy. A concept version of the Bolt will be unveiled at the industry’s biggest annual event, the North American International Auto Show, which starts Monday.\n\nThe Chevrolet Volt, a plug-in hybrid introduced by GM in 2010, has an electric range of just 38 miles, though next year’s model will go 50 miles.\n\nSome Tesla investors are jittery, pushing the Palo Alto, Calif., company’s share price down more than 10% in the past three months, compared with gains by GM, Ford and major U.S. stock indexes during the same period.\n\nAnalysts at some securities firms are worried that the 40% slide in gasoline prices at the pump since Aprilmight hurt demand for electric cars. Tesla shares also are being hurt by concerns that a several-month delay in the Model X rollout will make it harder for Mr. Musk to hit the 2020 sales target.\n\nBut because of the unwavering intensity of Mr. Musk’s determination, investors have flocked to Tesla and shrug off the fact that the auto maker has never made an annual profit. They don’t care that the Model S usually sells for more than $100,000, or about double the company’s original projection.\n\nIn the first nine months of 2014, Tesla had revenue of $2.24 billion, up 60% from a year earlier. Its net loss grew to $186.4 million from $57.7 million.\n\n“There are a lot of investors whose main thesis is based on Elon Musk and his vision for the future of vehicles,” says Colin Langan, an auto-industry analyst at UBS AG. He has a “neutral” rating on Tesla shares.\n\nCristiano Carlutti is more blunt. He ran Tesla’s operations in Europe before leaving in 2011 for startup auto makerQoros Auto Co., where he is a top executive. Tesla was “driven and is still driven by Elon Musk,” says Mr. Carlutti. “You take Elon out of the company, [and] the market cap would go down 80%.”\n\nMr. Musk says the auto maker has “certainly gotten a lot of attention, but we make very few cars, so the effect is small. The value that Tesla can provide is…an example of what is possible.”\n\nHe said when Tesla stock hit $280 last year that it was probably too high. According to the company’s latest proxy filing, Mr. Musk owns a 27% stake worth about $7.2 billion based on Friday’s closing price of $206.66.\n\nWith characteristic directness, Mr. Musk admits Tesla has no succession plan. The company also has suffered from growing pains because of his domineering presence.\n\nSome high-level managers quit or were fired after clashing with the chief executive over Mr. Musk’s insistence on doing things his way, according to interviews with dozens of current and former Tesla executives.\n\nDuring the launch of Model S production in 2012, Mr. Musk set up an office in the middle of the factory floor in Fremont, Calif., and took over when hiccups emerged. He told workers to buy USB cables at nearby Fry’s Electronics Inc. stores after a snarl delayed a shipment from China.\n\n“If you are fighting a battle, it’s way better if you are at the front lines. A general behind the lines is going to lose,” he says.\n\nElon Musk, right, and Peter Thiel, shown in 2000, made a fortune when PayPal was sold to eBay in 2002 for $1.4 billion. \nElon Musk, right, and Peter Thiel, shown in 2000, made a fortune when PayPal was sold to eBay in 2002 for $1.4 billion. \nThree weeks before the first Model S was delivered to a customer, Mr. Musk demanded that the sedans have larger rear tires because he felt they looked better, according to people involved in the process. The last-minute design switch also required complicated tweaks to the car’s anti-lock braking system and carried the risk of shortening the car’s driving range.\n\nTesla engineers protested that the electronics supplier might not honor its liability warranty if Mr. Musk went through with the bigger tires.\n\nMr. Musk didn’t back down. The engineers did. And the design change went through without a hitch, says someone who was in the room when the decision was made.\n\nCurrent and former Tesla executives say few people are willing to disagree openly with Mr. Musk. Those who fall out of sync with him often don’t stay long. Turnover in the auto industry can be especially problematic because it takes several years to design and roll out new models.\n\nLast month, the chief of Tesla’s operations in China, Veronica Wu, left the company after being there for only one year. Tesla hasn’t announced the reason for her sudden departure, and she didn’t respond to emails or other attempts to contact her.\n\nMr. Musk “is very, very demanding, and it’s not the right speed for a lot of people,” says Ricardo Reyes, who left Tesla in 2012 as its vice president of public relations and was rehired in November when his successor quit after about six months on the job.\n\nENTREPRENEUR’S STEADY SUCCESS\n\n1999: Elon Musk, at 28, sells mapping-software company for $307 million, earning $22 million.\n\n2002: Gets huge payday from PayPal’s sale to eBay for $1.4 billion, starts SpaceX.\n\n2004: Invests in Tesla and becomes fledging auto maker’s chairman.\n\n2008: Tesla delivers first battery-powered Roadster. Falcon 1 rocket makes successful launch. Musk becomes Tesla’s CEO.\n\n2010: Tesla goes public.\n\n2012: Model S sedan is delivered to first customer.\n\n2014: SpaceX wins $2.6 billion NASA contract to send astronauts to International Space Station. Tesla picks Nevada as site for $5 billion battery ‘gigafactory.’ Company’s stock-market value tops $30 billion.\n\nBefore that, Tesla went nearly two years without a director of the public-relations department.\n\nThe car maker’s CEO “pushes really hard, and it’s mission driven. It’s constant activity,” Mr. Reyes adds. “He used to say that he only wanted ‘special forces’ working for him. No normal people.”\n\nMr. Musk agrees that he can be exacting but denies that he fires employees without reason or cause. “I don’t like to fire people. I hate it,” he says. “The issue I’ve had is firing people too late, not too early.”\n\nMedia relations have been largely handled by Mr. Musk himself, who writes his own tweets and blog posts. Last Monday, he answered questions on social news forum Reddit Inc., telling readers about a favorite Winston Churchill quote about surmounting adversity: “If you’re going through hell, keep going.”\n\nIn the legal department, Tesla went through three general counsels from 2009 to 2012. It then had no general counsel for more than two years until Mr. Musk promoted his former divorce lawyer, Todd Maron.\n\nMr. Maron had been Tesla’s deputy general counsel. Mr. Musk says the turnover was an aberration, noting that SpaceX has had the same chief counsel for a decade.\n\nLast spring, Tesla pushed out its sales chief in Europe shortly after the company started selling cars there. An executive overseeing Japan and Hong Kong was let go last summer.\n\n\nGeorge Blankenship, the former Apple Inc. executive who came up with Tesla’s slick retail-store concept, left Tesla in 2013 after his responsibilities were scaled back. He didn’t respond to requests for comment.\n\nTesla’s chief engineer quit months before the Model S sedan was launched, while Mr. Musk fired the chief chassis engineer working on the Model X sport-utility vehicle, saying at the time that he asked for the resignation because “there wasn’t a good fit for him.” Tesla shares fell 17% after the auto maker announced the two departures but then rebounded.\n\nSeveral people at Tesla say Mr. Musk has looked on and off for years for a chief operating officer who would be the auto maker’s second-highest executive. Outsiders approached by Mr. Musk include Andy Palmer, the former chief planning officer at Nissan Motor Co. who left the Japanese auto maker in September to become CEO of Aston Martin Lagonda Ltd., a person familiar with the matter says.\n\nTesla technology chief JB Straubel, chief designer Franz von Holzhausen, business-development chief Diarmuid O’Connell and finance chief Deepak Ahuja have been at Tesla for at least five years and are considered close to Mr. Musk.\n\nBut none of them is seen as likely to succeed him. Mr. Musk has indicated that he will stay in the top job for at least four or five more years.\n\nTesla often spurns job candidates who have “too much automotive experience,” says someone recently recruited by the company. During an interview, the person was told that Tesla considered it a major negative to have extensive GM experience on a résumé. Tesla didn’t offer the person a job.\n\nPeople who have worked at Tesla say Mr. Musk’s ambition and vision are inspiring. But the hard-charging culture can be exhausting, they say.\n\nBrett Foster, a former Tesla engineer who redesigned faulty retractable door handles on the Model S, recalls a profanity-laced email in mid-2013 in which Mr. Musk prodded managers to soften their communications with lower-level employees. “ ‘Don’t be an a—’ was the gist of it,” Mr. Foster says. “I actually kind of liked that he did it.”\n\nSome managers tried to emulate Mr. Musk’s never-say-no style, but “without being as smart as Elon,” says Mr. Foster, who didn’t interact with the CEO regularly. “I struggled with the culture and am extremely happy I am no longer there.” He now works at Samsung Electronics Co.\n\nRyan Popple, Tesla’s finance chief from 2008 to 2010, says Mr. Musk’s relentless perfectionism has steered Tesla to where it is today. Mr. Popple, now the chief executive of electric bus makerProterra Inc., remembers when Mr. Musk demanded that Tesla figure out how to make aluminum body panels for the Model S, rather than hire an outside supplier to do the job.\n\nThe process is highly technical, tricky and expensive. “He was the only person in the room who thought it was a good idea,” says Mr. Popple. “There were a lot of people, including me, who thought: ‘I don’t know how this is going to work.’ ” Mr. Musk responded: “We have to own it.”\n\nTesla now makes all the aluminum body panels it needs in its own factory.\n\nWrite to Mike Ramsey at michael.ramsey@wsj.com",
  "gilded": 0,
  "score": 37,
  "removal_reason": null,
  "approved_by": null,
  "created_utc": 1421049420.0,
  "is_self": true,
  "stickied": false,
  "edited": 1421070084.0,
  "distinguished": null,
  "permalink": "https://www.reddit.com/r/teslamotors/comments/2s5dmk/musk_will_be_in_detroit_this_tuesday/?ref=search_posts",
  "banned_by": null,
  "from_id": null,
  "likes": null,
  "_underscore_names": null,
  "num_reports": null,
  "link_flair_css_class": null,
  "_info_url": "https://api.reddit.com/api/info/",
  "id": "2s5dmk",
  "archived": true,
  "secure_media": null,
  "from_kind": null,
  "saved": false,
  "domain": "self.teslamotors",
  "ups": 37,
  "suggested_sort": null,
  "quarantine": false,
  "over_18": false,
  "hide_score": false,
  "url": "https://www.reddit.com/r/teslamotors/comments/2s5dmk/musk_will_be_in_detroit_this_tuesday/",
  "subreddit_id": "t5_2s3j5",
  "_params": {},
  "_comments": null,
  "_replaced_more": false,
  "_comments_by_id": {},
  "user_reports": [],
  "media_embed": {},
  "created": 1421053020.0,
  "author_flair_text": "Tesla Fan",
  "visited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"http://www.wsj.com/articles/electric-car-pioneer-musk-charges-head-on-at-detroit-1421033527?mod=WSJ_hp_RightTopStories\">http://www.wsj.com/articles/electric-car-pioneer-musk-charges-head-on-at-detroit-1421033527?mod=WSJ_hp_RightTopStories</a></p>\n\n<p>Text from article: Musk Charges head on at Detroit</p>\n\n<p>When Elon Musk , who loudly disdains the traditional auto industry, makes his first public appearance in Detroit in two years on Tuesday, it will be easy to see how much has changed since then.</p>\n\n<p>Mr. Musk’s Tesla Motors Inc. is worth six times more in stock-market value. He is pushing hard to sell 500,000 vehicles a year by 2020, up from 90 a day in the third quarter. And giant auto makers are on a collision course with Tesla like never before, with General Motors Co. showing off a new electric car at the Detroit auto show on Monday.</p>\n\n<p>Mr. Musk’s response? He says he doesn’t plan to change a thing, from his proclivity for F-bombs to double duty as chief executive of rocket makerSpace Exploration Technologies Corp., or SpaceX, to a hands-on obsession with the tiniest operational and car-design details at Tesla.</p>\n\n<p>He calls himself a “nano-manager,” works about 100 hours a week and still runs the auto maker largely as he did before it sold the first Tesla Roadster in 2008.</p>\n\n<p>“I have OCD on product-related issues,” he says with a laugh. “I always see what’s... wrong. Would you want that? When I see a car or a rocket or spacecraft, I only see what’s wrong. I never see what’s right. It’s not a recipe for happiness.”</p>\n\n<p>In a speech Tuesday at an auto-show event, Mr. Musk is expected to criticize larger auto makers for not responding to Tesla even more aggressively. He denounces the rest of the industry as only halfheartedly trying to produce battery-powered cars for the masses, not just early adopters.</p>\n\n<p>More than a decade after launching Tesla, the 43-year-old Mr. Musk has gained lots of believers in his brash, iconoclastic quest to run gas guzzlers off the road. Tesla is worth $26 billion in stock-market value, nearly half the size of GM or Ford Motor Co. GM sold more than 27,000 new vehicles a day in the third quarter—or about 90 every five minutes.</p>\n\n<p>Panasonic Corp. will invest as much as $2 billion toward the $5 billion cost of Tesla’s new lithium-ion battery factory, under construction in Nevada. The state approved $1.3 billion in tax breaks and other incentives for Tesla, among the most ever in the U.S. for any company.</p>\n\n<p>Futuris Automotive is getting a new factory the size of three football fields in Newark, Calif., ready to rev up production of seats and headliners for Tesla, which builds its Model S sedans nearby. Headliners are attached to the inside roof of cars.</p>\n\n<p>“We decided to move into the Bay Area because we believe in what Tesla is trying to do,” says Sam Coughlin, Futuris’s top executive in the U.S. He plans to double the number of jobs at the factory this year, including engineers wooed away from Detroit.</p>\n\n<p>Just 0.3% of the new vehicles registered in the U.S. since the start of 2012 are fully electric-powered, according to IHS Automotive, part of IHS Inc. Tesla had more than 20% of all electric-car sales in that period.</p>\n\n<p>Tesla’s growing size is one reason why Audi AG , the premium-car brand owned by Germany’s Volkswagen AG , is working on a compact sport-utility vehicle designed to go 300 miles on an electric charge, according to Audi executives. Tesla plans to start selling its new Model X sport-utility vehicle in the third quarter of 2015.</p>\n\n<p>SpaceX Stumbles in Test to Show Reusable Rocket Technology Advances\nGM’s new Chevrolet Bolt would be aimed directly at Tesla’s forthcoming Model 3 and capable of traveling 200 miles with one charge, according to people familiar with the strategy. A concept version of the Bolt will be unveiled at the industry’s biggest annual event, the North American International Auto Show, which starts Monday.</p>\n\n<p>The Chevrolet Volt, a plug-in hybrid introduced by GM in 2010, has an electric range of just 38 miles, though next year’s model will go 50 miles.</p>\n\n<p>Some Tesla investors are jittery, pushing the Palo Alto, Calif., company’s share price down more than 10% in the past three months, compared with gains by GM, Ford and major U.S. stock indexes during the same period.</p>\n\n<p>Analysts at some securities firms are worried that the 40% slide in gasoline prices at the pump since Aprilmight hurt demand for electric cars. Tesla shares also are being hurt by concerns that a several-month delay in the Model X rollout will make it harder for Mr. Musk to hit the 2020 sales target.</p>\n\n<p>But because of the unwavering intensity of Mr. Musk’s determination, investors have flocked to Tesla and shrug off the fact that the auto maker has never made an annual profit. They don’t care that the Model S usually sells for more than $100,000, or about double the company’s original projection.</p>\n\n<p>In the first nine months of 2014, Tesla had revenue of $2.24 billion, up 60% from a year earlier. Its net loss grew to $186.4 million from $57.7 million.</p>\n\n<p>“There are a lot of investors whose main thesis is based on Elon Musk and his vision for the future of vehicles,” says Colin Langan, an auto-industry analyst at UBS AG. He has a “neutral” rating on Tesla shares.</p>\n\n<p>Cristiano Carlutti is more blunt. He ran Tesla’s operations in Europe before leaving in 2011 for startup auto makerQoros Auto Co., where he is a top executive. Tesla was “driven and is still driven by Elon Musk,” says Mr. Carlutti. “You take Elon out of the company, [and] the market cap would go down 80%.”</p>\n\n<p>Mr. Musk says the auto maker has “certainly gotten a lot of attention, but we make very few cars, so the effect is small. The value that Tesla can provide is…an example of what is possible.”</p>\n\n<p>He said when Tesla stock hit $280 last year that it was probably too high. According to the company’s latest proxy filing, Mr. Musk owns a 27% stake worth about $7.2 billion based on Friday’s closing price of $206.66.</p>\n\n<p>With characteristic directness, Mr. Musk admits Tesla has no succession plan. The company also has suffered from growing pains because of his domineering presence.</p>\n\n<p>Some high-level managers quit or were fired after clashing with the chief executive over Mr. Musk’s insistence on doing things his way, according to interviews with dozens of current and former Tesla executives.</p>\n\n<p>During the launch of Model S production in 2012, Mr. Musk set up an office in the middle of the factory floor in Fremont, Calif., and took over when hiccups emerged. He told workers to buy USB cables at nearby Fry’s Electronics Inc. stores after a snarl delayed a shipment from China.</p>\n\n<p>“If you are fighting a battle, it’s way better if you are at the front lines. A general behind the lines is going to lose,” he says.</p>\n\n<p>Elon Musk, right, and Peter Thiel, shown in 2000, made a fortune when PayPal was sold to eBay in 2002 for $1.4 billion. \nElon Musk, right, and Peter Thiel, shown in 2000, made a fortune when PayPal was sold to eBay in 2002 for $1.4 billion. \nThree weeks before the first Model S was delivered to a customer, Mr. Musk demanded that the sedans have larger rear tires because he felt they looked better, according to people involved in the process. The last-minute design switch also required complicated tweaks to the car’s anti-lock braking system and carried the risk of shortening the car’s driving range.</p>\n\n<p>Tesla engineers protested that the electronics supplier might not honor its liability warranty if Mr. Musk went through with the bigger tires.</p>\n\n<p>Mr. Musk didn’t back down. The engineers did. And the design change went through without a hitch, says someone who was in the room when the decision was made.</p>\n\n<p>Current and former Tesla executives say few people are willing to disagree openly with Mr. Musk. Those who fall out of sync with him often don’t stay long. Turnover in the auto industry can be especially problematic because it takes several years to design and roll out new models.</p>\n\n<p>Last month, the chief of Tesla’s operations in China, Veronica Wu, left the company after being there for only one year. Tesla hasn’t announced the reason for her sudden departure, and she didn’t respond to emails or other attempts to contact her.</p>\n\n<p>Mr. Musk “is very, very demanding, and it’s not the right speed for a lot of people,” says Ricardo Reyes, who left Tesla in 2012 as its vice president of public relations and was rehired in November when his successor quit after about six months on the job.</p>\n\n<p>ENTREPRENEUR’S STEADY SUCCESS</p>\n\n<p>1999: Elon Musk, at 28, sells mapping-software company for $307 million, earning $22 million.</p>\n\n<p>2002: Gets huge payday from PayPal’s sale to eBay for $1.4 billion, starts SpaceX.</p>\n\n<p>2004: Invests in Tesla and becomes fledging auto maker’s chairman.</p>\n\n<p>2008: Tesla delivers first battery-powered Roadster. Falcon 1 rocket makes successful launch. Musk becomes Tesla’s CEO.</p>\n\n<p>2010: Tesla goes public.</p>\n\n<p>2012: Model S sedan is delivered to first customer.</p>\n\n<p>2014: SpaceX wins $2.6 billion NASA contract to send astronauts to International Space Station. Tesla picks Nevada as site for $5 billion battery ‘gigafactory.’ Company’s stock-market value tops $30 billion.</p>\n\n<p>Before that, Tesla went nearly two years without a director of the public-relations department.</p>\n\n<p>The car maker’s CEO “pushes really hard, and it’s mission driven. It’s constant activity,” Mr. Reyes adds. “He used to say that he only wanted ‘special forces’ working for him. No normal people.”</p>\n\n<p>Mr. Musk agrees that he can be exacting but denies that he fires employees without reason or cause. “I don’t like to fire people. I hate it,” he says. “The issue I’ve had is firing people too late, not too early.”</p>\n\n<p>Media relations have been largely handled by Mr. Musk himself, who writes his own tweets and blog posts. Last Monday, he answered questions on social news forum Reddit Inc., telling readers about a favorite Winston Churchill quote about surmounting adversity: “If you’re going through hell, keep going.”</p>\n\n<p>In the legal department, Tesla went through three general counsels from 2009 to 2012. It then had no general counsel for more than two years until Mr. Musk promoted his former divorce lawyer, Todd Maron.</p>\n\n<p>Mr. Maron had been Tesla’s deputy general counsel. Mr. Musk says the turnover was an aberration, noting that SpaceX has had the same chief counsel for a decade.</p>\n\n<p>Last spring, Tesla pushed out its sales chief in Europe shortly after the company started selling cars there. An executive overseeing Japan and Hong Kong was let go last summer.</p>\n\n<p>George Blankenship, the former Apple Inc. executive who came up with Tesla’s slick retail-store concept, left Tesla in 2013 after his responsibilities were scaled back. He didn’t respond to requests for comment.</p>\n\n<p>Tesla’s chief engineer quit months before the Model S sedan was launched, while Mr. Musk fired the chief chassis engineer working on the Model X sport-utility vehicle, saying at the time that he asked for the resignation because “there wasn’t a good fit for him.” Tesla shares fell 17% after the auto maker announced the two departures but then rebounded.</p>\n\n<p>Several people at Tesla say Mr. Musk has looked on and off for years for a chief operating officer who would be the auto maker’s second-highest executive. Outsiders approached by Mr. Musk include Andy Palmer, the former chief planning officer at Nissan Motor Co. who left the Japanese auto maker in September to become CEO of Aston Martin Lagonda Ltd., a person familiar with the matter says.</p>\n\n<p>Tesla technology chief JB Straubel, chief designer Franz von Holzhausen, business-development chief Diarmuid O’Connell and finance chief Deepak Ahuja have been at Tesla for at least five years and are considered close to Mr. Musk.</p>\n\n<p>But none of them is seen as likely to succeed him. Mr. Musk has indicated that he will stay in the top job for at least four or five more years.</p>\n\n<p>Tesla often spurns job candidates who have “too much automotive experience,” says someone recently recruited by the company. During an interview, the person was told that Tesla considered it a major negative to have extensive GM experience on a résumé. Tesla didn’t offer the person a job.</p>\n\n<p>People who have worked at Tesla say Mr. Musk’s ambition and vision are inspiring. But the hard-charging culture can be exhausting, they say.</p>\n\n<p>Brett Foster, a former Tesla engineer who redesigned faulty retractable door handles on the Model S, recalls a profanity-laced email in mid-2013 in which Mr. Musk prodded managers to soften their communications with lower-level employees. “ ‘Don’t be an a—’ was the gist of it,” Mr. Foster says. “I actually kind of liked that he did it.”</p>\n\n<p>Some managers tried to emulate Mr. Musk’s never-say-no style, but “without being as smart as Elon,” says Mr. Foster, who didn’t interact with the CEO regularly. “I struggled with the culture and am extremely happy I am no longer there.” He now works at Samsung Electronics Co.</p>\n\n<p>Ryan Popple, Tesla’s finance chief from 2008 to 2010, says Mr. Musk’s relentless perfectionism has steered Tesla to where it is today. Mr. Popple, now the chief executive of electric bus makerProterra Inc., remembers when Mr. Musk demanded that Tesla figure out how to make aluminum body panels for the Model S, rather than hire an outside supplier to do the job.</p>\n\n<p>The process is highly technical, tricky and expensive. “He was the only person in the room who thought it was a good idea,” says Mr. Popple. “There were a lot of people, including me, who thought: ‘I don’t know how this is going to work.’ ” Mr. Musk responded: “We have to own it.”</p>\n\n<p>Tesla now makes all the aluminum body panels it needs in its own factory.</p>\n\n<p>Write to Mike Ramsey at <a href=\"mailto:michael.ramsey@wsj.com\">michael.ramsey@wsj.com</a></p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "_comment_sort": null,
  "report_reasons": null,
  "name": "t3_2s5dmk",
  "from": null,
  "hidden": false,
  "clicked": false,
  "media": null,
  "json_dict": null,
  "_api_link": "https://api.reddit.com/r/teslamotors/comments/2s5dmk/musk_will_be_in_detroit_this_tuesday/?ref=search_posts",
  "secure_media_embed": {},
  "mod_reports": [],
  "_orphaned": {},
  "_uniq": null,
  "num_comments": 32,
  "link_flair_text": null,
  "title": "Musk will be in Detroit this Tuesday",
  "_has_fetched": true,
  "author_flair_css_class": "1 f",
  "thumbnail": "self"
}