{
  "clicked": false,
  "_replaced_more": false,
  "archived": true,
  "num_comments": 28,
  "created": 1399991479.0,
  "saved": false,
  "selftext": "I took part in the spectacular Ironman 70.3 Mallorca this weekend. Apparently it's the most popular Half in the world, with 3,500 athletes lining up at the start. I can understand why: the scenery is gorgeous with a swim in the calm, crystal-clear turquoise island sea, followed by a punishing climb up a sheer mountain with breathtaking views, ending with a flat, beach-side run with hordes of enthusiastic crowds with a finish on the sand. It's a dream course and I had been training hard.\n\nAbout 20 minutes into the bike I got my first puncture in 7 years. Ok, no problem, I whipped out my (only) spare tube, CO2 canister and fixed the problem in no time at all. I couldn't find either the hole in the tube or its cause, despite thoroughly checking, so I saddled up and kept going, writing it up to bad luck. \n\nAbout 20 minutes later, bam! another flat. This time things were a touch more tricky, since I didn't have any spares left. No problem! At the briefing the day before they had said if this happens you should just wait, a van will come past. I pulled to the side and despairingly watched a deluge of athletes stream by. Fortunately I spotted a race official down the road and made my way over and explained my predicament. No problem, she said, took my race number down, radio'd race control and told me to just wait here and a repair van will be around in a few minutes to help, and then she left. At this point I was still full of hope of continuing the race. I mean, surely someone would stop with a spare tube! I don't mind getting DQ'd for outside help, if at least I could continue!\n\nI waited for **two hours** next to the side of that road, until the deluge of passing athletes became a trickle of elderly and overweight triathletes and then - no one. No sign of any official vehicle or marshall, never mind a repair van. I was out in the middle of nowhere. Eventually, frustrated, parched and desperate, I managed to wave down an Ironman branded motorbike and again explained my predicament. They radio'd the organisers and after a long and unintelligible discussion in Spanish with someone on the other side of the radio, they promised that the van would be around within a few minutes to help me out. They also said I would not get a spare tube or any help, I would only get a lift back. My race was over. I was crushed. I had trained for months and had invested a huge amount of time and money into this race. And all scuppered over a flat tyre.\n\nI asked the marshall whether I could at least do the run when I got back and they said yes, but I would get a DNF result. At least I could test my legs and my family would see me finish.\n\nFine. These things happen. So I waited. For another **hour**. No one came. By this time I had been standing in the scorching, windless sun next to a highway for almost 3 hours with no water or shade. This was plain dangerous. I was long over the disappointment. I was seriously pissed at Ironman organisers for their irresponsible, near criminal negligence.\n\nEventually an angel appeared from heaven in the form of a British man who had spotted me two hours before standing at the same place. He took pity and gave me a lift back to the start in Alcudia. He dropped me near transition and I made my way back onto the course and pushed my bike into the transition along with the rest of my age group who had just come off the bike (I had been away 3.5 hours, which was close to my planned bike split), and finished the run.\n\nThat night back in my apartment, I found the cause of the punctures. The rim tape had shifted and exposed a tiny sliver of spoke hole, which must have been enough to cause the punctures. I have no idea why this happened during the race. I had used the same wheel, tyre and tube for about a year now with no issues or flats. Next time I'll include a patch kit in my race gear and check the rim tape more thoroughly.\n\nSee this photo of the rim where the tape had shifted: https://imgur.com/sm8Znb1\n\nSo, apologies for the long ramble, but I need some of your advice please.\n\n- Has anyone ever had to get assistance on an Ironman course, or any triathlon? Is my horrid experience the norm? Was it reasonable to expect better service from Ironman having paid them a stupendous amount of cash?\n- Looking at the photo above, what could I have done to prevent this? Do I need better rim tape? Could the heat have contributed? What would you have done to prepare better, or in this situation?\n\nPS - I seemed to have gotten an official race result, listing my bike time as 3.5 hours, despite having informed two marshals of my issue who both took my number and told I would get a DNF.\n\nEDIT: Thanks for all the responses. From all the comments, and what I've researched elsewhere, I've come to the following conclusions:\n1) Ironman is all about self-sufficiency and I shouldn't expect any help on the course. \n2) Despite that, since they promised to send help, it was irresponsible of them not to. \n3) My flat was caused by shifted rim tape, and the rim tape had shifted likely because of the intense heat on the day causing the plastic material to expand and therefore snake slightly sidewise across the rim face.\n4) My (cheap Halfords) rim tape was also too narrow for the wheel\n\nSo, next time I'll have some good Velox adhesive rim tape and I'll carry some insulation tape around my CO2 canister as backup. I'll also be much more inclined to help other athletes who need it!",
  "mod_reports": [],
  "secure_media_embed": {},
  "author_flair_css_class": "Tri-Flair",
  "edited": 1400076186.0,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I took part in the spectacular Ironman 70.3 Mallorca this weekend. Apparently it&#39;s the most popular Half in the world, with 3,500 athletes lining up at the start. I can understand why: the scenery is gorgeous with a swim in the calm, crystal-clear turquoise island sea, followed by a punishing climb up a sheer mountain with breathtaking views, ending with a flat, beach-side run with hordes of enthusiastic crowds with a finish on the sand. It&#39;s a dream course and I had been training hard.</p>\n\n<p>About 20 minutes into the bike I got my first puncture in 7 years. Ok, no problem, I whipped out my (only) spare tube, CO2 canister and fixed the problem in no time at all. I couldn&#39;t find either the hole in the tube or its cause, despite thoroughly checking, so I saddled up and kept going, writing it up to bad luck. </p>\n\n<p>About 20 minutes later, bam! another flat. This time things were a touch more tricky, since I didn&#39;t have any spares left. No problem! At the briefing the day before they had said if this happens you should just wait, a van will come past. I pulled to the side and despairingly watched a deluge of athletes stream by. Fortunately I spotted a race official down the road and made my way over and explained my predicament. No problem, she said, took my race number down, radio&#39;d race control and told me to just wait here and a repair van will be around in a few minutes to help, and then she left. At this point I was still full of hope of continuing the race. I mean, surely someone would stop with a spare tube! I don&#39;t mind getting DQ&#39;d for outside help, if at least I could continue!</p>\n\n<p>I waited for <strong>two hours</strong> next to the side of that road, until the deluge of passing athletes became a trickle of elderly and overweight triathletes and then - no one. No sign of any official vehicle or marshall, never mind a repair van. I was out in the middle of nowhere. Eventually, frustrated, parched and desperate, I managed to wave down an Ironman branded motorbike and again explained my predicament. They radio&#39;d the organisers and after a long and unintelligible discussion in Spanish with someone on the other side of the radio, they promised that the van would be around within a few minutes to help me out. They also said I would not get a spare tube or any help, I would only get a lift back. My race was over. I was crushed. I had trained for months and had invested a huge amount of time and money into this race. And all scuppered over a flat tyre.</p>\n\n<p>I asked the marshall whether I could at least do the run when I got back and they said yes, but I would get a DNF result. At least I could test my legs and my family would see me finish.</p>\n\n<p>Fine. These things happen. So I waited. For another <strong>hour</strong>. No one came. By this time I had been standing in the scorching, windless sun next to a highway for almost 3 hours with no water or shade. This was plain dangerous. I was long over the disappointment. I was seriously pissed at Ironman organisers for their irresponsible, near criminal negligence.</p>\n\n<p>Eventually an angel appeared from heaven in the form of a British man who had spotted me two hours before standing at the same place. He took pity and gave me a lift back to the start in Alcudia. He dropped me near transition and I made my way back onto the course and pushed my bike into the transition along with the rest of my age group who had just come off the bike (I had been away 3.5 hours, which was close to my planned bike split), and finished the run.</p>\n\n<p>That night back in my apartment, I found the cause of the punctures. The rim tape had shifted and exposed a tiny sliver of spoke hole, which must have been enough to cause the punctures. I have no idea why this happened during the race. I had used the same wheel, tyre and tube for about a year now with no issues or flats. Next time I&#39;ll include a patch kit in my race gear and check the rim tape more thoroughly.</p>\n\n<p>See this photo of the rim where the tape had shifted: <a href=\"https://imgur.com/sm8Znb1\">https://imgur.com/sm8Znb1</a></p>\n\n<p>So, apologies for the long ramble, but I need some of your advice please.</p>\n\n<ul>\n<li>Has anyone ever had to get assistance on an Ironman course, or any triathlon? Is my horrid experience the norm? Was it reasonable to expect better service from Ironman having paid them a stupendous amount of cash?</li>\n<li>Looking at the photo above, what could I have done to prevent this? Do I need better rim tape? Could the heat have contributed? What would you have done to prepare better, or in this situation?</li>\n</ul>\n\n<p>PS - I seemed to have gotten an official race result, listing my bike time as 3.5 hours, despite having informed two marshals of my issue who both took my number and told I would get a DNF.</p>\n\n<p>EDIT: Thanks for all the responses. From all the comments, and what I&#39;ve researched elsewhere, I&#39;ve come to the following conclusions:\n1) Ironman is all about self-sufficiency and I shouldn&#39;t expect any help on the course. \n2) Despite that, since they promised to send help, it was irresponsible of them not to. \n3) My flat was caused by shifted rim tape, and the rim tape had shifted likely because of the intense heat on the day causing the plastic material to expand and therefore snake slightly sidewise across the rim face.\n4) My (cheap Halfords) rim tape was also too narrow for the wheel</p>\n\n<p>So, next time I&#39;ll have some good Velox adhesive rim tape and I&#39;ll carry some insulation tape around my CO2 canister as backup. I&#39;ll also be much more inclined to help other athletes who need it!</p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "user_reports": [],
  "author_flair_text": "5:39 70.3",
  "over_18": false,
  "score": 33,
  "stickied": false,
  "domain": "self.triathlon",
  "is_self": true,
  "hidden": false,
  "_orphaned": {},
  "_api_link": "https://api.reddit.com/r/triathlon/comments/25g3b0/the_rim_tape_that_killed_my_ironman_703_mallorca/?ref=search_posts",
  "_comments_by_id": {},
  "visited": false,
  "thumbnail": "self",
  "_has_fetched": true,
  "gilded": 0,
  "hide_score": false,
  "_info_url": "https://api.reddit.com/api/info/",
  "created_utc": 1399987879.0,
  "subreddit_id": "t5_2qhyh",
  "id": "25g3b0",
  "_params": {},
  "media_embed": {},
  "name": "t3_25g3b0",
  "quarantine": false,
  "permalink": "https://www.reddit.com/r/triathlon/comments/25g3b0/the_rim_tape_that_killed_my_ironman_703_mallorca/?ref=search_posts",
  "ups": 33,
  "url": "https://www.reddit.com/r/triathlon/comments/25g3b0/the_rim_tape_that_killed_my_ironman_703_mallorca/",
  "title": "The rim tape that killed my Ironman 70.3 Mallorca"
}