{
  "downs": 0,
  "mod_reports": [],
  "secure_media_embed": {},
  "_info_url": "https://api.reddit.com/api/info/",
  "gilded": 0,
  "num_comments": 1,
  "_orphaned": {},
  "hidden": false,
  "ups": 3,
  "url": "https://www.reddit.com/r/tabled/comments/268scw/table_iama_i_am_eddie_trunk_host_of_vh1s_that/",
  "_has_fetched": true,
  "quarantine": false,
  "name": "t3_268scw",
  "author_flair_text": "",
  "user_reports": [],
  "saved": false,
  "permalink": "https://www.reddit.com/r/tabled/comments/268scw/table_iama_i_am_eddie_trunk_host_of_vh1s_that/?ref=search_posts",
  "over_18": false,
  "is_self": true,
  "_params": {},
  "thumbnail": "",
  "created_utc": 1400796990.0,
  "_replaced_more": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Verified?</strong> <em>(This bot cannot verify AMAs just yet)</em></p>\n\n<p><strong>Date:</strong> 2014-05-22</p>\n\n<p><strong><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/\">Link to submission</a></strong> (<em>Has self-text</em>)</p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Questions</th>\n<th align=\"left\">Answers</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomhfw?context=5\">What&#39;s your best Lemmy drinking story?</a></td>\n<td align=\"left\">My favorite Lemmy drinking story is I was backstage at a Slash show about 3 years ago, and I was having a few drinks with Lemmy and the night was getting later, and I decided it was probably time for me to stop drinking, and I went over to the fridge and grabbed a bottle of water and went back to continue my conversation with Lemmy, and he looked at me with total disgust and berated me for even considering to stop drinking just because it was getting later, and completely convinced me to go back to the refrigerator and get a proper beverage. So the visual, really, is what sells that story and unfortunately we don&#39;t have that. His face looking at me with the bottle of water is priceless.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomhfw?context=5\">Also, this is random but, any idea how Steven Adler is doing these days? </a></td>\n<td align=\"left\">I&#39;ve heard that Steven is doing a little bit better these days, he&#39;s still struggling with sobriety unfortunately, but I&#39;ve heard he is doing better and certainly wish him well.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomevn?context=5\">Eddie, which musician do you wish you could interview that you haven&#39;t had the opportunity to yet? Also, my dad loves your show. His birthday was yesterday, and it would be awesome if he could get a happy belated birthday from you. Thank you for being here!</a></td>\n<td align=\"left\">Well first happy birthday to your dad! And secondly, the one musician I&#39;ve never interviewed at all in any way, shape or form and I&#39;d love to (and ironically I was in the same room as him a week ago) is Jimmy Page. I&#39;ve met with him and spoken with him, but I&#39;d love to do a real in-depth interview with Jimmy Page. This is of the people I&#39;ve never interviewed, I&#39;ve been lucky enough to interview tons of people.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomkvu?context=5\">Being a huge Guns N Roses fan, one of my favorite episodes of TMS is the Axl Rose special. After a long expected delay, how do you personally feel the interview came across? and do you have any good Axl Rose stories?</a></td>\n<td align=\"left\">That&#39;s an interview that I&#39;d love to do over. We waited a REALLY long time for that interview. And Axl claimed he didn&#39;t really know we were there and waiting. So by the time it happened, we were surprised it was even happening and not to make excuses but after sitting for about 15 hours it was certainly not the way we wanted to go into doing an interview like that. But people really loved that we were the first tv show in 15 years to have him on, and people were really excited to see him talk and speak and be Axl Rose. So it was a great moment for the show, and a great score for sure, but it was an interview as someone who prides myself on being a pretty good interviewer after all these years, it was one I&#39;d love to have done over under different circumstances and would like to do a better job. I&#39;ve never had an issue with him personally, and I saw him just a few weeks ago when we hosted The Golden Gods and Guns n Roses performed in the show that&#39;s airing this Saturday, and Axl also gets an award that&#39;s given to him by Nicolas Cage, so people will see all that on the Golden Gods this saturday. But he&#39;s always been cool by me.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomit2?context=5\">Eddie, thanks for all that you do for the metal scene. I loved hearing your radio show on long trips.  As an obvious music fan, do you find it hard to be objective? Especially when you have forged friendships with many artists?</a></td>\n<td align=\"left\">No, because most of the artists I&#39;m friends with know me well enough to know that if they truly do something that i don&#39;t like, I don&#39;t have a problem saying it. And they respect that. Most artists are so surrounded by yes men that tell them everything they want to hear and everything that they do is great that they actually value someone that they can get an objective, honest opinion from. I&#39;ll never forget, I think Sammy Hagar said to me &quot;what do you think of my new record and I need to ask you because I know you&#39;ll actually tell me if you don&#39;t like it.&quot; That really struck me because so many of these guys won&#39;t have anybody tell them they missed the mark or what they would have done instead, and a lot of them find that to be valuable. So most of the people I know respect that and know it&#39;s part of my job, they don&#39;t have to listen to what i say, they don&#39;t need to make me happy, but if they ask me for my opinion then they will get an honest opinion. And I think my audience has figured this out as well, which is why I feel so lucky to have an audience that cares about what i do.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomj9b?context=5\">Thanks for all you are doing for the metal scene nationally.  I&#39;ve learned about a lot of bands (including Angel, which is from my hometown of Washington, DC) from listening to you, and I really enjoy your broadcasts.  My question is, as someone based out of the NYC area, is there anything you are currently doing to support the metal scene at a local level?  As someone who plays in a NYC based metal band, what can I do (aside from the basics) to help the resurging metal scene in NY/NJ?</a></td>\n<td align=\"left\">I do my best. To a lot of people it seems like I have a lot more outlets than I really do. The reality is I have 2 radio shows that are only on once a week and I have a TV show that is on very sporadically with new episodes. So it&#39;s very difficult to navigate, for me, all the major national acts that need a ton of help these days, not to mention local bands that are trying to make a mark. I honestly don&#39;t have an answer on what to tell you to make you stand out and get that extra beyond the other bands on the scene. The only thing I could say that i tell bands all the time is focus on songwriting.  I have so many bands that come to me and talk about how great their singer or guitar player is or all these things they may have going on. but when you actually listen to them they don&#39;t have great songs. And to me, that is by far the #1 criteria. And I think sometimes a lot of bands forget about it. They get so caught up in social media, maybe their look or their playing or their stage show, and they forget sometimes to pay more attention to their thing that makes them by far the greatest, and that&#39;s great songs.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomhna?context=5\">Love your work, Eddie. What four (or five) people would be in your ultimate supergroup?</a></td>\n<td align=\"left\">Oh boy, I get that question a lot.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">Well, I would say one of my all-time favorite guitar players is John Sykes. One of my all-time favorite singers and front men is Steven Tyler. One of my all-time favorite bass players is Geezer Butler. And one of my all-time favorite drummers is Mike Portnoy.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">I completely pulled that out of left field because these questions are so tough for me because there are so many musicians that i love to death, these are just random musicians that I love and I think their playing would be an interesting mix, I would think.</td>\n</tr>\n<tr>\n<td align=\"left\"></td>\n<td align=\"left\">And actually, there&#39;s a band now called The Winery Dogs which I had a hand in assembling, so in a sort of funny way that band is actually a supergroup of mine that I actually helped get to happen and actually really exist!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomgn7?context=5\">Hey Eddie!  Any reason why no one covered the Heaven and Hell song on Ronnie James Dio This Is Your Life?</a></td>\n<td align=\"left\">No, I don&#39;t think there was any specific reason for it. I think it was mainly the artists were given 3 choices of what they wanted to cover, and for whatever reason, maybe the artists thought somebody else picked it, but I can tell you Stryper did a really cool cover of it on their recent covers record, it didn&#39;t make it on the tribute album, but maybe that&#39;s why people know it was recently covered. That&#39;s a good question, though.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chon2ib?context=5\">What do think of the new judas priest album?</a></td>\n<td align=\"left\">I haven&#39;t heard the whole album, I&#39;ve only heard 2 songs from it. The first title track, Redeemer of Souls, grew on me, I didn&#39;t know if I liked it so much at first but it certainly grew on me. And I just got a second track from the record, so I can&#39;t say because I haven&#39;t had a chance to listen to it closely. I literally got it yesterday. So I don&#39;t like to comment on what I think of albums until I hear the entire record. I think one of the big mistakes a lot of people make in the world we are in now where everything is so readily available is that they reach conclusions on albums off of one or two songs, and I never like to do that. I can&#39;t comment on how a record is going to be or how a record is going to be. Once I get a record and have the chance to listen to it, then I&#39;ll weigh in on it.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomk4r?context=5\">Who do you think will be the next Metallica or Pantera from names we don&#39;t know? I don&#39;t mean in style, just bands that everyone loves and listens to, even outside of the metal community. </a></td>\n<td align=\"left\">There&#39;s a new movement in rock right now I really like. There&#39;s a whole bunch of new young bands that are coming out that are based on riffs and hooks and great vocals, and they sound like they are from 1973, but in reality they are young new bands. I like that. I don&#39;t know which one of those bands will break through, or if any will be the next big thing, but I am rooting for many of them. Here are a few names: Kyng, there&#39;s a band called Rival Sons, Scorpion Child, Anti Mortem. There are just a few of the names of bands that I am rooting for to break through, because I like the direction.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomo3t?context=5\">Hey Eddie! My first Black Sabbath record was Heaven and Hell and I get some grief from my metal buddies about it because it&#39;s not the Ozzy Sabbath. Do you ever get that same grief (from Jim or Don etc)?</a></td>\n<td align=\"left\">No, and even if I did, my entire career has been based on not caring what other people think. And that&#39;s not to sound egotistical or self-centered, it&#39;s just that I don&#39;t believe in being influenced by other people as far as what&#39;s cool and what&#39;s not. To me the only thing that matters is if you like it or not. And for me I&#39;m transparent and open about the things i like, whether they are a hip and cool band or not. For me the first Sabbath record and the most special one in their catalog is Heaven and Hell. It&#39;s also a product of my age, I&#39;m 49 years old and when it came out I was 15. So that was when I discovered Black Sabbath, was at 15, and it makes sense that at that time I would get their new record which was Heaven and Hell. Of course I went and checked out their past records, but the Dio records were very special to me. So you shouldn&#39;t have to apologize to anybody for that.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomljm?context=5\">Hey Eddie, been watching TMS for a long time now. I have to ask, which of the guest guitarist were you favorites to have playing live?</a></td>\n<td align=\"left\">John 5 is always unbelievable. He&#39;s amazing, he&#39;s a huge fan of the show, and he probably has gained more fans from playing on our show than any other guitarist just because there are a lot of people that were not aware of him until they saw him play on our show. So John 5 is one that immediately comes to mind, but there have been so many. On the recent season, Yngwie Malmsteen was a standout.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chon63s?context=5\">On a scale of 1-10, how cool and genuine is Sammy?</a></td>\n<td align=\"left\">One of my favorite people. Just so much fun to hang with and to straight shoot with. You can be just as straight back to him, you don&#39;t have to pull any punches around him. He&#39;s just so much fun and genuine. I love guys like that.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomjru?context=5\">What are a few bands that definitely aren&#39;t hard rock/metal that you really enjoy listening to?</a></td>\n<td align=\"left\">Soul Asylum is for sure one of my favorites. they are more a straight up rock band that started more as a punk thing at one point but I like their later records better. I think that their leader, David Tirner, is a brilliant songwriter. And the first band that i was ever exposed to as a little kid I still listen to to this day, and they are a power pop band called The Raspberries.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomjru?context=5\">What episode of That Metal Show was the most fun to film for you?</a></td>\n<td align=\"left\">Oh that&#39;s easy! We used to do 2 shows a day. And 2 years ago for my birthday, we filmed a show on my birthday and one day the first ep we shot was with Sammy Hagar and Michael Anthony, 2 of the most fun people you&#39;d want to hang out with. And the next ep we shot was with Steve Harris from Iron Maiden, who I&#39;d been trying to get on the show forever. And in one of the 2 episodes they surprised me with a birthday cake that Steven Adler jumped out of.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomudz?context=5\">Hi Eddie,  Do you have any good David Lee Roth stories? Also, I was wondering if you have heard the latest from Tesla. If so, what do you think?</a></td>\n<td align=\"left\">I&#39;ve had virtually no dealings with David Lee Roth in my career, unfortunately. I never really spent any real time with him, so unfortunately I don&#39;t have any stories with him. I&#39;ve heard stories which are hysterical but nothing firsthand. As far as the Tesla record, I do have it, and it comes out in about a month. To me they are one of the best bands to come out of the 80s and they are still making great new music. If you like Tesla, you will like the new record, which is called Simplicity.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomxj4?context=5\">Given all the hubbub about Ace &amp; Peter and RRHOF, what did you think of Paul Stanley&#39;s book (if you read it)?</a></td>\n<td align=\"left\">I enjoyed his book. I think any person&#39;s autobiography is going to obviously be told from their perspective, and I thought his book was entertaining and I thought there were a few things on it that I didn&#39;t know that i found interesting. If I had any criticism of the book, he rarely ever in the book holds himself accountable for doing anything wrong, ever. It seems like there&#39;s a lot of downsides that he doesn&#39;t really take a lot of blame for in the book, but that will be the spin that you get from any autobiography. But I think all in all it was a very good read.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/choms66?context=5\">Hey Eddie With all the music festivals out there, have you ever considered establishing/hosting a TMS Festival? </a></td>\n<td align=\"left\">Well, anything that&#39;s branded with That Metal Show has to be done by VH1. So if there was to be a festival or any even that was That Metal Show branded, it would have to come from the network. As far as me personally, there has been some very preliminary discussions about me maybe doing some events just with my history and my name attached to them. I&#39;m not sure where that is going to go. There are a lot of ideas out there, and we will see what materializes. But I can tell you we were recently booked by VH1 to appear at a concert in Northern California, I believe in July, where it is being billed as a TMS-sponsored concert event. And myself, Don and Jim will be there to host it, I think Anthrax is playing, Living Color, Corey Taylor. But I have a few things I&#39;m working on myself and who knows, maybe it will all come together for all parties, it&#39;s just a question of what we can make work and what makes sense for everybody.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomj6k?context=5\">How&#39;s Mike Piazza doing ?</a></td>\n<td align=\"left\">Mike is great. Just saw him a few weeks ago when I was in Miami. He lives in Miami beach. He has 2 daughters and a son. And he coaches baseball for the Italian league in Italy. Outside of that he has a few business interests, but for the most part he is enjoying his life and playing a lot of golf, and he is still a close friend I talk to at least a few times a week every week. He would be on my show a lot more but he&#39;s in Florida. But we are still very good friends and I just got him tickets to see the Winery Dogs next week. And he and I just went to see Avenged Sevenfold in Florida two weeks ago.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chongtp?context=5\">What&#39;s your favorite mr. bungle song?  Also do you think time is linear or cyclical?</a></td>\n<td align=\"left\">Not a huge Mr. Bungle fan so I can&#39;t give you a favorite song. But I&#39;ve tried to get Mike Patton on TMS, and he&#39;s interested it&#39;s just scheduling.  If the question is if time is moving forward or if it&#39;s moving in circles, I think it&#39;s always moving forward.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomlxx?context=5\">Fellow UFO lover here!  When are you going to get that UFO tattoo?</a></td>\n<td align=\"left\">Not gonna happen anytime soon. Not a fan of tattoos or needles, but love the band.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chommfk?context=5\">Eddie, you come every year for Rocklahoma, how do you like Oklahoma? And how stoked are you for Redeemed of Souls?</a></td>\n<td align=\"left\">Oklahoma, I&#39;m IN Oklahoma right now actually! And I&#39;ve probably come to this state more than any other in the last 7 years since Rocklahoma started. I started hosting this festival when it kicked off its first year in &#39;07, and I&#39;ve been lucky enough to do it ever since. And because of coming here for the festival every year, it&#39;s opened up other opportunities for me with other promoters, concerts and venues more than just once a year. So a lot of people when I first came here, being a guy that basically grew up in the New York area, thought i would hate a place like oklahoma because it&#39;s so different. But it&#39;s actually quite the opposite, I really enjoy it for that reason, because it is so different than where I&#39;m from, the people are all really nice and it&#39;s a completely different way of life and speed of life, so it&#39;s  real nice change of life and the people are always amazing to me here, very very kind.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomkpw?context=5\">Hey, Eddie! Big fan of TMS. Who, in your opinion, has been the best guest (or guests) to come on the show?</a></td>\n<td align=\"left\">The best guests are always the artists that don&#39;t take things too serious, have fun, allow you to talk about all aspects of their career (the good and the bad) without getting mad, and just watch and get into the spirit of the show. The guys who have been the best in my opinion, who have been so much fun to have, have been Bryan Johnson, Geddy Lee from RUSH, Rob Halford, Sammy Hagar and Michael Anthony, Lars Ulrich, Ted Nugent, Steven Adler - those are the guys that really are truly and come to mind immediately, they are so much fun on the show and they mix it up with us. They don&#39;t take it too serious and are completely engaged on the show and have fun with us. There are over 100 episodes we&#39;ve done, there are so many more I&#39;m not mentioning, but those are the guys that come to mind at the moment.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomvlx?context=5\">Hey Eddie, glad you could stop by reddit. I started watching TMS after my dad showed me it about 5 years ago. It&#39;s introduced me to countless bands, albums and musicians that I might never have found out about, as well as providing my dad and I with lots of laughter, great interviews and music news. So thanks for all of that. My question is:  What are your favorite moment(s) as a radio personality, a host of TMS, and as a person? </a></td>\n<td align=\"left\">One of my favorite moments in radio would be back around 2006, when Axl Rose walked into my radio studio completely unplanned and unannounced. So that was certainly a huge moment and it&#39;s one of the things that led to him a few years later coming on TMS because he had already known me, and there was already some level of connection there, so that was extremely special. The parties for my radio show to celebrate the 25th and 30th anniversary of the shows were extremely special. For the 25th Anniversary Judas Priest played a private show, and for the 30th anniversary which was last year, Ace Frehley and Peter Criss played together for the first time in 20 years. There were moments where TMS would be, just getting the show on the air. What many people don&#39;t know is that I&#39;ve worked for VH1 Classic since 2002 or 2003. I was a host for the channel for many many years before That Metal Show, interviewed all sorts of artists. And as far back as then, I was pushing for that sort of show, and the day that I got the call that I&#39;d finally pushed it through was the day that I was running up the halls in my house happy that I could finally make it happen because it was something I&#39;d been working on for about 5 years. So it was a huge day when they said they&#39;d move forward and try the show out. So that was a special day. And then on a personal level, there&#39;s been so many great things but there&#39;s nothing more special and more moving in your life than having kids. And I&#39;m lucky that my wife and I have a 10 year old daughter and 6 year old son, and having 2 healthy kids, the day they were born was without question the most emotional and heaviest time of my life.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomm4i?context=5\">What happened with that big announcement you posted on the TMS Facebook page a few weeks ago but never announced it?</a></td>\n<td align=\"left\">The big announcement was that we were hosting The Golden Gods, which we did and people can see this Saturday 5/24 on VH1 Classic.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomqp7?context=5\">Knowing that you&#39;re are huge rush fan, what was your favorite period of rush?  </a></td>\n<td align=\"left\">The 70&#39;s. From Permanent Waves back.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomm7n?context=5\">How difficult is it to be an author?</a></td>\n<td align=\"left\">The hardest part for me in writing my books was typing because I&#39;m not good at typing and I don&#39;t really know how to properly type and especially with my most recent book I sat and physically typed each word in it, which was the hardest part. The other tough part really falls on my publisher, because my editor is the one who has to go and get clearances for the photos, and approvals for pictures, and make the deals with the people who took the photos, things along those lines. For me it&#39;s just very time consuming, so making the time to focus and getting the stories written and turned in on time is definitely the hardest part. But I don&#39;t consider myself a writer really. I just consider myself a storyteller and I&#39;m able to put those stories out in a variety of ways and one of the more recent ways has been my two books.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomhz3?context=5\">Here&#39;s a Stump the Trunk question, Eddie: can you tell me the exact date Slayer&#39;s 1986 masterpiece &quot;Reign in Blood&quot; was released?</a></td>\n<td align=\"left\">I&#39;m here to take your questions, not to do Stump the Trunk questions today. Save that for TMS.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomywa?context=5\">Eddie, Have you ever heard of BabyMetal from Japan and if so what do you think of them?</a></td>\n<td align=\"left\">I&#39;ve heard of them, but I&#39;ve never heard them, so I don&#39;t know.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomqj7?context=5\">The last season, you&#39;ve been asking guests questions like &quot;What song do you wish you wrote&quot;, and &quot;what band would you like to play in, and what instrument&quot;.  Can you turn it around and answer those same questions from your own perspective?</a></td>\n<td align=\"left\">Well, I don&#39;t play any instruments at all, which is why I got into the end of the business I did. If I have one regret it&#39;s not learning to play an instrument. I took some drum lessons as a kid but never stuck with it. I&#39;d still love to this day to be able to play guitar. So I don&#39;t play any instruments at all so it&#39;s hard for me to answer that sort of stuff because in order to write songs, I mean, I guess I could answer it in the sense that I have my favorite songs but from a musician standpoint I can&#39;t really comment on it since I&quot;m not a musician. That&#39;s why the questions we ask those artists are targeted towards them because they are musicians.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chon7yk?context=5\">Hi Eddie! Being Adrian Vandenberg has a new group together, any chances of having him or the new band on the show..? Thanks!! </a></td>\n<td align=\"left\">I haven&#39;t heard the band, and we don&#39;t have any plans to do any new episodes for a while, so when we do, I&#39;ll certainly entertain it. But I would tell everybody the same thing, because one of the number one things I get are requests for artists to be on TMS. And there&#39;s a process to it: They have to be available when we tape, they have to want to do the show, and we need to want to have them on the show (So the network has to say that we want to have them on the show).</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomq0h?context=5\">Eddie, it was such a sad day when Jani Lane left this world. That was such a bittersweet interview on That Metal Show. If you could do it all over again, what would be your final question for Jani?</a></td>\n<td align=\"left\">I&#39;m pretty comfortable with the way we did that interview and the way it was. In hindsight, of course we didn&#39;t know that a few weeks later he would be gone, and I think that the thing I&#39;m most happy about that interview is that he was on TV again and he was being treated respectfully. I think so many shows and references to his music and to him in general have always been about the glam or hair era, and all that sort of stuff. I think on our show he was given a much more respectful platform to talk about the records and the songs that he made and how he feels about them during the very limited time we had. After that show aired and after he passed away his family reached out to me and were very thankful that the last thing people saw and heard of him was him being treated with respect as a musician on my show. And that meant a lot.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomq73?context=5\">Eddie, you had mentioned a while back that Ace was considering doing full album shows. Do you think he&#39;ll do this around his new album? Would love to see a &#39;78 solo album show.</a></td>\n<td align=\"left\">I don&#39;t, simply because he does have a new album, and when people have new albums to promote, they want to play that material instead of playing a record that&#39;s 35 years old or better. So unfortunately if he was to do that (and I&#39;ve discussed it with him) it would most likely be between records. You don&#39;t want to launch a new record by playing music that came out in 1978. So although I&#39;ve discussed it with him, I don&#39;t think that will be what he will bring. I think the focus will be on his new album.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chompjy?context=5\">Thank you being my metal nerd inspiration! I adore Bloody Roots on Liquid Metal and TMS.  Which movie did Jamey Jasta take his mom and grandma to?  Keep it brutal \\m/</a></td>\n<td align=\"left\">He never told us! To this day, he never told us, so I honestly don&#39;t know.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomkd3?context=5\">What&#39;s up, Eddie!  What are some newer metal bands that metal fans may not know about but you recommend we all check out?</a></td>\n<td align=\"left\">See previous answer!</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomox7?context=5\">You seem to be a pretty big part of what I consider the NYC Hard Rock scene. Any chance of a &quot;supergroup&quot; coming out of this group of musicians?  </a></td>\n<td align=\"left\">Unfortunately I don&#39;t think there are enough bands based in NYC as far as major artists to generate a supergroup. one of the reasons why for YEARS we did TMS in Los Angeles was because 95% of the biggest name musicians live in that area. So it&#39;s very hard for stuff like that to happen and those sort of jams to happen in a place where virtually no major artists live anymore. There&#39;s a couple but it&#39;s nothing like LA where all the musicians live. So that&#39;s an area of the country that is much more viable for a group to come together like that than NY where it&#39;s just a handful of major artists still living.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomqye?context=5\">I can&#39;t wait to see Golden Gods on Saturday! What was your favorite part about hosting the show?</a></td>\n<td align=\"left\">Just being in a setting with such an eclectic mix of artists - there&#39;s new bands, older bands, so many different genres of rock and metal, you had everything from extreme metal bands to the former guitar player of Bon Jovi there, it was a wide, wide mix of artists represented. And many of them I knew and many I didn&#39;t, so it was cool to meet some people I hadn&#39;t met or known much about. And also to see the impact of that Metal Show on the rock community, it&#39;s always amazing to me, I&#39;ve had actors, a woman who&#39;s in NCIS, a guy who&#39;s in TRUE BLOOD, all come up to me and say they are huge fans, and that is kind of surreal to me because I know musicians watch the show but to see people who are not musicians who are huge fans of it is very cool. So it was great to be around it and on it and mix with all these people from all these different worlds, all these different people from metal and rock coming together for one night.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomrv3?context=5\">How do you feel about the hate and ridicule that Nickleback seems to get.</a></td>\n<td align=\"left\">It shouldn&#39;t bother them at all or their fans considering they are an enormously popular band. I think whether you like them or not, you can&#39;t argue with success. And I think that when bands reach a certain level of mainstream success there will be people who love to hate them. That comes with anything, really. Whenever anything gets to a certain level of popularity, there will always be a small percentage of people having a fun time taking shots at you to knock you down a peg. Most of the time when that happens the artist is so far beyond it that you have to roll it off your back whether it&#39;s you the artist or you as a fan. So I think Nickelback is successful enough that they aren&#39;t worried about people who don&#39;t like them.</td>\n</tr>\n<tr>\n<td align=\"left\"><a href=\"http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomkyu?context=5\">Hey Eddie!!! First of all, you rock. You&#39;re the omniscient god of Rock. I would like to know your thoughts on the late interview to Slash @ David Letterman&#39;s show, and his biography presentation.  </a></td>\n<td align=\"left\">I didn&#39;t see it. Can&#39;t comment on it because I didn&#39;t see it. But Slash is a good friend and wrote the forward for my latest book.</td>\n</tr>\n</tbody></table>\n\n<p><em>Last updated: 2014-05-26 21:01 UTC</em></p>\n\n<p><em>This post was generated by a robot! Send all complaints to <a href=\"/message/compose/?to=epsy\">epsy</a>.</em></p>\n</div><!-- SC_ON -->",
  "author_flair_css_class": "tabler",
  "subreddit_id": "t5_2tkmw",
  "archived": true,
  "domain": "self.tabled",
  "clicked": false,
  "score": 3,
  "id": "268scw",
  "stickied": false,
  "media_embed": {},
  "visited": false,
  "selftext": "**Verified?** *(This bot cannot verify AMAs just yet)*\n\n**Date:** 2014-05-22\n\n**[Link to submission](http://www.reddit.com/r/IAmA/comments/268f4b/)** (*Has self-text*)\n\n\n\nQuestions|Answers\n:--|:--\n[What's your best Lemmy drinking story?](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomhfw?context=5)|My favorite Lemmy drinking story is I was backstage at a Slash show about 3 years ago, and I was having a few drinks with Lemmy and the night was getting later, and I decided it was probably time for me to stop drinking, and I went over to the fridge and grabbed a bottle of water and went back to continue my conversation with Lemmy, and he looked at me with total disgust and berated me for even considering to stop drinking just because it was getting later, and completely convinced me to go back to the refrigerator and get a proper beverage. So the visual, really, is what sells that story and unfortunately we don't have that. His face looking at me with the bottle of water is priceless.\n[Also, this is random but, any idea how Steven Adler is doing these days? ](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomhfw?context=5)|I've heard that Steven is doing a little bit better these days, he's still struggling with sobriety unfortunately, but I've heard he is doing better and certainly wish him well. \n[Eddie, which musician do you wish you could interview that you haven't had the opportunity to yet? Also, my dad loves your show. His birthday was yesterday, and it would be awesome if he could get a happy belated birthday from you. Thank you for being here!](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomevn?context=5)|Well first happy birthday to your dad! And secondly, the one musician I've never interviewed at all in any way, shape or form and I'd love to (and ironically I was in the same room as him a week ago) is Jimmy Page. I've met with him and spoken with him, but I'd love to do a real in-depth interview with Jimmy Page. This is of the people I've never interviewed, I've been lucky enough to interview tons of people. \n[Being a huge Guns N Roses fan, one of my favorite episodes of TMS is the Axl Rose special. After a long expected delay, how do you personally feel the interview came across? and do you have any good Axl Rose stories?](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomkvu?context=5)|That's an interview that I'd love to do over. We waited a REALLY long time for that interview. And Axl claimed he didn't really know we were there and waiting. So by the time it happened, we were surprised it was even happening and not to make excuses but after sitting for about 15 hours it was certainly not the way we wanted to go into doing an interview like that. But people really loved that we were the first tv show in 15 years to have him on, and people were really excited to see him talk and speak and be Axl Rose. So it was a great moment for the show, and a great score for sure, but it was an interview as someone who prides myself on being a pretty good interviewer after all these years, it was one I'd love to have done over under different circumstances and would like to do a better job. I've never had an issue with him personally, and I saw him just a few weeks ago when we hosted The Golden Gods and Guns n Roses performed in the show that's airing this Saturday, and Axl also gets an award that's given to him by Nicolas Cage, so people will see all that on the Golden Gods this saturday. But he's always been cool by me. \n[Eddie, thanks for all that you do for the metal scene. I loved hearing your radio show on long trips.  As an obvious music fan, do you find it hard to be objective? Especially when you have forged friendships with many artists?](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomit2?context=5)|No, because most of the artists I'm friends with know me well enough to know that if they truly do something that i don't like, I don't have a problem saying it. And they respect that. Most artists are so surrounded by yes men that tell them everything they want to hear and everything that they do is great that they actually value someone that they can get an objective, honest opinion from. I'll never forget, I think Sammy Hagar said to me \"what do you think of my new record and I need to ask you because I know you'll actually tell me if you don't like it.\" That really struck me because so many of these guys won't have anybody tell them they missed the mark or what they would have done instead, and a lot of them find that to be valuable. So most of the people I know respect that and know it's part of my job, they don't have to listen to what i say, they don't need to make me happy, but if they ask me for my opinion then they will get an honest opinion. And I think my audience has figured this out as well, which is why I feel so lucky to have an audience that cares about what i do. \n[Thanks for all you are doing for the metal scene nationally.  I've learned about a lot of bands (including Angel, which is from my hometown of Washington, DC\\) from listening to you, and I really enjoy your broadcasts.  My question is, as someone based out of the NYC area, is there anything you are currently doing to support the metal scene at a local level?  As someone who plays in a NYC based metal band, what can I do (aside from the basics\\) to help the resurging metal scene in NY/NJ?](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomj9b?context=5)|I do my best. To a lot of people it seems like I have a lot more outlets than I really do. The reality is I have 2 radio shows that are only on once a week and I have a TV show that is on very sporadically with new episodes. So it's very difficult to navigate, for me, all the major national acts that need a ton of help these days, not to mention local bands that are trying to make a mark. I honestly don't have an answer on what to tell you to make you stand out and get that extra beyond the other bands on the scene. The only thing I could say that i tell bands all the time is focus on songwriting.  I have so many bands that come to me and talk about how great their singer or guitar player is or all these things they may have going on. but when you actually listen to them they don't have great songs. And to me, that is by far the #1 criteria. And I think sometimes a lot of bands forget about it. They get so caught up in social media, maybe their look or their playing or their stage show, and they forget sometimes to pay more attention to their thing that makes them by far the greatest, and that's great songs. \n[Love your work, Eddie. What four (or five\\) people would be in your ultimate supergroup?](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomhna?context=5)|Oh boy, I get that question a lot.\n |Well, I would say one of my all-time favorite guitar players is John Sykes. One of my all-time favorite singers and front men is Steven Tyler. One of my all-time favorite bass players is Geezer Butler. And one of my all-time favorite drummers is Mike Portnoy.\n |I completely pulled that out of left field because these questions are so tough for me because there are so many musicians that i love to death, these are just random musicians that I love and I think their playing would be an interesting mix, I would think.\n |And actually, there's a band now called The Winery Dogs which I had a hand in assembling, so in a sort of funny way that band is actually a supergroup of mine that I actually helped get to happen and actually really exist!\n[Hey Eddie!  Any reason why no one covered the Heaven and Hell song on Ronnie James Dio This Is Your Life?](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomgn7?context=5)|No, I don't think there was any specific reason for it. I think it was mainly the artists were given 3 choices of what they wanted to cover, and for whatever reason, maybe the artists thought somebody else picked it, but I can tell you Stryper did a really cool cover of it on their recent covers record, it didn't make it on the tribute album, but maybe that's why people know it was recently covered. That's a good question, though. \n[What do think of the new judas priest album?](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chon2ib?context=5)|I haven't heard the whole album, I've only heard 2 songs from it. The first title track, Redeemer of Souls, grew on me, I didn't know if I liked it so much at first but it certainly grew on me. And I just got a second track from the record, so I can't say because I haven't had a chance to listen to it closely. I literally got it yesterday. So I don't like to comment on what I think of albums until I hear the entire record. I think one of the big mistakes a lot of people make in the world we are in now where everything is so readily available is that they reach conclusions on albums off of one or two songs, and I never like to do that. I can't comment on how a record is going to be or how a record is going to be. Once I get a record and have the chance to listen to it, then I'll weigh in on it. \n[Who do you think will be the next Metallica or Pantera from names we don't know? I don't mean in style, just bands that everyone loves and listens to, even outside of the metal community. ](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomk4r?context=5)|There's a new movement in rock right now I really like. There's a whole bunch of new young bands that are coming out that are based on riffs and hooks and great vocals, and they sound like they are from 1973, but in reality they are young new bands. I like that. I don't know which one of those bands will break through, or if any will be the next big thing, but I am rooting for many of them. Here are a few names: Kyng, there's a band called Rival Sons, Scorpion Child, Anti Mortem. There are just a few of the names of bands that I am rooting for to break through, because I like the direction. \n[Hey Eddie! My first Black Sabbath record was Heaven and Hell and I get some grief from my metal buddies about it because it's not the Ozzy Sabbath. Do you ever get that same grief (from Jim or Don etc\\)?](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomo3t?context=5)|No, and even if I did, my entire career has been based on not caring what other people think. And that's not to sound egotistical or self-centered, it's just that I don't believe in being influenced by other people as far as what's cool and what's not. To me the only thing that matters is if you like it or not. And for me I'm transparent and open about the things i like, whether they are a hip and cool band or not. For me the first Sabbath record and the most special one in their catalog is Heaven and Hell. It's also a product of my age, I'm 49 years old and when it came out I was 15. So that was when I discovered Black Sabbath, was at 15, and it makes sense that at that time I would get their new record which was Heaven and Hell. Of course I went and checked out their past records, but the Dio records were very special to me. So you shouldn't have to apologize to anybody for that. \n[Hey Eddie, been watching TMS for a long time now. I have to ask, which of the guest guitarist were you favorites to have playing live?](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomljm?context=5)|John 5 is always unbelievable. He's amazing, he's a huge fan of the show, and he probably has gained more fans from playing on our show than any other guitarist just because there are a lot of people that were not aware of him until they saw him play on our show. So John 5 is one that immediately comes to mind, but there have been so many. On the recent season, Yngwie Malmsteen was a standout. \n[On a scale of 1-10, how cool and genuine is Sammy?](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chon63s?context=5)|One of my favorite people. Just so much fun to hang with and to straight shoot with. You can be just as straight back to him, you don't have to pull any punches around him. He's just so much fun and genuine. I love guys like that. \n[What are a few bands that definitely aren't hard rock/metal that you really enjoy listening to?](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomjru?context=5)|Soul Asylum is for sure one of my favorites. they are more a straight up rock band that started more as a punk thing at one point but I like their later records better. I think that their leader, David Tirner, is a brilliant songwriter. And the first band that i was ever exposed to as a little kid I still listen to to this day, and they are a power pop band called The Raspberries.\n[What episode of That Metal Show was the most fun to film for you?](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomjru?context=5)|Oh that's easy! We used to do 2 shows a day. And 2 years ago for my birthday, we filmed a show on my birthday and one day the first ep we shot was with Sammy Hagar and Michael Anthony, 2 of the most fun people you'd want to hang out with. And the next ep we shot was with Steve Harris from Iron Maiden, who I'd been trying to get on the show forever. And in one of the 2 episodes they surprised me with a birthday cake that Steven Adler jumped out of.\n[Hi Eddie,  Do you have any good David Lee Roth stories? Also, I was wondering if you have heard the latest from Tesla. If so, what do you think?](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomudz?context=5)|I've had virtually no dealings with David Lee Roth in my career, unfortunately. I never really spent any real time with him, so unfortunately I don't have any stories with him. I've heard stories which are hysterical but nothing firsthand. As far as the Tesla record, I do have it, and it comes out in about a month. To me they are one of the best bands to come out of the 80s and they are still making great new music. If you like Tesla, you will like the new record, which is called Simplicity. \n[Given all the hubbub about Ace & Peter and RRHOF, what did you think of Paul Stanley's book (if you read it\\)?](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomxj4?context=5)|I enjoyed his book. I think any person's autobiography is going to obviously be told from their perspective, and I thought his book was entertaining and I thought there were a few things on it that I didn't know that i found interesting. If I had any criticism of the book, he rarely ever in the book holds himself accountable for doing anything wrong, ever. It seems like there's a lot of downsides that he doesn't really take a lot of blame for in the book, but that will be the spin that you get from any autobiography. But I think all in all it was a very good read. \n[Hey Eddie With all the music festivals out there, have you ever considered establishing/hosting a TMS Festival? ](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/choms66?context=5)|Well, anything that's branded with That Metal Show has to be done by VH1. So if there was to be a festival or any even that was That Metal Show branded, it would have to come from the network. As far as me personally, there has been some very preliminary discussions about me maybe doing some events just with my history and my name attached to them. I'm not sure where that is going to go. There are a lot of ideas out there, and we will see what materializes. But I can tell you we were recently booked by VH1 to appear at a concert in Northern California, I believe in July, where it is being billed as a TMS-sponsored concert event. And myself, Don and Jim will be there to host it, I think Anthrax is playing, Living Color, Corey Taylor. But I have a few things I'm working on myself and who knows, maybe it will all come together for all parties, it's just a question of what we can make work and what makes sense for everybody.  \n[How's Mike Piazza doing ?](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomj6k?context=5)|Mike is great. Just saw him a few weeks ago when I was in Miami. He lives in Miami beach. He has 2 daughters and a son. And he coaches baseball for the Italian league in Italy. Outside of that he has a few business interests, but for the most part he is enjoying his life and playing a lot of golf, and he is still a close friend I talk to at least a few times a week every week. He would be on my show a lot more but he's in Florida. But we are still very good friends and I just got him tickets to see the Winery Dogs next week. And he and I just went to see Avenged Sevenfold in Florida two weeks ago. \n[What's your favorite mr. bungle song?  Also do you think time is linear or cyclical?](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chongtp?context=5)|Not a huge Mr. Bungle fan so I can't give you a favorite song. But I've tried to get Mike Patton on TMS, and he's interested it's just scheduling.  If the question is if time is moving forward or if it's moving in circles, I think it's always moving forward. \n[Fellow UFO lover here!  When are you going to get that UFO tattoo?](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomlxx?context=5)|Not gonna happen anytime soon. Not a fan of tattoos or needles, but love the band. \n[Eddie, you come every year for Rocklahoma, how do you like Oklahoma? And how stoked are you for Redeemed of Souls?](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chommfk?context=5)|Oklahoma, I'm IN Oklahoma right now actually! And I've probably come to this state more than any other in the last 7 years since Rocklahoma started. I started hosting this festival when it kicked off its first year in '07, and I've been lucky enough to do it ever since. And because of coming here for the festival every year, it's opened up other opportunities for me with other promoters, concerts and venues more than just once a year. So a lot of people when I first came here, being a guy that basically grew up in the New York area, thought i would hate a place like oklahoma because it's so different. But it's actually quite the opposite, I really enjoy it for that reason, because it is so different than where I'm from, the people are all really nice and it's a completely different way of life and speed of life, so it's  real nice change of life and the people are always amazing to me here, very very kind. \n[Hey, Eddie! Big fan of TMS. Who, in your opinion, has been the best guest (or guests\\) to come on the show?](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomkpw?context=5)|The best guests are always the artists that don't take things too serious, have fun, allow you to talk about all aspects of their career (the good and the bad) without getting mad, and just watch and get into the spirit of the show. The guys who have been the best in my opinion, who have been so much fun to have, have been Bryan Johnson, Geddy Lee from RUSH, Rob Halford, Sammy Hagar and Michael Anthony, Lars Ulrich, Ted Nugent, Steven Adler - those are the guys that really are truly and come to mind immediately, they are so much fun on the show and they mix it up with us. They don't take it too serious and are completely engaged on the show and have fun with us. There are over 100 episodes we've done, there are so many more I'm not mentioning, but those are the guys that come to mind at the moment.\n[Hey Eddie, glad you could stop by reddit. I started watching TMS after my dad showed me it about 5 years ago. It's introduced me to countless bands, albums and musicians that I might never have found out about, as well as providing my dad and I with lots of laughter, great interviews and music news. So thanks for all of that. My question is:  What are your favorite moment(s\\) as a radio personality, a host of TMS, and as a person? ](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomvlx?context=5)|One of my favorite moments in radio would be back around 2006, when Axl Rose walked into my radio studio completely unplanned and unannounced. So that was certainly a huge moment and it's one of the things that led to him a few years later coming on TMS because he had already known me, and there was already some level of connection there, so that was extremely special. The parties for my radio show to celebrate the 25th and 30th anniversary of the shows were extremely special. For the 25th Anniversary Judas Priest played a private show, and for the 30th anniversary which was last year, Ace Frehley and Peter Criss played together for the first time in 20 years. There were moments where TMS would be, just getting the show on the air. What many people don't know is that I've worked for VH1 Classic since 2002 or 2003. I was a host for the channel for many many years before That Metal Show, interviewed all sorts of artists. And as far back as then, I was pushing for that sort of show, and the day that I got the call that I'd finally pushed it through was the day that I was running up the halls in my house happy that I could finally make it happen because it was something I'd been working on for about 5 years. So it was a huge day when they said they'd move forward and try the show out. So that was a special day. And then on a personal level, there's been so many great things but there's nothing more special and more moving in your life than having kids. And I'm lucky that my wife and I have a 10 year old daughter and 6 year old son, and having 2 healthy kids, the day they were born was without question the most emotional and heaviest time of my life. \n[What happened with that big announcement you posted on the TMS Facebook page a few weeks ago but never announced it?](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomm4i?context=5)|The big announcement was that we were hosting The Golden Gods, which we did and people can see this Saturday 5/24 on VH1 Classic. \n[Knowing that you're are huge rush fan, what was your favorite period of rush?  ](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomqp7?context=5)|The 70's. From Permanent Waves back. \n[How difficult is it to be an author?](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomm7n?context=5)|The hardest part for me in writing my books was typing because I'm not good at typing and I don't really know how to properly type and especially with my most recent book I sat and physically typed each word in it, which was the hardest part. The other tough part really falls on my publisher, because my editor is the one who has to go and get clearances for the photos, and approvals for pictures, and make the deals with the people who took the photos, things along those lines. For me it's just very time consuming, so making the time to focus and getting the stories written and turned in on time is definitely the hardest part. But I don't consider myself a writer really. I just consider myself a storyteller and I'm able to put those stories out in a variety of ways and one of the more recent ways has been my two books. \n[Here's a Stump the Trunk question, Eddie: can you tell me the exact date Slayer's 1986 masterpiece \"Reign in Blood\" was released?](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomhz3?context=5)|I'm here to take your questions, not to do Stump the Trunk questions today. Save that for TMS. \n[Eddie, Have you ever heard of BabyMetal from Japan and if so what do you think of them?](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomywa?context=5)|I've heard of them, but I've never heard them, so I don't know. \n[The last season, you've been asking guests questions like \"What song do you wish you wrote\", and \"what band would you like to play in, and what instrument\".  Can you turn it around and answer those same questions from your own perspective?](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomqj7?context=5)|Well, I don't play any instruments at all, which is why I got into the end of the business I did. If I have one regret it's not learning to play an instrument. I took some drum lessons as a kid but never stuck with it. I'd still love to this day to be able to play guitar. So I don't play any instruments at all so it's hard for me to answer that sort of stuff because in order to write songs, I mean, I guess I could answer it in the sense that I have my favorite songs but from a musician standpoint I can't really comment on it since I\"m not a musician. That's why the questions we ask those artists are targeted towards them because they are musicians. \n[Hi Eddie! Being Adrian Vandenberg has a new group together, any chances of having him or the new band on the show..? Thanks!! ](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chon7yk?context=5)|I haven't heard the band, and we don't have any plans to do any new episodes for a while, so when we do, I'll certainly entertain it. But I would tell everybody the same thing, because one of the number one things I get are requests for artists to be on TMS. And there's a process to it: They have to be available when we tape, they have to want to do the show, and we need to want to have them on the show (So the network has to say that we want to have them on the show). \n[Eddie, it was such a sad day when Jani Lane left this world. That was such a bittersweet interview on That Metal Show. If you could do it all over again, what would be your final question for Jani?](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomq0h?context=5)|I'm pretty comfortable with the way we did that interview and the way it was. In hindsight, of course we didn't know that a few weeks later he would be gone, and I think that the thing I'm most happy about that interview is that he was on TV again and he was being treated respectfully. I think so many shows and references to his music and to him in general have always been about the glam or hair era, and all that sort of stuff. I think on our show he was given a much more respectful platform to talk about the records and the songs that he made and how he feels about them during the very limited time we had. After that show aired and after he passed away his family reached out to me and were very thankful that the last thing people saw and heard of him was him being treated with respect as a musician on my show. And that meant a lot. \n[Eddie, you had mentioned a while back that Ace was considering doing full album shows. Do you think he'll do this around his new album? Would love to see a '78 solo album show.](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomq73?context=5)|I don't, simply because he does have a new album, and when people have new albums to promote, they want to play that material instead of playing a record that's 35 years old or better. So unfortunately if he was to do that (and I've discussed it with him) it would most likely be between records. You don't want to launch a new record by playing music that came out in 1978. So although I've discussed it with him, I don't think that will be what he will bring. I think the focus will be on his new album. \n[Thank you being my metal nerd inspiration! I adore Bloody Roots on Liquid Metal and TMS.  Which movie did Jamey Jasta take his mom and grandma to?  Keep it brutal \\m/](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chompjy?context=5)|He never told us! To this day, he never told us, so I honestly don't know. \n[What's up, Eddie!  What are some newer metal bands that metal fans may not know about but you recommend we all check out?](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomkd3?context=5)|See previous answer!\n[You seem to be a pretty big part of what I consider the NYC Hard Rock scene. Any chance of a \"supergroup\" coming out of this group of musicians?  ](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomox7?context=5)|Unfortunately I don't think there are enough bands based in NYC as far as major artists to generate a supergroup. one of the reasons why for YEARS we did TMS in Los Angeles was because 95% of the biggest name musicians live in that area. So it's very hard for stuff like that to happen and those sort of jams to happen in a place where virtually no major artists live anymore. There's a couple but it's nothing like LA where all the musicians live. So that's an area of the country that is much more viable for a group to come together like that than NY where it's just a handful of major artists still living. \n[I can't wait to see Golden Gods on Saturday! What was your favorite part about hosting the show?](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomqye?context=5)|Just being in a setting with such an eclectic mix of artists - there's new bands, older bands, so many different genres of rock and metal, you had everything from extreme metal bands to the former guitar player of Bon Jovi there, it was a wide, wide mix of artists represented. And many of them I knew and many I didn't, so it was cool to meet some people I hadn't met or known much about. And also to see the impact of that Metal Show on the rock community, it's always amazing to me, I've had actors, a woman who's in NCIS, a guy who's in TRUE BLOOD, all come up to me and say they are huge fans, and that is kind of surreal to me because I know musicians watch the show but to see people who are not musicians who are huge fans of it is very cool. So it was great to be around it and on it and mix with all these people from all these different worlds, all these different people from metal and rock coming together for one night. \n[How do you feel about the hate and ridicule that Nickleback seems to get.](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomrv3?context=5)|It shouldn't bother them at all or their fans considering they are an enormously popular band. I think whether you like them or not, you can't argue with success. And I think that when bands reach a certain level of mainstream success there will be people who love to hate them. That comes with anything, really. Whenever anything gets to a certain level of popularity, there will always be a small percentage of people having a fun time taking shots at you to knock you down a peg. Most of the time when that happens the artist is so far beyond it that you have to roll it off your back whether it's you the artist or you as a fan. So I think Nickelback is successful enough that they aren't worried about people who don't like them. \n[Hey Eddie!!! First of all, you rock. You're the omniscient god of Rock. I would like to know your thoughts on the late interview to Slash @ David Letterman's show, and his biography presentation.  ](http://www.reddit.com/r/IAmA/comments/268f4b/i_am_eddie_trunk_host_of_vh1s_that_metal_show/chomkyu?context=5)|I didn't see it. Can't comment on it because I didn't see it. But Slash is a good friend and wrote the forward for my latest book. \n\n\n*Last updated: 2014-05-26 21:01 UTC*\n\n*This post was generated by a robot! Send all complaints to [epsy](/message/compose/?to=epsy).*\n\n",
  "hide_score": false,
  "_api_link": "https://api.reddit.com/r/tabled/comments/268scw/table_iama_i_am_eddie_trunk_host_of_vh1s_that/?ref=search_posts",
  "locked": false,
  "edited": 1401138317.0,
  "title": "[Table] IAmA: I am Eddie Trunk - host of VH1's That Metal Show, radio host, author, and rock expert - AMA!",
  "created": 1400796990.0,
  "_comments_by_id": {}
}