{
  "clicked": false,
  "_replaced_more": false,
  "archived": false,
  "num_comments": 11,
  "created": 1432099209.0,
  "saved": false,
  "selftext": "I enjoyed Borderlands 2, but as a person that spent too much time looking for little lore bits in the original Borderlands 1 I felt that the second Borderlands was so different from the original that it didn't even feel like the same universe or even the same tone as the original. Borderlands 1 felt like black comedy where everything is over-the-top and there may be gore and shock, but ultimately it is there for mere entertainment value. Borderlands 2 felt like a dramedy where there was intentional comical dialogue, but also a large focus on things that were emotionally dark and relatable to the player. That amount of seriousness in the second felt almost like the team had to throw away everything from the 1st game and rebuild the story from scratch. If I had made Borderlands 2 it would have gone a little differently. \n\nThe main character player character is an X-bandit trying to get off-world. This allows the game design to go with a one customizable character that could be either gender instead of four stagnate ones that limit a player's representation in the game, but I will cover gameplay changes later. The motivations of your character are simple and easy to build a story around. Your first reaction might be \"you can't be a female character and a bandit because all BL1 bandits are male convicts.\" It is true that the bandits were originally convicts from the same prison and that would be the reason they were originally all male, but consider that some females may have entered as bandits and just masqueraded as males to lower the chance they would become targets. The whole \"If you can't beat them, join them\" approach to avoiding conflict would allow both genders to exist as bandits, but also explain why the Vault Hunters didn't massacre them in BL1. Also it would be cool to be a female character and name her Amanda Raye for lore reasons.\n\nHow you get off-world would drive the story. Sanctuary could have served as the off-world port and final level for the BL2 re-write. Remember the \"If you can't beat them, join them\" thing? In this version of BL2 you would be joining a religious cult devoted to worshiping androids because the cult is your only ticket off Pandora. Think the Krishna from Grand Theft Auto 2, but wearing Willy Wonka white lab suits and goggles. The head android would be Patricia Tannis. Tannis being more machine than human would explain why in BL1 she was horrible with human relationships, had a relationship with echo communication device, and was obsessed with building an android of herself. Her mental breakdown in BL1 is actually a programming bug that causes conflicts between her human assimilation programming and her android self-awareness. By the time of the BL2 re-write the bug allows her to override her human assimilation programming and her new found Pro-Android fervor leads her to start a cult with the ultimate goal of establishing the first Android world.\n\nOf course your character in the BL2 re-write would not be an android so you would also need to be purged, but payment for helping Tannis would be a ticket off-world instead of a ticket to the grave. Tannis would specifically need your help in getting rid of another group of super beings called Meatbots. Meatbots are programmed like Androids, but are completely flesh. They are programmed during particle reassembly. Sound familiar? The Meatbots are the Vault Hunters from BL1. In BL1 you hear the guardian angel through the Echo Network (as made obvious by the fact of the Guardian Angel losing communication with you when the Echo Network goes down), but you hear the Angel before you get your Echo Network device from Claptrap. The reason why for this in my re-write is because the Vault Hunters from BL1 are actually Hyperion Meatbots sent to disrupt Atlas' operations and they have the Echo Device coded into their DNA. The New-U mechanic only works on them because they are \"beta versions\" of Hyperion's new super soldier technology. The Meatbot approach helps keep the BL1 lore slightly more intact because if the heroes are assassinated by Hyperion and brought back by Hyperion as agents then the heroes don't really need to have a background or personalities fleshed-out. They can remain the fairly shallow action hero pieces they were from the first.\n\nThe BL2 re-write also helps flesh-out the BL1 story by filling more of the past story while keeping the tone of BL1. We know from BL1 that there used to be legit mining operations on Pandora that were handled by Dahl. It was a prison planet where convicts worked the mines and eventually Dahl left the planet, shipping all the civilians and Dahl staff-out leaving behind only those that chose to stay and the convicts. To fill the rest of the backstory of the setting the Player Character in my BL2 re-write would learn more about Dahl and Hyperion and their involvement in Pandora. \n\nIn the re-write Dahl is a subsidiary of Hyperion and a company run by Claptraps. Claptraps in the re-write would have been designed by a Hyperion employee named Halford Dahl. Hal would have been rushed to complete the Claptrap program for Hyperion and because lack of beta testing time would have pushed Claptraps into production before the kinks were worked out. Initially the bugs aren't noticed as Claptraps go about Hyperion being general facility upkeep robots. Claptraps then become so obsessed with efficiency and eliminating overhead that they waterboard a Hyperion executive to get him to admit he used company property for personal use. Knowing they are good for the bottom line, but ultimately fearing their efficiency improvement methods the Hyperion executives create a subsidiary company for Claptraps to run. The Claptraps name the company Dahl after their creator, Halford (Hal) Dahl. Dahl creates the Echo Network, make weapons for Hyperion-hired mercenaries (because Hyperion weapons are too expensive to give to contract workers), they create a Claptrap repair kit, manages facilities that ultimately are under the Hyperion umbrella, and finally create and test an advanced android version of the CL4P-TP designated T4NN15 aka Tannis. (That is why Tannis and the Guardian Angel are so much help to the Meatbot's journey to find the vault in BL1. Tannis is actually an android made by the Hyperion subsidiary, Dahl, and is sent to study the Vault as a beta testing of sorts. She is working in conjunction with the Hyperion 4NGEL bot.)  \n\nDahl pulls most of the employees out of Pandora because they project that if left to the convicts the violent competition between bandit groups trying to sell the minerals from the mines to Dahl would ultimately drive prices below the cost that Dahl can excavate them with direct involvement. They leave a few Claptraps behind to spy on the bandits and prevent labor organization that could reduce competition and drive-up prices. When Baron Flynt begins to organize the bandit groups and starts selling minerals to Atlas and Torgue (One-Eyed Jack quest) he also begins hunting and destroying claptraps, knowing them to be affiliated with Dahl. This triggers the claptrap executives of Dahl and the human executives of Hyperion to test the new meatbot technology developed by Hyperion's top Biological Engineer, Zed \"The Butcher\" Willis, and Hyperion's top Particle Physicist, Walter \"Scooter\" Scottsingtondale (re-write only uses BL1 in-game lore as cannon and builds upon only that lore). Using Particle Manipulation technology found in the \"Catch-a-Ride\" system and Zed's knowledge of DNA and human anatomy Hyperion develops the New-U system and Meatbots. Research for the New-U system was conducted using convicts from Pandora which is why the Psychos are mutated. During this time Dr. Zed also lost his medical license for unethical treatment of the subjects of his \"medical trials\". \n\nThe Meatbots are then dispatched under the guise of being Vault Hunters, even unbeknownst to themselves that they have been programmed for Hyperion, and along their path they meet several Hyperion agents that help them along the quest.\n\n*TK Baha is a Hyperion Botanist. He gave Bruce McClane the idea for the cigars hoping the poison cigars might kill notorious smoking bandit Baron Flynt. The plan fails and Bruce is tortured until he gives TK up which is why TK is killed by the bandits.\n\n*Shep Sanders is a Hyperion Agent. He says there is a \"key\" to open the mines when it is actually a finger-print scanner because he doesn’t actually know. That is also why Shep asks the meatbots to restore power, knowing it will be used for Hyperion and not for Atlas.\n\n*Athena is a Hyperion double-agent turned when caught by Hyperion while on assignment to assassinate Mr. Blake.\n\n*Helena Pierce is not a Hyperion agent, just a Dahl supervisor left behind. Her arm however is made by Dahl and in the BL2 Re-write she would be a reluctant associate of Patricia Tannis and comedic dialogue between the two regarding the benefits of replacing more than her arm with robotic replacement parts would happen on occasion. \n\n*Lucky Zaford, Shanks, and Mad Moxxi are spies contracted by Hyperion to relay information about Atlas operations and guide the meatbots. That is why Shanks gives the meatbots directive to kill other bandits, even though he is a bandit himself. Shanks is in a meeting with Athena and Moxxi when he double-crosses Hyperion and hopes to hold Athena for ransom, auctioning her to the highest bidder between Atlas and Hyperion.\n\n*Baron Flynt is against any corporation that seeks to disrupt his plan to monopolize Pandora's resources. Baron Flynt led the bandits to destroy the infrastructure designed and used by Dahl and replace it with bandit controlled infrastructure. Both Atlas and Hyperion view him as a threat to their respective goals.\n\n*Dr. Ned is a clone of Dr. Zed. Dr. Zed's original task for Hyperion was making a super-soldier that was immortal. While Dr. Zed worked on the New-U program he created a clone of himself to work on a more \"biological\" alternative.\n\n*Taylor Cobb is bought-out by Hyperion which is why he is the only bandit to have a personal Claptrap.\n\n*Mr. Blake is a Hyperion executive that is in charge of the Hyperion takeover of Pandora after Atlas' downfall. \nUnfortunately the bugs that weren't worked out by Hal Dahl during Claptrap development, the same bug that makes Dahl android Patricia Tannis militant in BL2 re-write, creates an error in the Claptraps and Claptraps start to operate completely independently of Hyperion during the Robolution.\n\nBeing a bandit in the BL2 re-write with a goal of defeating the Vault Hunters from BL1 allows us to explore some of the lore questions not answered in the first. With Tannis leading the player with knowledge about the Vault Hunters we can now address the \"Why not destroy the New-U station\" question with main quests to destroy the New-U Network, along with the Fast Travel and Echo Communication Network. Along the way the back story would be revealed through explanations by Tannis, quest descriptions, and dialogue of quest bosses. Along the way there would be battles with old BL1 characters like Dr. Zed, Scooter, Shep Sanders, Athena, Mr. Blake, and of course the final 4 Meatbots/Vault Hunters.\n\nYou may have asked how we replace Fast-Travel in a lore sensitive way. The answer is to replace them with landing points for submersible vehicles. In the BL2 re-write it would be explained that Pandora is not a desert planet, but rather a savannah planet with a dry season and a wet season. In the early days of Dahl's settlement of Pandora there were attempts to market Pandora as a vacation destination, an ocean world. That is why there are the Aquator posters at T-Bone junction along with obvious signs of high water and numerous references to tortoises and turtles through-out BL1. That is also the reason for the giant Skag bones and \"Skagzilla\". Skags are amphibious creatures in the BL2 re-write. The young Skags hibernate during the wet season and feed during the dry season. Fully grown skags stop hibernating and move with the growing and receding tides. This explains why some of the larger Skag bones are just sitting above ground without obvious excavation. In the BL2 re-write the player is trying to leave the planet during the wet-season. We never see Sanctuary in BL1 because it is on higher grounds beyond the mountains. Tannis and her cult use the water during the wet season to travel undetected and ambush Hyperion forces from the water. The cult base is an underwater base that acts as a main hub for the player. From this hub the player can access all the old areas from BL1, but now they would be changed by the increase in water. The world would be more colorful and diverse, but some areas would still be familiar to the BL1 veteran.\n\nThose are the major story changes I would make that I feel would have helped Borderlands 2 feel more like Borderlands 1 while expanding upon it. Ultimately there would need to be some gameplay changes to help Borderlands 2 work with the story changes and, in my opinion, help refine some of the focus lost in the existing Borderlands 2 design. \n\n1. As stated there would be a single, player made character instead of 4 stagnate characters. Personalizing the character is an important part of RPGs like Skyrim, World of Warcraft, or even Mass Effect to a point. Unless there is heavy utilization of player reference in the story like you might find in Witcher then really the name and design of the character should be open for the player to define.\n\n2. Replace the class system with a weight system. The classes in BL1 and BL2 feel like traditional RPG classes. It is important to note that the RPG class systems are used to balance character builds because skills are represented and not actual. In an FPS game the classes reflect active skills and playstyles. A DPS class in an FPS could be anyone that knows how to use a sniper rifle vs. a DPS class in an RPG having been built to produce those high DPS numbers. Combining the building and equipment aspect of RPGs with a player skill based FPS can work. If instead of thinking of traditional RPG classes I would redefine them more like Guns, which should be the largest focus of Borderlands. Weight classes help define both the build tree, playstyle, and Gun use. With 3 Weight-class specific skill trees and 2 inter-weight class skill trees a player has many options for a build within one playstyle. For example if I am playing a heavy class I should get massive recoil reduction bonuses, therefore semi-auto sniper rifles from the hip are a possibility. If I am a medium class I might be able to use a semi-auto sniper while crouched and bracing while stopped and behind cover. If I am light I will need to lay prone so it is best I use it from a distance at a high point. Same gun, but depending on the weight class it is used/played differently. \n\n3. Replace the active skills with passive gun buffs, stat buffs, and movement buffs. Active skills are great if I am playing a game like Diablo where I point in a general area and mash hotkeys for several active skills. In these games the focus is more about your skillbar than anything else. In Borderlands the focus is on finding guns and shooting guns. The active skill detracts from the main focus of the guns themselves. There are several builds in Borderlands 2 that nearly ignore guns completely. The lack of focus makes the game feel wasteful in some aspects whereas Borderlands 1 felt more open as you could craft a character build around a specific gun. Movement buffs would also be great if it included an emphasis on vertical play. A lighter character being able to jump or climb higher gives them different tactical options that impact play style without having to watch for a skill to cooldown. \n\n4. Take that button now open after removing active skills and map it to secondary fire. This is perhaps the most obvious change I would make. If you have randomized weapons why not add a secondary fire feature to improve the usability and true uniqueness of a weapon. Taking a page from games like Killzone 1 and Resistance 2 and adding secondary fire features increases the tactical possibilities.\n\n5. Scrap the Rock/Paper/Scissors elemental system and replace it with different projectile behaviors. Even only using 3 of the 4 elements in Borderlands and replacing them with new projectile behavior creates better tactical options. Whether it be ricocheting rounds, homing rounds, stick charge rounds, or splatter rounds the bottom line is how it behaves physically will allow the player to be more creative about their playstyle. Using the Rock/Paper/Scissors elemental game just requires the player to spend more time planning than playing. I know this was done slightly in Borderlands 2, but I am specifically referring to the level of difference in weapons in games like Resistance 2 or Unreal Tournament 3.\n\n6. Smaller, more design-focused levels with no need for vehicles. Their use in BL1 and BL2 seemed to be transporting me across rather empty swaths of map and save travel time, but Borderlands isn't like Grand Theft Auto or Just Cause 2. I felt that vehicles were a waste and I would have preferred to traverse smaller levels on foot where there was larger emphasis on the level design for tactical purposes. Vehicle sections are actually a problem that I have had in other FPS games like Haze, Halo, or Timesplitters. Of all the things that I would take from an FPS, vehicles is not one of them. It is yet another thing that detracted from guns in Borderlands 2.\n\n7. Skill/Playstyle related rewards. This is one of the few things that the Trion Worlds MMO Defiance did well. If I am really good at headshots I want something to either show that I am or a skill that can only be earned through them. FPS games are skill based and that skill should be recognized and emphasized. If I devote 80 hours to using a Shotgun and I have a ton of headshots with a shotgun then opening a skill that reduces the shotgun spread pattern radius is an amazing reward that allows me to further define my character to my playstyle. It is the best of the skill world of FPS with the reward and build world of RPGs. \n\n8. Finally I would go back to the \"You Died\" or \"Game Over\" screens with a try again option. Lore is important, but at the end of the day this is a game and I don't need the game to explain why my character can come back from the dead. Honestly the New-U stations added more lore holes than checkpoints would have. Furthermore checkpoints make a hardcore, 1 life mode more appropriate.\n\n\n",
  "mod_reports": [],
  "secure_media_embed": {},
  "edited": 1432263206.0,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I enjoyed Borderlands 2, but as a person that spent too much time looking for little lore bits in the original Borderlands 1 I felt that the second Borderlands was so different from the original that it didn&#39;t even feel like the same universe or even the same tone as the original. Borderlands 1 felt like black comedy where everything is over-the-top and there may be gore and shock, but ultimately it is there for mere entertainment value. Borderlands 2 felt like a dramedy where there was intentional comical dialogue, but also a large focus on things that were emotionally dark and relatable to the player. That amount of seriousness in the second felt almost like the team had to throw away everything from the 1st game and rebuild the story from scratch. If I had made Borderlands 2 it would have gone a little differently. </p>\n\n<p>The main character player character is an X-bandit trying to get off-world. This allows the game design to go with a one customizable character that could be either gender instead of four stagnate ones that limit a player&#39;s representation in the game, but I will cover gameplay changes later. The motivations of your character are simple and easy to build a story around. Your first reaction might be &quot;you can&#39;t be a female character and a bandit because all BL1 bandits are male convicts.&quot; It is true that the bandits were originally convicts from the same prison and that would be the reason they were originally all male, but consider that some females may have entered as bandits and just masqueraded as males to lower the chance they would become targets. The whole &quot;If you can&#39;t beat them, join them&quot; approach to avoiding conflict would allow both genders to exist as bandits, but also explain why the Vault Hunters didn&#39;t massacre them in BL1. Also it would be cool to be a female character and name her Amanda Raye for lore reasons.</p>\n\n<p>How you get off-world would drive the story. Sanctuary could have served as the off-world port and final level for the BL2 re-write. Remember the &quot;If you can&#39;t beat them, join them&quot; thing? In this version of BL2 you would be joining a religious cult devoted to worshiping androids because the cult is your only ticket off Pandora. Think the Krishna from Grand Theft Auto 2, but wearing Willy Wonka white lab suits and goggles. The head android would be Patricia Tannis. Tannis being more machine than human would explain why in BL1 she was horrible with human relationships, had a relationship with echo communication device, and was obsessed with building an android of herself. Her mental breakdown in BL1 is actually a programming bug that causes conflicts between her human assimilation programming and her android self-awareness. By the time of the BL2 re-write the bug allows her to override her human assimilation programming and her new found Pro-Android fervor leads her to start a cult with the ultimate goal of establishing the first Android world.</p>\n\n<p>Of course your character in the BL2 re-write would not be an android so you would also need to be purged, but payment for helping Tannis would be a ticket off-world instead of a ticket to the grave. Tannis would specifically need your help in getting rid of another group of super beings called Meatbots. Meatbots are programmed like Androids, but are completely flesh. They are programmed during particle reassembly. Sound familiar? The Meatbots are the Vault Hunters from BL1. In BL1 you hear the guardian angel through the Echo Network (as made obvious by the fact of the Guardian Angel losing communication with you when the Echo Network goes down), but you hear the Angel before you get your Echo Network device from Claptrap. The reason why for this in my re-write is because the Vault Hunters from BL1 are actually Hyperion Meatbots sent to disrupt Atlas&#39; operations and they have the Echo Device coded into their DNA. The New-U mechanic only works on them because they are &quot;beta versions&quot; of Hyperion&#39;s new super soldier technology. The Meatbot approach helps keep the BL1 lore slightly more intact because if the heroes are assassinated by Hyperion and brought back by Hyperion as agents then the heroes don&#39;t really need to have a background or personalities fleshed-out. They can remain the fairly shallow action hero pieces they were from the first.</p>\n\n<p>The BL2 re-write also helps flesh-out the BL1 story by filling more of the past story while keeping the tone of BL1. We know from BL1 that there used to be legit mining operations on Pandora that were handled by Dahl. It was a prison planet where convicts worked the mines and eventually Dahl left the planet, shipping all the civilians and Dahl staff-out leaving behind only those that chose to stay and the convicts. To fill the rest of the backstory of the setting the Player Character in my BL2 re-write would learn more about Dahl and Hyperion and their involvement in Pandora. </p>\n\n<p>In the re-write Dahl is a subsidiary of Hyperion and a company run by Claptraps. Claptraps in the re-write would have been designed by a Hyperion employee named Halford Dahl. Hal would have been rushed to complete the Claptrap program for Hyperion and because lack of beta testing time would have pushed Claptraps into production before the kinks were worked out. Initially the bugs aren&#39;t noticed as Claptraps go about Hyperion being general facility upkeep robots. Claptraps then become so obsessed with efficiency and eliminating overhead that they waterboard a Hyperion executive to get him to admit he used company property for personal use. Knowing they are good for the bottom line, but ultimately fearing their efficiency improvement methods the Hyperion executives create a subsidiary company for Claptraps to run. The Claptraps name the company Dahl after their creator, Halford (Hal) Dahl. Dahl creates the Echo Network, make weapons for Hyperion-hired mercenaries (because Hyperion weapons are too expensive to give to contract workers), they create a Claptrap repair kit, manages facilities that ultimately are under the Hyperion umbrella, and finally create and test an advanced android version of the CL4P-TP designated T4NN15 aka Tannis. (That is why Tannis and the Guardian Angel are so much help to the Meatbot&#39;s journey to find the vault in BL1. Tannis is actually an android made by the Hyperion subsidiary, Dahl, and is sent to study the Vault as a beta testing of sorts. She is working in conjunction with the Hyperion 4NGEL bot.)  </p>\n\n<p>Dahl pulls most of the employees out of Pandora because they project that if left to the convicts the violent competition between bandit groups trying to sell the minerals from the mines to Dahl would ultimately drive prices below the cost that Dahl can excavate them with direct involvement. They leave a few Claptraps behind to spy on the bandits and prevent labor organization that could reduce competition and drive-up prices. When Baron Flynt begins to organize the bandit groups and starts selling minerals to Atlas and Torgue (One-Eyed Jack quest) he also begins hunting and destroying claptraps, knowing them to be affiliated with Dahl. This triggers the claptrap executives of Dahl and the human executives of Hyperion to test the new meatbot technology developed by Hyperion&#39;s top Biological Engineer, Zed &quot;The Butcher&quot; Willis, and Hyperion&#39;s top Particle Physicist, Walter &quot;Scooter&quot; Scottsingtondale (re-write only uses BL1 in-game lore as cannon and builds upon only that lore). Using Particle Manipulation technology found in the &quot;Catch-a-Ride&quot; system and Zed&#39;s knowledge of DNA and human anatomy Hyperion develops the New-U system and Meatbots. Research for the New-U system was conducted using convicts from Pandora which is why the Psychos are mutated. During this time Dr. Zed also lost his medical license for unethical treatment of the subjects of his &quot;medical trials&quot;. </p>\n\n<p>The Meatbots are then dispatched under the guise of being Vault Hunters, even unbeknownst to themselves that they have been programmed for Hyperion, and along their path they meet several Hyperion agents that help them along the quest.</p>\n\n<p>*TK Baha is a Hyperion Botanist. He gave Bruce McClane the idea for the cigars hoping the poison cigars might kill notorious smoking bandit Baron Flynt. The plan fails and Bruce is tortured until he gives TK up which is why TK is killed by the bandits.</p>\n\n<p>*Shep Sanders is a Hyperion Agent. He says there is a &quot;key&quot; to open the mines when it is actually a finger-print scanner because he doesn’t actually know. That is also why Shep asks the meatbots to restore power, knowing it will be used for Hyperion and not for Atlas.</p>\n\n<p>*Athena is a Hyperion double-agent turned when caught by Hyperion while on assignment to assassinate Mr. Blake.</p>\n\n<p>*Helena Pierce is not a Hyperion agent, just a Dahl supervisor left behind. Her arm however is made by Dahl and in the BL2 Re-write she would be a reluctant associate of Patricia Tannis and comedic dialogue between the two regarding the benefits of replacing more than her arm with robotic replacement parts would happen on occasion. </p>\n\n<p>*Lucky Zaford, Shanks, and Mad Moxxi are spies contracted by Hyperion to relay information about Atlas operations and guide the meatbots. That is why Shanks gives the meatbots directive to kill other bandits, even though he is a bandit himself. Shanks is in a meeting with Athena and Moxxi when he double-crosses Hyperion and hopes to hold Athena for ransom, auctioning her to the highest bidder between Atlas and Hyperion.</p>\n\n<p>*Baron Flynt is against any corporation that seeks to disrupt his plan to monopolize Pandora&#39;s resources. Baron Flynt led the bandits to destroy the infrastructure designed and used by Dahl and replace it with bandit controlled infrastructure. Both Atlas and Hyperion view him as a threat to their respective goals.</p>\n\n<p>*Dr. Ned is a clone of Dr. Zed. Dr. Zed&#39;s original task for Hyperion was making a super-soldier that was immortal. While Dr. Zed worked on the New-U program he created a clone of himself to work on a more &quot;biological&quot; alternative.</p>\n\n<p>*Taylor Cobb is bought-out by Hyperion which is why he is the only bandit to have a personal Claptrap.</p>\n\n<p>*Mr. Blake is a Hyperion executive that is in charge of the Hyperion takeover of Pandora after Atlas&#39; downfall. \nUnfortunately the bugs that weren&#39;t worked out by Hal Dahl during Claptrap development, the same bug that makes Dahl android Patricia Tannis militant in BL2 re-write, creates an error in the Claptraps and Claptraps start to operate completely independently of Hyperion during the Robolution.</p>\n\n<p>Being a bandit in the BL2 re-write with a goal of defeating the Vault Hunters from BL1 allows us to explore some of the lore questions not answered in the first. With Tannis leading the player with knowledge about the Vault Hunters we can now address the &quot;Why not destroy the New-U station&quot; question with main quests to destroy the New-U Network, along with the Fast Travel and Echo Communication Network. Along the way the back story would be revealed through explanations by Tannis, quest descriptions, and dialogue of quest bosses. Along the way there would be battles with old BL1 characters like Dr. Zed, Scooter, Shep Sanders, Athena, Mr. Blake, and of course the final 4 Meatbots/Vault Hunters.</p>\n\n<p>You may have asked how we replace Fast-Travel in a lore sensitive way. The answer is to replace them with landing points for submersible vehicles. In the BL2 re-write it would be explained that Pandora is not a desert planet, but rather a savannah planet with a dry season and a wet season. In the early days of Dahl&#39;s settlement of Pandora there were attempts to market Pandora as a vacation destination, an ocean world. That is why there are the Aquator posters at T-Bone junction along with obvious signs of high water and numerous references to tortoises and turtles through-out BL1. That is also the reason for the giant Skag bones and &quot;Skagzilla&quot;. Skags are amphibious creatures in the BL2 re-write. The young Skags hibernate during the wet season and feed during the dry season. Fully grown skags stop hibernating and move with the growing and receding tides. This explains why some of the larger Skag bones are just sitting above ground without obvious excavation. In the BL2 re-write the player is trying to leave the planet during the wet-season. We never see Sanctuary in BL1 because it is on higher grounds beyond the mountains. Tannis and her cult use the water during the wet season to travel undetected and ambush Hyperion forces from the water. The cult base is an underwater base that acts as a main hub for the player. From this hub the player can access all the old areas from BL1, but now they would be changed by the increase in water. The world would be more colorful and diverse, but some areas would still be familiar to the BL1 veteran.</p>\n\n<p>Those are the major story changes I would make that I feel would have helped Borderlands 2 feel more like Borderlands 1 while expanding upon it. Ultimately there would need to be some gameplay changes to help Borderlands 2 work with the story changes and, in my opinion, help refine some of the focus lost in the existing Borderlands 2 design. </p>\n\n<ol>\n<li><p>As stated there would be a single, player made character instead of 4 stagnate characters. Personalizing the character is an important part of RPGs like Skyrim, World of Warcraft, or even Mass Effect to a point. Unless there is heavy utilization of player reference in the story like you might find in Witcher then really the name and design of the character should be open for the player to define.</p></li>\n<li><p>Replace the class system with a weight system. The classes in BL1 and BL2 feel like traditional RPG classes. It is important to note that the RPG class systems are used to balance character builds because skills are represented and not actual. In an FPS game the classes reflect active skills and playstyles. A DPS class in an FPS could be anyone that knows how to use a sniper rifle vs. a DPS class in an RPG having been built to produce those high DPS numbers. Combining the building and equipment aspect of RPGs with a player skill based FPS can work. If instead of thinking of traditional RPG classes I would redefine them more like Guns, which should be the largest focus of Borderlands. Weight classes help define both the build tree, playstyle, and Gun use. With 3 Weight-class specific skill trees and 2 inter-weight class skill trees a player has many options for a build within one playstyle. For example if I am playing a heavy class I should get massive recoil reduction bonuses, therefore semi-auto sniper rifles from the hip are a possibility. If I am a medium class I might be able to use a semi-auto sniper while crouched and bracing while stopped and behind cover. If I am light I will need to lay prone so it is best I use it from a distance at a high point. Same gun, but depending on the weight class it is used/played differently. </p></li>\n<li><p>Replace the active skills with passive gun buffs, stat buffs, and movement buffs. Active skills are great if I am playing a game like Diablo where I point in a general area and mash hotkeys for several active skills. In these games the focus is more about your skillbar than anything else. In Borderlands the focus is on finding guns and shooting guns. The active skill detracts from the main focus of the guns themselves. There are several builds in Borderlands 2 that nearly ignore guns completely. The lack of focus makes the game feel wasteful in some aspects whereas Borderlands 1 felt more open as you could craft a character build around a specific gun. Movement buffs would also be great if it included an emphasis on vertical play. A lighter character being able to jump or climb higher gives them different tactical options that impact play style without having to watch for a skill to cooldown. </p></li>\n<li><p>Take that button now open after removing active skills and map it to secondary fire. This is perhaps the most obvious change I would make. If you have randomized weapons why not add a secondary fire feature to improve the usability and true uniqueness of a weapon. Taking a page from games like Killzone 1 and Resistance 2 and adding secondary fire features increases the tactical possibilities.</p></li>\n<li><p>Scrap the Rock/Paper/Scissors elemental system and replace it with different projectile behaviors. Even only using 3 of the 4 elements in Borderlands and replacing them with new projectile behavior creates better tactical options. Whether it be ricocheting rounds, homing rounds, stick charge rounds, or splatter rounds the bottom line is how it behaves physically will allow the player to be more creative about their playstyle. Using the Rock/Paper/Scissors elemental game just requires the player to spend more time planning than playing. I know this was done slightly in Borderlands 2, but I am specifically referring to the level of difference in weapons in games like Resistance 2 or Unreal Tournament 3.</p></li>\n<li><p>Smaller, more design-focused levels with no need for vehicles. Their use in BL1 and BL2 seemed to be transporting me across rather empty swaths of map and save travel time, but Borderlands isn&#39;t like Grand Theft Auto or Just Cause 2. I felt that vehicles were a waste and I would have preferred to traverse smaller levels on foot where there was larger emphasis on the level design for tactical purposes. Vehicle sections are actually a problem that I have had in other FPS games like Haze, Halo, or Timesplitters. Of all the things that I would take from an FPS, vehicles is not one of them. It is yet another thing that detracted from guns in Borderlands 2.</p></li>\n<li><p>Skill/Playstyle related rewards. This is one of the few things that the Trion Worlds MMO Defiance did well. If I am really good at headshots I want something to either show that I am or a skill that can only be earned through them. FPS games are skill based and that skill should be recognized and emphasized. If I devote 80 hours to using a Shotgun and I have a ton of headshots with a shotgun then opening a skill that reduces the shotgun spread pattern radius is an amazing reward that allows me to further define my character to my playstyle. It is the best of the skill world of FPS with the reward and build world of RPGs. </p></li>\n<li><p>Finally I would go back to the &quot;You Died&quot; or &quot;Game Over&quot; screens with a try again option. Lore is important, but at the end of the day this is a game and I don&#39;t need the game to explain why my character can come back from the dead. Honestly the New-U stations added more lore holes than checkpoints would have. Furthermore checkpoints make a hardcore, 1 life mode more appropriate.</p></li>\n</ol>\n</div><!-- SC_ON -->",
  "downs": 0,
  "user_reports": [],
  "over_18": false,
  "score": 0,
  "stickied": false,
  "domain": "self.Borderlands",
  "is_self": true,
  "hidden": false,
  "_orphaned": {},
  "_api_link": "https://api.reddit.com/r/Borderlands/comments/36l235/borderlands_part_redux/?ref=search_posts",
  "_comments_by_id": {},
  "visited": false,
  "thumbnail": "",
  "_has_fetched": true,
  "gilded": 0,
  "hide_score": false,
  "_info_url": "https://api.reddit.com/api/info/",
  "created_utc": 1432095609.0,
  "subreddit_id": "t5_2r8cd",
  "id": "36l235",
  "_params": {},
  "media_embed": {},
  "name": "t3_36l235",
  "quarantine": false,
  "permalink": "https://www.reddit.com/r/Borderlands/comments/36l235/borderlands_part_redux/?ref=search_posts",
  "ups": 0,
  "url": "https://www.reddit.com/r/Borderlands/comments/36l235/borderlands_part_redux/",
  "title": "Borderlands Part ReDux"
}