{
  "selftext": "I thought I'd post this just to point out that this sub is not as depressing as it might look. I think people who say it is (a) might not come here that often, and (b) are probably more affected by the negative stories than the positive ones, giving them the impression that it's all doom and gloom. So there are three categories below, roughly equating to stories posted about \"not about dying on a bike\", \"cyclist deaths\" and \"things which might cause cyclist deaths\". I've gone back roughly two months.\n\nPersonally I think the articles posted recently have been excellent, but would like to request more original content such as blog posts (preferably which you have written), ride reports and, of course, photos. Just be mindful of the \"no memes / image macros\" rule and let's not become \"New Bike Day Mk II\" please :)\n\n#All stories (221)\n\n##Not about cyclist deaths or threatening behaviour (194 / 87.8%)\n\n* Anyone know the owner of this Norco bike? I saw someone stealing a wheel off it last night outside Balham station ...\n* Why do so many cyclists use roads when there is a cycle path running alongside?\n* Bradford's new Cycle Super Deathway | The Alternative Department for Transport\n* The European Cycling Industry employs around 650,000 people, substantially more than even the United States 'Big Three' automotive companies ...\n* Cllr Adolf finds out just how bad his transport dept is at spending Cycle Ambition money\n* Infrastructure for all | \"What's required is infrastructure suitable for the young and the old ...\"\n* I just emailed my local council re: the poor road surface - does anybody else do the same?\n* Cycle campaigners want to create an 85-mile traffic-free circuit from Bristol to Somerset\n* \"Motorists stay back\" T-shirt part of new clothing range from 100 Climbs\n* Leeds-Bradford CityConnect: an update | The Alternative Department for Transport\n* London's top cycling cafe stops revealed by Strava - Cycling Weekly\n* [Cambridge] Milton Road Segregated Cycleways Petition (x-post /r/cambridgecycling)\n* That Bradford junction: some suggestions | The Alternative Department for Transport\n* London Roads task force update report april2015\n* Royal Parks say no to Cycle Superhighway, forcing cyclists onto busy junctions\n* toddler is knocked over by 'hit-and-run' cyclist outside her Blackpool home...Anyone know this guy?\n* Boardman calls on Cameron to get moving\n* Boardman: Motorists should be held liable for collisions with cyclists\n* Brits are cycling more, DfT stats show\n* Cycling Scotland's new campaign says Give Everyone Cycle Space - but is it enough room? (+ video)\n* Getting a new bike from Halfords\n* Homepage - Cycle City Ambition Programme - Nottingham\n* London bike-jackings hit 10 a week, say Metropolitan Police\n* What to be aware of when buying a bike?\n* My friend came up with these awesome handlebar lights to help save lives ...\n* We Are Not Pedestrians on Wheels\n* New cycle \"route\" in Leeds, Regent Street. (They are taking the piss.)\n* Guildford to Brighton\n* Officer given written warning for decision not to prosecute driver who hit cyclist while on wrong side of road\n* CityConnect: You'll get what you're given | The Alternative Department for Transport\n* Any one bought one of these trailers? Prices vary wildy, wondering what you don't get in the lower models.\n* Brent Council - Regent's Park to Gladstone Park Quietway Cycle Route\n* Cycling events in the New Forest: Summer 2015 ...\n* OPINION: Not another bloomin' radio phone-in about cyclists\n* /r/UKbike, we'd really appreciate your insight\n* Are you at risk from people wearing shoes with wheels in them? ...\n* Neither one nor t'Other! (Salford's proposed Cycle Infrastructure.)\n* Cheapest Bike Upgrade To Climb Hills Faster \n* Livingston jogger dies after being hit by cyclist\n* Starting from the bottom. Any info much appreciated!\n* Downlights for trucks paint 'no go' area for cyclists\n* I am driving support vehicle for a charity bike ride - any tips?\n* Unreliable Evidence - The Law of the Road (Radio 4)\n* Guildford to Brighton\n* Anyone used the Garmin Edge 200?\n* Cyclist brings private prosecution against Plymouth police officer\n* Is the cammeraderie on the road between cyclists only in cycling?\n* Dramatic video shows crowd lift double-decker bus to save life of trapped unicyclist ...\n* Accept cyclists on road (From The Argus)\n* Legal challenge to East London Mini Holland cycling scheme launched\n* HGVs failing to fit hi-tech cyclist savers\n* New £380,000 cycle and pedestrian bridge to open on Friday\n* Help me Pimp my Pashley...?\n* 14 hours in London - help!\n* Cycle to Work Scheme - All from the same retailer?\n* The most expensive 20 feet of road in Hampshire is causing cycling crashes\n* Pirory Lane road rage (x-post from /r/cycling)\n* Lawyers warn of cyclists' tram risk\n* The user experience | At War With The Motorist\n* \"When you are queuing in traffic you do not have to think that much.\"\n* Naked cyclists take a hard line on 'aroused' protest participant\n* The Easy Option - Beyond the Kerb\n* [Change.org] Jason Wells founder of Brew Cafe: Cycle to work for a year. \n* The solution is design | As Easy As Riding A Bike\n* Bec Hill Climb turning to crowdfunding for 2015 event.\n* Australian butcher Jason Wells caught in extraordinary road rage rant at cyclist: I'm sorry\n* Jason Wells founder of Brew Cafe: Cycle to work for a year after attacking cyclist\n* Could augmented reality make urban cycling easier and safer? \"Potential of a soft infrastructure which can be overlaid on existing urban fabric ...\"\n* Them and Theirs - Beyond the Kerb\n* Singletrack Magazine Response to the R4 You & Yours Phone-in On Cyclists.\n* Glasgow City Council's latest attack on pedestrians and cyclists\n* Peloton Cycling Jersey's £20 with code JERSEYSALE\n* Cycle tour route advice.\n* Anyone here cycle on a keto / low-carb diet?\n* Bike boom powers Halfords to £1bn sales \n* There and back again: riding 373 miles across Wales over a weekend. \"There's no headline sponsor ...\"\n* Who to contact regarding getting a footpath reclassified to something more bike friendly?\n* Bike recommendation for heavy guy? \n* Highways England to roll out 606 cycle routes - Get Britain Cycling\n* (x-post from r/bicycling)Thermal cameras will watch for waiting cyclists and turn traffic lights green\n* London to Brighton - transport from St Albans/Herts\n* London cycling commissioner: \"Cycle superhighways came close to not happening\"\n* Pretty good Groupon deal today: £209.99 for a Viking Zenith, 239.99 for one Viking Peleton Carbon ...\n* Active cities 'boost bottom lines'\n* Boris On Making Cycle Highway Mandatory\n* The secret history of 19th century cyclists ...\n* Residents trapped by cyclists in Cardiff. Diddums.\n* Cyclists who fail to use dedicated lanes 'could be fined'\n* Dangerous driver races by off duty police on bicycle...\n* Calais to Montpellier\n* Wiggins' £6000 Hour Record chain (video)\n* Did a double take at the model sticker on this bike...\n* Road Bike Survey Win a GoPro Hero 4\n* Front of Bus Cycle Racks, the DVSA says no.\n* Traveling to England from California for a month (July-August) this Summer ...\n* Space Invaders | As Easy As Riding A Bike\n* Turbogate: Bedford and beyond | The Alternative Department for Transport\n* Why cargo bike deliveries are taking over the UK's cities\n* My local cycle lane, ladies and gentlemen... \n* Giant Rove 0 // Specialized Ariel Elite Disc // or something else?\n* Cycling participation in England rises 22% in a decade\n* Sign up for the Flagg Cycle Challenge in the Peak District!\n* Bike thieves target houses with cycle carriers on cars parked outside\n* (x-post r/bicycling) NBD - can't wait to start commuting on this beast!\n* Vietec Heating doesn't do work for cyclists.\n* Designed to Move\n* My South West UK cycle tour.\n* Some dimwit has locked their bike to mine. I'm infuriated!\n* where to even begin? Help me and the lady.\n* Looking for super-low maintenance belt-driven bike £800 budget\n* Do any of you guys commute through the winter?\n* Write-up and photos from Mountain Mayhem, the 24 hour mountain bike race\n* Hybrid or Road Bike\n* A beginner looking for a commuter\n* Dunwich dynamo\n* Get Britain Cycling Magazine 2015\n* Road Bike Survey - Last chance to win the GoPro Hero\n* Cyclists of Reddit, I am short and fat. Can I ride a bike without being in agony?\n* I am interested in doing a semi long distance cycle ...\n* The gap | As Easy As Riding A Bike\n* New cyclist friendly traffic lights in Liverpool.\n* I've just been given a cycling challenge - Help me out!\n* How to make the most money back on an ill-advised purchase?\n* Travelling to France by train with bikes and tent, suggestions welcome\n* Today r/YorkCycling was born, if you're a cyclist in york please come and help our sub grow!\n* Yo, I want a bar mounted phone case, recommend me one plz\n* Daily Mail at its best\n* Biker assaults two ppl cycling in stoke, uploads video. Can you find the victims?\n* Beautiful 1938 Aluminium Caminargent in Coventry Transport Museum [potato]\n* maidstoneonbike: Maliciously bad cycle facilities. Wow.\n* What can/should I do next?\n* Best place to look for used bikes for a tall new rider?\n* Radstock, A Sign of Failure\n* Protest at Bank 8am tomorrow after cyclist dies at junction\n* Us, not \"Them\" | As Easy As Riding A Bike\n* Bravo Cemex! - They are trialling the new low-cab Mercedes Econic tipper in London \n* Giant OCR Compact Road bike\n* Top things I would change to make Cycling safer. \n* What power do the police have in making sure cars don't park in bike lanes?\n* Interesting TDF stage breakdown (xpost from r/bicycling/) \n* MP backs peak hours on 'dangerous' lorries to protect cyclists\n* Perpetuation of the \"road tax\" concept\n* Mobile phone using drivers monologue on \"bloody cyclists\"\n* How to get from Heathrow to King's Cross with my bike and all my gear?\n* Thoughts on the Btwin Triban 500 Hybrid?\n* Cheap roof bars for moving two road bikes \n* Does anyone know of any propper bike shops in the midlands ..?\n* Purchasing a bike need some advice\n* Comment: Is a single bike rack mysteriously causing congestion?\n* Martyn Ashton - Back On Track\n* Tram tracks present biggest danger to Sheffield cyclists says campaign group\n* Do any of you use a 'Hook turn' or 'Two stage turn' to turn right on fast roads?\n* Road tax, red lights and lycra: the cycling ignorance quiz\n* Help identifying broken part and is the bike safe to ride?\n* Something's Seriously Wrong Here | Beyond the Kerb\n* Gumtree: near 2,000% spike in Brompton searches in hot weather\n* Can you repair/replace the zip on a Lycra jersey?\n* Cargo bikes UK?\n* What the separated bike track on Kensington High Street might have looked like ...\n* Testing of a roundabout designed for cyclists?\n* Life after a crash \n* The School run by bike, Britain vs The Netherlands.\n* Pedal For Scotland 2015\n* Carrying large-ish light boxes?\n* What time do the Tour highlights come on ITV Player? I need my daily fix!!!\n* Shit!\n* Tories resurrect cyclist-baiting \"road tax\"\n* What businesses think will improve customer access vs. what customers want\n* Infrastructure vs Helmets | The Alternative Department for Transport\n* Cycle Auction\n* Looking for a commuter bike\n* I gave it all up - to cycle the world with my dog: \"I decided I'd spend some time touring the country on my bike ...\"\n* Active commuters in London not that bothered by #tubestrike\n* CS1 in Hackney will be 10 minutes faster than the main road with only 8 sets of lights ...\n* Fat bike on a Welsh beach (Colwyn Bay)\n* City cycling in London is a joke - mux' blog - Tweakblogs\n* Could someone explain private roads to me please?\n* UK - Visiting the US & Canada - xpost from /r/bicycling\n* Train and bike route planning.\n* Baker Street - two way project proposed changes - the usual sub-standard infra you would expect from Westminster Council\n* Brecon Beacons Bike Hire Suggestions/Info\n* Running The Reds\n* Cycling for everybody : The Electric Bicycle, and raising their speed limit from 15mph to 20mph to match the residential area speed limit for cars at 20mph. - A discussion\n* Motorists are welcome to the roads they pay for\n* Harrogate's Big Bike Bash bust the budget\n* Chris Boardman on the Dutch love affair with cycling | Features | Tour de France\n* First time in the UK with a bike...blown away by what you guys have here in scenery for a tour ...\n* Cyclists please dimount\n* Vehicular Cycling Propaganda of the Week #1 | The Alternative Department for Transport\n* Any tips for Flying Ant Day?\n* Peak District Trail Flattening Work Continues\n* Lorries could be banned from city streets to make them safer for cyclists\n* Positive experience reporting a bad driver.. \n* [Meta] normally I avoid this sub because its depressing. But there are no deaths on the front page today. Congrats to us for not being killed this week.\n\n##Cyclist Deaths (4 / 1.8%)\n\n* Man charged with murder over Harworth cyclist death\n* Cyclist killed in crash with a lorry at Bank junction\n* London cyclist killed in Denmark Hill lorry crash\n* Health specialist is latest cyclist to be killed by HGV | The Times\n\n##Negative Stories (related to violence, injury or threatening behaviour) (23 / 10.4%)\n\n* Cyclists killed or injured in Wales rises 38% in a year\n* Met loses appeal over Guardian journalist hit by police car\n* Devon councillor swore at cyclists before allegedly running them off the road\n* Northampton driver who killed cyclist after sending \"trivial\" WhatsApp messages while at wheel is jailed\n* North Shields - Taxi Driver close overtake on corner. Passengers jump out and assault cyclists.\n* Sabotage and hatred: what have people got against cyclists?\n* Nomination for close pass of the year RO08 NHL [not my video]\n* Cycle serious injuries rise 8% in 2014\n* Cyclist knocked down by 'cut-throat' wire stung up on bike path by twisted thugs\n* [near misses] Why cycling in the UK is so scary\n* Female cyclists bear brunt of bad driving and harassment from drivers, says study\n* Trucker threatens a person cycling with murder (help find the victim)\n* Cyclist gets hit by car\n* \"Stupid, sickening and dangerous\" - saboteurs spread tacks on Cambridge cycling route\n* New figures suggest more killer drivers are going unpunished\n* Wire traps set up for cyclists on popular Brighton route. \n* Angry Range Rover Man's fame increases: \"Driver threatens to break cyclist's neck in bout of road rage near Richmond Park (video)\"\n* Lorry driver who killed cyclist given year's community order and 11 penalty points\n* General road fatalities down, but cycling injuries up.\n* People riding their bikes at a country park close to the New Forest are being warned to be alert after a cyclist was hurt by fishing line stretched at head height on a cycle path\n* Police launch appeal as cyclist pushed into Regent's Canal in East London\n* Witness withholding driver details after door flung into my head at speed\n* I was assaulted in cells by four police after a road rage row, says cyclist who exposed 'UK's worst force' ...",
  "gilded": 0,
  "score": 8,
  "removal_reason": null,
  "approved_by": null,
  "created_utc": 1437056120.0,
  "is_self": true,
  "stickied": false,
  "edited": false,
  "distinguished": null,
  "permalink": "https://www.reddit.com/r/ukbike/comments/3di98q/meta_meta_what_really_gets_posted_in_rukbike/?ref=search_posts",
  "banned_by": null,
  "from_id": null,
  "likes": null,
  "_underscore_names": null,
  "num_reports": null,
  "link_flair_css_class": null,
  "_info_url": "https://api.reddit.com/api/info/",
  "id": "3di98q",
  "archived": false,
  "secure_media": null,
  "from_kind": null,
  "saved": false,
  "domain": "self.ukbike",
  "ups": 8,
  "suggested_sort": null,
  "quarantine": false,
  "over_18": false,
  "hide_score": false,
  "url": "https://www.reddit.com/r/ukbike/comments/3di98q/meta_meta_what_really_gets_posted_in_rukbike/",
  "subreddit_id": "t5_2slwv",
  "_params": {},
  "_comments": null,
  "_replaced_more": false,
  "_comments_by_id": {},
  "user_reports": [],
  "media_embed": {},
  "created": 1437059720.0,
  "author_flair_text": "wessex boy | frankenbike",
  "visited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I thought I&#39;d post this just to point out that this sub is not as depressing as it might look. I think people who say it is (a) might not come here that often, and (b) are probably more affected by the negative stories than the positive ones, giving them the impression that it&#39;s all doom and gloom. So there are three categories below, roughly equating to stories posted about &quot;not about dying on a bike&quot;, &quot;cyclist deaths&quot; and &quot;things which might cause cyclist deaths&quot;. I&#39;ve gone back roughly two months.</p>\n\n<p>Personally I think the articles posted recently have been excellent, but would like to request more original content such as blog posts (preferably which you have written), ride reports and, of course, photos. Just be mindful of the &quot;no memes / image macros&quot; rule and let&#39;s not become &quot;New Bike Day Mk II&quot; please :)</p>\n\n<h1>All stories (221)</h1>\n\n<h2>Not about cyclist deaths or threatening behaviour (194 / 87.8%)</h2>\n\n<ul>\n<li>Anyone know the owner of this Norco bike? I saw someone stealing a wheel off it last night outside Balham station ...</li>\n<li>Why do so many cyclists use roads when there is a cycle path running alongside?</li>\n<li>Bradford&#39;s new Cycle Super Deathway | The Alternative Department for Transport</li>\n<li>The European Cycling Industry employs around 650,000 people, substantially more than even the United States &#39;Big Three&#39; automotive companies ...</li>\n<li>Cllr Adolf finds out just how bad his transport dept is at spending Cycle Ambition money</li>\n<li>Infrastructure for all | &quot;What&#39;s required is infrastructure suitable for the young and the old ...&quot;</li>\n<li>I just emailed my local council re: the poor road surface - does anybody else do the same?</li>\n<li>Cycle campaigners want to create an 85-mile traffic-free circuit from Bristol to Somerset</li>\n<li>&quot;Motorists stay back&quot; T-shirt part of new clothing range from 100 Climbs</li>\n<li>Leeds-Bradford CityConnect: an update | The Alternative Department for Transport</li>\n<li>London&#39;s top cycling cafe stops revealed by Strava - Cycling Weekly</li>\n<li>[Cambridge] Milton Road Segregated Cycleways Petition (x-post <a href=\"/r/cambridgecycling\">/r/cambridgecycling</a>)</li>\n<li>That Bradford junction: some suggestions | The Alternative Department for Transport</li>\n<li>London Roads task force update report april2015</li>\n<li>Royal Parks say no to Cycle Superhighway, forcing cyclists onto busy junctions</li>\n<li>toddler is knocked over by &#39;hit-and-run&#39; cyclist outside her Blackpool home...Anyone know this guy?</li>\n<li>Boardman calls on Cameron to get moving</li>\n<li>Boardman: Motorists should be held liable for collisions with cyclists</li>\n<li>Brits are cycling more, DfT stats show</li>\n<li>Cycling Scotland&#39;s new campaign says Give Everyone Cycle Space - but is it enough room? (+ video)</li>\n<li>Getting a new bike from Halfords</li>\n<li>Homepage - Cycle City Ambition Programme - Nottingham</li>\n<li>London bike-jackings hit 10 a week, say Metropolitan Police</li>\n<li>What to be aware of when buying a bike?</li>\n<li>My friend came up with these awesome handlebar lights to help save lives ...</li>\n<li>We Are Not Pedestrians on Wheels</li>\n<li>New cycle &quot;route&quot; in Leeds, Regent Street. (They are taking the piss.)</li>\n<li>Guildford to Brighton</li>\n<li>Officer given written warning for decision not to prosecute driver who hit cyclist while on wrong side of road</li>\n<li>CityConnect: You&#39;ll get what you&#39;re given | The Alternative Department for Transport</li>\n<li>Any one bought one of these trailers? Prices vary wildy, wondering what you don&#39;t get in the lower models.</li>\n<li>Brent Council - Regent&#39;s Park to Gladstone Park Quietway Cycle Route</li>\n<li>Cycling events in the New Forest: Summer 2015 ...</li>\n<li>OPINION: Not another bloomin&#39; radio phone-in about cyclists</li>\n<li><a href=\"/r/UKbike\">/r/UKbike</a>, we&#39;d really appreciate your insight</li>\n<li>Are you at risk from people wearing shoes with wheels in them? ...</li>\n<li>Neither one nor t&#39;Other! (Salford&#39;s proposed Cycle Infrastructure.)</li>\n<li>Cheapest Bike Upgrade To Climb Hills Faster </li>\n<li>Livingston jogger dies after being hit by cyclist</li>\n<li>Starting from the bottom. Any info much appreciated!</li>\n<li>Downlights for trucks paint &#39;no go&#39; area for cyclists</li>\n<li>I am driving support vehicle for a charity bike ride - any tips?</li>\n<li>Unreliable Evidence - The Law of the Road (Radio 4)</li>\n<li>Guildford to Brighton</li>\n<li>Anyone used the Garmin Edge 200?</li>\n<li>Cyclist brings private prosecution against Plymouth police officer</li>\n<li>Is the cammeraderie on the road between cyclists only in cycling?</li>\n<li>Dramatic video shows crowd lift double-decker bus to save life of trapped unicyclist ...</li>\n<li>Accept cyclists on road (From The Argus)</li>\n<li>Legal challenge to East London Mini Holland cycling scheme launched</li>\n<li>HGVs failing to fit hi-tech cyclist savers</li>\n<li>New £380,000 cycle and pedestrian bridge to open on Friday</li>\n<li>Help me Pimp my Pashley...?</li>\n<li>14 hours in London - help!</li>\n<li>Cycle to Work Scheme - All from the same retailer?</li>\n<li>The most expensive 20 feet of road in Hampshire is causing cycling crashes</li>\n<li>Pirory Lane road rage (x-post from <a href=\"/r/cycling\">/r/cycling</a>)</li>\n<li>Lawyers warn of cyclists&#39; tram risk</li>\n<li>The user experience | At War With The Motorist</li>\n<li>&quot;When you are queuing in traffic you do not have to think that much.&quot;</li>\n<li>Naked cyclists take a hard line on &#39;aroused&#39; protest participant</li>\n<li>The Easy Option - Beyond the Kerb</li>\n<li>[Change.org] Jason Wells founder of Brew Cafe: Cycle to work for a year. </li>\n<li>The solution is design | As Easy As Riding A Bike</li>\n<li>Bec Hill Climb turning to crowdfunding for 2015 event.</li>\n<li>Australian butcher Jason Wells caught in extraordinary road rage rant at cyclist: I&#39;m sorry</li>\n<li>Jason Wells founder of Brew Cafe: Cycle to work for a year after attacking cyclist</li>\n<li>Could augmented reality make urban cycling easier and safer? &quot;Potential of a soft infrastructure which can be overlaid on existing urban fabric ...&quot;</li>\n<li>Them and Theirs - Beyond the Kerb</li>\n<li>Singletrack Magazine Response to the R4 You &amp; Yours Phone-in On Cyclists.</li>\n<li>Glasgow City Council&#39;s latest attack on pedestrians and cyclists</li>\n<li>Peloton Cycling Jersey&#39;s £20 with code JERSEYSALE</li>\n<li>Cycle tour route advice.</li>\n<li>Anyone here cycle on a keto / low-carb diet?</li>\n<li>Bike boom powers Halfords to £1bn sales </li>\n<li>There and back again: riding 373 miles across Wales over a weekend. &quot;There&#39;s no headline sponsor ...&quot;</li>\n<li>Who to contact regarding getting a footpath reclassified to something more bike friendly?</li>\n<li>Bike recommendation for heavy guy? </li>\n<li>Highways England to roll out 606 cycle routes - Get Britain Cycling</li>\n<li>(x-post from <a href=\"/r/bicycling\">r/bicycling</a>)Thermal cameras will watch for waiting cyclists and turn traffic lights green</li>\n<li>London to Brighton - transport from St Albans/Herts</li>\n<li>London cycling commissioner: &quot;Cycle superhighways came close to not happening&quot;</li>\n<li>Pretty good Groupon deal today: £209.99 for a Viking Zenith, 239.99 for one Viking Peleton Carbon ...</li>\n<li>Active cities &#39;boost bottom lines&#39;</li>\n<li>Boris On Making Cycle Highway Mandatory</li>\n<li>The secret history of 19th century cyclists ...</li>\n<li>Residents trapped by cyclists in Cardiff. Diddums.</li>\n<li>Cyclists who fail to use dedicated lanes &#39;could be fined&#39;</li>\n<li>Dangerous driver races by off duty police on bicycle...</li>\n<li>Calais to Montpellier</li>\n<li>Wiggins&#39; £6000 Hour Record chain (video)</li>\n<li>Did a double take at the model sticker on this bike...</li>\n<li>Road Bike Survey Win a GoPro Hero 4</li>\n<li>Front of Bus Cycle Racks, the DVSA says no.</li>\n<li>Traveling to England from California for a month (July-August) this Summer ...</li>\n<li>Space Invaders | As Easy As Riding A Bike</li>\n<li>Turbogate: Bedford and beyond | The Alternative Department for Transport</li>\n<li>Why cargo bike deliveries are taking over the UK&#39;s cities</li>\n<li>My local cycle lane, ladies and gentlemen... </li>\n<li>Giant Rove 0 // Specialized Ariel Elite Disc // or something else?</li>\n<li>Cycling participation in England rises 22% in a decade</li>\n<li>Sign up for the Flagg Cycle Challenge in the Peak District!</li>\n<li>Bike thieves target houses with cycle carriers on cars parked outside</li>\n<li>(x-post <a href=\"/r/bicycling\">r/bicycling</a>) NBD - can&#39;t wait to start commuting on this beast!</li>\n<li>Vietec Heating doesn&#39;t do work for cyclists.</li>\n<li>Designed to Move</li>\n<li>My South West UK cycle tour.</li>\n<li>Some dimwit has locked their bike to mine. I&#39;m infuriated!</li>\n<li>where to even begin? Help me and the lady.</li>\n<li>Looking for super-low maintenance belt-driven bike £800 budget</li>\n<li>Do any of you guys commute through the winter?</li>\n<li>Write-up and photos from Mountain Mayhem, the 24 hour mountain bike race</li>\n<li>Hybrid or Road Bike</li>\n<li>A beginner looking for a commuter</li>\n<li>Dunwich dynamo</li>\n<li>Get Britain Cycling Magazine 2015</li>\n<li>Road Bike Survey - Last chance to win the GoPro Hero</li>\n<li>Cyclists of Reddit, I am short and fat. Can I ride a bike without being in agony?</li>\n<li>I am interested in doing a semi long distance cycle ...</li>\n<li>The gap | As Easy As Riding A Bike</li>\n<li>New cyclist friendly traffic lights in Liverpool.</li>\n<li>I&#39;ve just been given a cycling challenge - Help me out!</li>\n<li>How to make the most money back on an ill-advised purchase?</li>\n<li>Travelling to France by train with bikes and tent, suggestions welcome</li>\n<li>Today <a href=\"/r/YorkCycling\">r/YorkCycling</a> was born, if you&#39;re a cyclist in york please come and help our sub grow!</li>\n<li>Yo, I want a bar mounted phone case, recommend me one plz</li>\n<li>Daily Mail at its best</li>\n<li>Biker assaults two ppl cycling in stoke, uploads video. Can you find the victims?</li>\n<li>Beautiful 1938 Aluminium Caminargent in Coventry Transport Museum [potato]</li>\n<li>maidstoneonbike: Maliciously bad cycle facilities. Wow.</li>\n<li>What can/should I do next?</li>\n<li>Best place to look for used bikes for a tall new rider?</li>\n<li>Radstock, A Sign of Failure</li>\n<li>Protest at Bank 8am tomorrow after cyclist dies at junction</li>\n<li>Us, not &quot;Them&quot; | As Easy As Riding A Bike</li>\n<li>Bravo Cemex! - They are trialling the new low-cab Mercedes Econic tipper in London </li>\n<li>Giant OCR Compact Road bike</li>\n<li>Top things I would change to make Cycling safer. </li>\n<li>What power do the police have in making sure cars don&#39;t park in bike lanes?</li>\n<li>Interesting TDF stage breakdown (xpost from <a href=\"/r/bicycling/\">r/bicycling/</a>) </li>\n<li>MP backs peak hours on &#39;dangerous&#39; lorries to protect cyclists</li>\n<li>Perpetuation of the &quot;road tax&quot; concept</li>\n<li>Mobile phone using drivers monologue on &quot;bloody cyclists&quot;</li>\n<li>How to get from Heathrow to King&#39;s Cross with my bike and all my gear?</li>\n<li>Thoughts on the Btwin Triban 500 Hybrid?</li>\n<li>Cheap roof bars for moving two road bikes </li>\n<li>Does anyone know of any propper bike shops in the midlands ..?</li>\n<li>Purchasing a bike need some advice</li>\n<li>Comment: Is a single bike rack mysteriously causing congestion?</li>\n<li>Martyn Ashton - Back On Track</li>\n<li>Tram tracks present biggest danger to Sheffield cyclists says campaign group</li>\n<li>Do any of you use a &#39;Hook turn&#39; or &#39;Two stage turn&#39; to turn right on fast roads?</li>\n<li>Road tax, red lights and lycra: the cycling ignorance quiz</li>\n<li>Help identifying broken part and is the bike safe to ride?</li>\n<li>Something&#39;s Seriously Wrong Here | Beyond the Kerb</li>\n<li>Gumtree: near 2,000% spike in Brompton searches in hot weather</li>\n<li>Can you repair/replace the zip on a Lycra jersey?</li>\n<li>Cargo bikes UK?</li>\n<li>What the separated bike track on Kensington High Street might have looked like ...</li>\n<li>Testing of a roundabout designed for cyclists?</li>\n<li>Life after a crash </li>\n<li>The School run by bike, Britain vs The Netherlands.</li>\n<li>Pedal For Scotland 2015</li>\n<li>Carrying large-ish light boxes?</li>\n<li>What time do the Tour highlights come on ITV Player? I need my daily fix!!!</li>\n<li>Shit!</li>\n<li>Tories resurrect cyclist-baiting &quot;road tax&quot;</li>\n<li>What businesses think will improve customer access vs. what customers want</li>\n<li>Infrastructure vs Helmets | The Alternative Department for Transport</li>\n<li>Cycle Auction</li>\n<li>Looking for a commuter bike</li>\n<li>I gave it all up - to cycle the world with my dog: &quot;I decided I&#39;d spend some time touring the country on my bike ...&quot;</li>\n<li>Active commuters in London not that bothered by #tubestrike</li>\n<li>CS1 in Hackney will be 10 minutes faster than the main road with only 8 sets of lights ...</li>\n<li>Fat bike on a Welsh beach (Colwyn Bay)</li>\n<li>City cycling in London is a joke - mux&#39; blog - Tweakblogs</li>\n<li>Could someone explain private roads to me please?</li>\n<li>UK - Visiting the US &amp; Canada - xpost from <a href=\"/r/bicycling\">/r/bicycling</a></li>\n<li>Train and bike route planning.</li>\n<li>Baker Street - two way project proposed changes - the usual sub-standard infra you would expect from Westminster Council</li>\n<li>Brecon Beacons Bike Hire Suggestions/Info</li>\n<li>Running The Reds</li>\n<li>Cycling for everybody : The Electric Bicycle, and raising their speed limit from 15mph to 20mph to match the residential area speed limit for cars at 20mph. - A discussion</li>\n<li>Motorists are welcome to the roads they pay for</li>\n<li>Harrogate&#39;s Big Bike Bash bust the budget</li>\n<li>Chris Boardman on the Dutch love affair with cycling | Features | Tour de France</li>\n<li>First time in the UK with a bike...blown away by what you guys have here in scenery for a tour ...</li>\n<li>Cyclists please dimount</li>\n<li>Vehicular Cycling Propaganda of the Week #1 | The Alternative Department for Transport</li>\n<li>Any tips for Flying Ant Day?</li>\n<li>Peak District Trail Flattening Work Continues</li>\n<li>Lorries could be banned from city streets to make them safer for cyclists</li>\n<li>Positive experience reporting a bad driver.. </li>\n<li>[Meta] normally I avoid this sub because its depressing. But there are no deaths on the front page today. Congrats to us for not being killed this week.</li>\n</ul>\n\n<h2>Cyclist Deaths (4 / 1.8%)</h2>\n\n<ul>\n<li>Man charged with murder over Harworth cyclist death</li>\n<li>Cyclist killed in crash with a lorry at Bank junction</li>\n<li>London cyclist killed in Denmark Hill lorry crash</li>\n<li>Health specialist is latest cyclist to be killed by HGV | The Times</li>\n</ul>\n\n<h2>Negative Stories (related to violence, injury or threatening behaviour) (23 / 10.4%)</h2>\n\n<ul>\n<li>Cyclists killed or injured in Wales rises 38% in a year</li>\n<li>Met loses appeal over Guardian journalist hit by police car</li>\n<li>Devon councillor swore at cyclists before allegedly running them off the road</li>\n<li>Northampton driver who killed cyclist after sending &quot;trivial&quot; WhatsApp messages while at wheel is jailed</li>\n<li>North Shields - Taxi Driver close overtake on corner. Passengers jump out and assault cyclists.</li>\n<li>Sabotage and hatred: what have people got against cyclists?</li>\n<li>Nomination for close pass of the year RO08 NHL [not my video]</li>\n<li>Cycle serious injuries rise 8% in 2014</li>\n<li>Cyclist knocked down by &#39;cut-throat&#39; wire stung up on bike path by twisted thugs</li>\n<li>[near misses] Why cycling in the UK is so scary</li>\n<li>Female cyclists bear brunt of bad driving and harassment from drivers, says study</li>\n<li>Trucker threatens a person cycling with murder (help find the victim)</li>\n<li>Cyclist gets hit by car</li>\n<li>&quot;Stupid, sickening and dangerous&quot; - saboteurs spread tacks on Cambridge cycling route</li>\n<li>New figures suggest more killer drivers are going unpunished</li>\n<li>Wire traps set up for cyclists on popular Brighton route. </li>\n<li>Angry Range Rover Man&#39;s fame increases: &quot;Driver threatens to break cyclist&#39;s neck in bout of road rage near Richmond Park (video)&quot;</li>\n<li>Lorry driver who killed cyclist given year&#39;s community order and 11 penalty points</li>\n<li>General road fatalities down, but cycling injuries up.</li>\n<li>People riding their bikes at a country park close to the New Forest are being warned to be alert after a cyclist was hurt by fishing line stretched at head height on a cycle path</li>\n<li>Police launch appeal as cyclist pushed into Regent&#39;s Canal in East London</li>\n<li>Witness withholding driver details after door flung into my head at speed</li>\n<li>I was assaulted in cells by four police after a road rage row, says cyclist who exposed &#39;UK&#39;s worst force&#39; ...</li>\n</ul>\n</div><!-- SC_ON -->",
  "downs": 0,
  "_comment_sort": null,
  "report_reasons": null,
  "name": "t3_3di98q",
  "from": null,
  "hidden": false,
  "clicked": false,
  "media": null,
  "json_dict": null,
  "_api_link": "https://api.reddit.com/r/ukbike/comments/3di98q/meta_meta_what_really_gets_posted_in_rukbike/?ref=search_posts",
  "secure_media_embed": {},
  "mod_reports": [],
  "_orphaned": {},
  "_uniq": null,
  "num_comments": 2,
  "link_flair_text": null,
  "title": "[Meta meta] What *really* gets posted in /r/ukbike",
  "_has_fetched": true,
  "author_flair_css_class": "",
  "thumbnail": "self"
}