{
  "selftext": "Well, hell, if /u/ThuggsyBogues can kill a Patriot League preview then surely I can fire up a WCC one.\n\nHere goes!\n\n**1. Gonzaga** - They lose three guards from last year but don't expect them to take much of a step back. Projected lineup below doesn't even include Sabonis, who could either be the other component of a three-big lineup or play a huge sixth-man role off the bench. Silas Melson, Bryan Alberts, and Ryan Edwards give the Zags a pretty solid top nine. I'll guess 32-5 as a final record with a Sweet 16 appearance. **Projected starters** - Josh Perkins (FR), Eric McClellan (SR), Kyle Dranginis (SR), Kyle Wiltjer (SR), Przemek Karnowski (SR). **Key losses** - Kevin Pangos, Gary Bell, Byron Wesley.\n\n**2. BYU** - Always the toughest to project with players coming and going on their two-year missions. X-factor for BYU could be Nick Emery, who was an ESPN Top 100 (#45) recruit out of high school and finally joins BYU after completing his mission. Besides Emery, the Cougars should also see an immediate impact from Kyle Davis (Utah State transfer) and possibly Jamal Aytes (UNLV transfer, but battling injuries). Consider them a candidate for a play-in game. **Projected Starters** - Kyle Collinsworth (SR), Chase Fischer (SR), Jake Toolson (SO), Kyle Davis (JR), Corbin Kaufusi (SR). **Key Losses** - Tyler Haws, Anson Winder, Skyler Halford.\n\n**3. St. Mary's** - Time for a step back from the Gaels with massive turnover from last season, including the loss of Brad Waldow. A step back in Gaels land, however, is still good enough to hold off a push from Pepperdine for a top-three finish. Enter Boston College transfer Joe Rahon to the scene, who might just immediately be the best player on this SMC team. Dane Pineau should get big minutes off the bench if they do go with the five listed here. May be able to push for NIT consideration. **Projected Starters** - Joe Rahon (JR), Emmett Naar (SO), Calvin Hermanson (SO), Evan Fitzner (FR), Jock Landale (SO). **Key Losses** - Brad Waldow, Kerry Carter, Aaron Bright, Desmond Simmons, Garrett Jackson.\n\n**4. Pepperdine** - Marty Wilson is a wizard! The Waves are a trendy pick to make noise in the WCC this year given their season sweep over BYU and road win over the Gaels in 2014-15, but I'm going to slot them in right where they finished last season. Seems like Stacy Davis has been an impact player in this conference for a half decade now, and he's finally a senior along with Jett Raines. Like SMC, the Waves could make a push for a spot in the NIT which is a fine accomplishment for any WCC team not named Gonzaga, BYU, or Saint Mary's.\n**Projected Starters** - Jeremy Major (JR), Shawn Olden (SO), Lamond Murray (JR), Stacy Davis (SR), Jett Raines (SR). **Key Losses** - None.\n\n*Really, you can just roll the dice from 5 through 10. Could realistically have any of the teams finish in any position in this group and it wouldn't be a surprise.*\n\n**5. Portland** - This is where the WCC drops off a lot, and the Pilots appear to have enough returning to be among the best of the rest. Now an upperclassman, Alec Wintering will be among the best point guards in the WCC and the Pilots replace Kevin Bailey and Thomas van der Mars with JUCO guys Jarrel Marshall and Ray Barreno. They're not a deep team by any stretch of the imagination, but should be able to avoid the play-in games in Vegas. **Projected Starters** - Alec Wintering (JR), Bryce Pressley (SR), Jarrel Marshall (JR), Gabe Taylor (SO), Ray Barreno (JR). **Key Losses** - Kevin Bailey, Thomas van der Mars, Volodymyr Gerun.\n\n**6. Loyola Marymount** - We'll start finding out soon if there's a method to Coach Dunlap's madness. Runs off one of the best players in the WCC (Evan Payne) after his first year as head coach, for what we can only assume was a severe disconnect between Dunlap's system and Payne's significant skill set. Only one of my five projected starters were around last year, but we'll see what Dunlap can do with this group now that he's got \"his guys\" in there. Google Brandon Brown, he's an interesting story coming out of Phoenix College. **Projected Starters** - Brandon Brown (JR), Buay Tuach (JR), Steven Haney (SO), Marin Mornar (SR), Shamar Johnson (JR). **Key Losses** - Evan Payne (Long Beach State), Ayodeji Egbeyemi, Godwin Okonji, Chase Flint.\n\n**7. San Diego** - New bench boss Lamont Smith replaces Bill Grier. Smith is from Texas and brings four high school recruits from there to join the returning Marcus Harris, giving the Toreros five from that state on their roster. USD had one of the top backcourt combos in the conference last year, but both Dee and Anderson are now gone. Tyler Williams is a huge recruit for the Toreros, was collecting high major offers and was rated as a 3* or 4* prospect. I've got him as starting right away, but I'll admit that USD is one of the teams I have trouble finding info on. **Projected Starters** - Vasa Pusica (SO), Tyler Williams (FR), Duda Sanadze (SR), Brett Bailey (JR), Jito Kok (SR). **Key Losses** - Johnny Dee, Chris Anderson, Thomas Jacobs.\n\n**8. Santa Clara** - Could be Keating's last year with Santa Clara recently hiring a new AD, barring a massive turnaround from the Broncos. But does anyone see that happening? It's basically Jared Brownridge against the world. He's just good enough to give SCU a win here and there, but it looks like they're set up for a bit of a long season unless one of their five freshmen can step up in a big way. Any SCU fans on here? I know Pugh, Kratch, and Hubbard weren't ever on the floor at the same time last year but I couldn't figure out who else to slot into the starting lineup. Wardlow, maybe? **Projected Starters** - Brendyn Taylor (JR), Jared Brownridge (SO), Jarvis Pugh (SO), Nate Kratch (JR), Matt Hubbard (SO). **Key Losses** - Brandon Clark, Denzel Johnson.\n\n**9. Pacific** - I'll move them up one slot from last year just due to attrition from the other programs, but it's been a rough transition up to the WCC from the Big West for the Tigers. They suffered last year after losing a significant crop of seniors following 2013-14, but should start a slow trend upwards with all but Robinson and Aguirre returning. Coach Verlin is still trying to fill the shoes of the legendary Bob Thomason, who led Pacific to some wildly successful seasons during his time in Stockton. **Projected Starters** - T.J. Wallace (JR), David Taylor (JR), Ray Bowles (SO), Eric Thompson (SR), Sami Eleraky (JR). **Key Losses** - Dulani Robinson, Gabriel Aguirre.\n\n**10. San Francisco** - A typical offseason for the Dons under Rex Walters, with only 29% of their minutes played from last season returning. Essentially, only Tim Derksen and Devin Watson are the only players that had any sort of role last year that will be back in 2015-16. They're both good, but not nearly good enough to lead the Dons anywhere. Maybe the Dons fans on here can let me know if I'm close with the projected lineup, I really just threw some shit at the wall here. Plus I don't think Rex is done, he will scrape up a big from somewhere before school starts I'm sure. **Projected Starters** - Devin Watson (SO), Tim Derksen (SR), Chase Foster (SO), Montray Clemons (SR), Dont'e Reynolds (JR). **Key Losses** - Kruize Pinkins, Mark Tollefson (Arizona), Matt Glover, Chris Adams, Matt Christiansen.",
  "gilded": 0,
  "score": 20,
  "removal_reason": null,
  "approved_by": null,
  "created_utc": 1438787854.0,
  "is_self": true,
  "stickied": false,
  "edited": 1438834902.0,
  "distinguished": null,
  "permalink": "https://www.reddit.com/r/CollegeBasketball/comments/3fvuco/west_coast_conference_preview/?ref=search_posts",
  "banned_by": null,
  "from_id": null,
  "likes": null,
  "_underscore_names": null,
  "num_reports": null,
  "link_flair_css_class": null,
  "_info_url": "https://api.reddit.com/api/info/",
  "id": "3fvuco",
  "archived": false,
  "secure_media": null,
  "from_kind": null,
  "saved": false,
  "domain": "self.CollegeBasketball",
  "ups": 20,
  "suggested_sort": null,
  "quarantine": false,
  "over_18": false,
  "hide_score": false,
  "url": "https://www.reddit.com/r/CollegeBasketball/comments/3fvuco/west_coast_conference_preview/",
  "subreddit_id": "t5_2rj3j",
  "_params": {},
  "_comments": null,
  "_replaced_more": false,
  "_comments_by_id": {},
  "user_reports": [],
  "media_embed": {},
  "created": 1438791454.0,
  "author_flair_text": null,
  "visited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Well, hell, if <a href=\"/u/ThuggsyBogues\">/u/ThuggsyBogues</a> can kill a Patriot League preview then surely I can fire up a WCC one.</p>\n\n<p>Here goes!</p>\n\n<p><strong>1. Gonzaga</strong> - They lose three guards from last year but don&#39;t expect them to take much of a step back. Projected lineup below doesn&#39;t even include Sabonis, who could either be the other component of a three-big lineup or play a huge sixth-man role off the bench. Silas Melson, Bryan Alberts, and Ryan Edwards give the Zags a pretty solid top nine. I&#39;ll guess 32-5 as a final record with a Sweet 16 appearance. <strong>Projected starters</strong> - Josh Perkins (FR), Eric McClellan (SR), Kyle Dranginis (SR), Kyle Wiltjer (SR), Przemek Karnowski (SR). <strong>Key losses</strong> - Kevin Pangos, Gary Bell, Byron Wesley.</p>\n\n<p><strong>2. BYU</strong> - Always the toughest to project with players coming and going on their two-year missions. X-factor for BYU could be Nick Emery, who was an ESPN Top 100 (#45) recruit out of high school and finally joins BYU after completing his mission. Besides Emery, the Cougars should also see an immediate impact from Kyle Davis (Utah State transfer) and possibly Jamal Aytes (UNLV transfer, but battling injuries). Consider them a candidate for a play-in game. <strong>Projected Starters</strong> - Kyle Collinsworth (SR), Chase Fischer (SR), Jake Toolson (SO), Kyle Davis (JR), Corbin Kaufusi (SR). <strong>Key Losses</strong> - Tyler Haws, Anson Winder, Skyler Halford.</p>\n\n<p><strong>3. St. Mary&#39;s</strong> - Time for a step back from the Gaels with massive turnover from last season, including the loss of Brad Waldow. A step back in Gaels land, however, is still good enough to hold off a push from Pepperdine for a top-three finish. Enter Boston College transfer Joe Rahon to the scene, who might just immediately be the best player on this SMC team. Dane Pineau should get big minutes off the bench if they do go with the five listed here. May be able to push for NIT consideration. <strong>Projected Starters</strong> - Joe Rahon (JR), Emmett Naar (SO), Calvin Hermanson (SO), Evan Fitzner (FR), Jock Landale (SO). <strong>Key Losses</strong> - Brad Waldow, Kerry Carter, Aaron Bright, Desmond Simmons, Garrett Jackson.</p>\n\n<p><strong>4. Pepperdine</strong> - Marty Wilson is a wizard! The Waves are a trendy pick to make noise in the WCC this year given their season sweep over BYU and road win over the Gaels in 2014-15, but I&#39;m going to slot them in right where they finished last season. Seems like Stacy Davis has been an impact player in this conference for a half decade now, and he&#39;s finally a senior along with Jett Raines. Like SMC, the Waves could make a push for a spot in the NIT which is a fine accomplishment for any WCC team not named Gonzaga, BYU, or Saint Mary&#39;s.\n<strong>Projected Starters</strong> - Jeremy Major (JR), Shawn Olden (SO), Lamond Murray (JR), Stacy Davis (SR), Jett Raines (SR). <strong>Key Losses</strong> - None.</p>\n\n<p><em>Really, you can just roll the dice from 5 through 10. Could realistically have any of the teams finish in any position in this group and it wouldn&#39;t be a surprise.</em></p>\n\n<p><strong>5. Portland</strong> - This is where the WCC drops off a lot, and the Pilots appear to have enough returning to be among the best of the rest. Now an upperclassman, Alec Wintering will be among the best point guards in the WCC and the Pilots replace Kevin Bailey and Thomas van der Mars with JUCO guys Jarrel Marshall and Ray Barreno. They&#39;re not a deep team by any stretch of the imagination, but should be able to avoid the play-in games in Vegas. <strong>Projected Starters</strong> - Alec Wintering (JR), Bryce Pressley (SR), Jarrel Marshall (JR), Gabe Taylor (SO), Ray Barreno (JR). <strong>Key Losses</strong> - Kevin Bailey, Thomas van der Mars, Volodymyr Gerun.</p>\n\n<p><strong>6. Loyola Marymount</strong> - We&#39;ll start finding out soon if there&#39;s a method to Coach Dunlap&#39;s madness. Runs off one of the best players in the WCC (Evan Payne) after his first year as head coach, for what we can only assume was a severe disconnect between Dunlap&#39;s system and Payne&#39;s significant skill set. Only one of my five projected starters were around last year, but we&#39;ll see what Dunlap can do with this group now that he&#39;s got &quot;his guys&quot; in there. Google Brandon Brown, he&#39;s an interesting story coming out of Phoenix College. <strong>Projected Starters</strong> - Brandon Brown (JR), Buay Tuach (JR), Steven Haney (SO), Marin Mornar (SR), Shamar Johnson (JR). <strong>Key Losses</strong> - Evan Payne (Long Beach State), Ayodeji Egbeyemi, Godwin Okonji, Chase Flint.</p>\n\n<p><strong>7. San Diego</strong> - New bench boss Lamont Smith replaces Bill Grier. Smith is from Texas and brings four high school recruits from there to join the returning Marcus Harris, giving the Toreros five from that state on their roster. USD had one of the top backcourt combos in the conference last year, but both Dee and Anderson are now gone. Tyler Williams is a huge recruit for the Toreros, was collecting high major offers and was rated as a 3* or 4* prospect. I&#39;ve got him as starting right away, but I&#39;ll admit that USD is one of the teams I have trouble finding info on. <strong>Projected Starters</strong> - Vasa Pusica (SO), Tyler Williams (FR), Duda Sanadze (SR), Brett Bailey (JR), Jito Kok (SR). <strong>Key Losses</strong> - Johnny Dee, Chris Anderson, Thomas Jacobs.</p>\n\n<p><strong>8. Santa Clara</strong> - Could be Keating&#39;s last year with Santa Clara recently hiring a new AD, barring a massive turnaround from the Broncos. But does anyone see that happening? It&#39;s basically Jared Brownridge against the world. He&#39;s just good enough to give SCU a win here and there, but it looks like they&#39;re set up for a bit of a long season unless one of their five freshmen can step up in a big way. Any SCU fans on here? I know Pugh, Kratch, and Hubbard weren&#39;t ever on the floor at the same time last year but I couldn&#39;t figure out who else to slot into the starting lineup. Wardlow, maybe? <strong>Projected Starters</strong> - Brendyn Taylor (JR), Jared Brownridge (SO), Jarvis Pugh (SO), Nate Kratch (JR), Matt Hubbard (SO). <strong>Key Losses</strong> - Brandon Clark, Denzel Johnson.</p>\n\n<p><strong>9. Pacific</strong> - I&#39;ll move them up one slot from last year just due to attrition from the other programs, but it&#39;s been a rough transition up to the WCC from the Big West for the Tigers. They suffered last year after losing a significant crop of seniors following 2013-14, but should start a slow trend upwards with all but Robinson and Aguirre returning. Coach Verlin is still trying to fill the shoes of the legendary Bob Thomason, who led Pacific to some wildly successful seasons during his time in Stockton. <strong>Projected Starters</strong> - T.J. Wallace (JR), David Taylor (JR), Ray Bowles (SO), Eric Thompson (SR), Sami Eleraky (JR). <strong>Key Losses</strong> - Dulani Robinson, Gabriel Aguirre.</p>\n\n<p><strong>10. San Francisco</strong> - A typical offseason for the Dons under Rex Walters, with only 29% of their minutes played from last season returning. Essentially, only Tim Derksen and Devin Watson are the only players that had any sort of role last year that will be back in 2015-16. They&#39;re both good, but not nearly good enough to lead the Dons anywhere. Maybe the Dons fans on here can let me know if I&#39;m close with the projected lineup, I really just threw some shit at the wall here. Plus I don&#39;t think Rex is done, he will scrape up a big from somewhere before school starts I&#39;m sure. <strong>Projected Starters</strong> - Devin Watson (SO), Tim Derksen (SR), Chase Foster (SO), Montray Clemons (SR), Dont&#39;e Reynolds (JR). <strong>Key Losses</strong> - Kruize Pinkins, Mark Tollefson (Arizona), Matt Glover, Chris Adams, Matt Christiansen.</p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "_comment_sort": null,
  "report_reasons": null,
  "name": "t3_3fvuco",
  "from": null,
  "hidden": false,
  "clicked": false,
  "media": null,
  "json_dict": null,
  "_api_link": "https://api.reddit.com/r/CollegeBasketball/comments/3fvuco/west_coast_conference_preview/?ref=search_posts",
  "secure_media_embed": {},
  "mod_reports": [],
  "_orphaned": {},
  "_uniq": null,
  "num_comments": 5,
  "link_flair_text": null,
  "title": "WEST COAST CONFERENCE PREVIEW!",
  "_has_fetched": true,
  "author_flair_css_class": null,
  "thumbnail": "self"
}