{
  "downs": 0,
  "mod_reports": [],
  "secure_media_embed": {},
  "_info_url": "https://api.reddit.com/api/info/",
  "gilded": 2,
  "num_comments": 1570,
  "_orphaned": {},
  "hidden": false,
  "ups": 5332,
  "url": "https://www.reddit.com/r/books/comments/3l1epw/how_to_scam_amazon_customers_out_of_100k_a_year/",
  "_has_fetched": true,
  "quarantine": false,
  "name": "t3_3l1epw",
  "user_reports": [],
  "saved": false,
  "permalink": "https://www.reddit.com/r/books/comments/3l1epw/how_to_scam_amazon_customers_out_of_100k_a_year/?ref=search_posts",
  "over_18": false,
  "is_self": true,
  "_params": {},
  "thumbnail": "self",
  "created_utc": 1442326475.0,
  "_replaced_more": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Do you know Dagny Taggart? She&#39;s a character in Atlas Shrugged. She&#39;s also a best selling author of language learning ebooks on Amazon. She speaks 15 languages apparently. According to her bio, she spends her life traveling and picking up languages along the way.</p>\n\n<p>There&#39;s just one problem, Dagny Taggart doesn&#39;t exist. Her bio is fake, her profile picture is a stock photo. The books she writes are full of errors because they are written by a person (or perhaps a group of people) that doesn&#39;t actually speak the language and is just copying and writing in her own words what she learns from free language learning websites. </p>\n\n<p>Despite the glaring errors in her books that are obvious to anyone that can actually speak the language, her books are well reviewed, 4.5 out of 5 stars on almost every single one. There are the top selling books in every language category. How could this be? Dagny Taggart is paying for fake reviews, and it&#39;s working.</p>\n\n<p>I am an indie author. In full disclosure, I must inform the reader that Dagny Taggart is my direct competition. I am losing to her, and not just her, most of the best selling language learning ebooks are actually just scams. </p>\n\n<p>It&#39;s a relatively easy scam. Go on the internet, look up some topic, usually one where a lot of general information can be learned online (languages, travel, diets, exercise, cooking) write it up in your own words into an ebook, get a professional cover, pay a company to write fake reviews for you, and BAM, you have a steady income stream. I estimate from my own sales that Dagny Taggart&#39;s books have scammed hundreds of thousands of dollars out of people in this year alone. </p>\n\n<p>So why hasn&#39;t Amazon put a stop to this? Why are fake reviews so rampant despite Amazon&#39;s best efforts? Amazon has taken a few actions. Recently, they have weighted the reviews of verified purchases, which is a good step, but can easily be overcome in the ebook world. Amazon has also brought lawsuits against the companies that sell fake reviews, another good step, but if there is a market for something, it will always exist.</p>\n\n<p>There is actually an easy fix to this scam. Something that Amazon has missed completely: <strong>average number of reviews over sales</strong>. My own book was downloaded over 5000 times in a three month period, which netted me 15 reviews. That&#39;s about 3 reviews per 1000 downloads. I imagine other products are similar, but the true statistics only Amazon knows. Some of Dagny Taggart&#39;s books received ten reviews on the very first day of publication. This past week, another scammer&#39;s book has received over 100 reviews (and counting). Could it be that they each had thousands of downloads on the very first day of publication, or during this past week? No, of course not. They paid professional reviews to astroturf.</p>\n\n<p>The simple solution is to red flag products that receive reviews in excess of the R/S ratio (reviews over sales), investigate the authors that are scamming the system, unpublish their works, refund their customers, and ban them from publishing again. Of course, there is a flaw in this as well, someone might pay a company to write fake reviews for their competition in order to get them banned, but if that competition were to contact Amazon and agree to delete the fake positive reviews, perhaps they could be forgiven. </p>\n\n<p>The big joke is, many of Amazon&#39;s top reviewers are professional astroturfers. The criminals have been given badges. It&#39;s easy to spot an astroturfer. Just click on their name. They write about ten book reviews a day. How many of you buy more than one book a day on Amazon, let alone buy and review it? They must be the fastest readers in the world! </p>\n\n<p><strong>Ultimately, the problem lies in the consumers themselves.</strong> All the information I have told you in this article can easily be found out by anyone who takes the time to check the reviews of a product. In fact, for most of Dagny Taggart&#39;s books, the top review is a one star review that tells you all about the scam. A simple glance at the dates the reviews were published will tell you if a product received ten reviews in one hour. Unfortunately, the majority of ebook consumers don&#39;t take a few minutes to do their due diligence, they just look for the stars, and so the best selling books remain the ones with the most positive reviews. You may say it&#39;s their own fault, buyer beware, but in the end this will hurt all indie publishers when readers realize their purchases were a scam, and lead them to trust Amazon&#39;s review system and indie publishers less and less. </p>\n\n<p>What can we do to get Amazon to implement the simple fix of red flagging works that receive too many reviews per sales? What other solutions do you think would be a good idea? </p>\n\n<p><strong>Edit:</strong> Dagny&#39;s lawyer has contacted me, thoughts? Can I actually be sued for reddit posts? </p>\n\n<p>Dear goans314,</p>\n\n<p>I am the lawyer of the publishing company that owns Dagny Taggart&#39;s book rights on Amazon. </p>\n\n<p>Today you uploaded an outrageously defamatory post attacking my client on Reddit. You are slandering my client with unsubstantiated and shameful lies, hurting his image, reputation, and book sales on Amazon.</p>\n\n<p>I urge you to proceed and delete the defamatory post you have uploaded on Reddit immediately. You will face imminent legal action if you do not proceed to delete the post.</p>\n\n<p>We reserve all legal actions in regard with the damage you have already caused to my client.</p>\n\n<p>Regards,</p>\n\n<p>Mark Hamilton</p>\n\n<p><strong>Edit2:</strong> More threat&#39;s from Dagny&#39;s &quot;lawyer&quot;, guy needs to work on his English....</p>\n\n<p>Good morning,</p>\n\n<p>Here’s again Mark Hamilton, a member of the legal firm that represents the author (Dagny Taggart) you defame. We’ve already identified you, and have complete information about you. You must be aware that you commited a felony and that our legal firm has received precise instructions to prosecute you not only in the US but in any place all around the world where it can be necessary. You will have to pay high indemnizaciones. Not only this, we are commited to put you in prison. To avoid this consequences – that will reach you soon, be sure- your only choice is to proceed WITHIN THE NEXT 3 HOURS to:</p>\n\n<p>1) Write on Reddit a public disculpa. You can say you made a mistake or you was misinformed about this author. But clearly, you have to admit you were wrong.</p>\n\n<p>2) Instruct all the persons you engaged to write defamatory reviews on Amazon, to delete them immediately.</p>\n\n<p>If you don’t fulfill these requirements WITHIN THE NEXT 3 HOURS, we’ll prosecute you. THIS IS YOUR LAST CHANCE!</p>\n\n<p>Have a good day</p>\n\n<p>Mark Hamilton</p>\n\n<p>Good morning,</p>\n\n<p>Here’s again Mark Hamilton, a member of the legal firm that represents the author (Dagny Taggart) you defamed yesterday. We’ve already identified you, and have complete information about your person. You must be aware that you commited a felony and that our legal firm has received precise instructions to legally pursue you not only in the US but in any place all around the world where it can be necessary. Our firm has a long arm. Be sure you will have to pay high reparations. Not only this, we are commited to put you in prison. To avoid this consequences – that will reach you soon, be sure- your only choice is to proceed WITHIN THE NEXT 3 HOURS to:</p>\n\n<p>1) Write on Reddit, and on every site your defamatory expressions have been posted, public apologies. You can say you made a mistak if you want. But clearly, you have to admit you were wrong.</p>\n\n<p>2) Instruct all the persons you engaged to write defamatory reviews on Amazon, to delete them immediately.</p>\n\n<p>3) You, personally, will have to write reviews on Amazon in every book of our client in which defamatory reviews have been posted. You have to say CLEARLY that all these reviews are defamatory.</p>\n\n<p>If you don’t fulfill these requirements WITHIN THE NEXT 3 HOURS, we’ll legally pursue you. THIS IS YOUR LAST CHANCE!</p>\n\n<p>Have a good day</p>\n\n<p>Mark Hamilton</p>\n</div><!-- SC_ON -->",
  "subreddit_id": "t5_2qh4i",
  "archived": false,
  "domain": "self.books",
  "clicked": false,
  "score": 5332,
  "id": "3l1epw",
  "stickied": false,
  "media_embed": {},
  "visited": false,
  "selftext": "Do you know Dagny Taggart? She's a character in Atlas Shrugged. She's also a best selling author of language learning ebooks on Amazon. She speaks 15 languages apparently. According to her bio, she spends her life traveling and picking up languages along the way.\n\nThere's just one problem, Dagny Taggart doesn't exist. Her bio is fake, her profile picture is a stock photo. The books she writes are full of errors because they are written by a person (or perhaps a group of people) that doesn't actually speak the language and is just copying and writing in her own words what she learns from free language learning websites. \n\nDespite the glaring errors in her books that are obvious to anyone that can actually speak the language, her books are well reviewed, 4.5 out of 5 stars on almost every single one. There are the top selling books in every language category. How could this be? Dagny Taggart is paying for fake reviews, and it's working.\n\nI am an indie author. In full disclosure, I must inform the reader that Dagny Taggart is my direct competition. I am losing to her, and not just her, most of the best selling language learning ebooks are actually just scams. \n\nIt's a relatively easy scam. Go on the internet, look up some topic, usually one where a lot of general information can be learned online (languages, travel, diets, exercise, cooking) write it up in your own words into an ebook, get a professional cover, pay a company to write fake reviews for you, and BAM, you have a steady income stream. I estimate from my own sales that Dagny Taggart's books have scammed hundreds of thousands of dollars out of people in this year alone. \n\nSo why hasn't Amazon put a stop to this? Why are fake reviews so rampant despite Amazon's best efforts? Amazon has taken a few actions. Recently, they have weighted the reviews of verified purchases, which is a good step, but can easily be overcome in the ebook world. Amazon has also brought lawsuits against the companies that sell fake reviews, another good step, but if there is a market for something, it will always exist.\n\nThere is actually an easy fix to this scam. Something that Amazon has missed completely: **average number of reviews over sales**. My own book was downloaded over 5000 times in a three month period, which netted me 15 reviews. That's about 3 reviews per 1000 downloads. I imagine other products are similar, but the true statistics only Amazon knows. Some of Dagny Taggart's books received ten reviews on the very first day of publication. This past week, another scammer's book has received over 100 reviews (and counting). Could it be that they each had thousands of downloads on the very first day of publication, or during this past week? No, of course not. They paid professional reviews to astroturf.\n\nThe simple solution is to red flag products that receive reviews in excess of the R/S ratio (reviews over sales), investigate the authors that are scamming the system, unpublish their works, refund their customers, and ban them from publishing again. Of course, there is a flaw in this as well, someone might pay a company to write fake reviews for their competition in order to get them banned, but if that competition were to contact Amazon and agree to delete the fake positive reviews, perhaps they could be forgiven. \n\nThe big joke is, many of Amazon's top reviewers are professional astroturfers. The criminals have been given badges. It's easy to spot an astroturfer. Just click on their name. They write about ten book reviews a day. How many of you buy more than one book a day on Amazon, let alone buy and review it? They must be the fastest readers in the world! \n\n**Ultimately, the problem lies in the consumers themselves.** All the information I have told you in this article can easily be found out by anyone who takes the time to check the reviews of a product. In fact, for most of Dagny Taggart's books, the top review is a one star review that tells you all about the scam. A simple glance at the dates the reviews were published will tell you if a product received ten reviews in one hour. Unfortunately, the majority of ebook consumers don't take a few minutes to do their due diligence, they just look for the stars, and so the best selling books remain the ones with the most positive reviews. You may say it's their own fault, buyer beware, but in the end this will hurt all indie publishers when readers realize their purchases were a scam, and lead them to trust Amazon's review system and indie publishers less and less. \n\nWhat can we do to get Amazon to implement the simple fix of red flagging works that receive too many reviews per sales? What other solutions do you think would be a good idea? \n\n**Edit:** Dagny's lawyer has contacted me, thoughts? Can I actually be sued for reddit posts? \n\nDear goans314,\n\nI am the lawyer of the publishing company that owns Dagny Taggart's book rights on Amazon. \n\nToday you uploaded an outrageously defamatory post attacking my client on Reddit. You are slandering my client with unsubstantiated and shameful lies, hurting his image, reputation, and book sales on Amazon.\n\nI urge you to proceed and delete the defamatory post you have uploaded on Reddit immediately. You will face imminent legal action if you do not proceed to delete the post.\n\nWe reserve all legal actions in regard with the damage you have already caused to my client.\n\nRegards,\n\nMark Hamilton\n\n**Edit2:** More threat's from Dagny's \"lawyer\", guy needs to work on his English....\n\nGood morning,\n\nHere’s again Mark Hamilton, a member of the legal firm that represents the author (Dagny Taggart) you defame. We’ve already identified you, and have complete information about you. You must be aware that you commited a felony and that our legal firm has received precise instructions to prosecute you not only in the US but in any place all around the world where it can be necessary. You will have to pay high indemnizaciones. Not only this, we are commited to put you in prison. To avoid this consequences – that will reach you soon, be sure- your only choice is to proceed WITHIN THE NEXT 3 HOURS to:\n\n1) Write on Reddit a public disculpa. You can say you made a mistake or you was misinformed about this author. But clearly, you have to admit you were wrong.\n\n2) Instruct all the persons you engaged to write defamatory reviews on Amazon, to delete them immediately.\n\nIf you don’t fulfill these requirements WITHIN THE NEXT 3 HOURS, we’ll prosecute you. THIS IS YOUR LAST CHANCE!\n\nHave a good day\n\nMark Hamilton\n\nGood morning,\n\nHere’s again Mark Hamilton, a member of the legal firm that represents the author (Dagny Taggart) you defamed yesterday. We’ve already identified you, and have complete information about your person. You must be aware that you commited a felony and that our legal firm has received precise instructions to legally pursue you not only in the US but in any place all around the world where it can be necessary. Our firm has a long arm. Be sure you will have to pay high reparations. Not only this, we are commited to put you in prison. To avoid this consequences – that will reach you soon, be sure- your only choice is to proceed WITHIN THE NEXT 3 HOURS to:\n\n1) Write on Reddit, and on every site your defamatory expressions have been posted, public apologies. You can say you made a mistak if you want. But clearly, you have to admit you were wrong.\n\n2) Instruct all the persons you engaged to write defamatory reviews on Amazon, to delete them immediately.\n\n3) You, personally, will have to write reviews on Amazon in every book of our client in which defamatory reviews have been posted. You have to say CLEARLY that all these reviews are defamatory.\n\nIf you don’t fulfill these requirements WITHIN THE NEXT 3 HOURS, we’ll legally pursue you. THIS IS YOUR LAST CHANCE!\n\nHave a good day\n\nMark Hamilton\n",
  "hide_score": false,
  "_api_link": "https://api.reddit.com/r/books/comments/3l1epw/how_to_scam_amazon_customers_out_of_100k_a_year/?ref=search_posts",
  "locked": false,
  "edited": 1442447775.0,
  "title": "How to scam amazon customers out of $100k a year.",
  "created": 1442326475.0,
  "_comments_by_id": {}
}