{
  "selftext": "**Another redditor has [fact-checked my factcheck](http://www.reddit.com/r/PoliticalDiscussion/comments/12nmip/do_you_remember_january_3_2007_factcheck/c6wnvg3), I recommend you check it out as well.**\n\n--------------------------------------------------\n\nI received this e-mail and decided to personally fact-check it. Feel free to pass it on.\n\n**Remember that on October 9, 2007, 11 months before our “economic crisis” occurred (that it was actually created), the Dow hit its highest point ever, closing at 14,164.53 and reaching 14,198.10 intra-day level 2 days later. Unemployment was steady at 4.7%. But things were already being put in place to create the havoc we’ve all been experiencing since then.**\n\nTRUE\n\n(Source: BLS, Wikipedia)\n\n**The day the Democrats took over was not January 22nd 2009 with President Obama, it was actually January 3rd 2007, which was the day the Democrats took over the House of Representatives and the Senate, at the very start of the 10th Congress.**\n\nHALF TRUE.\n\n[According to wikipedia](http://en.wikipedia.org/wiki/110th_United_States_Congress), Democrats held fewer than 50 Senate seats, but there were two independent senators who caucused with them. This also means that the Democrats did not have the needed seats to stop a filibuster.\n\n**The Democrat Party controlled a majority in both chambers for the first time since the end of the 103rd Congress in 1995.**\n\nTRUE.\n\n(Source: Wikipedia)\n\n**At the time: The DOW Jones closed at 12,621.77 The GDP for the previous quarter was 3.5% The Unemployment rate was 4.6% George Bush's Economic policies SET A RECORD of 52 STRAIGHT MONTHS of JOB GROWTH**\n\nMOSTLY TRUE.\n\nI can find corresponding factchecks that don't dispute the 52 months claim, although I can't find it myself on BLS. Most likely they cherrypicked the statistics. I can only easily graph total civilian jobs, so this statistic may reflect combined civilian+government+military jobs. The GDP that they cite is actually the [GDP growth in the previous economic quarter at that time](http://www.tradingeconomics.com/united-states/gdp-growth).\n\nNote that [far more jobs were actually created under Clinton's presidency than Bush's](http://en.wikipedia.org/wiki/Jobs_created_during_U.S._presidential_terms).\n\n**January 3rd, 2007 was the day that Barney Frank took over the House Financial Services Committee and Chris Dodd took over the Senate Banking Committee. The economic meltdown that happened 15 months later was in what part of the economy? BANKING AND FINANCIAL SERVICES!**\n\nThe explicit points are TRUE, but the implied conclusion is FALSE.\n\nThe US Financial Crisis Inquiry Commission investigated the claim. They all blamed causes well outside the Banking Committee.\n\nThe majority concluded:\n(i) \"this financial crisis was avoidable.\"\n(ii) \"widespread failures in financial regulation and supervision proved devastating to the stability of the nation’s financial markets.\"\n(iii) \"dramatic failures of corporate governance and risk management at many systemically important financial institutions were a key cause of this crisis.\"\n(iv) \"a combination of excessive borrowing, risky investments, and lack of transparency put the financial system on a collision course with crisis.\"\n(v) \"the government was ill prepared for the crisis, and its inconsistent response added to the uncertainty and panic in the financial markets.\"\n(vi) \"there was a systemic breakdown in accountability and ethics.\"\n(vii) \"collapsing mortgage-lending standards and the mortgage securitization pipeline lit and spread the flame of contagion and crisis.\"\n(viii) \"over-the-counter derivatives contributed significantly to this crisis.\"\n(ix) \"the failures of credit rating agencies were essential cogs in the wheel of financial destruction.\"\n\nThe first dissenting statement concluded it was caused by:\n(i) Developing countries and oil-producing nations loaned savings to the US, creating a credit bubble that increased investment in high-risk mortages. \"U.S. monetary policy may have contributed to the credit bubble but did not cause it.\"\n(ii) \"Beginning in the late 1990s and accelerating in the 2000s, there was a large and sustained housing bubble in the United States.\"\n(iii) \"firms like Countrywide, Washington Mutual, Ameriquest, and HSBC Finance originated vast numbers of high-risk, nontraditional mortgages that were in some cases deceptive, in many cases confusing, and often beyond borrowers’ ability to repay\"\n(iv) \"Failures in credit rating...fueled the creation of more bad mortages\".\n(v) \"Managers of many large and midsize financial institutions in the United States amassed enormous concentrations of highly correlated housing risk.\"\n(vi) \"Managers of these financial firms amplified this concentrated housing risk by holding too little capital relative to the risks they were carrying on their balance sheets\"\n(vii) \"In some cases, the financial system was vulnerable because policymakers were afraid of a large firm’s sudden and disorderly failure triggering balancesheet losses in its counterparties. These institutions were deemed too big and interconnected to other firms through counterparty credit risk for policymakers to be willing to allow them to fail suddenly.\"\n(viii) \"In other cases, unrelated financial institutions failed because of a common shock: they made similar failed bets on housing.\"\n(ix) \"In quick succession in September 2008, the failures, near-failures, and restructurings of ten firms triggered a global financial panic. Confidence and trust in the financial system began to evaporate as the health of almost every large and midsize financial institution in the United States and Europe was questioned.\"\n(x) \"The financial shock and panic caused a severe contraction in the real economy. The shock and panic ended in early 2009.\"\n\nThe second dissenting statement concluded: \"the U.S. government’s housing policies were the major contributor to the i nancial crisis of 2008. These policies fostered the development of a massive housing bubble between 1997 and 2007 and the creation of 27 million subprime and Alt-A loans, many of which were ready to default as soon as the housing bubble began to del ate. The losses associated with these weak and high risk loans caused either the real or apparent weakness of the major Financial institutions around the world that held these mortgages—or PMBS backed by these mortgages—as investments or as sources of liquidity. Deregulation, lack of regulation, predatory lending or the other factors that were cited in the report of the FCIC’s majority were not determinative factors\"\n\nThe majority opinion was written by six members chosen by Nancy Pelosi and Harry Reid. The first dissenting opinion was written by three of the members chosen by John Boener and Mitch McConnell. The second dissenting opinion was written by one member chosen by John Boener, who seems to have co-written the paper with Arthur F. Burns.\n\nSources: [Wikipedia](http://en.wikipedia.org/wiki/FCIC), [FCIC Report](http://fcic.law.stanford.edu/report)\n\nMany people have blamed the repeal of the part of the [Glass-Steagall act](http://en.wikipedia.org/wiki/Glass%E2%80%93Steagall_Act). The repeal was passed as part of the pGramm-Leach-Bliley Act](http://en.wikipedia.org/wiki/Gramm%E2%80%93Leach%E2%80%93Bliley_Act) in 1999 under a Republican Congress and signed into law by Bill Clinton. This allowed commercial banks, investment banks, securities firms, and insurance companies to consolidate.\n\nThe [Dodd Frank Act](http://en.wikipedia.org/wiki/Dodd_Frank_Act), passed in 2010 under the Democratic Congress, restricted depository banks from engaging in proprietary trading. This is an example of the [Volcker Rule](http://en.wikipedia.org/wiki/Volcker_Rule): \"restrict United States banks from making certain kinds of speculative investments that do not benefit their customers\" and was proposed by Obama.\n\nThe [GOP platform](http://www.gop.com/2012-republican-platform_Restoring/): \"Making matters worse, the Congress, under Democrat control, enacted the Dodd-Frank Act, a massive labyrinth of costly new regulations that deter lenders from lending to creditworthy homebuyers and that disproportionately harms small and community banks. As a result, home sales remain weak, investment in housing remains depressed, construction industry jobs remain down, and mortgage lending has yet to recover to pre-crisis levels.\"\n\n**Unemployment added to this CRISIS by (among MANY other things) dumping 5-6 TRILLION Dollars of toxic loans on the economy from YOUR Fannie Mae and Freddie Mac FIASCOES!**\n\nI'm not at all sure what the e-mail means by \"dumping...on the economy\". [This](http://en.wikipedia.org/wiki/Fannie_mae#2008_-_Crisis_and_Conservatorship), however, seems relevant to explain the government's actions towards Fannie Mae.\n\n\"On July 11, 2008, the New York Times reported that U.S. government officials were considering a plan for the U.S. government to take over Fannie Mae and/or Freddie Mac should their financial situations worsen due to the U.S. housing crisis.[37] Fannie Mae and smaller Freddie Mac own or guarantee a massive proportion of all home loans in the United States and so were especially hard hit by the slump. The government officials also stated that the government had also considered calling for explicit government guarantee through legislation of $5 trillion on debt owned or guaranteed by the two companies.\nFannie stock plunged.[38] Some worried that Fannie lacked capital and might go bankrupt. Others worried about a government seizure. U.S. Treasury Secretary Henry M. Paulson as well as the White House went on the air to defend the financial soundness of Fannie Mae, in a last-ditch effort to prevent a total financial panic.[39][40] Fannie and Freddie underpinned the whole U.S. mortgage market. As recently as 2008, Fannie Mae and the Federal Home Loan Mortgage Corporation (Freddie Mac) had owned or guaranteed about half of the U.S.'s $12 trillion mortgage market.[37] If they were to collapse, mortgages would be harder to obtain and much more expensive. Fannie and Freddie bonds were owned by everyone from the Chinese Government, to Money Market funds, to the retirement funds of hundreds of millions of people. If they went bankrupt, all those investments would go to 0, and there would be mass upheaval on a global scale.[41]\"\n\n**Starting in 2001, Bush asked Congress 17 TIMES to stop Fannie & Freddie - because it was financially risky for the US economy.**\n\nTRUE.\n\nMultiple news sources corroborate this.\n\n**And who took the THIRD highest pay-off from Fannie Mae AND Freddie Mac? OBAMA**\n\nFALSE.\n\nActually, he was [second highest in 2008](http://www.opensecrets.org/news/2008/09/update-fannie-mae-and-freddie.html). However, he only received $126,349. By 2008, he had received $22 million from all campaign donors. So Fannie Mae would be about 0.5%. Fannie Mae also donated to both Democrats and Republicans. Democrats only collected 57% of this \"pay-off\".\n\nObama's 2004 [top contributors](https://www.opensecrets.org/races/contrib.php?cycle=2004&id=ILS2) were:\n\n* University of Chicago - $153,054\n* Kirkland & Ellis - $96,138\n* Sonnenschein, Nath & Rosenthal\t $74,200\n* Henry Crown & Co\t$74,000\n* Sidley, Austin et al\t $73,182\n\nFor this election, Obama's [top contributors](https://www.opensecrets.org/pres12/contrib.php?cycle=2012&id=N00009638) are:\n\n* University of California - $1,092,906\n* Microsoft Corp - $761,343\n* Google Inc - $737,055\n* US Government - $627,628\n* Harvard University - $602,992\n\nObama's 2004-2012 [top contributors](https://www.opensecrets.org/politicians/summary.php?cid=N00009638&cycle=Career) have been:\n\n* University of California - $2,453,300\n* Microsoft Corp - $1,399,236\n* Harvard University - $1,354,354\t\n* Google Inc - $1,334,217\n* Goldman Sachs\t- $1,215,165\n\nFrom 1989-2012, [Obama has collected](http://www.opensecrets.org/politicians/summary.php?cycle=Career&type=I&cid=n00009638&newMem=N) $1,440,189,622.\n\nGeorge W. Bush's [top contributors](http://www.opensecrets.org/pres04/contrib.php?cid=N00008072) in 2004 were:\n\n* Morgan Stanley - $603,480\n* Merrill Lynch - $586,254\n* PricewaterhouseCoopers - $514,250\n* UBS AG - $474,325\n* Goldman Sachs - $394,600\n\nMitt Romney's 2002 [top contributors](http://www.opensecrets.org/races/summary.php?cycle=2002&id=MAS2) were:\n\n* FleetBoston Financial - $69,000\n* Interpublic Group - $58,750\n* Mintz, Levin et al - $54,200\n* Verizon Communications\t - $48,206\n* Raytheon Co - $44,350\n\nMitt Romney's [top contributors](https://www.opensecrets.org/pres12/contrib.php?cycle=2012&id=N00000286) for this election are:\n\n* Goldman Sachs - $994,139\n* Bank of America - $921,839\n* Morgan Stanley - $827,255\n* JPMorgan Chase & Co - $792,147\n* Credit Suisse Group - $618,941\n\nOpenSecrets doesn't have a figure for how much Romney has raised throughout his entire political career.\n\n([Comparison between the two candidates](https://www.opensecrets.org/pres12/index.php))\n\n**And who fought against reform of Fannie and Freddie? OBAMA and the Democrat Congress.**\n\nFALSE\n\nFrom Wikipedia, the [bill never made it out of a Republican-majority committee](http://en.wikipedia.org/wiki/Federal_takeover_of_Fannie_Mae_and_Freddie_Mac):\n\"In 2003, the Bush Administration sought to create a new agency, replacing the Office of Federal Housing Enterprise Oversight, to oversee Fannie Mae and Freddie Mac. In 1992 in the wake of the Savings and Loan crisis, and over concern similar lending problems would develop, the Office of Federal Housing Enterprise Oversight was created as part of the Department of Housing and Urban Development.[16] While Senate and House leaders voiced their intention to bring about the needed legislation, no reform bills materialized. A Senate reform bill introduced by Senator John Corzine (D-NJ) (S.1656) never made it out of the 21-member (10D/11R) Senate Banking, Housing, and Urban Affairs Committee.[17] At the time members of the 108th congress expressed faith in the solvency of Fannie and Freddie. Congressman Barney Frank (D-MA), for example, described them as \"not facing any kind of financial crisis.\" [18]\"\n\nObama [did not serve](http://en.wikipedia.org/wiki/United_States_Senate_career_of_Barack_Obama#Committees) on that committee.\n\n**And when you hear Obama blame \"Congress\" for keeping him from meeting his promises, REMEMBER his good friend Harry Reid and fellow Democrats still control the Senate, as they have since JANUARY 3rd, 2007...THE DAY THE DEMOCRATS TOOK OVER!\"**\n\nHALF TRUE.\n\nThe Democrats do control a majority, but just barely. They do not have a supermajority, and the Republican senators have made heavier use of filibusters than at any time in the last 50-90 years.\n\nSources:\n[Wikipedia](http://en.wikipedia.org/w/index.php?title=File:Cloture_Voting,_United_States_Senate,_1947_to_2008.svg&page=1)\n[Washington Post](http://www.washingtonpost.com/blogs/ezra-klein/post/is-the-filibuster-unconstitutional/2012/05/15/gIQAYLp7QU_blog.html)\n\n**Budgets do not come from the White House. They come from Congress and the party that controlled Congress since January 2007 is the Democrat Party. And Harry Reid and the Senate have not proposed a budget in over two years!**\n\nFALSE\n\nEach year, the President of the United States submits his budget request to Congress for the following fiscal year as required by the Budget and Accounting Act of 1921. Current law (31 U.S.C. § 1105(a)) requires the president to submit a budget no earlier than the first Monday in January, and no later than the first Monday in February. Typically, presidents submit budgets on the first Monday in February. The budget submission has been delayed, however, in some new presidents' first year when the previous president belonged to a different party. ([Wikipedia](http://en.wikipedia.org/wiki/United_States_federal_budget))\n\n**Furthermore, the Democrats controlled the budget process for 2008 & 2009 as well as 2010 & 2011.**\n\nMOSTLY TRUE.\n\nI'm assuming they're referring to control of the budget committees. At least for 2011 onwards, Paul Ryan is the chairman of the House Budget committee with a 22/16 Republican majority. Otherwise it appears to be true for previous years.\n\nSources:\n[House Budget Committee website](http://budget.house.gov/about/budgetcommitteemembers.htm)\n[Wikipedia](http://en.wikipedia.org/wiki/United_States_House_Committee_on_the_Budget)\n[Opensecrets.org](http://www.opensecrets.org/cmteprofiles/profiles.php?cmte=HBUD&cmteid=H06&congno=112&chamber=H&cycle=2012)\n\n**In that first year, they had to contend with George Bush, which caused them to compromise on spending, when Bush somewhat belatedly got tough on spending increases.**\n\nThis is a really complicated and highly subjective statement to evaluate. What one person considers \"tough\" may not be the same as someone else.\n\nI would point out that the Democrats did not have the 2/3 majority in both houses to override a presidential veto during Bush's presidency (see above).\n\n**For 2009 though, Nancy Pelosi & Harry Reid bypassed George Bush entirely, passing continuing resolutions to keep government running until Barack Obama could take office. At that time, they passed a massive omnibus spending bill to complete the 2009 budgets.**\n\nMOSTLY FALSE.\n\nThe democrats did have a 2/3 majority in the House, but only had 57 seats in the senate. They would have needed cooperation from both the independents and a republican to pass  The bill they refer to appears to be [HR 1105](http://www.govtrack.us/congress/bills/111/hr1105). According to the GOP's own website, the bill only represented a [$31 billion increase](http://www.gop.gov/bill/111/1/hr1105) over previous spending for $410 billion of government programs. That is not a \"massive\" amount  of a 1.2 trillion deficit (2.5%).\n\nThe CBO [estimated](http://en.wikipedia.org/wiki/Bush_tax_cuts#Debate_over_continuation_of_cuts) that extending the Bush tax cuts from 2011-2020 would directly cost the Federal government $440 billion a year.\n\n**And where was Barack Obama during this time? He was a member of that very Congress that passed all of these massive spending bills, and he signed the omnibus bill as President to complete 2009.**\n\nTRUE, but as pointed out above the omnibus bill was only a $31 billion increase over what those government programs had traditionally used.\n\n**If the Democrats inherited any deficit, it was the 2007 deficit, the last of the Republican budgets.**\n\nHALF TRUE.\n\nWhile it is true the Democrats controlled the House of Representatives and Senate, as well as their respective budget committees, they did not control the Presidency and could not override a veto. On [at least one occasion](http://en.wikipedia.org/wiki/110th_congress#Major_events) this lead to the Democratic congress altering a spending bill necessitated by the war in Iraq to allow for indefinite military operations.\n\n**That deficit was the lowest in five years, and the fourth straight decline in deficit spending.**\n\nTRUE.\n\nFrom 2002-2004, the budget went from a $127 billion surplus to a $413 billion deficit. From 2004-2007, the deficit went down to $164 billion. From 2007-2009, the deficit spiked to $1.4 trillion. From 2009-2012, the deficit has reduced to $1.1 trillion. ([Source](http://www.davemanuel.com/history-of-deficits-and-surpluses-in-the-united-states.php))\n\n**After that, Democrats in Congress took control of spending, and that includes Barack Obama, who voted for the budgets.**\n\nTRUE.\n\n**If Obama inherited anything, he inherited it from himself. In a nutshell, what Obama is saying is \"I inherited a deficit that I voted for and then I voted to expand that deficit four-fold since January 20th.\"**\n\nPANTS ON FIRE.\n\nThe deficit includes [increased defense spending](http://en.wikipedia.org/wiki/Financial_cost_of_the_Iraq_War#Appropriations) necessary to maintain a military presence in Iraq and Afghanistan, reduced tax revenues due to the deficit, and the Bush tax cuts which were passed prior to Obama's Senate term and have cost hundreds of billions of dollars per year. The present-day deficit also includes economic stimulus acts, bailouts of banks and auto manufacturers to stabilize the economy due to the economic crash. The economic crash itself, as established above, is not easily blamed on one party of government and seems to be a consequence of businesses and individuals making more investments with more risk than they were prepared to handle. If anything, the Republican party's commitment to making it easier for people to get home loans and invest on those home loans seems more conductive to creating the same problems that even their own committee members blamed as the cause of the crisis.\n\nThe Omnibus bill the e-mail cites contained \"nine appropriation bills that were not passed by Congress last year (Agriculture, Commerce/State/Justice, Energy and Water, Financial Services, Department of Interior, Labor/HHS, Legislative Branch, Department of State/Foreign Ops, Transportation/HUD)\" and only increased funding over previous the previous year's levels by $31 billion/$410 billion, according to the GOP's own website. Substantially more spending increases would need to be identified to equal the amount put in place by the Bush administration's policies, let alone to blame the deficit solely on the Democratic party.\n\nThe CBO's analysis:\nhttp://www.cbo.gov/sites/default/files/cbofiles/attachments/06-07-ChangesSince2001Baseline.pdf",
  "gilded": 0,
  "score": 18,
  "removal_reason": null,
  "approved_by": null,
  "created_utc": 1352093007.0,
  "is_self": true,
  "stickied": false,
  "edited": 1352113572.0,
  "distinguished": null,
  "permalink": "https://www.reddit.com/r/PoliticalDiscussion/comments/12nmip/do_you_remember_january_3_2007_factcheck/?ref=search_posts",
  "banned_by": null,
  "from_id": null,
  "likes": null,
  "_underscore_names": null,
  "num_reports": null,
  "link_flair_css_class": null,
  "_info_url": "https://api.reddit.com/api/info/",
  "id": "12nmip",
  "archived": true,
  "secure_media": null,
  "from_kind": null,
  "saved": false,
  "domain": "self.PoliticalDiscussion",
  "ups": 18,
  "suggested_sort": null,
  "quarantine": false,
  "over_18": false,
  "hide_score": false,
  "url": "https://www.reddit.com/r/PoliticalDiscussion/comments/12nmip/do_you_remember_january_3_2007_factcheck/",
  "subreddit_id": "t5_2sfmf",
  "_params": {},
  "_comments": null,
  "_replaced_more": false,
  "_comments_by_id": {},
  "user_reports": [],
  "media_embed": {},
  "created": 1352096607.0,
  "author_flair_text": null,
  "visited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Another redditor has <a href=\"http://www.reddit.com/r/PoliticalDiscussion/comments/12nmip/do_you_remember_january_3_2007_factcheck/c6wnvg3\">fact-checked my factcheck</a>, I recommend you check it out as well.</strong></p>\n\n<hr/>\n\n<p>I received this e-mail and decided to personally fact-check it. Feel free to pass it on.</p>\n\n<p><strong>Remember that on October 9, 2007, 11 months before our “economic crisis” occurred (that it was actually created), the Dow hit its highest point ever, closing at 14,164.53 and reaching 14,198.10 intra-day level 2 days later. Unemployment was steady at 4.7%. But things were already being put in place to create the havoc we’ve all been experiencing since then.</strong></p>\n\n<p>TRUE</p>\n\n<p>(Source: BLS, Wikipedia)</p>\n\n<p><strong>The day the Democrats took over was not January 22nd 2009 with President Obama, it was actually January 3rd 2007, which was the day the Democrats took over the House of Representatives and the Senate, at the very start of the 10th Congress.</strong></p>\n\n<p>HALF TRUE.</p>\n\n<p><a href=\"http://en.wikipedia.org/wiki/110th_United_States_Congress\">According to wikipedia</a>, Democrats held fewer than 50 Senate seats, but there were two independent senators who caucused with them. This also means that the Democrats did not have the needed seats to stop a filibuster.</p>\n\n<p><strong>The Democrat Party controlled a majority in both chambers for the first time since the end of the 103rd Congress in 1995.</strong></p>\n\n<p>TRUE.</p>\n\n<p>(Source: Wikipedia)</p>\n\n<p><strong>At the time: The DOW Jones closed at 12,621.77 The GDP for the previous quarter was 3.5% The Unemployment rate was 4.6% George Bush&#39;s Economic policies SET A RECORD of 52 STRAIGHT MONTHS of JOB GROWTH</strong></p>\n\n<p>MOSTLY TRUE.</p>\n\n<p>I can find corresponding factchecks that don&#39;t dispute the 52 months claim, although I can&#39;t find it myself on BLS. Most likely they cherrypicked the statistics. I can only easily graph total civilian jobs, so this statistic may reflect combined civilian+government+military jobs. The GDP that they cite is actually the <a href=\"http://www.tradingeconomics.com/united-states/gdp-growth\">GDP growth in the previous economic quarter at that time</a>.</p>\n\n<p>Note that <a href=\"http://en.wikipedia.org/wiki/Jobs_created_during_U.S._presidential_terms\">far more jobs were actually created under Clinton&#39;s presidency than Bush&#39;s</a>.</p>\n\n<p><strong>January 3rd, 2007 was the day that Barney Frank took over the House Financial Services Committee and Chris Dodd took over the Senate Banking Committee. The economic meltdown that happened 15 months later was in what part of the economy? BANKING AND FINANCIAL SERVICES!</strong></p>\n\n<p>The explicit points are TRUE, but the implied conclusion is FALSE.</p>\n\n<p>The US Financial Crisis Inquiry Commission investigated the claim. They all blamed causes well outside the Banking Committee.</p>\n\n<p>The majority concluded:\n(i) &quot;this financial crisis was avoidable.&quot;\n(ii) &quot;widespread failures in financial regulation and supervision proved devastating to the stability of the nation’s financial markets.&quot;\n(iii) &quot;dramatic failures of corporate governance and risk management at many systemically important financial institutions were a key cause of this crisis.&quot;\n(iv) &quot;a combination of excessive borrowing, risky investments, and lack of transparency put the financial system on a collision course with crisis.&quot;\n(v) &quot;the government was ill prepared for the crisis, and its inconsistent response added to the uncertainty and panic in the financial markets.&quot;\n(vi) &quot;there was a systemic breakdown in accountability and ethics.&quot;\n(vii) &quot;collapsing mortgage-lending standards and the mortgage securitization pipeline lit and spread the flame of contagion and crisis.&quot;\n(viii) &quot;over-the-counter derivatives contributed significantly to this crisis.&quot;\n(ix) &quot;the failures of credit rating agencies were essential cogs in the wheel of financial destruction.&quot;</p>\n\n<p>The first dissenting statement concluded it was caused by:\n(i) Developing countries and oil-producing nations loaned savings to the US, creating a credit bubble that increased investment in high-risk mortages. &quot;U.S. monetary policy may have contributed to the credit bubble but did not cause it.&quot;\n(ii) &quot;Beginning in the late 1990s and accelerating in the 2000s, there was a large and sustained housing bubble in the United States.&quot;\n(iii) &quot;firms like Countrywide, Washington Mutual, Ameriquest, and HSBC Finance originated vast numbers of high-risk, nontraditional mortgages that were in some cases deceptive, in many cases confusing, and often beyond borrowers’ ability to repay&quot;\n(iv) &quot;Failures in credit rating...fueled the creation of more bad mortages&quot;.\n(v) &quot;Managers of many large and midsize financial institutions in the United States amassed enormous concentrations of highly correlated housing risk.&quot;\n(vi) &quot;Managers of these financial firms amplified this concentrated housing risk by holding too little capital relative to the risks they were carrying on their balance sheets&quot;\n(vii) &quot;In some cases, the financial system was vulnerable because policymakers were afraid of a large firm’s sudden and disorderly failure triggering balancesheet losses in its counterparties. These institutions were deemed too big and interconnected to other firms through counterparty credit risk for policymakers to be willing to allow them to fail suddenly.&quot;\n(viii) &quot;In other cases, unrelated financial institutions failed because of a common shock: they made similar failed bets on housing.&quot;\n(ix) &quot;In quick succession in September 2008, the failures, near-failures, and restructurings of ten firms triggered a global financial panic. Confidence and trust in the financial system began to evaporate as the health of almost every large and midsize financial institution in the United States and Europe was questioned.&quot;\n(x) &quot;The financial shock and panic caused a severe contraction in the real economy. The shock and panic ended in early 2009.&quot;</p>\n\n<p>The second dissenting statement concluded: &quot;the U.S. government’s housing policies were the major contributor to the i nancial crisis of 2008. These policies fostered the development of a massive housing bubble between 1997 and 2007 and the creation of 27 million subprime and Alt-A loans, many of which were ready to default as soon as the housing bubble began to del ate. The losses associated with these weak and high risk loans caused either the real or apparent weakness of the major Financial institutions around the world that held these mortgages—or PMBS backed by these mortgages—as investments or as sources of liquidity. Deregulation, lack of regulation, predatory lending or the other factors that were cited in the report of the FCIC’s majority were not determinative factors&quot;</p>\n\n<p>The majority opinion was written by six members chosen by Nancy Pelosi and Harry Reid. The first dissenting opinion was written by three of the members chosen by John Boener and Mitch McConnell. The second dissenting opinion was written by one member chosen by John Boener, who seems to have co-written the paper with Arthur F. Burns.</p>\n\n<p>Sources: <a href=\"http://en.wikipedia.org/wiki/FCIC\">Wikipedia</a>, <a href=\"http://fcic.law.stanford.edu/report\">FCIC Report</a></p>\n\n<p>Many people have blamed the repeal of the part of the <a href=\"http://en.wikipedia.org/wiki/Glass%E2%80%93Steagall_Act\">Glass-Steagall act</a>. The repeal was passed as part of the pGramm-Leach-Bliley Act](<a href=\"http://en.wikipedia.org/wiki/Gramm%E2%80%93Leach%E2%80%93Bliley_Act\">http://en.wikipedia.org/wiki/Gramm%E2%80%93Leach%E2%80%93Bliley_Act</a>) in 1999 under a Republican Congress and signed into law by Bill Clinton. This allowed commercial banks, investment banks, securities firms, and insurance companies to consolidate.</p>\n\n<p>The <a href=\"http://en.wikipedia.org/wiki/Dodd_Frank_Act\">Dodd Frank Act</a>, passed in 2010 under the Democratic Congress, restricted depository banks from engaging in proprietary trading. This is an example of the <a href=\"http://en.wikipedia.org/wiki/Volcker_Rule\">Volcker Rule</a>: &quot;restrict United States banks from making certain kinds of speculative investments that do not benefit their customers&quot; and was proposed by Obama.</p>\n\n<p>The <a href=\"http://www.gop.com/2012-republican-platform_Restoring/\">GOP platform</a>: &quot;Making matters worse, the Congress, under Democrat control, enacted the Dodd-Frank Act, a massive labyrinth of costly new regulations that deter lenders from lending to creditworthy homebuyers and that disproportionately harms small and community banks. As a result, home sales remain weak, investment in housing remains depressed, construction industry jobs remain down, and mortgage lending has yet to recover to pre-crisis levels.&quot;</p>\n\n<p><strong>Unemployment added to this CRISIS by (among MANY other things) dumping 5-6 TRILLION Dollars of toxic loans on the economy from YOUR Fannie Mae and Freddie Mac FIASCOES!</strong></p>\n\n<p>I&#39;m not at all sure what the e-mail means by &quot;dumping...on the economy&quot;. <a href=\"http://en.wikipedia.org/wiki/Fannie_mae#2008_-_Crisis_and_Conservatorship\">This</a>, however, seems relevant to explain the government&#39;s actions towards Fannie Mae.</p>\n\n<p>&quot;On July 11, 2008, the New York Times reported that U.S. government officials were considering a plan for the U.S. government to take over Fannie Mae and/or Freddie Mac should their financial situations worsen due to the U.S. housing crisis.[37] Fannie Mae and smaller Freddie Mac own or guarantee a massive proportion of all home loans in the United States and so were especially hard hit by the slump. The government officials also stated that the government had also considered calling for explicit government guarantee through legislation of $5 trillion on debt owned or guaranteed by the two companies.\nFannie stock plunged.[38] Some worried that Fannie lacked capital and might go bankrupt. Others worried about a government seizure. U.S. Treasury Secretary Henry M. Paulson as well as the White House went on the air to defend the financial soundness of Fannie Mae, in a last-ditch effort to prevent a total financial panic.[39][40] Fannie and Freddie underpinned the whole U.S. mortgage market. As recently as 2008, Fannie Mae and the Federal Home Loan Mortgage Corporation (Freddie Mac) had owned or guaranteed about half of the U.S.&#39;s $12 trillion mortgage market.[37] If they were to collapse, mortgages would be harder to obtain and much more expensive. Fannie and Freddie bonds were owned by everyone from the Chinese Government, to Money Market funds, to the retirement funds of hundreds of millions of people. If they went bankrupt, all those investments would go to 0, and there would be mass upheaval on a global scale.[41]&quot;</p>\n\n<p><strong>Starting in 2001, Bush asked Congress 17 TIMES to stop Fannie &amp; Freddie - because it was financially risky for the US economy.</strong></p>\n\n<p>TRUE.</p>\n\n<p>Multiple news sources corroborate this.</p>\n\n<p><strong>And who took the THIRD highest pay-off from Fannie Mae AND Freddie Mac? OBAMA</strong></p>\n\n<p>FALSE.</p>\n\n<p>Actually, he was <a href=\"http://www.opensecrets.org/news/2008/09/update-fannie-mae-and-freddie.html\">second highest in 2008</a>. However, he only received $126,349. By 2008, he had received $22 million from all campaign donors. So Fannie Mae would be about 0.5%. Fannie Mae also donated to both Democrats and Republicans. Democrats only collected 57% of this &quot;pay-off&quot;.</p>\n\n<p>Obama&#39;s 2004 <a href=\"https://www.opensecrets.org/races/contrib.php?cycle=2004&amp;id=ILS2\">top contributors</a> were:</p>\n\n<ul>\n<li>University of Chicago - $153,054</li>\n<li>Kirkland &amp; Ellis - $96,138</li>\n<li>Sonnenschein, Nath &amp; Rosenthal     $74,200</li>\n<li>Henry Crown &amp; Co  $74,000</li>\n<li>Sidley, Austin et al   $73,182</li>\n</ul>\n\n<p>For this election, Obama&#39;s <a href=\"https://www.opensecrets.org/pres12/contrib.php?cycle=2012&amp;id=N00009638\">top contributors</a> are:</p>\n\n<ul>\n<li>University of California - $1,092,906</li>\n<li>Microsoft Corp - $761,343</li>\n<li>Google Inc - $737,055</li>\n<li>US Government - $627,628</li>\n<li>Harvard University - $602,992</li>\n</ul>\n\n<p>Obama&#39;s 2004-2012 <a href=\"https://www.opensecrets.org/politicians/summary.php?cid=N00009638&amp;cycle=Career\">top contributors</a> have been:</p>\n\n<ul>\n<li>University of California - $2,453,300</li>\n<li>Microsoft Corp - $1,399,236</li>\n<li>Harvard University - $1,354,354<br/></li>\n<li>Google Inc - $1,334,217</li>\n<li>Goldman Sachs - $1,215,165</li>\n</ul>\n\n<p>From 1989-2012, <a href=\"http://www.opensecrets.org/politicians/summary.php?cycle=Career&amp;type=I&amp;cid=n00009638&amp;newMem=N\">Obama has collected</a> $1,440,189,622.</p>\n\n<p>George W. Bush&#39;s <a href=\"http://www.opensecrets.org/pres04/contrib.php?cid=N00008072\">top contributors</a> in 2004 were:</p>\n\n<ul>\n<li>Morgan Stanley - $603,480</li>\n<li>Merrill Lynch - $586,254</li>\n<li>PricewaterhouseCoopers - $514,250</li>\n<li>UBS AG - $474,325</li>\n<li>Goldman Sachs - $394,600</li>\n</ul>\n\n<p>Mitt Romney&#39;s 2002 <a href=\"http://www.opensecrets.org/races/summary.php?cycle=2002&amp;id=MAS2\">top contributors</a> were:</p>\n\n<ul>\n<li>FleetBoston Financial - $69,000</li>\n<li>Interpublic Group - $58,750</li>\n<li>Mintz, Levin et al - $54,200</li>\n<li>Verizon Communications     - $48,206</li>\n<li>Raytheon Co - $44,350</li>\n</ul>\n\n<p>Mitt Romney&#39;s <a href=\"https://www.opensecrets.org/pres12/contrib.php?cycle=2012&amp;id=N00000286\">top contributors</a> for this election are:</p>\n\n<ul>\n<li>Goldman Sachs - $994,139</li>\n<li>Bank of America - $921,839</li>\n<li>Morgan Stanley - $827,255</li>\n<li>JPMorgan Chase &amp; Co - $792,147</li>\n<li>Credit Suisse Group - $618,941</li>\n</ul>\n\n<p>OpenSecrets doesn&#39;t have a figure for how much Romney has raised throughout his entire political career.</p>\n\n<p>(<a href=\"https://www.opensecrets.org/pres12/index.php\">Comparison between the two candidates</a>)</p>\n\n<p><strong>And who fought against reform of Fannie and Freddie? OBAMA and the Democrat Congress.</strong></p>\n\n<p>FALSE</p>\n\n<p>From Wikipedia, the <a href=\"http://en.wikipedia.org/wiki/Federal_takeover_of_Fannie_Mae_and_Freddie_Mac\">bill never made it out of a Republican-majority committee</a>:\n&quot;In 2003, the Bush Administration sought to create a new agency, replacing the Office of Federal Housing Enterprise Oversight, to oversee Fannie Mae and Freddie Mac. In 1992 in the wake of the Savings and Loan crisis, and over concern similar lending problems would develop, the Office of Federal Housing Enterprise Oversight was created as part of the Department of Housing and Urban Development.[16] While Senate and House leaders voiced their intention to bring about the needed legislation, no reform bills materialized. A Senate reform bill introduced by Senator John Corzine (D-NJ) (S.1656) never made it out of the 21-member (10D/11R) Senate Banking, Housing, and Urban Affairs Committee.[17] At the time members of the 108th congress expressed faith in the solvency of Fannie and Freddie. Congressman Barney Frank (D-MA), for example, described them as &quot;not facing any kind of financial crisis.&quot; [18]&quot;</p>\n\n<p>Obama <a href=\"http://en.wikipedia.org/wiki/United_States_Senate_career_of_Barack_Obama#Committees\">did not serve</a> on that committee.</p>\n\n<p><strong>And when you hear Obama blame &quot;Congress&quot; for keeping him from meeting his promises, REMEMBER his good friend Harry Reid and fellow Democrats still control the Senate, as they have since JANUARY 3rd, 2007...THE DAY THE DEMOCRATS TOOK OVER!&quot;</strong></p>\n\n<p>HALF TRUE.</p>\n\n<p>The Democrats do control a majority, but just barely. They do not have a supermajority, and the Republican senators have made heavier use of filibusters than at any time in the last 50-90 years.</p>\n\n<p>Sources:\n<a href=\"http://en.wikipedia.org/w/index.php?title=File:Cloture_Voting,_United_States_Senate,_1947_to_2008.svg&amp;page=1\">Wikipedia</a>\n<a href=\"http://www.washingtonpost.com/blogs/ezra-klein/post/is-the-filibuster-unconstitutional/2012/05/15/gIQAYLp7QU_blog.html\">Washington Post</a></p>\n\n<p><strong>Budgets do not come from the White House. They come from Congress and the party that controlled Congress since January 2007 is the Democrat Party. And Harry Reid and the Senate have not proposed a budget in over two years!</strong></p>\n\n<p>FALSE</p>\n\n<p>Each year, the President of the United States submits his budget request to Congress for the following fiscal year as required by the Budget and Accounting Act of 1921. Current law (31 U.S.C. § 1105(a)) requires the president to submit a budget no earlier than the first Monday in January, and no later than the first Monday in February. Typically, presidents submit budgets on the first Monday in February. The budget submission has been delayed, however, in some new presidents&#39; first year when the previous president belonged to a different party. (<a href=\"http://en.wikipedia.org/wiki/United_States_federal_budget\">Wikipedia</a>)</p>\n\n<p><strong>Furthermore, the Democrats controlled the budget process for 2008 &amp; 2009 as well as 2010 &amp; 2011.</strong></p>\n\n<p>MOSTLY TRUE.</p>\n\n<p>I&#39;m assuming they&#39;re referring to control of the budget committees. At least for 2011 onwards, Paul Ryan is the chairman of the House Budget committee with a 22/16 Republican majority. Otherwise it appears to be true for previous years.</p>\n\n<p>Sources:\n<a href=\"http://budget.house.gov/about/budgetcommitteemembers.htm\">House Budget Committee website</a>\n<a href=\"http://en.wikipedia.org/wiki/United_States_House_Committee_on_the_Budget\">Wikipedia</a>\n<a href=\"http://www.opensecrets.org/cmteprofiles/profiles.php?cmte=HBUD&amp;cmteid=H06&amp;congno=112&amp;chamber=H&amp;cycle=2012\">Opensecrets.org</a></p>\n\n<p><strong>In that first year, they had to contend with George Bush, which caused them to compromise on spending, when Bush somewhat belatedly got tough on spending increases.</strong></p>\n\n<p>This is a really complicated and highly subjective statement to evaluate. What one person considers &quot;tough&quot; may not be the same as someone else.</p>\n\n<p>I would point out that the Democrats did not have the 2/3 majority in both houses to override a presidential veto during Bush&#39;s presidency (see above).</p>\n\n<p><strong>For 2009 though, Nancy Pelosi &amp; Harry Reid bypassed George Bush entirely, passing continuing resolutions to keep government running until Barack Obama could take office. At that time, they passed a massive omnibus spending bill to complete the 2009 budgets.</strong></p>\n\n<p>MOSTLY FALSE.</p>\n\n<p>The democrats did have a 2/3 majority in the House, but only had 57 seats in the senate. They would have needed cooperation from both the independents and a republican to pass  The bill they refer to appears to be <a href=\"http://www.govtrack.us/congress/bills/111/hr1105\">HR 1105</a>. According to the GOP&#39;s own website, the bill only represented a <a href=\"http://www.gop.gov/bill/111/1/hr1105\">$31 billion increase</a> over previous spending for $410 billion of government programs. That is not a &quot;massive&quot; amount  of a 1.2 trillion deficit (2.5%).</p>\n\n<p>The CBO <a href=\"http://en.wikipedia.org/wiki/Bush_tax_cuts#Debate_over_continuation_of_cuts\">estimated</a> that extending the Bush tax cuts from 2011-2020 would directly cost the Federal government $440 billion a year.</p>\n\n<p><strong>And where was Barack Obama during this time? He was a member of that very Congress that passed all of these massive spending bills, and he signed the omnibus bill as President to complete 2009.</strong></p>\n\n<p>TRUE, but as pointed out above the omnibus bill was only a $31 billion increase over what those government programs had traditionally used.</p>\n\n<p><strong>If the Democrats inherited any deficit, it was the 2007 deficit, the last of the Republican budgets.</strong></p>\n\n<p>HALF TRUE.</p>\n\n<p>While it is true the Democrats controlled the House of Representatives and Senate, as well as their respective budget committees, they did not control the Presidency and could not override a veto. On <a href=\"http://en.wikipedia.org/wiki/110th_congress#Major_events\">at least one occasion</a> this lead to the Democratic congress altering a spending bill necessitated by the war in Iraq to allow for indefinite military operations.</p>\n\n<p><strong>That deficit was the lowest in five years, and the fourth straight decline in deficit spending.</strong></p>\n\n<p>TRUE.</p>\n\n<p>From 2002-2004, the budget went from a $127 billion surplus to a $413 billion deficit. From 2004-2007, the deficit went down to $164 billion. From 2007-2009, the deficit spiked to $1.4 trillion. From 2009-2012, the deficit has reduced to $1.1 trillion. (<a href=\"http://www.davemanuel.com/history-of-deficits-and-surpluses-in-the-united-states.php\">Source</a>)</p>\n\n<p><strong>After that, Democrats in Congress took control of spending, and that includes Barack Obama, who voted for the budgets.</strong></p>\n\n<p>TRUE.</p>\n\n<p><strong>If Obama inherited anything, he inherited it from himself. In a nutshell, what Obama is saying is &quot;I inherited a deficit that I voted for and then I voted to expand that deficit four-fold since January 20th.&quot;</strong></p>\n\n<p>PANTS ON FIRE.</p>\n\n<p>The deficit includes <a href=\"http://en.wikipedia.org/wiki/Financial_cost_of_the_Iraq_War#Appropriations\">increased defense spending</a> necessary to maintain a military presence in Iraq and Afghanistan, reduced tax revenues due to the deficit, and the Bush tax cuts which were passed prior to Obama&#39;s Senate term and have cost hundreds of billions of dollars per year. The present-day deficit also includes economic stimulus acts, bailouts of banks and auto manufacturers to stabilize the economy due to the economic crash. The economic crash itself, as established above, is not easily blamed on one party of government and seems to be a consequence of businesses and individuals making more investments with more risk than they were prepared to handle. If anything, the Republican party&#39;s commitment to making it easier for people to get home loans and invest on those home loans seems more conductive to creating the same problems that even their own committee members blamed as the cause of the crisis.</p>\n\n<p>The Omnibus bill the e-mail cites contained &quot;nine appropriation bills that were not passed by Congress last year (Agriculture, Commerce/State/Justice, Energy and Water, Financial Services, Department of Interior, Labor/HHS, Legislative Branch, Department of State/Foreign Ops, Transportation/HUD)&quot; and only increased funding over previous the previous year&#39;s levels by $31 billion/$410 billion, according to the GOP&#39;s own website. Substantially more spending increases would need to be identified to equal the amount put in place by the Bush administration&#39;s policies, let alone to blame the deficit solely on the Democratic party.</p>\n\n<p>The CBO&#39;s analysis:\n<a href=\"http://www.cbo.gov/sites/default/files/cbofiles/attachments/06-07-ChangesSince2001Baseline.pdf\">http://www.cbo.gov/sites/default/files/cbofiles/attachments/06-07-ChangesSince2001Baseline.pdf</a></p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "_comment_sort": null,
  "report_reasons": null,
  "name": "t3_12nmip",
  "from": null,
  "hidden": false,
  "clicked": false,
  "media": null,
  "json_dict": null,
  "_api_link": "https://api.reddit.com/r/PoliticalDiscussion/comments/12nmip/do_you_remember_january_3_2007_factcheck/?ref=search_posts",
  "secure_media_embed": {},
  "mod_reports": [],
  "_orphaned": {},
  "_uniq": null,
  "num_comments": 11,
  "link_flair_text": null,
  "title": "\"Do you remember January 3, 2007\" Fact-check.",
  "_has_fetched": true,
  "author_flair_css_class": null,
  "thumbnail": ""
}