{
  "downs": 0,
  "mod_reports": [],
  "secure_media_embed": {},
  "_info_url": "https://api.reddit.com/api/info/",
  "gilded": 0,
  "num_comments": 23,
  "_orphaned": {},
  "hidden": false,
  "ups": 54,
  "url": "https://www.reddit.com/r/badhistory/comments/2f5gua/hohohorrible_santa_history/",
  "_has_fetched": true,
  "quarantine": false,
  "name": "t3_2f5gua",
  "author_flair_text": "the Weather History Slayer",
  "user_reports": [],
  "saved": false,
  "permalink": "https://www.reddit.com/r/badhistory/comments/2f5gua/hohohorrible_santa_history/?ref=search_posts",
  "over_18": false,
  "is_self": true,
  "_params": {},
  "thumbnail": "",
  "created_utc": 1409556190.0,
  "_replaced_more": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I found <a href=\"http://np.reddit.com/r/todayilearned/comments/2f3a6r/til_santa_is_red_and_white_because_coca_cola/\">this post</a> in TIL, and while the comments are quick to point out that that is both inaccurate and not actually what the Coca Cola website says, the <a href=\"http://www.coca-cola.co.uk/faq/rumours/is-it-true-santa-is-red-because-of-coca-cola.html\">Coca Cola website</a> isn&#39;t entirely accurate either. </p>\n\n<p>So how do we get our modern image of Santa Claus? Santa Claus, as we all know, is roughly based on <a href=\"https://en.wikipedia.org/wiki/Saint_Nicholas\">Saint Nicholas</a>, a lovely 4th century figure known for giving gifts and being the patron saint of things. Much of the modern American image of Santa Claus, though, is based not on St. Nicholas, but rather on a combination of cultural images of a Christmas figure, including the British <a href=\"https://upload.wikimedia.org/wikipedia/commons/1/19/FatherChristmastrial.jpg\">Father Christmas</a> and the Dutch <a href=\"https://upload.wikimedia.org/wikipedia/commons/7/7c/Intocht_van_Sinterklaas_in_Schiedam_2009_%284102602499%29_%282%29.jpg\">Sinterklaas</a>. </p>\n\n<p>The connection between Sinterklaas and Santa Claus is debated. <a href=\"http://www.livius.org/ne-nn/nicholas/nicholas_of_myra3.html\">This source</a> makes the case that one directly influenced the other through both Thomas Nast (who I&#39;ll get to) and Dutch colonists in New Amsterdam. However, there isn&#39;t much in the way of hard evidence that the Dutch living in New Amsterdam ever really celebrated Sinterklaas, though the fact that it was a Dutch holiday at this point suggests they did. Washington Irving certainly thought it had been celebrated in New Amsterdam, including it in novels and stories about the region. <em>Knickerbocker&#39;s History of New York from The Beginning of the World To the End of The Dutch Dynasty</em> published in 1809 featured Sinterklaas as a character, and his 1812 edition of <em>A History of New York</em> included an image of Sinterklaas flying over rooftops in a flying wagon, something which almost certainly influenced the development of the image of Santa Claus.</p>\n\n<p>The first recorded image of Santa riding in a sleigh pulled by reindeer comes from 1821 in <em>A New-year&#39;s present, to the little ones from five to twelve</em> which contained a poem about &quot;Old Santeclaus.&quot; This also contained a depiction of Santa in a red outfit quite unlike that of Sinterklaas or of previous depictions of the character. In 1823, the poem <a href=\"http://www.poets.org/poetsorg/poem/visit-st-nicholas\">A Visit from St. Nicholas</a> by Clement Clark Moore further popularised the image. The first American image of a character unquestionably labelled as &quot;Santa Claus&quot; was based on the Moore poem and appeared in 1837. This character was short, beardless, and rather evil-looking, though he did dress in red and stuff a bag of toys down chimneys. It was a combination of many cultural influences, with some German and Dutch imagery, but also with some imagery shared with Father Christmas. </p>\n\n<p>Enter Thomas Nast, cartoonist and illustrator for the magazine <em>Harper&#39;s Weekly.</em> Nast is a fascinating figure in and of himself, popularising many common American political images such as the elephant and the donkey to represent the Republican and Democrat parties, but in this context, we&#39;re going to talk about Santa Claus. Nast is a key figure in his creation, not only creating 76 images of Santa, but also potentially establishing many aspects of the lore, including that Santa Claus lived at the North Pole. His first <a href=\"https://upload.wikimedia.org/wikipedia/commons/f/f3/Santa_Claus_1863_Harpers.png\">images</a> of Santa Claus involve the character in the Civil War on the Union side (Nast was a political cartoonist, after all), but evolved to show him in <a href=\"http://webcomicoverlook.files.wordpress.com/2010/12/nast1271.jpg?w=604\">more familiar settings</a>. <a href=\"http://webcomicoverlook.files.wordpress.com/2010/12/santa_claus_2.jpg?w=604\">This</a> image from 1881 is probably the single most famous of his Santa Claus images, and is one of the greatest influences on the modern depiction of the character. Even at this point, though, the character could be found in <a href=\"http://webcomicoverlook.files.wordpress.com/2010/12/nast-works.jpg?w=604\">a bright red suit</a>. </p>\n\n<p>This is not to say that Coca Cola didn&#39;t have a role in popularising the character. Santa had been used in advertising throughout the early 20th century, including advertising <a href=\"http://www.whiterocking.org/images/sf1915web.jpg\">mineral water in 1915</a>  (<a href=\"http://www.whiterocking.org/santa.html\">this gallery</a> is full of fun images from the 1910s to mid-1920s, with <a href=\"http://www.whiterocking.org/images/life121223web.jpg\">this one</a> being my favourite). Coca Cola began advertising using illustrator Haddon Sundblom&#39;s <a href=\"http://www.stnicholascenter.org/media/images/t/time-1931a.jpg\">version of the character</a> in 1931. The rest, they say, is history as the character became ingratiated with Christmas, the spirit of giving, and American culture. The image evolved to fit with the times - Santa&#39;s workshop became industrialised by the end of the 20th century, for instance - but the original image influenced by Dutch settlers and encapsulated by Nast remained roughly the same. </p>\n\n<p>Source and further reading: Christmas in America by Penne L. Restad</p>\n</div><!-- SC_ON -->",
  "author_flair_css_class": "",
  "subreddit_id": "t5_2wo26",
  "archived": true,
  "domain": "self.badhistory",
  "clicked": false,
  "score": 54,
  "id": "2f5gua",
  "stickied": false,
  "media_embed": {},
  "visited": false,
  "selftext": "I found [this post](http://np.reddit.com/r/todayilearned/comments/2f3a6r/til_santa_is_red_and_white_because_coca_cola/) in TIL, and while the comments are quick to point out that that is both inaccurate and not actually what the Coca Cola website says, the [Coca Cola website](http://www.coca-cola.co.uk/faq/rumours/is-it-true-santa-is-red-because-of-coca-cola.html) isn't entirely accurate either. \n\nSo how do we get our modern image of Santa Claus? Santa Claus, as we all know, is roughly based on [Saint Nicholas](https://en.wikipedia.org/wiki/Saint_Nicholas), a lovely 4th century figure known for giving gifts and being the patron saint of things. Much of the modern American image of Santa Claus, though, is based not on St. Nicholas, but rather on a combination of cultural images of a Christmas figure, including the British [Father Christmas](https://upload.wikimedia.org/wikipedia/commons/1/19/FatherChristmastrial.jpg) and the Dutch [Sinterklaas](https://upload.wikimedia.org/wikipedia/commons/7/7c/Intocht_van_Sinterklaas_in_Schiedam_2009_%284102602499%29_%282%29.jpg). \n\nThe connection between Sinterklaas and Santa Claus is debated. [This source](http://www.livius.org/ne-nn/nicholas/nicholas_of_myra3.html) makes the case that one directly influenced the other through both Thomas Nast (who I'll get to) and Dutch colonists in New Amsterdam. However, there isn't much in the way of hard evidence that the Dutch living in New Amsterdam ever really celebrated Sinterklaas, though the fact that it was a Dutch holiday at this point suggests they did. Washington Irving certainly thought it had been celebrated in New Amsterdam, including it in novels and stories about the region. *Knickerbocker's History of New York from The Beginning of the World To the End of The Dutch Dynasty* published in 1809 featured Sinterklaas as a character, and his 1812 edition of *A History of New York* included an image of Sinterklaas flying over rooftops in a flying wagon, something which almost certainly influenced the development of the image of Santa Claus.\n\nThe first recorded image of Santa riding in a sleigh pulled by reindeer comes from 1821 in *A New-year's present, to the little ones from five to twelve* which contained a poem about \"Old Santeclaus.\" This also contained a depiction of Santa in a red outfit quite unlike that of Sinterklaas or of previous depictions of the character. In 1823, the poem [A Visit from St. Nicholas](http://www.poets.org/poetsorg/poem/visit-st-nicholas) by Clement Clark Moore further popularised the image. The first American image of a character unquestionably labelled as \"Santa Claus\" was based on the Moore poem and appeared in 1837. This character was short, beardless, and rather evil-looking, though he did dress in red and stuff a bag of toys down chimneys. It was a combination of many cultural influences, with some German and Dutch imagery, but also with some imagery shared with Father Christmas. \n\nEnter Thomas Nast, cartoonist and illustrator for the magazine *Harper's Weekly.* Nast is a fascinating figure in and of himself, popularising many common American political images such as the elephant and the donkey to represent the Republican and Democrat parties, but in this context, we're going to talk about Santa Claus. Nast is a key figure in his creation, not only creating 76 images of Santa, but also potentially establishing many aspects of the lore, including that Santa Claus lived at the North Pole. His first [images](https://upload.wikimedia.org/wikipedia/commons/f/f3/Santa_Claus_1863_Harpers.png) of Santa Claus involve the character in the Civil War on the Union side (Nast was a political cartoonist, after all), but evolved to show him in [more familiar settings](http://webcomicoverlook.files.wordpress.com/2010/12/nast1271.jpg?w=604). [This](http://webcomicoverlook.files.wordpress.com/2010/12/santa_claus_2.jpg?w=604) image from 1881 is probably the single most famous of his Santa Claus images, and is one of the greatest influences on the modern depiction of the character. Even at this point, though, the character could be found in [a bright red suit](http://webcomicoverlook.files.wordpress.com/2010/12/nast-works.jpg?w=604). \n\nThis is not to say that Coca Cola didn't have a role in popularising the character. Santa had been used in advertising throughout the early 20th century, including advertising [mineral water in 1915](http://www.whiterocking.org/images/sf1915web.jpg)  ([this gallery](http://www.whiterocking.org/santa.html) is full of fun images from the 1910s to mid-1920s, with [this one](http://www.whiterocking.org/images/life121223web.jpg) being my favourite). Coca Cola began advertising using illustrator Haddon Sundblom's [version of the character](http://www.stnicholascenter.org/media/images/t/time-1931a.jpg) in 1931. The rest, they say, is history as the character became ingratiated with Christmas, the spirit of giving, and American culture. The image evolved to fit with the times - Santa's workshop became industrialised by the end of the 20th century, for instance - but the original image influenced by Dutch settlers and encapsulated by Nast remained roughly the same. \n\nSource and further reading: Christmas in America by Penne L. Restad",
  "hide_score": false,
  "_api_link": "https://api.reddit.com/r/badhistory/comments/2f5gua/hohohorrible_santa_history/?ref=search_posts",
  "locked": false,
  "edited": false,
  "title": "Ho-ho-horrible Santa history",
  "created": 1409559790.0,
  "_comments_by_id": {}
}