{
  "selftext": "I guess I live in the fascist corporate states of 'Murica now.  I mean seriously, once they start doing this (happened immediately after I saw that net neutrality rules released by the FCC were in favor of corporations) with Comcast, it is going to be everyone, and likely not just the United States unless countries make specific laws to prevent it.  Since I can't pay for my own priority to access steam, I mean, wtf?  Is this going to go down like Netflix paying them off not to throttle?  Is Steam going to wait until they are blacklisted to get involved?  Is *anyone* going to get involved *before* they get blacklisted and extorted for more money?  Did we all just give up I guess?  Think I might have no choice, when Congressmen rule a deal that pretty much makes Comcast a monopoly after they are paid by Comcast.  Any suggestions on what country to move to?",
  "gilded": 0,
  "score": 12,
  "removal_reason": null,
  "approved_by": null,
  "created_utc": 1400482800.0,
  "is_self": true,
  "stickied": false,
  "edited": false,
  "distinguished": null,
  "permalink": "https://www.reddit.com/r/Steam/comments/25x6ly/so_if_net_neutrality_is_now_dead_and_comcast_is/?ref=search_posts",
  "banned_by": null,
  "from_id": null,
  "likes": null,
  "_underscore_names": null,
  "num_reports": null,
  "link_flair_css_class": null,
  "_info_url": "https://api.reddit.com/api/info/",
  "id": "25x6ly",
  "archived": true,
  "secure_media": null,
  "from_kind": null,
  "saved": false,
  "domain": "self.Steam",
  "ups": 12,
  "suggested_sort": null,
  "quarantine": false,
  "over_18": false,
  "hide_score": false,
  "url": "https://www.reddit.com/r/Steam/comments/25x6ly/so_if_net_neutrality_is_now_dead_and_comcast_is/",
  "subreddit_id": "t5_2qwis",
  "_params": {},
  "_comments": null,
  "_replaced_more": false,
  "_comments_by_id": {},
  "user_reports": [],
  "media_embed": {},
  "created": 1400482800.0,
  "author_flair_text": null,
  "visited": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I guess I live in the fascist corporate states of &#39;Murica now.  I mean seriously, once they start doing this (happened immediately after I saw that net neutrality rules released by the FCC were in favor of corporations) with Comcast, it is going to be everyone, and likely not just the United States unless countries make specific laws to prevent it.  Since I can&#39;t pay for my own priority to access steam, I mean, wtf?  Is this going to go down like Netflix paying them off not to throttle?  Is Steam going to wait until they are blacklisted to get involved?  Is <em>anyone</em> going to get involved <em>before</em> they get blacklisted and extorted for more money?  Did we all just give up I guess?  Think I might have no choice, when Congressmen rule a deal that pretty much makes Comcast a monopoly after they are paid by Comcast.  Any suggestions on what country to move to?</p>\n</div><!-- SC_ON -->",
  "downs": 0,
  "_comment_sort": null,
  "report_reasons": null,
  "name": "t3_25x6ly",
  "from": null,
  "hidden": false,
  "clicked": false,
  "media": null,
  "json_dict": null,
  "_api_link": "https://api.reddit.com/r/Steam/comments/25x6ly/so_if_net_neutrality_is_now_dead_and_comcast_is/?ref=search_posts",
  "secure_media_embed": {},
  "mod_reports": [],
  "_orphaned": {},
  "_uniq": null,
  "num_comments": 22,
  "link_flair_text": null,
  "title": "So if net neutrality is now dead, and Comcast is throttling my downloads from steam to next to nothing, what is Steam's advice?",
  "_has_fetched": true,
  "author_flair_css_class": null,
  "thumbnail": "self"
}